     FSTANDIG   IP   F 1319        DISK
     FSTANDI    O  A F  997        DISK
     ISTANDIG   AA  01
      *
     I                                  1  165  DATA01
     I                             P  166  170 0DATA02
     I                                171  400  DATA03
     I                                401  600  DATA04
     I                                601  800  DATA05
     I                                801  990  DATA06
     I                               1319 1319  DATA07
      *
     C     DATA02        IFEQ      0
     C                   MOVE      *BLANKS       DATA12           11
     C                   ELSE
     C                   MOVEL     DATA02        DATA12           11
     C                   END
     C                   EXCEPT    NY
      *
     OSTANDI    EADD         NY
     O                       DATA01             165
     O                       DATA12             176
     O                       DATA03             406
     O                       DATA04             606
     O                       DATA05             806
     O                       DATA06             996
     O                       DATA07             997
