     FTRILCN    UP   E           K DISK
      *
     C     NVCNR         IFEQ      *BLANKS
     C                   MOVE      TVCNR         NVCNR
     C                   END
     C                   UPDATE    TRILCNR
