     FHEAD33    UF   E           K DISK
     C                   MOVE      *ZEROS        KUNNUL            8 0
      *
     C     KUNNUL        SETLL     HEAD33
     C     KUNNUL        READE     HEAD33                                 33
     C     *IN33         DOWEQ     '0'
      *
     C     HEOPD         IFGT      *ZEROS
     C                   SELECT
     C     HEUR          WHENEQ    'A'
     C     HEUR          OREQ      'C'
     C     HEUR          OREQ      'F'
     C                   MOVE      HEKNK         TRKNFA
     C     TRKNFA        IFEQ      *ZEROS
     C                   MOVE      HEKNKF        TRKNFA
     C                   END
     C     TRKNFA        IFEQ      *ZEROS
     C                   MOVE      HEKNS         TRKNFA
     C                   END
     C     TRKNFA        IFEQ      *ZEROS
     C                   MOVE      HEKNSF        TRKNFA
     C                   END
     C     HEUR          WHENEQ    'B'
     C     HEUR          OREQ      'D'
     C     HEUR          OREQ      'G'
     C                   MOVE      HEKNS         TRKNFA
     C     TRKNFA        IFEQ      *ZEROS
     C                   MOVE      HEKNSF        TRKNFA
     C                   END
     C     TRKNFA        IFEQ      *ZEROS
     C                   MOVE      HEKNK         TRKNFA
     C                   END
     C     TRKNFA        IFEQ      *ZEROS
     C                   MOVE      HEKNKF        TRKNFA
     C                   END
     C                   ENDSL
     C                   END
     C                   UPDATE    HEADFR
      *
     C     KUNNUL        READE     HEAD33                                 33
     C                   END
      *
      *
     C                   SETON                                        LR
     C                   RETURN
