     FTRILKL    UP   E           K DISK
      *
     C     XAVD          IFEQ      TVAVD
     C     XTDN          ANDEQ     TVTDN
     C     XLI           ANDEQ     TVLI
     C                   ADD       1             XLI2
     C                   ELSE
     C                   Z-ADD     1             XLI2              3 0
     C                   END
     C                   MOVE      XLI2          TVLI2
     C                   MOVE      TVAVD         XAVD              4 0
     C                   MOVE      TVTDN         XTDN              5 0
     C                   MOVE      TVLI2         XLI               5 0
     C     NVEH          IFEQ      *BLANKS
     C                   MOVE      TVEH          NVEH
     C                   MOVE      TVNT          NVNT
     C                   END
     C                   UPDATE    TRILKLR
