     FTELLGE    IF A E           K DISK
      *
     C                   MOVEL     'ESPEDPRD'    GECO
     C     GECO          CHAIN     TELLGE                             33
     C                   IF        *IN33
     C                   Z-ADD     1000          GENO
     C                   WRITE     TELLGER
     C                   END
     C                   MOVEL     'ESPEDPAR'    GECO
     C     GECO          CHAIN     TELLGE                             33
     C                   IF        *IN33
     C                   Z-ADD     10000         GENO
     C                   WRITE     TELLGER
     C                   END
      *
     C                   MOVE      *ON           *INLR
     C                   RETURN
