     FGSSLGF    UP   E             DISK
      *
     C                   SELECT
     C                   WHEN      LGPGM = 'AMR001R'
     C                   Z-ADD     3             LGNIVÅ
     C                   WHEN      LGPGM = 'SS102'
     C                   Z-ADD     3             LGNIVÅ
     C                   MOVEL     LGANY         XAN3              3
     C                   IF        XAN3 = 'RFP'
     C                   EVAL      LGTXT = 'Ready for pickup.'
     C                   ELSE
     C                   EVAL      LGTXT = 'In production.'
     C                   END
     C                   WHEN      LGPGM = 'SS103'
     C                   MOVEL     LGTXT         XAN3              3
     C                   IF        XAN3 <> 'Del'
     C                   Z-ADD     3             LGNIVÅ
     C                   END
     C                   WHEN      LGPGM = 'SS111'
     C                   MOVEL     LGTXT         XAN3              3
     C                   IF        XAN3 <> 'Sta'
     C                   Z-ADD     3             LGNIVÅ
     C                   EVAL      LGTXT = 'Ready for pickup.'
     C                   END
     C                   WHEN      LGPGM = 'SS176'
     C                   MOVEL     LGTXT         XAN3              3
     C                   IF        XAN3 = 'Put'
     C                   Z-ADD     3             LGNIVÅ
     C                   MOVEL     LGANY         XAN3              3
     C                   IF        XAN3 = 'Sig'
     C                   EVAL      LGTXT = LGANY
     C                   ELSE
     C                   EVAL      LGTXT = 'Delivered to end customer.'
     C                   END
     C                   END
     C                   ENDSL
      *
     C                   UPDATE    GSSLGFR
