     FTRILDK    UP   E           K DISK
      *
     C     NVDTY         IFEQ      *BLANKS
     C     NVDREF        ANDNE     *BLANKS
     C     NVDO          ANDNE     *BLANKS
     C                   MOVE      TVDTY         NVDTY
     C                   MOVE      TVDREF        NVDREF
     C                   MOVE      TVDSK         NVDSK
     C                   MOVE      TVDO          NVDO
     C                   MOVE      TVDOSK        NVDOSK
     C                   END
     C                   UPDATE    TRILDKR
