     FLLTKF     UP   E             DISK
     C     TKOMRF        IFEQ      0
     C                   Z-ADD     1             TKOMRF
     C                   END
     C                   UPDATE    LLTKFR
