     FKODTS8    UP   E             DISK
     D                 DS
     D  KS8FTX                 1     52
     D  KS8ØRE                51     51
      *
     C     KS8STY        IFEQ      'E'
     C                   MOVE      '*'           KS8ØRE
     C                   MOVE      'G'           KS8STY
     C                   ELSE
     C                   MOVE      ' '           KS8ØRE
     C                   END
     C                   UPDATE    KOS8R
