     FKUFAST    IF A E           K DISK
     FKUFASTNY  IF   E           K DISK    RENAME(KOFASTR:KUFASTR)
      *
     C     KUFASTK       KLIST
     C                   KFLD                    KFTYP
     C                   KFLD                    KFKOD
      *
     C                   MOVEL     'ESPEDFARGE'  KFTYP
     C     KFTYP         SETLL     KUFAST
     C     KFTYP         READE     KUFAST                                 33
     C                   IF        *IN33
     C     KFTYP         SETLL     KUFASTNY
     C     KFTYP         READE     KUFASTNY                               33
     C                   DOW       *IN33 = '0'
     C                   WRITE     KOFASTR
     C     KFTYP         READE     KUFASTNY                               33
     C  N33              ENDDO
     C                   END
      *
     C     *LOVAL        SETLL     KUFASTNY
     C                   READ      KUFASTNY                               33
     C                   DOW       *IN33 = '0'
     C                   IF        KFKOD = ' DEFN'
     C     KUFASTK       CHAIN     KUFAST                             33
     C                   IF        *IN33
     C                   WRITE     KOFASTR
     C                   END
     C                   END
     C                   READ      KUFASTNY                               33
     C  N33              ENDDO
      *
     C                   MOVE      *ON           *INLR
     C                   RETURN
