     FLLAGJD    IP   E             DISK
     FLLLINE    UF   E           K DISK
      *
     C     LLLINEK       KLIST
     C                   KFLD                    VDMNL
     C                   KFLD                    VDVNL
     C     LLLINEK       CHAIN     LLLINE                             33
     C                   IF        *IN33 = *OFF
     C                   IF        ((LLWNT0 = 0) AND (VDLANT > 0))
     C                   IF        LLNTLK = 1
     C                   MOVE      VDLANT        LLWNT0
     C                   MOVE      VDSAE0        LLWNTL
     C                   MOVE      VDSAE1        LLWNT1
     C                   MOVE      VDSAE2        LLWNT2
     C                   MOVE      VDSAE3        LLWNT3
     C                   END
     C                   END
     C                   UPDATE    LLLINER
     C                   END
