     FLLSERF    UP   E             DISK
     FLLLINE    IF   E           K DISK
     FLLHEAD    IF   E           K DISK
     FLLAGJL98  IF   E           K DISK
     FLLAGJD02  IF   E           K DISK
      *
     C     LLLINEK       KLIST
     C                   KFLD                    SNMNU
     C                   KFLD                    SNVNU
     C     LLAGJD02K     KLIST
     C                   KFLD                    LHGRP
     C                   KFLD                    LHPNR
     C                   KFLD                    SNMNU
     C                   KFLD                    SNVNU
      *
     C     LLLINEK       CHAIN     LLLINE                             33
     C                   IF        *IN33 = *OFF
      * PLUKKET
     C                   MOVE      LLANR         SNANR
     C     SNMNU         CHAIN     LLHEAD                             33
     C                   IF        *IN33 = *OFF
     C                   IF        LHSTA = 'Z'
     C                   MOVE      'P'           SNST
     C                   ELSE
     C                   MOVE      ' '           SNST
     C                   END
     C                   MOVE      LHGRP         SNGRP
     C                   MOVE      LHPNR         SNPNR
     C                   END
     C     LLAGJD02K     SETLL     LLAGJD02
     C     LLAGJD02K     READE     LLAGJD02                               33
     C                   DOW       *IN33 = *OFF
     C                   IF        VDMN  = SNMNI
     C                   MOVE      VDVN          SNVNI
     C                   LEAVE
     C                   END
     C     LLAGJD02K     READE     LLAGJD02                               33
     C                   ENDDO
     C                   ELSE
     C     SNMNI         CHAIN     LLAGJL98                           33
     C                   IF        *IN33 = *OFF
      * IKKE PLUKKET
     C                   MOVE      VAGRUP        SNGRP
     C                   MOVE      VAKJED        SNPNR
     C                   MOVE      VAANR         SNANR
     C                   END
     C                   END
      *
     C                   UPDATE    LLSERR
