     FV8FKD51   CF   E             WORKSTN
      *
     C     *ENTRY        PLIST
     C                   PARM                    WSLIB
      *
     C                   WRITE     WINDOWSZ
     C     START         TAG
     C                   EXFMT     BILDE01
     C     WSLIB         CABEQ     *BLANKS       START
      *
     C                   MOVE      '1'           *INLR
     C                   RETURN
