     FBRPRF     UF   E           K DISK
      *
     C                   Z-SUB     1             XKUNR             8 0
     C     *LOVAL        SETLL     BRPRF
     C                   READ      BRPRF                                  33
     C  N33              IF        BPLIN > 0
     C                   UPDATE    BRPRFR
     C                   MOVE      *ON           *IN33
     C                   END
      *
     C                   DOW       *IN33 = *OFF
     C                   IF        BPKUNR <> XKUNR
     C                   Z-ADD     1             XLIN              3 0
     C                   Z-ADD     1             XKOL              3 0
     C                   MOVE      BPKUNR        XKUNR
     C                   END
     C                   IF        BPLIN = 0
     C                   MOVE      XLIN          BPLIN
     C                   MOVE      XKOL          BPKOL
     C                   END
     C                   ADD       1             XKOL
     C                   IF        XKOL > 5
     C                   ADD       1             XLIN
     C                   Z-ADD     1             XKOL
     C                   END
     C                   UPDATE    BRPRFR
     C                   READ      BRPRF                                  33
     C  N33              ENDDO
      *
     C                   MOVE      *ON           *INLR
     C                   RETURN
