     FV8FNF     UP   E             DISK
      *
     C                   MOVE      ' '           FNKNV
     C                   MOVE      ' '           FNST
     C                   MOVE      ' '           FNHKNV
     C                   MOVE      ' '           FNHST
     C                   UPDATE    V8FNFR
