     FFRISOL01  UF   E           K DISK
      *
     C                   MOVEL     'LPL'         FSKODE
     C     FSKODE        SETLL     FRISOL01
     C     FSKODE        READE     FRISOL01                               33
     C                   DOW       *IN33 = *OFF
     C                   MOVE      FSSOK         XAN30            30
     C                   IF        XAN30 = *BLANKS
     C                   MOVEL     FSSOK         XFSSOK           32
     C                   EVAL      FSSOK = '00'
     C                   CAT       XFSSOK:0      FSSOK
     C                   END
     C                   UPDATE    FRISOKR
     C     FSKODE        READE     FRISOL01                               33
     C                   ENDDO
      *
     C                   MOVE      *ON           *INLR
     C                   RETURN
