     FHEAD35    UF   E           K DISK
      *
     D                 DS
     D  HERFK                  1     35
     D  HYSNDN                 1     20
     D  HYPALL                21     23
     D  HYBLGK                24     26
     D  HYLKOD                27     31
     D  HYLLST                32     32
     D  HYEDIK                33     33
     D  HYTERI                34     34
      *
     C                   MOVE      'x'           DUM35            35
     C     DUM35         SETLL     HEAD35
     C                   READ      HEAD35                                 35
     C     *IN35         DOWEQ     '0'
     C     HEUR          IFEQ      'H'
     C                   MOVE      HYSNDN        HXSNDN
     C                   MOVE      *ZEROS        HXPALL
     C     HYPALL        IFGE      '000'
     C     HYPALL        ANDLE     '999'
     C                   MOVE      HYPALL        HXPALL
     C                   END
     C                   MOVE      HYBLGK        HXBLGK
     C                   MOVE      HYLKOD        HXLKOD
     C                   MOVE      HYLLST        HXLLST
     C                   MOVE      HYEDIK        HXEDIK
     C                   MOVE      HYTERI        HXTERI
     C                   MOVE      *BLANKS       HERFK
     C                   UPDATE    HEADER
     C                   END
      *
     C                   READ      HEAD35                                 35
     C                   END
      *
     C                   SETON                                        LR
     C                   RETURN
