     FARKIVP    UP   E             DISK
      *
     D                 DS
     D  ARUNDE                 1     10
     D  ARUN07                 7      7
      *
      * kun konvertere 1 gang
      *
     C     ARUN07        IFEQ      ' '
      *
     C     ARTYPE        IFEQ      'fa'
     C     ARTYPE        OREQ      'fs'
     C     ARTYPE        OREQ      'fx'
     C     ARTYPE        OREQ      'ta'
     C                   MOVEL     ARUNDE        XX06              6 0
     C                   Z-ADD     XX06          XX07              7 0
     C                   MOVEL     XX07          ARUNDE
     C                   UPDATE    ARKIVR
     C                   END
     C                   END
