     FLLMRF     UP   E             DISK
     FGODSFI    IF   E           K DISK
     D                 DS
     D  MRKREF                 1     25
     D  MRGODS                 5      9
     D  XXGN                   1     15
     D  XXMOTT                17     25
      *
     C     MRGODS        CHAIN     GODSFI                             33
     C                   IF        *IN33 = *OFF
     C                   MOVE      XXGN          MRGN
     C                   MOVEL     XXMOTT        MRMOTT
     C                   MOVEL     MRFT1         MRTRNR
     C                   MOVE      *BLANKS       MRKREF
     C                   MOVE      *BLANKS       MRFT1
     C                   END
     C                   UPDATE    LLMRFR
