     FKODTP     IF A E           K DISK
     FUTSKRS    IF A E           K DISK
      *
     C                   EVAL      UTPNR = 121
     C     UTPNR         CHAIN     UTSKRS                             33
     C                   IF        *IN33
     C                   EVAL      UTPTXT = 'TET kombinert t-dokument'
     C                   EVAL      UTPTY  = '*STD'
     C                   EVAL      UTPL   = 72
     C                   EVAL      UTPK   = 120
     C                   EVAL      UTHEAD = 'N'
     C                   EVAL      UTXXX  = *BLANKS
     C                   WRITE     UTSR
     C                   EVAL      UTPNR = 122
     C                   EVAL      UTPTXT = 'TET kombinert vareliste'
     C                   EVAL      UTXXX  = *BLANKS
     C                   WRITE     UTSR
     C     *LOVAL        SETLL     KODTP
     C                   READ      KODTP                                  33
     C                   DOW       *IN33 = *OFF
     C                   SELECT
     C                   WHEN      KOPLNR = 98
     C                   EVAL      KOPLNR = 121
     C                   EVAL      KOPFM  = *BLANKS
     C                   WRITE     KOPR
     C                   WHEN      KOPLNR = 99
     C                   EVAL      KOPLNR = 122
     C                   EVAL      KOPFM  = *BLANKS
     C                   WRITE     KOPR
     C                   ENDSL
     C                   READ      KODTP                                  33
     C                   ENDDO
     C                   END
      *
     C                   EVAL      UTPNR = 257
     C     UTPNR         CHAIN     UTSKRS                             33
     C                   IF        *IN33
     C                   EVAL      UTPTXT = 'NCTS export, kombi. t-dok.'
     C                   EVAL      UTPTY  = '*STD'
     C                   EVAL      UTPL   = 72
     C                   EVAL      UTPK   = 120
     C                   EVAL      UTHEAD = 'N'
     C                   EVAL      UTXXX  = *BLANKS
     C                   WRITE     UTSR
     C                   EVAL      UTPNR = 258
     C                   EVAL      UTPTXT = 'NCTS export, kombi. vareliste'
     C                   EVAL      UTXXX  = *BLANKS
     C                   WRITE     UTSR
     C     *LOVAL        SETLL     KODTP
     C                   READ      KODTP                                  33
     C                   DOW       *IN33 = *OFF
     C                   SELECT
     C                   WHEN      KOPLNR = 255
     C                   EVAL      KOPLNR = 257
     C                   EVAL      KOPFM  = *BLANKS
     C                   WRITE     KOPR
     C                   WHEN      KOPLNR = 256
     C                   EVAL      KOPLNR = 258
     C                   EVAL      KOPFM  = *BLANKS
     C                   WRITE     KOPR
     C                   ENDSL
     C                   READ      KODTP                                  33
     C                   ENDDO
     C                   END
      *
     C                   EVAL      *INLR = *ON
     C                   RETURN
      *
