     FTARI      UP   E           K DISK
      *
     C                   IF        XINIT <> 'J'
     C                   CALL      'SYGE15C'
     C                   PARM                    WDT               8
     C                   PARM                    WTM               6
     C                   MOVE      'J'           XINIT             1
     C                   END
      *
     C                   MOVE      WDT           TADTR
     C                   UPDATE    TARIR
      *
