      *
      ***********************************************************
      *** KUNDE SPESIFIKE OPPDRAGSTILLEG (VIA FRIE SØKEVEIER) ***
      *** INDIKATORER 01 - 26 KUN CMD-TASTER / ROLL TASTER    ***
      ***********************************************************
      *
     FCUOTIG    UF A E           K DISK
     FCUNDL01   IF   E           K DISK
     FVCUNDO2D  CF   E             WORKSTN
     F                                     SFILE(SUBFIL:ZRECNO)
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  KFSOTX                 1     30
     D  XDLT                   1      7
     C*
     C                   EXSR      INIT
     C*
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     SUBCTL
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
     C                   MOVE      W2FRI         YSFRI
     C                   MOVE      *BLANKS       W2FRI
     C                   MOVE      *BLANKS       W2TXT
      *_____________
      * Fyll Subfile
      *"""""""""""""
     C     COKEYL        SETLL     CUOTIG
     C     START1        TAG
     C     COKEY         READE(N)  CUOTIG                                 94
      *
     C     START2        TAG
      *
     C  N94              DO
     C                   DO        10
     C                   ADD       1             ZRECNO
     C                   WRITE     SUBFIL
     C     COKEY         READE(N)  CUOTIG                                 94
     C  N94              MOVE      COFRI         YSFRI
     C  N94              END
     C                   END
     C*
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     2             POSNBR
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C     ZRECNO        IFEQ      0
     C                   EXFMT     NYWRK
     C                   ELSE
     C                   WRITE     BUNN
     C                   EXFMT     SUBCTL
     C                   END
     C                   SETOFF                                       9830
     C                   MOVEA     '000'         *IN(88)
     C*
     C     WSCLOC        DIV       256           LINNBR
     C                   MVR                     POSNBR
     C*
     C*** AVSLUTT
     C   03
     COR 12              GOTO      SLUTT
     C*** SØKING
     C*
     C*** FRISK OPP
     C   05              GOTO      START
     C*
     C*** BLA VIDERE
     C   25              DO
     C                   SETOFF                                       25
     C                   Z-ADD     YRECNO        ZRECNO
     C  N94COKEYL        SETLL     CUOTIG
     C  N94COKEY         READE(N)  CUOTIG                                 94
     C                   GOTO      START2
     C                   END
      *
     C     W2NR          IFEQ      '1'
     C                   EXSR      TESTB
     C                   GOTO      START3
     C                   END
     C     W2FRI         IFNE      *BLANKS
     C                   GOTO      START
     C                   END
     C     W2TXT         IFNE      *BLANKS
     C                   GOTO      START
     C                   END
     C*
     C     ZRECNO        IFNE      0
     C                   EXSR      HENT
     C   27WSNR          IFEQ      '1'
     C                   MOVE      COFRI         USOK
     C                   GOTO      SLUTT
     C                   END
     C                   END
     C                   GOTO      START3
     C*
     C     SLUTT         TAG
     C                   SETON                                        LR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB         BEGSR
     C***********************************************
      *
     C     W2FRI         IFEQ      *BLANKS
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     10            POSNBR
     C                   SETON                                        9030
     C                   MOVE      'SHU0596'     MSGNR
     C                   END
      *
     C     W2TXT         IFEQ      *BLANKS
     C                   Z-ADD     5             LINNBR
     C                   Z-ADD     45            POSNBR
     C                   SETON                                        8930
     C                   MOVE      'SHU0597'     MSGNR
     C                   END
      *
      *
     C   30              GOTO      SLTB
      *
     C*** OPPDATERE PÅ REGISTER OG SUBFIL
     C                   MOVE      W2FRI         COFRI
     C                   MOVE      W2TXT         COTXT
     C                   WRITE     CUOTIGR
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   WRITE     SUBFIL
     C                   WRITE     SUBCTL
     C                   MOVE      *BLANKS       W2NR
     C                   MOVE      *BLANKS       W2FRI
     C                   MOVE      *BLANKS       W2TXT
     C*
     C     SLTB          ENDSR
     C*
     C***********************************************
     C     HENT          BEGSR
     C***********************************************
     C                   MOVEA     '00'          *IN(91)
     C                   Z-ADD     0             LINNBR
     C                   SETOFF                                       919299
     C     *IN98         DOWEQ     '0'
     C                   READC     SUBFIL                                 98
     C   98              DO
     C   99              SETOFF                                       98
     C                   Z-ADD     1             LINNBR
     C                   GOTO      SLHENT
     C                   END
     C     ZRECNO        DIV       5             LINNBR
     C     LINNBR        IFEQ      0
     C                   Z-ADD     5             LINNBR
     C                   END
      *
      *SLETTING
      *
     C  N27WSNR          IFEQ      '4'
     C     XDLT          COMP      '*DELETE'                              98
     C   98              GOTO      SLHENT
     C     COKDLT        CHAIN     CUOTIG                             33
     C     *IN33         IFEQ      '0'
     C                   DELETE    CUOTIGR
     C                   MOVE      *BLANKS       COFRI
     C                   MOVE      *BLANKS       KFSOTX
     C                   MOVE      '*DELETE'     XDLT
     C                   MOVE      *BLANKS       WSNR
     C                   MOVE      '1'           *IN99
     C                   UPDATE    SUBFIL
     C                   END
     C                   END
      *
      *ENDRING
      *
     C                   END
     C*
     C     SLHENT        TAG
     C                   ADD       4             LINNBR
     C                   Z-ADD     2             POSNBR
     C                   SETOFF                                       99
     C   98              DO
     C                   MOVE      'DIV0012'     MSGNR
     C                   SETON                                            30
     C                   END
     C*
     C                   ENDSR
     C*
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     KUNKEY        KLIST
     C                   KFLD                    COFIRM
     C                   KFLD                    COKUNR
     C     COKEY         KLIST
     C                   KFLD                    COFIRM
     C                   KFLD                    COKUNR
     C                   KFLD                    COAVD
     C                   KFLD                    COKODE
     C     COKEYL        KLIST
     C                   KFLD                    COFIRM
     C                   KFLD                    COKUNR
     C                   KFLD                    COAVD
     C                   KFLD                    COKODE
     C                   KFLD                    YSFRI            35
     C     COKUPD        KLIST
     C                   KFLD                    COFIRM
     C                   KFLD                    COKUNR
     C                   KFLD                    COAVD
     C                   KFLD                    COKODE
     C                   KFLD                    W2FRI
     C     COKDLT        KLIST
     C                   KFLD                    COFIRM
     C                   KFLD                    COKUNR
     C                   KFLD                    COAVD
     C                   KFLD                    COKODE
     C                   KFLD                    COFRI
      *
     C     *ENTRY        PLIST
     C                   PARM                    COFIRM
     C                   PARM                    COKUNR
     C                   PARM                    COAVD
     C                   PARM                    COKODE
     C                   PARM                    USOK             35
     C                   PARM                    UMODE             1
     C     UMODE         COMP      'P'                                    27
      *
     C     KUNKEY        CHAIN     CUNDL01                            33
      *
     C                   WRITE     WINDOWSZ
      *
     C                   ENDSR
     C*
