********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 sh  PTF10 feil ved f6           ..
10XXX * 02 sh  PTF10 innført vedlegg avvik
10XXX * 03 sh  PTF10 fast emnerubrikk
10XXX * 04 sh  PTF10 tillegg til 2
10XXX * 05 sh  PTF10 epost Ø @ *
10XXX * 06 sh  PTF10 SUBFILVISNING
10XXX * 07 sh  PTF10 avdelinger
10XXX * 08 sh  PTF10 oppdragstyper
10XXX * 09 sh  PTF10 SAMMENSLÅING
N02  FARKTXTL1  IF   E           K DISK
N02  FARKVEDK   UF A E           K DISK
     FCUNDC     UF A E             DISK
     F                                     INFDS(CUNDS)
     FCUNDC07   IF   E           K DISK
     F                                     INFDS(CUNDS7)
     F                                     RENAME(CUNDCR:CUNDCR7)
     FCUNDL01   IF   E           K DISK
     FVCUNDC4D  CF   E             WORKSTN
     F                                     SFILE(VCUNDCD4:ZRECNO)
     F                                     INFDS(FBAREA)
     D TXT             S             15    DIM(1) CTDATA PERRCD(1)
     D CUNDS           DS
     D  RRNP                 397    400B 0
     D CUNDS7          DS
     D  RRNP7                397    400B 0
     D FBAREA          DS
     D  WSCLOC               370    371B 0
     D  WSSUBN               378    379B 0
     D                 DS
     D  CTYPE                  1     30
     D  CTYPE1                 1      1
     D                 DS
     D  USØKKN                 1     30
     D  USØKKO                 1      2
     D  URRNI                  3     12
      *
N02  D                 DS
N02  D  V                      1     60
N02  D                                     DIM(30)
N02  D  AVKVED                 1     60
N02  D  V01                    1      2
N02  D  V02                    3      4
N02  D  V03                    5      6
N02  D  V04                    7      8
N02  D  V05                    9     10
N02  D  V06                   11     12
N02  D  V07                   13     14
N02  D  V08                   15     16
N02  D  V09                   17     18
N02  D  V10                   19     20
N02  D  V11                   21     22
N02  D  V12                   23     24
N02  D  V13                   25     26
N02  D  V14                   27     28
N02  D  V15                   29     30
N02  D  V16                   31     32
N02  D  V17                   33     34
N02  D  V18                   35     36
N02  D  V19                   37     38
N02  D  V20                   39     40
N02  D  V21                   41     42
N02  D  V22                   43     44
N02  D  V23                   45     46
N02  D  V24                   47     48
N02  D  V25                   49     50
N02  D  V26                   51     52
N02  D  V27                   53     54
N02  D  V28                   55     56
N02  D  V29                   57     58
N02  D  V30                   59     60
N02  D                 DS
N02  D  w                      1     60
N02  D                                     DIM(30)
N02  D  WSKVED                 1     60
N02  D  W01                    1      2
N02  D  W02                    3      4
N02  D  W03                    5      6
N02  D  W04                    7      8
N02  D  W05                    9     10
N02  D  W06                   11     12
N02  D  W07                   13     14
N02  D  W08                   15     16
N02  D  W09                   17     18
N02  D  W10                   19     20
N02  D  W11                   21     22
N02  D  W12                   23     24
N02  D  W13                   25     26
N02  D  W14                   27     28
N02  D  W15                   29     30
N02  D  W16                   31     32
N02  D  W17                   33     34
N02  D  W18                   35     36
N02  D  W19                   37     38
N02  D  W20                   39     40
N02  D  W21                   41     42
N02  D  W22                   43     44
N02  D  W23                   45     46
N02  D  W24                   47     48
N02  D  W25                   49     50
N02  D  W26                   51     52
N02  D  W27                   53     54
N02  D  W28                   55     56
N02  D  W29                   57     58
N02  D  W30                   59     60
N02   *
N07  D                 DS
N07  D  a                      1     80
N07  D                                     DIM(20)
N07  D  CAVD                   1     80
N07  D  AVD001                 1      4  0
N07  D  AVD002                 5      8  0
N07  D  AVD003                 9     12  0
N07  D  AVD004                13     16  0
N07  D  AVD005                17     20  0
N07  D  AVD006                21     24  0
N07  D  AVD007                25     28  0
N07  D  AVD008                29     32  0
N07  D  AVD009                33     36  0
N07  D  AVD010                37     40  0
N07  D  AVD011                41     44  0
N07  D  AVD012                45     48  0
N07  D  AVD013                49     52  0
N07  D  AVD014                53     56  0
N07  D  AVD015                57     60  0
N07  D  AVD016                61     64  0
N07  D  AVD017                65     68  0
N07  D  AVD018                69     72  0
N07  D  AVD019                73     76  0
N07  D  AVD020                77     80  0
N07   *
N08  D                 DS
N08  D  CO                     1     60
N08  D                                     DIM(5)
N08  D  COPD                   1     10
N08  D  COPD01                 1      2
N08  D  COPD02                 3      4
N08  D  COPD03                 5      6
N08  D  COPD04                 7      8
N08  D  COPD05                 9     10
     C                   EXSR      INIT
      *______________
      * Clear Subfile
      *""""""""""""""
     C     START         TAG
     C                   MOVE      '1'           *IN93
     C                   WRITE     VCUNDCD5
     C                   MOVEA     '00'          *IN(93)
     C                   Z-ADD     *ZEROS        ZRECNO
      *_____________
      * Fill Subfile
      *"""""""""""""
     C     CUNKY1        SETLL     CUNDC07                            77
      *
     C     START1        TAG
     C                   DO        13
     C  N60CUNKY1B       READE     CUNDC07                                94
     C  N94CTYPE1        COMP      '*'                                9494
     C     *IN94         IFEQ      '0'
     C     CUNKY2        CHAIN     CUNDL01                            51
     C                   MOVE      RRNP7         SFRRN
     C                   MOVEL     KNAVN         SFCONT
     C                   MOVEL     CTYPE         SFTYPE
     C  N51              MOVEL     KNAVN         SFNAVN           22
     C   51              EVAL      SFNAVN='* mail til bruker selv *'
     C                   MOVEL     CEMAIL        SFMAIL
     C                   move      clive         sflive
     C                   move      clive         sfPRIN
     C                   ADD       1             ZRECNO
     C                   Z-ADD     ZRECNO        CURS1
N04  C                   MOVEL     CTYPE         USOKK16          16
N04  C                   MOVE      USOKK16       USOKK15
N04  C     ARKKEY        CHAIN     ARKTXTL1                           33
N04  C  N33              MOVE      ARTYPE        AVTYPE
N04  C   33              MOVE      '**'          AVTYPE
     C                   WRITE     VCUNDCD4
     C                   END                                                    <*IN94
     C  N94              ENDDO
      *
     C                   Z-ADD     ZRECNO        YRECNO            5 0
     C     YRECNO        IFGT      0
     C     YRECNO        SUB       1             ZRECNO
     C     ZRECNO        DIV       13            ZRECNO
     C     ZRECNO        MULT      13            ZRECNO
     C                   ADD       1             ZRECNO
     C                   ELSE
     C                   GOTO      START5
     C                   ENDIF
      *________________
      * Display Subfile
      *""""""""""""""""
     C     START3        TAG
     C                   MOVEA     '11'          *IN(91)
     C                   MOVE      '0'           *IN31
     C                   WRITE     VCUNDCD5
     C                   Z-ADD     WSSUBN        XRECNO
     C                   EXFMT     VCUNDCD3
     C                   READ      VCUNDCD5                               66
      *
     C     FKEYS         TAG
      *
     C     XRECNO        IFEQ      0
     C                   Z-ADD     ZRECNO        XRECNO            4 0
     C                   END
      *
     C                   SETOFF                                       999830
      *** F3=Exit
     C     *IN03         IFEQ      '1'
     C                   GOTO      ENDPGM
     C                   END                                                    <*IN03
      *** F5=Refresh
     C     *IN05         IFEQ      '1'
     C                   clear                   SFCONT
     C                   CLEAR                   SFNAVN
     C                   CLEAR                   SFMAIL
     C                   GOTO      START
     C                   END                                                    <*IN05
      *** F6=NY
     C     *IN06         IFEQ      '1'
     C                   MOVE      *ZEROS        CCOMPN
     C                   MOVE      *BLANKS       KNAVN
     C                   MOVE      *BLANKS       CCONTA
     C  N60              MOVE      *BLANKS       CTYPE
     C                   MOVE      *BLANKS       CPHONE
     C                   MOVE      *BLANKS       CMOBIL
     C                   MOVE      *BLANKS       CFAX
     C                   MOVE      *BLANKS       CEMAIL
     C                   MOVE      *BLANKS       Clive
     C                   MOVE      *BLANKS       CPRINT
N09  C                   MOVE      *BLANKS       CMERGE
n03  C                   MOVE      *BLANKS       CEMNE
n07  C                   MOVE      *ZEROS        CAVD
n08  C                   MOVE      *blanks       COPD
n01  c                   setoff                                       40
     C                   GOTO      START5
     C                   END                                                    <*IN03
      *** F8=SØK
     C     *IN08         IFEQ      '1'
     C                   Z-ADD     22            LINNBR
     C                   Z-ADD     15            POSNBR
     C                   EXFMT     VCUNDCD8
     C     *IN12         IFEQ      '0'
     C                   MOVEL     wsalfa        Ualfa
     C                   END
     C                   GOTO      START
     C                   END                                                    <*IN03
      *** F12=Cancel
     C     *IN12         IFEQ      '1'
     C                   clear                   SFCONT
     C                   CLEAR                   SFNAVN
     C                   CLEAR                   SFMAIL
     C                   CLEAR                   SFLIVE
     C                   CLEAR                   SFPRIN
     C                   GOTO      START
     C                   END                                                    <*IN12
      *** Roll
     C     *IN25         IFEQ      '1'
     C                   Z-ADD     YRECNO        ZRECNO
     C                   MOVE      '0'           *IN25
     C     START4        TAG
     C     *IN94         IFEQ      '0'
     C                   GOTO      START1
     C                   END                                                    <*IN94
     C                   END                                                    <*IN25
      *** Get options from screen
     C     ZRECNO        IFNE      0
     C                   EXSR      GETOPT
      *** No option selected
     C     *IN97         IFEQ      '1'
     C                   EXFMT     VCUNDCD3
     C                   READ      VCUNDCD5                               66
     C                   MOVE      '0'           *IN97
     C                   GOTO      FKEYS
     C                   END                                                    <*IN12
      *** F3=Exit
     C     *IN03         IFEQ      '1'
     C                   GOTO      ENDPGM
     C                   END                                                    <*IN03
     C                   END                                                    <ZRECNO
     C     *IN98         IFEQ      '1'
     C     XRECNO        ANDNE     0
     C                   Z-ADD     XRECNO        ZRECNO
     C                   END                                                    <*IN98
     C                   GOTO      START3
      *** New record
     C     START5        TAG
     C                   MOVEL     'Ny      '    WMODE
N02  C                   MOVE      *BLANKS       WSKVED
N02  C     VEDKEY        CHAIN     ARKVEDK                            33
N02  C  N33              MOVE      AVKVED        WSKVED
     C                   EXFMT     VCUNDCD1
     C                   MOVEA     '00000'       *IN(61)
     C                   MOVE      '0'           *IN(67)
     C                   MOVE      '0'           *IN30
      *** F3=Exit
      *** F12=Cancel
     C     *IN12         IFEQ      '1'
     C     *IN03         OREQ      '1'
     C                   GOTO      ENDPGM
     C*                    MOVEA'00000'   *IN,61
     C*                    MOVE '0'       *IN,67
     C                   ELSE
      *
      * 04=SØKK KUNDE
      *
     C   04              DO
     C                   MOVE      *BLANKS       USØKKN           30
     C                   CALL      'SOEKKUN'
     C                   PARM                    CCOMPN            8 0
     C                   PARM                    UFIRMA
     C                   PARM                    USØKKN           30
     C* RETUR MED KONTAKTPERS
     C     USØKKO        IFEQ      'KP'
     C                   MOVE      URRNI         RRN              10 0
     C     RRN           CHAIN(N)  CUNDC                              31
     C  N31              MOVEL     USOK          CTYPE
     C  N31              goto      start5
     C                   END
     C                   END
     C     CCOMPN        IFNE      0
     C     CUNKY2        CHAIN     CUNDL01                            70
     C   70              SETON                                        30
     C   70              MOVE      'SPK0001'     MSGNR
     C   70              GOTO      START5
     C                   END
     C                   EXSR      TESTB1
     C     *IN30         IFEQ      '1'
     C                   GOTO      START5
     C                   END                                                    <*IN30
     C                   END                                                    <*IN12
     C                   GOTO      START3
      *
     C     ENDPGM        TAG
     C                   MOVE      '1'           *INLR
     C                   RETURN
     C*
     C***********************************************
     C     TESTB1        BEGSR
     C***********************************************
     C*          N40 = NEW
     C*           40 = CHANGE
     C***********************************************
     C                   EXSR      TSTSCR
     C     *IN30         IFEQ      '1'
     C                   GOTO      ENDTST
     C                   END                                                    <*IN30
     C     CUNKY2        CHAIN     CUNDL01                            51
     C     *IN40         IFEQ      '1'
     C                   UPDATE    CUNDCR                               38
     C                   ELSE
     C                   MOVEL     UFIRMA        CFIRMA
     C                   WRITE     CUNDCR
     C                   END                                                    <*IN40
      *
      * OPPDATERER VEDLEGG DOKUMENTKODE
      *
N02  C     VEDKEY        CHAIN     ARKVEDK                            33
N02  C     WSKVED        IFEQ      *BLANKS
N02  C  N33              DELETE    ARKVEDKR
N02  C                   ELSE
N02  C                   MOVE      WSKVED        AVKVED
N02  C  N33              UPDATE    ARKVEDKR
N02  C   33              MOVE      CCOMPN        AVKUND
N02  C   33              WRITE     ARKVEDKR
N02  C                   END
     C*
     C  N60              MOVEL     CTYPE         SFTYPE
     C   60              MOVEL     USOK          SFTYPE
S06  C*                  MOVEL     CCONTA        SFCONT
S06  C*                  MOVEL     KNAVN         SFNAVN
N06  C                   MOVEL     KNAVN         SFCONT
     C                   MOVEL     CEMAIL        SFMAIL
     C                   MOVEL     CLIVE         SFLIVE
     C                   MOVEL     CLIVE         SFPRIN
     C     *IN40         IFEQ      '1'
     C                   UPDATE    VCUNDCD4
     C                   ELSE
     C                   ADD       1             YRECNO
     C                   Z-ADD     YRECNO        ZRECNO
     C                   MOVE      RRNP          SFRRN
     C                   WRITE     VCUNDCD4
     C                   END                                                    <*IN40
     C                   EXSR      CLRSCR
      *
     C     ENDTST        ENDSR
      ***********************************************************
     C     TSTSCR        BEGSR
      ***********************************************************
     C                   MOVE      '0'           *IN30
     C                   MOVEA     '00000'       *IN(61)
     C                   MOVE      '0'           *IN(67)
     C*
     C     CCONTA        IFEQ      *BLANKS
     C                   MOVE      'CBA0130'     MSGNR
     C                   MOVE      '1'           *IN61
     C                   MOVE      '1'           *IN30
     C                   GOTO      TSTEND
     C                   END                                                    <CCONTA
     C     CEMAIL        IFEQ      *BLANKS
     C                   MOVE      'SHU1128'     MSGNR
     C                   MOVE      '1'           *IN62
     C                   MOVE      '1'           *IN30
     C                   GOTO      TSTEND
     C                   ELSE
     C     '@'           SCAN      CEMAIL                                 63
N05  C  N63'Ø'           SCAN      CEMAIL                                 63
N05  C  N63'*'           SCAN      CEMAIL                                 63
     c     *in(63)       ifeq      '0'
     C                   SETON                                        3062
     C                   MOVE      'SHU1128'     MSGNR
     C                   z-add     8             LINNBR
     C                   z-add     10            POSNBR
     C                   GOTO      TSTEND
     C                   END
     C                   END                                                    <CCONTA
     C*
     C     TSTEND        ENDSR
     C*
      ***********************************************
     C     GETOPT        BEGSR
      ***********************************************
     C                   Z-ADD     0             OPTNBR            2 0
     C                   SETOFF                                       919299
     C                   MOVE      '1'           *IN97
     C     *IN98         DOWEQ     '0'
     C                   READC     VCUNDCD4                               98
     C     *IN98         IFEQ      '1'
     C     *IN99         IFEQ      '1'
     C                   MOVE      '0'           *IN98
     C                   END                                                    <*IN99
     C                   GOTO      ENDGET
     C                   END                                                    <*IN98
     C                   MOVE      '0'           *IN97
     C                   Z-ADD     CURS1         ZRECNO
      *** 1=PICK E=EPOST F=FAX
     C     WSNR          IFEQ      '1 '
     C     WSNR          OREQ      ' 1'
     C     WSNR          OREQ      '01'
     C     WSNR          OREQ      'E '
     C     WSNR          OREQ      ' E'
     C     WSNR          OREQ      'F '
     C     WSNR          OREQ      ' F'
     C                   MOVE      SFRRN         URRN
     C     WSNR          IFEQ      'F '
     C     WSNR          OREQ      ' F'
     C                   MOVE      'F'           EPOFAX
     C                   END
     C     WSNR          IFEQ      'E '
     C     WSNR          OREQ      ' E'
     C                   MOVE      'E'           EPOFAX
     C                   END
     C                   SETON                                        LR
     C                   RETURN
     C                   END                                                    <SFNAVN
      *** 2=Change
     C     WSNR          IFEQ      '2 '
     C     WSNR          OREQ      ' 2'
     C     WSNR          OREQ      '02'
     C                   ADD       1             OPTNBR
     C                   MOVE      ' '           WSNR
     C                   MOVEL     'Endre   '    WMODE
     C     SFNAVN        IFEQ      TXT(1)
     C                   MOVE      'CBA0120'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      ENDGET
     C                   END                                                    <SFNAVN
     C                   MOVE      '1'           *IN40
     C                   EXSR      CHGST
      *** F12=Cancel
     C     *IN12         IFEQ      '1'
     C                   GOTO      ENDGET
     C                   END                                                    <*IN12
     C                   MOVE      '0'           *IN40
     C                   END                                                    <WSNR=2
      *** 3=Copy
     C     WSNR          IFEQ      '3 '
     C     WSNR          OREQ      ' 3'
     C     WSNR          OREQ      '03'
     C                   ADD       1             OPTNBR
     C                   MOVE      ' '           WSNR
     C                   MOVEL     'Kopier  '    WMODE
     C     SFNAVN        IFEQ      TXT(1)
     C                   MOVE      'CBA0120'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      ENDGET
     C                   END                                                    <SFNAVN
     C                   EXSR      CPYST
      *** F12=Cancel
     C     *IN12         IFEQ      '1'
     C                   GOTO      ENDGET
     C                   END                                                    <*IN12
     C                   END                                                    <WSNR=3
      *** 4=Delete
     C     WSNR          IFEQ      '4 '
     C     WSNR          OREQ      ' 4'
     C     WSNR          OREQ      '04'
     C                   ADD       1             OPTNBR
     C                   MOVE      ' '           WSNR
     C                   MOVEL     'Slett   '    WMODE
     C     SFNAVN        IFEQ      TXT(1)
     C                   MOVE      'CBA0120'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      ENDGET
     C                   END                                                    <SFNAVN
     C                   EXSR      DLTST
      *** F12=Cancel
     C     *IN12         IFEQ      '1'
     C                   GOTO      ENDGET
     C                   END                                                    <*IN12
     C                   END                                                    <WSNR=4
      *** 5=Display
     C     WSNR          IFEQ      '5 '
     C     WSNR          OREQ      ' 5'
     C     WSNR          OREQ      '05'
     C                   ADD       1             OPTNBR
     C                   MOVE      ' '           WSNR
     C                   MOVEL     'Vise    '    WMODE
     C     SFNAVN        IFEQ      TXT(1)
     C                   MOVE      'CBA0120'     MSGNR
     C                   MOVE      '1'           *IN30
     C                   GOTO      ENDGET
     C                   END                                                    <SFNAVN
     C     SFRRN         CHAIN(N)  CUNDC                              77
     C  N77CUNKY2        CHAIN     CUNDL01                            51
     C                   MOVE      '1'           *IN88
     C                   EXFMT     VCUNDCD1
      *** F12=Cancel
     C     *IN12         IFEQ      '1'
     C                   UPDATE    VCUNDCD4
     C                   GOTO      ENDGET
     C                   END                                                    <*IN12
     C                   MOVEA     '00000'       *IN(61)
     C                   MOVE      '0'           *IN(67)
     C                   MOVE      '0'           *IN88
     C                   UPDATE    VCUNDCD4
     C                   END                                                    <WSNR=5
     C                   ENDDO
      *
     C     ENDGET        TAG
      *
     C                   ENDSR
      ***********************************************
     C     CHGST         BEGSR
      ***********************************************
     C                   MOVE      '0'           *IN88
     C     SFRRN         CHAIN     CUNDC                              77
     C  N77CUNKY2        CHAIN     CUNDL01                            51
     C                   MOVE      '1'           *IN99
N02  C                   MOVE      *BLANKS       WSKVED
N02  C     VEDKEY        CHAIN     ARKVEDK                            33
N02  C  N33              MOVE      AVKVED        WSKVED
     C     STCHG         TAG
     C                   EXFMT     VCUNDCD1
     C                   MOVE      '0'           *IN30
     C                   MOVEA     '00000'       *IN(61)
     C                   MOVE      '0'           *IN(67)
     C     *IN12         IFEQ      '1'
     C     *IN03         OREQ      '1'
     C                   UPDATE    VCUNDCD4
     C                   GOTO      CHGEND
     C                   END                                                    <*IN12
     C                   EXSR      TESTB1
     C     *IN30         IFEQ      '1'
     C                   GOTO      STCHG
     C                   END                                                    <*IN30
      *
     C     CHGEND        TAG
     C                   ENDSR
     C*
      ***********************************************
     C     CPYST         BEGSR
      ***********************************************
     C                   MOVE      '0'           *IN88
     C     SFRRN         CHAIN(N)  CUNDC                              77
     C  N77CUNKY2        CHAIN     CUNDL01                            51
     C                   MOVE      '1'           *IN99
     C                   UPDATE    VCUNDCD4
     C     STCPY         TAG
     C                   EXFMT     VCUNDCD1
     C                   MOVE      '0'           *IN30
     C                   MOVEA     '00000'       *IN(61)
     C                   MOVE      '0'           *IN(67)
     C     *IN12         IFEQ      '1'
     C     *IN03         OREQ      '1'
     C                   EXSR      CLRSCR
     C                   MOVEA     '00000'       *IN(61)
     C                   MOVE      '0'           *IN(67)
     C                   GOTO      CPYEND
     C                   END                                                    <*IN12
     C                   MOVE      '0'           *IN40
     C                   EXSR      TESTB1
     C     *IN30         IFEQ      '1'
     C                   GOTO      STCPY
     C                   END                                                    <*IN30
      *
     C     CPYEND        TAG
     C                   ENDSR
     C*
      ***********************************************
     C     DLTST         BEGSR
      ***********************************************
     C                   MOVE      '1'           *IN99
     C                   MOVEA     '11'          *IN(88)
     C     SFRRN         CHAIN     CUNDC                              77
     C  N77CUNKY2        CHAIN     CUNDL01                            51
     C                   EXFMT     VCUNDCD1
     C                   MOVEA     '00'          *IN(88)
     C     *IN11         IFEQ      '1'
     C     *IN77         IFEQ      '0'
     C                   DELETE    CUNDCR
     C                   END                                                    <*IN77
     C                   MOVEL     CCONTA        SFCONT
     C                   MOVEL     TXT(1)        SFNAVN
     C                   END                                                    <*IN11
     C                   UPDATE    VCUNDCD4
      *
     C                   ENDSR
      ***********************************************
     C     CLRSCR        BEGSR
      ***********************************************
     C                   MOVE      '0'           *IN40
     C                   CLEAR                   CCONTA
     C  N60              CLEAR                   CTYPE
     C                   CLEAR                   CPHONE
      *
     C                   ENDSR
      ***********************************************
     C     INIT          BEGSR
      ***********************************************
     C     *LIKE         DEFINE    CFIRMA        UFIRMA
     C     *ENTRY        PLIST
     C                   PARM                    UFIRMA
     C                   PARM                    USOK             30
     C                   PARM                    URRN             10 0
     C                   PARM                    EPOFAX            1
n07  c                   move      *zeros        cavd
     C     USOK          COMP      *BLANKS                            6060
     C   60              MOVEL     USOK          CTYPE
     C   60              MOVEL     USOK          SFTYPE
     C   60              MOVEL     USOK          SFTYPE
      *--------------------------------------------------------------
      * DEFINE KEY FOR CUNDC01
      *--------------------------------------------------------------
     C     ARKKEY        KLIST
     C                   KFLD                    USOKK15          15
N02  C     VEDKEY        KLIST
N02  C                   KFLD                    AVFIRM            2
N02  C                   KFLD                    CCOMPN
N02  C                   KFLD                    AVTYPE            2
N02  C                   MOVE      UFIRMA        AVFIRM
     C     CUNKY1        KLIST
     C                   KFLD                    UFIRMA
     C                   KFLD                    USOKK             1
     C                   KFLD                    Ualfa            10
     C     CUNKY1B       KLIST
     C                   KFLD                    UFIRMA
     C                   KFLD                    USOKK             1
     C     CUNKY2        KLIST
     C                   KFLD                    UFIRMA
     C                   KFLD                    CCOMPN
      *
      *
     C                   MOVE      '1'           *IN50
      *
     C                   MOVEL     '*'           USOKK
     C                   ENDSR
      *
**
*** SLETTET ***
