********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 Fjerner noen  hardkodinger fra standard
10XXX * 02 SH  PTF10 ikke tildel nytt nummer hvis den er i parameter
********************************************************************
     FKUNDF     O  A E           K DISK
     FKKUNF     O  A E           K DISK
     FCUNDF     IF A E           K DISK
     F                                     RENAME(KUNDR:CUNDR)
     FSYSBL01   UF   E           K DISK
      *___________________________
      * Finner username
      *"""""""""""""""""""""""""""
     D                SDS
     D  ZJOB                 244    253
     D  ZUSER                254    263
     D  ZJOBNR               264    269  0
     ICUNDR
     I              BANKG                       SYBAGI
     I              POSTG                       SYPOGI
     C*
     C     *entry        PLIST
     C                   PARM                    FIRMA
     C                   PARM                    KUNDNR
     C*
     C     KEYF          KLIST
     C                   KFLD                    FIRMA
     C*
N02  c     kundnr        ifeq      *zeros
     C     KEYF          CHAIN     SYSBL01                            52
     C     SISKNR        IFNE      99999999
     C                   ADD       1             SISKNR
     C                   Z-ADD     SISKNR        KUNDNR
     C                   ELSE
     C                   Z-ADD     1             SISKNR
     C                   Z-ADD     1             KUNDNR
     C                   ENDIF
     C                   UPDATE    SYSBR
N02  c                   end
     C*
     c                   move      'A'           AKTKOD
s01  c*                  move      '10'          BetBet
s01  c*                  movel     'NO'          LAND
s01  c*                  movel     'J'           Sfakt
     c                   movel     'J'           PKOD
     c                   movel     'J'           KUTDR
     c                   movel     'KUN'         KHENV
     c                   z-add     1             FEKS
     c                   movel     '20'          DAOAAR
     c                   move      UYEAR         DAOAAR
     c                   move      UMONTH        DAOMND
     c                   move      UDAY          DAODAG
     C*
     C                   WRITE     KUNDR
     C                   WRITE     KKUNR
     C                   WRITE     CUNDR
     C*
     C                   SETON                                        LR
     C                   RETURN
     C*
