      *********************************************************************
      *  Henter arkivlenke for 'fa' 'fs' 'fx' basert på FAKT
      *  OBS - for økt sikkerhet burde både fakturanr OG kundenr være input OG lese via ARKIVL04
      *********************************************************************
CRTPG+*  CRTPGM SYSPED/WSFALNK MODULE(*LIBL/WSFALNK
CRTPGM*         *LIBL/INCGI) ACTGRP(CGI) AUT(*USE)
      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
********************************************************************
      *********************************************************************
      * MAIN PROGRAM FLOW
      *********************************************************************
      /copy syspeds/qrpgsrcpy,hspecs
      /copy syspeds/qrpgsrcpy,hspecsbnd
     FBRIDF     IF   E           K DISK    USROPN
     FARKIVL06  IF   E           K DISK    usropn
     FFIRM      IF   E           K DISK    usropn
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prototypeb
      /copy syspeds/qrpgsrcpy,usec
      /copy syspeds/qrpgsrcpy,variables3
      *--------------------------------------------------------------------
     D WSUSER          S             10
     D XMLstring       S          32000
      *--------------------------------------------------------------------
      /copy syspeds/qrpgsrcpy,prolog3
      *--------------------------------------------------------------------
      *
      * Parse input
     C                   exsr      Parse
     C                   EXSR      INIT
      * Hent XML output-dok/ skriv top + linjer
     c                   callp     gethtmlifs(
     C                             '/syspeddev/html/WS_XML.html':
     C                             '/CGITAG/')
      *
     C                   callp     wrtsection('top')
      *
      /free
        XMLstring='<?xml version="1.0" encoding="UTF-8" standalone="yes"?>';
      /end-free
     C                   callp     updHTMLvar('XMLstring':XMLstring)
     C                   callp     wrtsection('XMLlin')
      /free
        XMLstring='<getInvoiceLinks>';
      /end-free
     C                   callp     updHTMLvar('XMLstring':XMLstring)
     C                   callp     wrtsection('XMLlin')
      *
     c                   exsr      CrtBody
      * slutt
      /free
        XMLstring='</getInvoiceLinks>';
      /end-free
     C                   callp     updHTMLvar('XMLstring':XMLstring)
     C                   callp     wrtsection('XMLlin')
      *
     C     SLUTT         TAG
     C                   EXSR      EXIT
     C                   return
      *=====================================================================******
      * Parse input
      *=====================================================================******
     C     Parse         begsr
     C                   eval      WSUSER  = zhbgetvar('USER')
     c     WSUSER        ifeq      *blanks
     C                   eval      WSUSER  = 'NN'
     c                   endif
     C                   eval      ARUNDE  = zhbgetvar('FAKT')
     C                   endsr
      *=====================================================================******
      *  INITIER
      *=====================================================================******
     C     INIT          begsr
     C     ArkKey        KLIST
     C                   KFLD                    FIFIRM
     C                   KFLD                    ARTYPE
     C                   KFLD                    ARUNDE
      *
     C                   OPEN      BRIDF
     C     WSUSER        CHAIN     BRIDF                              50
     C* En "standardvariant" libl: call bound (INCGI=*MODULE) med parameter.
     C     BILIBL        ifeq      *blanks
     C                   callb     'INCGI'
     C                   parm                    BISTDL
     C                   else
     C* Helt egen bibl.liste satt på user - normal CALL (BILIBL er "*pgm")
     C                   call      BILIBL
     C                   end
     C                   OPEN      arkivl06
     C                   OPEN      FIRM
     c     *loval        setll     FIRM
     c                   read      FIRM
      *
     C                   endsr
      *=====================================================================******
      *  AVSLUTT
      *=====================================================================******
     C     EXIT          begsr
     C                   callp     wrtsection('*fini')
     C                   close     BRIDF
     C                   CLOSE     arkivl06
     C                   CLOSE     FIRM
     C                   eval      *inlr = *on
      *
     C                   endsr
      * **************************************************
     C     CrtBody       begsr
      * **************************************************
      * 'fa' = link til single
     c                   eval      ARTYPE = 'fa'
     c                   eval      ARLINK = *blanks
     c     ArkKey        chain     ARKIVL06                           33
     c     ARLINK        ifne      *blanks
     c     '.pdf'        scan      ARLINK                                 34
     c     *in34         ifeq      *off
     c                   eval      ARLINK=%trim(ARLINK)+'.pdf'
     c                   endif
     c                   endif
      /free
        XMLstring='  <faLink>'+%trim(ARLINK)+'</faLink>';
      /end-free
     C                   callp     updHTMLvar('XMLstring':XMLstring)
     C                   callp     wrtsection('XMLlin')
      *
      * 'fs' = link til samlefaktura , hoveddokument
     c                   eval      ARTYPE = 'fs'
     c                   eval      ARLINK = *blanks
     c     ArkKey        chain     ARKIVL06                           33
     c     ARLINK        ifne      *blanks
     c     '.pdf'        scan      ARLINK                                 34
     c     *in34         ifeq      *off
     c                   eval      ARLINK=%trim(ARLINK)+'.pdf'
     c                   endif
     c                   endif
      /free
        XMLstring='  <fsLink>'+%trim(ARLINK)+'</fsLink>';
      /end-free
     C                   callp     updHTMLvar('XMLstring':XMLstring)
     C                   callp     wrtsection('XMLlin')
      *
      * 'fx' = link til samlefaktura , spedifikasjon
     c                   eval      ARTYPE = 'fx'
     c                   eval      ARLINK = *blanks
     c     ArkKey        chain     ARKIVL06                           33
     c     ARLINK        ifne      *blanks
     c     '.pdf'        scan      ARLINK                                 34
     c     *in34         ifeq      *off
     c                   eval      ARLINK=%trim(ARLINK)+'.pdf'
     c                   endif
     c                   endif
      /free
        XMLstring='  <fxLink>'+%trim(ARLINK)+'</fxLink>';
      /end-free
     C                   callp     updHTMLvar('XMLstring':XMLstring)
     C                   callp     wrtsection('XMLlin')
      *
      *
     C                   endsr
      *
