      * Prototype
     D XMLesc          PR                  ExtPgm('XMLESCAPE')
     D   XMLStr                   32000A
     C                   move      *blanks       String        32000
     c                   eval      String   = '"Me, Myself & <I>"'
      *
     c                   CALLP     XMLesc(String)

     C                   RETURN
