********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 YBC PTF11 TEST FØRST TEGN ER /
********************************************************************
     FEDISX     IF   E           K DISK
     C     *ENTRY        PLIST
     C                   PARM                    WSXPRODM         10
     C                   PARM                    WBANE           256
      * Skriv til X-ref fil for filnavn/katalognavn
     C     WSXPRODM      CHAIN     EDISX                              51
     C                   IF        *IN51=*OFF
N01  C                   IF        %SUBST(SXIFSOBJ:1:1) <> '/'
     C                   EVAL      WBANE = '/' + SXIFSOBJ
N01  C                   ELSE
N01  C                   EVAL      WBANE = SXIFSOBJ
N01  C                   ENDIF
     C                   ENDIF

     C                   EVAL      *INLR=*ON
