     D MAIN            PR              *   EXTPROC('main')
     D                                 *   VALUE
     D                                 *   VALUE

     D in              S               *
     D out             S               *
     D RETURNInt       S             10I 0

     C                   EVAL      in='/SYSPEDF/TDS/SIGN'
     C                   EVAL      out='/SYSPEDF/TDS/SIGN.bin'
     C                   EVAL      RETURNInt = main(%addr(in)
     C                                         : %addr(out))

     C                   EVAL      *INLR=*OFF
