     FZADF      UF   E           K DISK
     F                                     RENAME(SADFR:ZADFR)
     FSADF      O  A E             DISK
     FKODTVAL2  IF   E           K DISK

     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UOPDN             5 0
     C                   PARM                    UFREFF           17

     C     KODVAK        KLIST
     C                   KFLD                    SFVK28
     C                   KFLD                    XDT

N01  C                   CALL      'SYGE15C'
N01  C                   PARM                    WDT               8
N01  C                   PARM                    WTM               6
N01  C                   MOVE      WDT           XDT               8 0

     C     UFREFF        CHAIN     ZADF                               51
     C     *IN51         IFEQ      *OFF
     C     SFOPDN        ANDEQ     0
     C                   MOVE      UAVD          SFAVD
     C                   MOVE      UOPDN         SFOPDN
     C     KODVAK        SETGT     KODTVAL2
     C     SFVK28        READPE    KODTVAL2                               52
     C                   IF        *IN52=*OFF
     C                   Z-ADD     KVAKRS        SFKR28
     C                   Z-ADD     KVAOMR        SFOM28
     C                   ENDIF
     C                   UPDATE    ZADFR
     C                   WRITE     SADFR
     C                   ENDIF

     C                   EVAL      *INLR=*ON
