     FZBARC     O    F   36        PRINTER OFLIND(*INOF)
     D                 DS
     D  DATA                   1     36
     D  DATA1                  4     36
     D  DATA2                  4     11
     D  DATA3                 12     19
      *  BARCODE, KODET
     D  DATA14                 4      5
     D  DATA15                 6     14
     D  DATA16                15     17  0
     D  DATA17                18     21
      *  BARCODE, TEXT
     D  DATA24                 4      5
     D  DATA25                 6     14
     D  DATA26                16     18  0
     D  DATA27                20     23
      *  UTLEV.STED
     D  DATA34                 4      7
     D  DATA35                 9     34
      *  KOLLI
     D  DATA44                 4      6  0
     D  DATA45                 8      9
     D  DATA46                11     13  0
      *  FIRMATEXT
     D  DATA54                 4     12
     D  DATA55                14     17  0
     D  DATA56                18     18
     D  DATA57                19     23  0
      *  STYKK
     D  DATA64                 4      4
     D  DATA65                 5      8  0
     D  DATA66                 9      9
      *  SELGER
     D  DATA74                 4     33
     C                   EXSR      SRINIT
     C                   EXSR      LINE1
     C                   EXSR      BARC
     C                   EXSR      BARC2
     C                   EXSR      TEXT01
     C                   EXSR      TEXT02
     C                   EXSR      TEXT03
     C                   EXSR      TEXT04
     C                   EXSR      TEXT05
     C                   EXSR      TEXT06
     C                   EXSR      TEXT07
     C     XTOTAL        IFNE      0
     C                   EXSR      TEXT08
     C                   EXSR      TEXT09
     C                   END
     C                   EXSR      TEXT10
     C                   EXSR      TEXT11
     C     XANT          IFNE      0
     C                   EXSR      TEXT12
     C                   END
     C                   EXSR      TEXT13
     C                   EXSR      SREND
      *_______
      * LINE-1
      *"""""""
     C     LINE1         BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *LINE POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '25,425'      DATA1
     C                   EXCEPT    ZBARC1
      *LINE
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WGB           DATA
     C                   MOVEL     '600,0,3'     DATA1
     C                   EXCEPT    ZBARC1
      *END OF LINE
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *________
      * BARCODE
      *""""""""
     C     BARC          BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     ',100,75'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,150'      DATA1
     C                   EXCEPT    ZBARC1
      *BARCODE SIZE
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WBY           DATA
     C                   MOVEL     '3,2:1,15'    DATA1
     C                   EXCEPT    ZBARC1
      *BARCODE
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WB2           DATA
     C                   MOVEL     'N,150,N'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVE      '00'          DATA14
     C                   MOVEL     DF1004        DATA15
     C                   Z-ADD     XANTM         DATA16
     C                   MOVE      DFADUP        DATA17
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *______________
      * BARCODE, TEXT
      *""""""""""""""
     C     BARC2         BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,18,10'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,350'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVE      '00'          DATA24
     C                   MOVEL     DF1004        DATA25
     C                   Z-ADD     XANTM         DATA26
     C                   MOVE      DFADUP        DATA27
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *________________
      * UTLEVERINGSSTED
      *""""""""""""""""
     C     TEXT01        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,30'       DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVE      DFADUP        DATA34
     C                   MOVEL     DFADU         DATA35
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *_____________
      * AVSENDERNAVN
      *"""""""""""""
     C     TEXT02        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,18,10'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,440'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     KNAVN         DATA1
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *_______________
      * AVSENDER ADR-1
      *"""""""""""""""
     C     TEXT03        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,18,10'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,460'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     ADR1          DATA1
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *_______________
      * AVSENDER ADR-2
      *"""""""""""""""
     C     TEXT04        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,18,10'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,480'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     ADR2          DATA1
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *_______________
      * MOTTAKERS NAVN
      *"""""""""""""""
     C     TEXT05        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,530'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     DFNAM         DATA1
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *____________________
      * MOTTAKERS ADRESSE-1
      *""""""""""""""""""""
     C     TEXT06        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,570'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     DFADM1        DATA1
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *____________________
      * MOTTAKERS ADRESSE-2
      *""""""""""""""""""""
     C     TEXT07        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,610'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     DFADM2        DATA1
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *___________________________
      * UTLEVERINGSFORBEHÅLL, TEXT
      *"""""""""""""""""""""""""""
     C     TEXT08        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,690'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     'UTL.FBH.'    DATA2
     C                   MOVEL     'KR.     '    DATA3
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *___________________________
      * UTLEVERINGSFORBEHÅLL, BELØP
      *"""""""""""""""""""""""""""
     C     TEXT09        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '300,690'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     XTOTAL        DATA1
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *_________
      * AVDELING
      *""""""""""
     C     TEXT10        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,18,10'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,740'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     'INTERSPE'    DATA54
     C                   MOVE      'D'           DATA54
     C                   Z-ADD     DFAVD         DATA55
     C                   MOVE      '/'           DATA56
     C                   Z-ADD     DFOPD         DATA57
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *____________
      * KOLLIANTALL
      *"""""""""""""
     C     TEXT11        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '230,80'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   Z-ADD     XANTM         DATA44
     C                   MOVE      'AV'          DATA45
     C                   Z-ADD     DFNT          DATA46
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *_____________
      * ANTALL STYKK
      *"""""""""""""
     C     TEXT12        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,36,20'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,80'       DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVE      '('           DATA64
     C                   Z-ADD     XANT          DATA65
     C                   MOVE      ')'           DATA66
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *_______
      * SELGER
      *"""""""
     C     TEXT13        BEGSR
      *FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WAD           DATA
     C                   MOVEL     'N,18,10'     DATA1
     C                   EXCEPT    ZBARC1
      *DATA POSITION
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFO           DATA
     C                   MOVEL     '30,400'      DATA1
     C                   EXCEPT    ZBARC1
      *DATA TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFD           DATA
     C                   MOVEL     HENAS         DATA74
     C                   EXCEPT    ZBARC1
      *END OF TEXT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WFS           DATA
     C                   EXCEPT    ZBARC1
      *
     C                   ENDSR
      *____
      * INZ
      *""""
     C     SRINIT        BEGSR
      *
     C                   BITOFF    '02'          WA                1            DEC 5E
     C                   BITON     '134567'      WA                             DEC 5E
      *
     C                   MOVEL     WA            WAA               3            AA
     C                   MOVE      'AA'          WAA               3            AA
      *
     C                   MOVEL     WA            WAD               3            AD
     C                   MOVE      'AD'          WAD               3            AD
      *
     C                   MOVEL     WA            WAP               3            AP
     C                   MOVE      'AP'          WAP               3            AP
      *
     C                   MOVEL     WA            WBY               3            BY
     C                   MOVE      'BY'          WBY               3            BY
      *
     C                   MOVEL     WA            WB2               3            B2
     C                   MOVE      'B2'          WB2               3            B2
      *
     C                   MOVEL     WA            WXA               3            XA
     C                   MOVE      'XA'          WXA               3            XA
      *
     C                   MOVEL     WA            WCF               3            CF
     C                   MOVE      'CF'          WCF               3            CF
      *
     C                   MOVEL     WA            WCI               3            CI
     C                   MOVE      'CI'          WCI               3            CI
      *
     C                   MOVEL     WA            WXZ               3            XZ
     C                   MOVE      'XZ'          WXZ               3            XZ
      *
     C                   MOVEL     WA            WFO               3            FO
     C                   MOVE      'FO'          WFO               3            FO
      *
     C                   MOVEL     WA            WFD               3            FD
     C                   MOVE      'FD'          WFD               3            FD
      *
     C                   MOVEL     WA            WFS               3            FS
     C                   MOVE      'FS'          WFS               3            FS
      *
     C                   MOVEL     WA            WGB               3            GB
     C                   MOVE      'GB'          WGB               3            GB
      *START
     C                   MOVEL     WXA           DATA
     C                   EXCEPT    ZBARC1
      *CHARACTER SET
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WCI           DATA
     C                   MOVEL     '4'           DATA1
     C                   EXCEPT    ZBARC1
      *DEFAULT FONT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WCF           DATA
     C                   MOVEL     'D,30,15'     DATA1
     C                   EXCEPT    ZBARC1
      *INPUT PARAMETERS
     C     *LIKE         DEFINE    DATA55        DFAVD
     C     *LIKE         DEFINE    DATA57        DFOPD
     C     *ENTRY        PLIST
     C                   PARM                    DFADUP            4            UTLEV.PNR
     C                   PARM                    DFADU            26            UTLEV.STED
     C                   PARM                    DF1004           35            SENDN.NR
     C                   PARM                    XANTM             4 0          KOLLINR
     C                   PARM                    DFNT              7 0          TOT ANT KOLLI
     C                   PARM                    XTOTAL            9 2          UTL.F.BEH
     C                   PARM                    KNAVN            30            AVS.NAVN
     C                   PARM                    ADR1             30            AVS.ADR1
     C                   PARM                    ADR2             30            AVS.ADR2
     C                   PARM                    DFNAM            30            MOTT.NAVN
     C                   PARM                    DFADM1           30            MOTT.ADR1
     C                   PARM                    DFADM2           30            MOTT.ADR2
     C                   PARM                    DFAVD                          AVD
     C                   PARM                    DFOPD                          OPD
     C                   PARM                    XANT              4 0          ANT. STYKK
     C                   PARM                    HENAS            30            SELGER
      *
     C                   ENDSR
      *____
      * END
      *""""
     C     SREND         BEGSR
      *SLUTT
     C                   MOVE      *BLANKS       DATA
     C                   MOVEL     WXZ           DATA
     C                   EXCEPT    ZBARC1
     C                   MOVE      '1'           *INLR
     C                   ENDSR
     OZBARC     E            ZBARC1
     O                       DATA
