     FFRISOK    IF   E           K DISK
     FSADF      IF   E           K DISK

     C                   EXSR      INIT

     C                   EXSR      FRISR

     C                   EXSR      SUM28

     C                   SETON                                        LR
      *________________________________________________
     C     SUM28         BEGSR
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C                   MOVE      *ZEROS        XNOK             13 2
     C                   MOVE      *ZEROS        XNOKI            13 2
     C                   MOVE      *BLANKS       XVAL              3
     C     SAD21K        SETLL     SADF
     C                   SETOFF                                       8990
     C     STS28         TAG
     C     SAD21K        READE     SADF                                   90
     C  N90              DO
     C     SFVK28        IFNE      *BLANKS
     C  N89XVAL          IFEQ      *BLANKS
     C                   MOVE      SFVK28        XVAL
     C                   MOVE      SFKR28        UKURS
     C                   ELSE
     C     XVAL          COMP      SFVK28                             8989
     C                   END
     C                   ADD       SFBL28        XNOKI
     C     SFBL28        DIV       SFOM28        XWORK            17 4
     C     XWORK         MULT(H)   SFKR28        XWORK
     C                   ADD(H)    XWORK         XNOK
     C                   END
     C                   GOTO      STS28
     C                   END

     C     XNOK          IFNE      *ZEROS
     C   89              MOVE      'NOK'         UVAL
     C   89              Z-ADD     100           UKURS
     C   89              Z-ADD     XNOK          USUM
     C                   END

     C  N89XVAL          IFNE      *BLANKS
     C     XNOKI         ANDNE     *ZEROS
     C                   MOVE      XVAL          UVAL
     C                   Z-ADD     XNOKI         USUM
     C                   END

     C                   ENDSR
     C***********************************************
     C     INIT          BEGSR
     C***********************************************
     C     FRIKEY        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN
     C                   KFLD                    WSKODE
     C     SAD21K        KLIST
     C                   KFLD                    UAVD
     C                   KFLD                    UTDN

     C     *ENTRY        PLIST
     C                   PARM                    UAVD              4 0
     C                   PARM                    UTDN              5 0
     C                   PARM                    USUM             13 2
     C                   PARM                    UVAL              3
     C                   PARM                    UKURS             7 3
     C                   PARM                    UFLAGG            1 0

     C     *LIKE         DEFINE    FSKODE        WSKODE
     C                   EVAL      WSKODE='GP2'
     C                   MOVE      *ZEROS        UKURS

     C                   ENDSR
      *________________________________________________
     C     FRISR         BEGSR
      *""""""""""""""""""""""""""""""""""""""""""""""""
     C     FRIKEY        SETLL     FRISOK
     C     FRIKEY        READE     FRISOK                                 51
     C     *IN51         DOWEQ     *OFF
     C                   MOVEL     FSSOK         WFREFF           17
     C                   CALL      'ZAD031'
     C                   PARM                    UAVD
     C                   PARM                    UTDN
     C                   PARM                    WFREFF
     C                   EVAL      UFLAGG=1
     C     FRIKEY        READE     FRISOK                                 51
     C                   ENDDO
     C                   ENDSR
