     A          R ADOBEFR
     A            ADUSER        10          COLHDG('BRUKER')
     A            ADARTY         2          COLHDG('ARKIVKODE H.F.)')
     A            ADARKM        30          COLHDG('IFS ARKIVMAPPE')
     A            ADIFTM        30          COLHDG('IFS TEMP-MAPPE')
     A            ADNETV        30          COLHDG('IFS NETV.S/BANE')
     A            ADPCTM        70          COLHDG('PC TEMP-MAPPE')
     A            ADPATH       150          COLHDG('ADOBE-PATH(PGM)')
     A            ADPAGE         1          COLHDG('PAGE(ÅPNE FRA)')
     A          K ADUSER
