      *____________________________________________
      * SYSPED / PRISER MED FLYSELSKAPS HEADING-FIL
      *""""""""""""""""""""""""""""""""""""""""""""
     A          R AIRLHR                    PFILE(AIRLH)
     A          K AIRPTO
     A          K AIRLIN
     A          K AIRPFR
