      *___________________________________________
      * SYSPED / PRISER MED FLYSELSKAPS DETALJ-FIL
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R AIRNRDR                   PFILE(AIRNRD)
     A          K AIRPFR
     A          K AIRPTO
     A          K AIRLIN
     A          K AIRSRT
     A          K AIRWEI
     A          K AIRCOD
     A          K AIRKN
     A          K AIRCOM
