      *__________________________________________
      * SYSPED / BASESTEDER MED KUNDER/ALT. BÆRER
      *""""""""""""""""""""""""""""""""""""""""""
     A          R AIRNRHR
     A            AIRLIN         3S 0       TEXT('AIRLINER')
     A            AIRPFR         3          TEXT('FROM AIRPORT')
     A            AIRPTO         3          TEXT('TO AIRPORT')
     A            AIRCUR         3          TEXT('CURRENCY')
     A            AIROMR         7P 0       TEXT('KUBIC FACTOR')
     A            AIRIAT         1          TEXT('IATA-PRICING(J/N')
     A          K AIRLIN
     A          K AIRPFR
     A          K AIRPTO
