      *____________________________________________
      * SYSPED / PRISER MED FLYSELSKAPS HEADING-FIL
      *""""""""""""""""""""""""""""""""""""""""""""
     A          R AIRNRHR                   PFILE(AIRNRH)
     A          K AIRPFR
     A          K AIRLIN
     A          K AIRPTO
