     A          R AIRSONETR
     A            AIRLIN         3  0       COLHDG('AIRLINER')
     A            AIRSON         2          COLHDG('SONE')
     A            AIRTXT        15          COLHDG('TEXT')
     A          K AIRLIN
     A          K AIRSON
