     A          R AIRSONER
     A            AIRLIN         3  0       COLHDG('AIRLINER')
     A            AIRLAN         2          COLHDG('LANDKODE')
     A            AIRPOR         5          COLHDG('AIRPORT')
     A            AIRSON         2          COLHDG('SONE')
     A          K AIRLIN
     A          K AIRLAN
     A          K AIRPOR
