     A*__________________________
     A* SYSPED / AMETA AGENTERS ANDEL
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A                                      UNIQUE
     A          R AMANDELR                  TEXT('AMETA header')
     A            AAKNA     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Agent')
     A            AADEL          3P 0       COLHDG('Agents andel')
     A            AAVAL     R               REFFLD(VAL)
     A                                      COLHDG('Avregn. valuta')
     A            AAKURS         7P 4       COLHDG('Avregn. kurs')
     A            AATYPE         1          COLHDG('Ametatype')
     A            AAAVSL         1          COLHDG('Avslutt delt ameta')
     A            AALOSS         1          COLHDG('Lossekode')
     A            AALIMT         5P 0       COLHDG('Grensev. pool ameta')
     A            AANETT    R               REFFLD(ST)
     A                                      COLHDG('Netto utskrit')
     A            AALKG          5S 0       COLHDG('Omr.fakt. LM->KG')
     A            AAKKG          5S 0       COLHDG('Omr.fakt. M3->KG')
     A            AAUTV          1          COLHDG('Utvidet ameta')
     A            AAVALA    R               REFFLD(VAL)
     A                                      COLHDG('Agents valuta')
     A            AAKURA         7P 4       COLHDG('Agents kurs')
     A            AAVALE    R               REFFLD(VAL)
     A                                      COLHDG('Egen valuta')
     A            AAKURE         7P 4       COLHDG('Egen kurs')
     A            AASPES         1A         COLHDG('Spesifisert utskrift')
     A          K AAKNA
