     A*________________________________________
     A* SYSPED / AMETA gebyrer pr. detaljelinje
     A*""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A                                      UNIQUE
     A          R AXGER                     TEXT('AMETA gebyr pr. detaljelinje')
     A            AXST      R               REFFLD(ST)
     A                                      COLHDG('Statuskode')
     A            AXTUNR    R               REFFLD(PRO)
     A                                      COLHDG('Turnummer')
     A            AXKNA     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Agent')
     A            AXPOS          7A         COLHDG('Posisjon')
     A            AXUNR     R               REFFLD(PRO)
     A                                      COLHDG('Undernummer')
     A            AXAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            AXOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            AXLI           5S 0
     A                                      COLHDG('Linejenummer')
     A            AXVK      R               REFFLD(VK)
     A                                      COLHDG('Gebyr kode')
     A            AXEINT    R               REFFLD(BEL13)
     A                                      COLHDG('Egne innt.')
     A            AXEUTG    R               REFFLD(BEL13)
     A                                      COLHDG('Egne utg.')
     A            AXAINT    R               REFFLD(BEL13)
     A                                      COLHDG('Agent innt.')
     A            AXAUTG    R               REFFLD(BEL13)
     A                                      COLHDG('Agent utg.')
     A          K AXTUNR
     A          K AXKNA
     A          K AXPOS
     A          K AXUNR
     A          K AXAVD
     A          K AXOPD
     A          K AXLI
