     A*________________________________________
     A* SYSPED / AMETA gebyrer pr. detaljelinje
     A*""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A                                      UNIQUE
     A          R AMGER                     TEXT('AMETA gebyr pr. detaljelinje')
     A            AGST      R               REFFLD(ST)
     A                                      COLHDG('Statuskode')
     A            AGTUNR    R               REFFLD(PRO)
     A                                      COLHDG('Turnummer')
     A            AGKNA     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Agent')
     A            AGPOS          7A         COLHDG('Posisjon')
     A            AGUNR     R               REFFLD(PRO)
     A                                      COLHDG('Undernummer')
     A            AGAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            AGOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            AGLI           5S 0       COLHDG('Linejenummer')
     A            AGVK      R               REFFLD(VK)
     A                                      COLHDG('Gebyr kode')
     A            AGEINT    R               REFFLD(BEL13)
     A                                      COLHDG('Egne innt.')
     A            AGEUTG    R               REFFLD(BEL13)
     A                                      COLHDG('Egne utg.')
     A            AGAINT    R               REFFLD(BEL13)
     A                                      COLHDG('Agent innt.')
     A            AGAUTG    R               REFFLD(BEL13)
     A                                      COLHDG('Agent utg.')
     A          K AGTUNR
     A          K AGKNA
     A          K AGPOS
     A          K AGUNR
     A          K AGAVD
     A          K AGOPD
     A          K AGLI
