     A*____________________________________________________
     A* SYSPED / AMETA AGENTERS GEBYRER/FRANKATUR FOR AMETA
     A*""""""""""""""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A                                      UNIQUE
     A          R AMGEBYRR                  TEXT('AMETA header')
     A            AGKNA     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Agent')
     A            AGIMEX    R               REFFLD(ST)
     A                                      COLHDG('Import/export')
     A            AGVK      R               REFFLD(VK)
     A                                      COLHDG('Gebyrkode')
     A            AGIK      R               REFFLD(ST)
     A                                      COLHDG('Inntekt/Kostnad')
     A            AGIKAG    R               REFFLD(ST)
     A                                      COLHDG('I/K Agent/Egen')
     A            AGFR01    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR02    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR03    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR04    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR05    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR06    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR07    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR08    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR09    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR10    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR11    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR12    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR13    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR14    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR15    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR16    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR17    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR18    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR19    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            AGFR20    R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A          K AGKNA
     A          K AGIMEX
     A          K AGVK
     A          K AGIK
     A          K AGIKAG
