     A*__________________________
     A* SYSPED / AMETA Header
     A*""""""""""""""""""""""""""
     A          R AMHER                     PFILE(AMHE)
     A                                      TEXT('Agent/Periode/Tur')
     A          K AHKNA
     A          K AHDTCP
     A          K AHDTÅP
     A          K AHDTMP
     A          K AHTUNR
