     A*___________________________________________
     A* SYSPED / SAML2   (SAMLEFAKTURA)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAMLR                     PFILE(AMSAML)
     A          K SAFIRM
     A          K SAKN
     A          K SAPRO
     A          K SAOPD
     A          K SASK
