     A*__________________________________
     A* SYSPED / SAMLAST
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SAMLR
     A            SAAVD     R               REFFLD(AVD)
     A            SAFIRM    R               REFFLD(FI)
     A            SAKN      R               REFFLD(KN)
     A            SAPRO     R               REFFLD(PRO)
     A            SAOPD     R               REFFLD(OPD)
     A            SASK      R               REFFLD(SK)
     A            SAXXX          4          COLHDG('LEDIGE PLASSER')
     A          K SAAVD
     A          K SAFIRM
     A          K SAKN
     A          K SAPRO
     A          K SAOPD
     A          K SASK
