     A*________________________________________
     A* SYSPED / AMETA WORKFILE FOR STATUSLISTE
     A*""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A                                      UNIQUE
     A          R AMTURR                    TEXT('AMETA workfile statusliste')
     A            ATST      R               REFFLD(ST)
     A                                      COLHDG('Statuskode')
      *                           '0' = IKKE PÅBEGYNT
      *                           '1' = AMETA ÅPNET
      *                           '2' = UNDER ARBEID
      *                           '3' = AVSLUTTET
      *                           '4' = AVSLUTTET
      *                           '5' = AVSLUTTET
      *                           '6' = KREDITERT
     A            ATTUNR    R               REFFLD(PRO)
     A                                      COLHDG('Turnummer')
     A            ATKNA     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Agent')
     A            ATDT      R               REFFLD(DT)
     A                                      COLHDG('DATO')
     A          K ATST
     A          K ATTUNR
     A          K ATKNA
     A          K ATDT
