     A*___________________________________________
     A* SYSPED / SAML2   (SAMLEFAKTURA)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAMLR                     PFILE(AMWSAML)
     A          K SAFIRM
     A          K SAAVD
     A          K SAOPD
