     A*________________________________________
     A* SYSPED / AMETA WORKFILE FOR OPPDRAG SORTERT PÅ TURNR/AGENT
     A*""""""""""""""""""""""""""""""""""""""""
     A* (Må ha workfile i stedet for en LF (HEPRO/HEKNA) på HEADF..
     A* ..siden transp.modulen benytter HEKNA til oppdragsgiver........
     A* ..(agent ble så innført senere i TRKNFA i HEADTR).)
     A                                      REF(SR)
     A          R AMWTUAGR                  TEXT('AMETA wrkf OPD. PR TUR/AGENT')
     A            WATUNR    R               REFFLD(PRO)
     A                                      COLHDG('Turnummer')
     A            WAKNA     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Agent')
     A            WAPOS1         7A         COLHDG('Posisjon 1')
     A            WAAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            WAOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A          K WATUNR
     A          K WAKNA
     A          K WAPOS1
