     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('FAX00110' 'FAX001' 'SY400LO-
     A                                      /FAX')
     A                                      HELP
      *
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'SØK')
     A                                      CF10(10 'send EPOST')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/ARC026'
     A                                      COLOR(BLU)
     A                                  1 18MSGCON(040 SHU1256 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 64TIME
     A                                      COLOR(BLU)
     A                                  6  3MSGCON(006 SHU0837 *LIBL/SYMSGF)
     A            EPOST         70A  B  6 10CHECK(LC)
     A  72                                  DSPATR(RI)
     A                                  9  3MSGCON(018 SHU1257 *LIBL/SYMSGF)
     A            FRANR          7Y 0B  9 24EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A                                 10  3MSGCON(018 SHU1258 *LIBL/SYMSGF)
     A            TILNR          7Y 0B 10 24EDTCDE(Z)
     A  71                                  DSPATR(RI)
     A  30        MSGTXT        70A  O 24  2MSGID(&MSGNR SYMSGF)
     A  30N31                               COLOR(WHT)
     A  30 31                               COLOR(RED)
     A                                 22  3MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 51MSGCON(018 SHU1259 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 27MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
