     A*%%TS  SD  20131008  091301  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYFA5201' 'SYFA52' 'SY400LO-
     A                                      /MAINT')
     A                                      HELP
      *
     A          R SUBFIL                    SFL
     A            SFDATA       152   O  6  2
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/ARC013'
     A                                      COLOR(BLU)
     A                                  1 17MSGCON(050 SHU0906 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A            EPUSER    R        O  2  2REFFLD(ARKLOGHR/EPUSER *LIBL/ARKLOG-
     A                                      H)
     A                                      COLOR(YLW)
     A                                  3  2MSGCON(013 SHU0912 *LIBL/SYMSGF)
     A            EPTIL         70A  O  3 17COLOR(YLW)
     A            ZRECNO         4S 0O  2 75SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  4  2MSGCON(013 SHU0913 *LIBL/SYMSGF)
     A            EPDATE         8Y 0O  4 17EDTWRD('    -  -  ')
     A                                      COLOR(YLW)
     A            EPTIME         6Y 0O  4 30EDTWRD('  -  -  ')
     A                                      COLOR(YLW)
     A                                  4 43'Ref:'
     A            EPAVD          4Y 0O  4 48COLOR(WHT)
     A                                      EDTCDE(Z)
     A                                  4 53'/'
     A            EPOPD          7Y 0O  4 55COLOR(WHT)
     A                                      EDTCDE(Z)
     A                                  4 63MSGCON(005 SHU1378 *LIBL/SYMSGF)
     A            EPTUR          8Y 0O  4 69COLOR(WHT)
     A                                      EDTCDE(Z)
     A                                  5  2MSGCON(040 SHU0911 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  5 43MSGCON(006 SHU1379 *LIBL/SYMSGF)
     A            EPKUND         8Y 0O  5 50COLOR(WHT)
     A                                      EDTCDE(Z)
     A            NAVN20        20   O  5 59COLOR(WHT)
      *
     A          R BUNN
     A                                      CF03(03 'EXIT')
     A                                      CF12(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98        MSG205        78A  O  4  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
      *
     A          R NYWRK
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                  1  2'SYSPED/ARC012'
     A                                      COLOR(BLU)
     A                                  1 17MSGCON(050 SHU0906 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A            EPUSER    R        O  2 17REFFLD(ARKLOGHR/EPUSER *LIBL/ARK-
     A                                      LOGH)
     A                                  3  2MSGCON(015 SHU0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  1MSGCON(077 SHU0880 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  98        MSG205        78A  O 24  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
