     A*%%TS  SD  20130918  145216  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('FAX00110' 'FAX001' 'SY400LO-
     A                                      /FAX')
     A                                      HELP
     A*
     A          R BILDE
     A*%%TS  SD  20130918  145216  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt')
     A                                      CF12(12 'AvBRYT')
     A                                      CF04(04 'SØK')
     A                                      CF10(10 'send EPOST')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/ARC004'
     A                                      COLOR(BLU)
     A                                  1 17MSGCON(040 SHU0859 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 17MSGCON(040 SHU0832 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 64TIME
     A                                      COLOR(BLU)
     A                                  7  3MSGCON(006 SHU0863 *LIBL/SYMSGF)
     A            INTEKS         1A  B  7 10VALUES('I' 'E')
     A                                  7 13MSGCON(050 SHU0864 *LIBL/SYMSGF)
     A                                  8  3MSGCON(006 SHU0837 *LIBL/SYMSGF)
     A            EPOST         70A  B  8 10CHECK(LC)
     A  72                                  DSPATR(RI)
     A                                  9  3MSGCON(006 SHU0836 *LIBL/SYMSGF)
     A            KUNDNR         8Y 0B  9 10EDTCDE(4)
     A  71                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A            KNAVN         30A  B  9 20
     A                                 12  3MSGCON(006 SHU0838 *LIBL/SYMSGF)
     A            WSCVP1        80A  B 12 10CHECK(LC)
     A  73                                  DSPATR(RI)
     A                                 14  3MSGCON(006 SHU0839 *LIBL/SYMSGF)
     A            WSCVP2        40A  B 14 10CHECK(LC)
     A            WSCVP3        40A  B 15 10CHECK(LC)
     A            WSCVP4        40A  B 16 10CHECK(LC)
     A            WSCVP5        40A  B 17 10CHECK(LC)
     A            WSCVP6        40A  B 18 10CHECK(LC)
     A            WSCVP7        40A  B 19 10CHECK(LC)
     A            WSCVP8        40A  B 20 10CHECK(LC)
     A                                 21  2MSGCON(015 SHU1411 *LIBL/SYMSGF)
     A            ARCMRG         1A  B 21 19
     A  74                                  DSPATR(RI)
     A                                 23  1MSGCON(018 SHU0847 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 20MSGCON(035 SHU1034 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 56MSGCON(025 SHU1035 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        70A  O 24  2MSGID(&MSGNR SYMSGF)
     A  30N31                               COLOR(WHT)
     A  30 31                               COLOR(RED)
