     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYFA5201' 'SYFA52' 'SY400LO-
     A                                      /MAINT')
     A                                      HELP
      *
     A          R BILDE01
     A                                      CF03(03 'EXIT')
     A                                      CF10(10 'BRENN')
     A                                  1  2'SYSPED/ARC040'
     A                                      COLOR(BLU)
     A                                  1 17MSGCON(050 SHU0992 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  7  2MSGCON(015 SHU0993 *LIBL/SYMSGF)
     A            WSFLD         30A  B  7 20CHECK(LC)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(016 SHU1003 *LIBL/SYMSGF)
     A            WSTYPE         2A  B  9 20
     A  72                                  DSPATR(RI)
     A  72                                  DSPATR(PC)
     A                                      CHECK(LC)
     A            ARTXT         15A  O  9 24
     A                                  9 45MSGCON(035 SHU1008 *LIBL/SYMSGF)
     A                                 10 19'(mm yyyy   mm yyyy)'
     A                                 10 45MSGCON(030 SHU1288 *LIBL/SYMSGF)
     A                                 11  2MSGCON(016 SHU0994 *LIBL/SYMSGF)
     A            WSPFRA         2Y 0B 11 20EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAFRA         4Y 0B 11 23EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 11 28'-'
     A            WSPTIL         2Y 0B 11 30EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSATIL         4Y 0B 11 33EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(020 SHU0995 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
