     A                                      DSPSIZ(27 132 *DS3)
     A                                      PRINT
     A                                      HELP
      *
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                      CF12(12 'AvBRYT')
     A                                      CF04(04 'SØK')
     A                                      CF10(10 'send EPOST')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/ARC045'
     A                                      COLOR(BLU)
     A                                  1 18MSGCON(040 SHU1360 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 64TIME
     A                                      COLOR(BLU)
     A                                  4  3MSGCON(006 SHU0837 *LIBL/SYMSGF)
     A            EPOST         70A  B  4 10CHECK(LC)
     A  72                                  DSPATR(RI)
     A                                  5  3MSGCON(006 SHU0836 *LIBL/SYMSGF)
     A            KUNDNR         8Y 0B  5 10EDTCDE(4)
     A  71                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A            KNAVN         30A  B  5 20
     A                                  7  3MSGCON(006 SHU0838 *LIBL/SYMSGF)
     A            WSEMNE        80A  B  7 10CHECK(LC)
     A  73                                  DSPATR(RI)
     A                                  8  3MSGCON(006 SHU0839 *LIBL/SYMSGF)
     A            WSCVP1       120A  B  8 10CHECK(LC)
     A            WSCVP2       120A  B  9 10CHECK(LC)
     A            WSCVP3       120A  B 10 10CHECK(LC)
     A            WSCVP4       120A  B 11 10CHECK(LC)
     A            WSCVP5       120A  B 12 10CHECK(LC)
     A            WSCVP6       120A  B 13 10CHECK(LC)
     A            WSCVP7       120A  B 14 10CHECK(LC)
     A            WSCVP8       120A  B 15 10CHECK(LC)
     A            WSCVP9       120A  B 16 10CHECK(LC)
     A            WSCVP10      120A  B 17 10CHECK(LC)
     A            WSCVP11      120A  B 18 10CHECK(LC)
     A            WSCVP12      120A  B 19 10CHECK(LC)
     A            WSCVP13      120A  B 20 10CHECK(LC)
     A            WSCVP14      120A  B 21 10CHECK(LC)
     A            WSCVP15      120A  B 22 10CHECK(LC)
     A            WSCVP16      120A  B 23 10CHECK(LC)
     A            WSCVP17      120A  B 24 10CHECK(LC)
     A            WSCVP18      120A  B 25 10CHECK(LC)
     A                                 26  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 22MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 42MSGCON(018 SHU0847 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        70A  O 27  2MSGID(&MSGNR SYMSGF)
     A  30N31                               COLOR(WHT)
     A  30 31                               COLOR(RED)
