     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      HELP
      *
     A          R BILDE
     A                                  1  2'SYSPED/ARC021'
     A                                      COLOR(BLU)
     A                                  1 16'Uploading of documents'
     A            WSLINK       120A  O  5  2COLOR(WHT)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
