     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYFA5201' 'SYFA52' 'SY400LO-
     A                                      /MAINT')
     A                                      HELP
      *
     A          R BILDE01
     A                                      CF03(03 'EXIT')
     A                                      CF10(10 'BRENN')
     A                                  1  3'SYSPED/ARKREGE'
     A                                      COLOR(BLU)
     A                                  1 19'Regenerere arkiv og sende mail på -
     A                                      disse'
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  9  2'Fra og til fakturanummer'
     A            FAKFRA         6Y 0B  9 28EDTCDE(4)
     A            FAKTIL         6Y 0B  9 37EDTCDE(4)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22'F10=start regenerering'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
