     A          R ARKCMPR                   PFILE(ARKCMP)
     A          K ARFIRM
     A          K ARTYPE
     A          K ARDATE
N01  A          K ARLINK
