     A          R ARKCMPR                   PFILE(ARKCMP)
     A          K ARSTAT
     A          K ARAVD
     A          K AROPD
     A          K ARTYPE
     A          K ARUNDE
