     A          R ARKIVR                    PFILE(ARKIVP)
     A          K ARKUND
     A          K ARTYPE
     A          K ARDATE
     A          K ARUNDE
