     A          R ARKIVR                    PFILE(ARKIVP)
     A          K ARSTAT
     A          K ARAVD
     A          K AROPD
     A          K ARTYPE
     A          K ARUNDE
