     A          R ARKLOGHR
     A            EPUSER        10          COLHDG('BRUKER')
     A            EPDATE         8S 0       COLHDG('DATO')
     A            EPTIME         6S 0       COLHDG('KL')
     A            EPTIL         70          COLHDG('TIL')
     A            EPUNIK         9S 0       COLHDG('UNIK')
     A            EPAUTO         1          COLHDG('AUTO')
N01  A            EPAVD          4S 0       COLHDG('AVD')
N01  A            EPOPD          7S 0       COLHDG('OPDNR')
N01  A            EPTUR          8S 0       COLHDG('TUR')
N01  A            EPKUND         8S 0       COLHDG('KUNDENR')
     A          K EPUSER
     A          K EPDATE
     A          K EPUNIK
