     A          R ARKLOGTR
     A            EPTELK         1          COLHDG('KODE')
     A            EPUNIK         9S 0       COLHDG('UNIK')
     A          K EPTELK
