     A          R ARKTXTR
     A            ARTYPE         2          COLHDG('DOKTYPE')
     A            ARTXT         15          COLHDG('TEXT')
     A            ARKJN          1          COLHDG('ARKIVERES JN')
     A            ARKSND         1          COLHDG('SENDES JN')
     A            ARKLAG         2          COLHDG('LAGRINGSSTED')
     A            ARKDAG         5S 0       COLHDG('DAGER LAGRES')
     A            ARKVED        60          COLHDG('VEDLEGG')
     A            ARSLAB         1          COLHDG('LABEL, IKKE SK.ARK ')
     A            ARSBAN        50          COLHDG('SCAN-BANE')
     A            ARMRG          1          COLHDG('MERGE')
     A            ARVEDL        40          COLHDG('VEDLEGG')
     A          K ARTYPE
