     A          R ARKVEDKR
     A            AVFIRM         2          COLHDG('FIRMA')
     A            AVKUND         8S 0       COLHDG('KUNDE')
     A            AVTYPE         2          COLHDG('DOK.TYPE')
     A            AVKVED        60          COLHDG('VEDLEGG')
     A          K AVFIRM
     A          K AVKUND
     A          K AVTYPE
