     A          R ARUSERR
     A            ARUSER        10          COLHDG('BRUKER')
     A            ARNAVN        30          COLHDG('NAVN')
     A            ARINEK         1          COLHDG('INTEKS')
     A            AREPOS        70          COLHDG('EPOSTADR')
     A            ARBANS        70          COLHDG('BANE INNSKANNING')
     A          K ARUSER
