     A*_____________________________________
     A* SYSPED / WORKFILE   UTSKRIFT AV LOSSELISTE
     A*"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R ASSAMR
     A            ASMVK     R               REFFLD(VK)
     A            ASMVAL    R               REFFLD(VAL)
     A            ASMBLV        13S 2       COLHDG('BELØP')
     A            ASMNT          3S 0       COLHDG('ANTALL OPPDRAG')
     A            ASMBLN        13S 2       COLHDG('NORSK KRONE')
     A            ASMXXX        29          COLHDG('LEDIGE PLASSER')
     A          K ASMVK
     A          K ASMVAL
