     A*_________________________________________
     A* SYSPED / KUNDEAVTALER  FRAKT
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R AVFRHR                    PFILE(AVFRH)
     A          K AFKUND
     A          K AFFRAN
     A          O AFLKFR                    COMP(EQ '%%')
