     A*_________________________________________
     A* SYSPED / KUNDEAVTALER  FRAKT
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R AVFRHR                    PFILE(AVFRH)
     A          K AFKUND
     A          K AFLKTI
     A          K AFPNT1
     A          K AFPNT2
     A          K AFLKFR
     A          K AFPNF1
     A          K AFPNF2
     A          K AFFRAN
     A          K AFGEBY
     A          K AFBFR2
