     A*_________________________________________
     A* SYSPED / KUNDEAVTALER  FRAKT
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R AVFRHR                    PFILE(AVFRH)
     A          K AFKUND
     A          K AFPROD
     A          K AFAVDE
     A          K AFFRAN
     A          K AFGEBY
     A          K AFLKFR
     A          K AFLKTI
