     A*____________________________
     A* SYSPED / LØPENR AVREGNING
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R AVRNRR
     A            AVKODE         1          COLHDG('AVR.KODE')
     A* "T" = TRANSPORTØR AVREGNING
     A            AVAVNR         7P 0       COLHDG('AVREGNINGSNR')
     A          K AVKODE
