      *____________________________________________
      * SYSPED / AVSLUTTEDE TURER/OPPDRAG
      *""""""""""""""""""""""""""""""""""""""""""""
     A          R AVSLUTFR                  PFILE(AVSLUTF)
     A          K AVAVD
     A          K AVPRO
