      *____________________________________________
      * SYSPED / AVSLUTTEDE TURER/OPPDRAG
      *""""""""""""""""""""""""""""""""""""""""""""
     A          R AVSLUTGR                  PFILE(AVSLUTGF)
     A          K AVPRO
