     A          R AWBTXTR
     A            AWBSID         2  0       COLHDG('SIDENR')
     A            AWBHE1        95          COLHDG('HODE 1')
     A            AWBHE2        95          COLHDG('HODE 2')
     A            AWBHE3        95          COLHDG('HODE 3')
     A            AWBHE4        95          COLHDG('HODE 4')
     A            AWBHE5        95          COLHDG('HODE 5')
     A            AWBHE6        95          COLHDG('HODE 6')
     A            AWBHE7        95          COLHDG('HODE 7')
     A            AWBHE8        95          COLHDG('HODE 8')
     A            AWBHE9        95          COLHDG('HODE 9')
     A            AWBBUN        50          COLHDG('BUNN')
     A          K AWBSID
