     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('HLPPRS' 'PRISER91' 'ROGER')
     A                                      ALTHELP
     A                                      HELP
     A          R START
     A                                      CF03(03 'AVSLUTT')
     A                                  3 64DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  4 34' '
     A                                  4 64TIME
     A                                      COLOR(BLU)
     A                                 11  8'Tast inn starttid  :'
     A                                      COLOR(GRN)
     A            STRTID         6A  B 11 37COLOR(WHT)
     A                                      CHECK(FE)
     A                                 12  8'og trykk enter'
     A                                      COLOR(GRN)
     A                                 15  8'navn på tape-stasjon'
     A            SAVDEV        10   B 15 37COLOR(WHT)
     A                                 22 55'(C)Systema A/S'
     A                                      COLOR(WHT)
     A                                 22  8'F3 = Avslutt'
     A                                      COLOR(BLU)
