     A*____________________________
     A* VALUTA MED SWIFT OG GIRO
     A*""""""""""""""""""""""""""""
     A          R BAGIROR
     A            BAVALU         3          TEXT('VALUTAKODE')
     A            BASWIF        11          TEXT('SWIFTADRESSE')
S01  A*           BAGIRN        20          TEXT('GIRONUMMER')
N01  A            BAGIRN        25          TEXT('GIRONUMMER')
     A          K BAVALU
