     A*____________________________
     A* SYSPED / BASESTEDER MED KUNDER/ALT. BÆRER
     A*""""""""""""""""""""""""""""
     A          R BASEKR
     A            BAKDEP         4S 0       TEXT('DEPARTMENT')
     A            BAKLKF         2          TEXT('FOREIGN COUNT.CODE')
     A            BAKPNF         5          TEXT('FOREIGN POSTAL' )
     A            BAKKNR         8S 0       TEXT('KUNDENR. EDIFACT')
     A            BAKALT         4S 0       TEXT('ALT.BÆRER')
     A            BAKALA         4S 0       TEXT('ALT.K.STED')
     A          K BAKDEP
     A          K BAKLKF
     A          K BAKPNF
