     A*____________________________
     A* SYSPED / STEDSNAVN POSTNR PR LAND
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R BASESR
     A            BASLKF         2          TEXT('COUNTRY FROM')
     A            BASPNF         5          TEXT('POSTAL FROM')
     A            BASLKT         2          TEXT('COUNTRY TO')
     A            BASPNT         5          TEXT('POSTAL TO')
     A            BASSOT         5          TEXT('SONETABLE')
N01  A            BASLMT         5S 0       TEXT('BASE LIMIT VEKT')
N01  A            BASSOL         5          TEXT('SONETABELL LIMIT')
     A          K BASLKF
     A          K BASPNF
     A          K BASLKT
     A          K BASPNT
