     A          R BATGRR
     A            BAGRUP         7          COLHDG('BÅTGRUPPE')
     A            BANAVN         5          COLHDG('BÅTKODE')
     A            BAKUNR         8S 0       COLHDG('KUNDE')
     A          K BAGRUP
     A          K BANAVN
