     A*__________________________
     A* SYSPED400 BILKODER
     A*""""""""""""""""""""""""""
     A          R BILKR                     PFILE(BILK)
     A          K BKTXT
