     A*__________________________________
     A* SYSPED / REGISTER FOR BILL OF LADING
     A*""""""""""""""""""""""""""""""""""
     A          R BILLOFR                   PFILE(BILLOF)
     A          K BLAVD
     A          K BLKNR
     A          K BLDTA
