     A                                      REF(SR)
     A          R BLOSR
     A            BLAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            BLOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            BLNAB         30A         COLHDG('VESSEL NAME')
     A            BLREFS        20A         COLHDG('SHIPPER REF.')
     A            BLFD1         40A         COLHDG('FREIGH DETAILS 1')
     A            BLFD2         40A         COLHDG('FREIGH DETAILS 2')
     A            BLFD3         40A         COLHDG('FREIGH DETAILS 3')
     A            BLPLC         25A         COLHDG('PLACE')
     A            BLPDT         25A         COLHDG('DATE')
     A            BLGB1         35A         COLHDG('GOODSDESC 1')
     A            BLGB2         35A         COLHDG('GOODSDESC 2')
     A            BLLSSNV       25A         COLHDG('FRA STED')
     A            BLLSHNV       25A         COLHDG('FRA HAVN')
     A            BLLOHNV       30A         COLHDG('TIL HAVN')
     A            BLLOSNV       30A         COLHDG('TIL STED')
     A            BLTXT1       100A         COLHDG('FREE TEXT 1')
     A            BLTXT2       100A         COLHDG('FREE TEXT 2')
     A            BLTXT3       100A         COLHDG('FREE TEXT 3')
     A            BLTXT4       100A         COLHDG('FREE TEXT 4')
     A          K BLAVD
     A          K BLOPD
