     A                                      REF(SR)
     A          R BLTURR
     A            BLPRO     R               REFFLD(PRO)
     A                                      COLHDG('TURNUMMER')
     A            BLKDP          5A         COLHDG('KODE FOR LAYOUT')
     A            BLNTBS        15A         COLHDG('ANTALL KOPI')
     A            BLREFS        20A         COLHDG('SHIPPER REF.')
     A            TULAS         30A         COLHDG('LASTSTED')
     A            TULASH        30A         COLHDG('LASTHAVN')
     A            TULOS         30A         COLHDG('LOSSESTED')
     A            TULOSH        30A         COLHDG('LOSSEHAVN')
     A            BLKNA          8S 0       COLHDG('AVSENDERSNR.')
     A            BLAD0A    R               REFFLD(AD)
     A                                      COLHDG('AVSENDERSADR.-0')
     A            BLNAA     R               REFFLD(NA)
     A                                      COLHDG('AVSENDERSNAVN')
     A            BLAD1A    R               REFFLD(AD)
     A                                      COLHDG('AVSENDERSADR.-1')
     A            BLAD2A    R               REFFLD(AD)
     A                                      COLHDG('AVSENDERSADR.-2')
     A            BLAD3A    R               REFFLD(AD)
     A                                      COLHDG('AVSENDERSADR.-3')
     A            BLAD4A    R               REFFLD(AD)
     A                                      COLHDG('AVSENDERSADR.-4')
     A            BLKNM          8S 0       COLHDG('MOTTAGERSNR.')
     A            BLAD0M    R               REFFLD(AD)
     A                                      COLHDG('MOTTAGERSADR.-0')
     A            BLNAM     R               REFFLD(NA)
     A                                      COLHDG('MOTTAGERSNAVN')
     A            BLAD1M    R               REFFLD(AD)
     A                                      COLHDG('MOTTAGERSADR.-1')
     A            BLAD2M    R               REFFLD(AD)
     A                                      COLHDG('MOTTAGERSADR.-2')
     A            BLAD3M    R               REFFLD(AD)
     A                                      COLHDG('MOTTAGERSADR.-3')
     A            BLAD4M    R               REFFLD(AD)
     A                                      COLHDG('MOTTAGERSADR.-4')
     A            BLKNN          8S 0       COLHDG('NFY.NR.')
     A            BLAD0N    R               REFFLD(AD)
     A                                      COLHDG('NOTIFY ADRESSE-0')
     A            BLNAN     R               REFFLD(NA)
     A                                      COLHDG('NOTIFY NAVN')
     A            BLAD1N    R               REFFLD(AD)
     A                                      COLHDG('NOTIFY ADRESSE-1')
     A            BLAD2N    R               REFFLD(AD)
     A                                      COLHDG('NOTIFY ADRESSE-2')
     A            BLAD3N    R               REFFLD(AD)
     A                                      COLHDG('NOTIFY ADRESSE-3')
     A            BLAD4N    R               REFFLD(AD)
     A                                      COLHDG('NOTIFY ADRESSE-4')
     A            BLFD1         40A         COLHDG('FREIGH DETAILS 1')
     A            BLFD2         40A         COLHDG('FREIGH DETAILS 2')
     A            BLFD3         40A         COLHDG('FREIGH DETAILS 3')
     A            BLPLC         25A         COLHDG('PLACE')
     A            BLPDT         25A         COLHDG('DATE')
     A            BLTXT1       100A         COLHDG('FREE TEXT 1')
     A            BLTXT2       100A         COLHDG('FREE TEXT 2')
     A            BLTXT3       100A         COLHDG('FREE TEXT 3')
     A            BLTXT4       100A         COLHDG('FREE TEXT 4')
     A          K BLPRO
