     A*__________________________________
     A* SYSPED / REGISTER FOR BILL OF LADING
     A*""""""""""""""""""""""""""""""""""
     A          R BILLOFR                   PFILE(BILLOF)
     A          K BLLB
     A          K BLDTA
