********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10199 * 01 YBC PTF10 BEVARE LINJENR
********************************************************************
     A*__________________________________
     A* SYSPED / JOIN-REGISTER (LOGISK)
     A*""""""""""""""""""""""""""""""""""
     A          R BLV1R                     PFILE(BLV1)
     A            BVMN
     A            BVAVD
     A            BVOPD
N01  A            BVLI
     A          K BVMN
     A          K BVAVD
     A          K BVOPD
      *
     A          R BLV2R                     PFILE(BLV2)
     A            BVMN
     A            BVAVD
     A            BVOPD
N01  A            BVLI
     A          K BVMN
     A          K BVAVD
     A          K BVOPD
      *
     A          R BLVSD2R                   PFILE(BLVSD2)
     A            BVMN
     A            BVAVD
     A            BVOPD
N01  A            BVLI
     A          K BVMN
     A          K BVAVD
     A          K BVOPD
      *
     A          R BILLOFR                   PFILE(BILLOF)
     A            BLMN
     A            BLAVD
     A            BLOPD
     A          K BLMN
     A          K BLAVD
     A          K BLOPD
      *
