     A*__________________________
     A* SYSPED / REGISTER FOR BILL OF LADING (LOKAL)
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R BLLOKR
     A            BEAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            BEOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            BEKNA          8P 0       COLHDG('AVSENDERSNR.')
     A            BENAA     R               REFFLD(NA)
     A                                      COLHDG('AVSENDERSNAVN')
     A            BEAD1A    R               REFFLD(AD)
     A                                      COLHDG('AVSENDERSADR.-1')
     A            BEAD2A    R               REFFLD(AD)
     A                                      COLHDG('AVSENDERSADR.-2')
     A            BEAD3A    R               REFFLD(AD)
     A                                      COLHDG('AVSENDERSADR.-3')
     A            BEKNM          8P 0       COLHDG('MOTTAGERSNR.')
     A            BENAM     R               REFFLD(NA)
     A                                      COLHDG('MOTTAGERSNAVN')
     A            BEAD1M    R               REFFLD(AD)
     A                                      COLHDG('MOTTAGERSADR.-1')
     A            BEAD2M    R               REFFLD(AD)
     A                                      COLHDG('MOTTAGERSADR.-2')
     A            BEAD3M    R               REFFLD(AD)
     A                                      COLHDG('MOTTAGERSADR.-3')
     A            BEKNN          8P 0       COLHDG('NFY.NR.')
     A            BENAN     R               REFFLD(NA)
     A                                      COLHDG('NFY.NAVN')
     A            BEAD1N    R               REFFLD(AD)
     A                                      COLHDG('NFY.ADRESSE-1')
     A            BEAD2N    R               REFFLD(AD)
     A                                      COLHDG('NFY.ADRESSE-2')
     A            BEAD3N    R               REFFLD(AD)
     A                                      COLHDG('NFY.ADRESSE-3')
     A            BEKDP          5          COLHDG('KODE FOR LAYOUT')
     A            BEMN      R               REFFLD(FT17)
     A                                      COLHDG('SAMLAST CONT.NR')
     A            BEFT          20          COLHDG('TESKT')
     A            BEKDSA         1          COLHDG('SHIPPERS ACCOUNT')
     A            BEKDRA         1          COLHDG('RECEIVERS ACCOUNT')
     A            BEKDTF         1          COLHDG('THROUGHFREIGHT')
     A            BEKDCP         1          COLHDG('COLL/PPD')
     A            BENTBS        15          COLHDG('ANTALL BS/L')
     A            BESD      R               REFFLD(SD)
     A                                      COLHDG('STED')
     A            BEDT           8P 0       COLHDG('DATO')
     A            BEBLNR        16          COLHDG('LOKAL B/L-NR')
     A          K BEAVD
     A          K BEOPD
