     A*__________________________
     A* SYSPED / BOOKINGS VARELINJEREGISTER TYPE-1
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R BLV1GTR
     A            BVAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            BVOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            BVLI           3S 0       COLHDG('LINJENR')
     A            BVMN      R               REFFLD(FT17)
     A                                      COLHDG('MERKE & NUMMER')
     A            BVGTIN         8S 0       COLHDG('DATO GATE IN')
     A            BVGTUT         8S 0       COLHDG('DATO GATE OUT')
     A          K BVAVD
     A          K BVOPD
     A          K BVLI
