      *
      * BOKSER FOR TURPLANLEGGING
     A*__________________________
     A* SYSPED / BOKSFIL
     A*""""""""""""""""""""""""""
     A          R BOKSR                     PFILE(BOKSF)
     A          K BOSTAT
     A          K BOTUR
