     A*__________________________________
     A* SYSPED / BOOKINGregister
     A*""""""""""""""""""""""""""""""""""
     A          R BOOKINGR                  PFILE(BOOKING)
     A          K BOLB
     A          K BODT1
     A          K BOLSH
     A          K BOVHL
