     A*__________________________________
     A* SYSPED / BOOKINGregister
     A*""""""""""""""""""""""""""""""""""
     A          R BOOKINGR                  PFILE(BOOKING)
     A          K BOAVD
     A          K BOLB
     A          K BODT1
