     A*__________________________
     A* SYSPED / BOOKINGregister
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R BOOKINGR
     A            BOST      R               REFFLD(ST)
     A                                      COLHDG('Statuskode')
     A            BOAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            BOOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            BOPRO     R               REFFLD(PRO)
     A                                      COLHDG('Prosjektnr')
     A            BOAVDK         4P 0       COLHDG('KOPI FRA Avdeling')
     A            BOOPDK         7P 0       COLHDG('KOPI FRA Oppd.nr')
     A            BOSG      R               REFFLD(SG)
     A                                      COLHDG('Signatur')
     A            BODTR     R               REFFLD(DT)
     A                                      COLHDG('REGISTRERINGSDATO')
NV5  A            BOACC          2  0       COLHDG('ÅRHUNDRE')
     A            BOAAR          2  0       COLHDG('AARSTALL')
     A            BOUKE          2  0       COLHDG('UKENR.')
     A            BOKNR          8P 0       COLHDG('Kundenr REDERI')
     A            BOTR           4          COLHDG('TRAFIKKNR.')
     A            BOKNA          8P 0       COLHDG('Kundenr AVSENDER')
     A            BONAA     R               REFFLD(NA)
     A                                      COLHDG('Navn AVSENDER')
     A            BOKNAA        25          COLHDG('KONTAKTPERSON')
     A            BOKNS          8P 0       COLHDG('Kundenr SPED.')
     A            BONAS     R               REFFLD(NA)
     A                                      COLHDG('Navn SPED.')
     A            BOKNAS        25          COLHDG('KONTAKTPERSON')
     A            BOLB           5          COLHDG('LOKALBÅT')
     A            BOLBN         20          COLHDG('LOKALBÅT NAVN')
     A            BOLSH     R               REFFLD(SD)
     A                                      COLHDG('LASTEHAVN')
     A            BOLSHN        20          COLHDG('LASTEHAVNS NAVN')
EV5  A            BODT1          8P 0       COLHDG('AVGANGSDATO')
     A            BOANM         15          COLHDG('ANMELDT')
     A            BOREF1        10          COLHDG('REF. TIL ANMELDT')
     A            BOANMN        15          COLHDG('NAVN TIL ANMELDT')
EV5  A            BODT2          8P 0       COLHDG('DATO')
     A            BOINS1        55          COLHDG('INSTRUKS AVGANG')
     A            BOVH      R               REFFLD(SD)
     A                                      COLHDG('VIAHAVN')
     A            BOVHN         20          COLHDG('VIAHAVNS NAVN')
     A            BOOB           5          COLHDG('OVERSJØBÅT')
     A            BOOBN         20          COLHDG('OVERSJØBÅT NAVN')
     A            BOREIS        14          COLHDG('REISENR.')
EV5  A            BODT3          8P 0       COLHDG('AVGANGSDATO 2')
     A            BOLOH     R               REFFLD(SD)
     A                                      COLHDG('LOSSEHAVN')
     A            BOLOHN        20          COLHDG('LOSSESTEDS NAVN')
     A            BOLOS     R               REFFLD(SD)
     A                                      COLHDG('LOSSESTED')
     A            BOLOSN        20          COLHDG('LOSSESTEDS NAVN')
     A            BOLSTY         3          COLHDG('LASTETYPE')
     A            BOMM          15          COLHDG('MOVEMENT')
     A            BOREFN        14          COLHDG('BOOK.NR OVERSJØ BÅT')
     A            BONT1     R               REFFLD(NT)
     A                                      COLHDG('Antall kolli 1')
     A            BOKDC1         2          COLHDG('CONTAINER KODE')
     A            BOMN1         20          COLHDG('MERKE & NUMMER 1')
     A            BOVS1     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-1')
     A            BOVKT1    R               REFFLD(VKT9)
     A                                      COLHDG('Vekt 1')
     A            BOM31          7P 3       COLHDG('KUBIKK 1')
     A            BONT2     R               REFFLD(NT)
     A                                      COLHDG('Antall kolli 2')
     A            BOKDC2         2          COLHDG('CONTAINER KODE')
     A            BOMN2         20          COLHDG('MERKE & NUMMER 2')
     A            BOVS2     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-2')
     A            BOVKT2    R               REFFLD(VKT9)
     A                                      COLHDG('Vekt 2')
     A            BOM32          7P 3       COLHDG('KUBIKK 2')
     A            BONT3     R               REFFLD(NT)
     A                                      COLHDG('Antall kolli 3')
     A            BOKDC3         2          COLHDG('CONTAINER KODE')
     A            BOMN3         20          COLHDG('MERKE & NUMMER 3')
     A            BOVS3     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-3')
     A            BOVKT3    R               REFFLD(VKT9)
     A                                      COLHDG('Vekt 3')
     A            BOM33          7P 3       COLHDG('KUBIKK 3')
     A            BONT4     R               REFFLD(NT)
     A                                      COLHDG('Antall kolli 4')
     A            BOKDC4         2          COLHDG('CONTAINER KODE')
     A            BOMN4         20          COLHDG('MERKE & NUMMER 4')
     A            BOVS4     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-4')
     A            BOVKT4    R               REFFLD(VKT9)
     A                                      COLHDG('Vekt 4')
     A            BOM34          7P 3       COLHDG('KUBIKK 4')
     A            BOLSS     R               REFFLD(SD)
     A                                      COLHDG('LASTESTED')
     A            BOLSSN        20          COLHDG('LASTESTEDS NAVN')
EV5  A            BODT4          8P 0       COLHDG('LASTEDATO')
     A            BOREF2        20          COLHDG('REF. TIL LASTEST.')
     A            BOINS2        55          COLHDG('INSTRUKS LASTEST.')
     A            BODP          20          COLHDG('DEPOT')
EV5  A            BODT5          8P 0       COLHDG('DEPOT DATO')
     A            BOREF3        20          COLHDG('REF. TIL DEPOT')
     A            BOINS3        55          COLHDG('INSTRUKS DEPOT')
     A            BOKNT          8P 0       COLHDG('Kundenr TRANS.')
     A            BONAT         20          COLHDG('Navn TRNASPORTØR')
EV5  A            BODT6          8P 0       COLHDG('TRANS. DATO')
     A            BOREF4        20          COLHDG('REF. TIL TRANS.')
     A            BOINS4        55          COLHDG('INSTRUKS TRANS.')
     A            BOCH           1          COLHDG('C.H.')
     A            BOMH           1          COLHDG('M.H.')
     A            BORATE        50          COLHDG('RATE')
     A            BOVAL     R               REFFLD(VAL)
     A                                      COLHDG('Valutakode')
     A            BOBL      R               REFFLD(BEL7)
     A            BOCP           1          COLHDG('CC/PP')
      *
     A            BOKNRP    R               REFFLD(KN)
     A                                      COLHDG('KNR ROUTING PARTY')
     A            BONARP    R               REFFLD(NA)
     A                                      COLHDG('NAVN ROUT.PARTY')
     A            BOKNDA    R               REFFLD(KN)
     A                                      COLHDG('DELIVERRY AGENT')
     A            BONADA    R               REFFLD(NA)
     A                                      COLHDG('NAVN DELIV.AGENT')
     A            BOVHL     R               REFFLD(SD)
     A                                      COLHDG('VIAHAVN LOKAL B/L')
     A            BODT7          8P 0       COLHDG('DATO VIAHAVN L')
     A            BOVH2     R               REFFLD(SD)
     A                                      COLHDG('VIAHAVN 2')
     A            BODT8          8P 0       COLHDG('DATO VIAHAVN 2')
     A            BODT9          8P 0       COLHDG('DATO LOSSEHAVN')
     A            BOBKNL        14          COLHDG('BOOK.NR LOKAL BÅT')
     A            BOCPL          1          COLHDG('CC/PP')
     A            BOVALL    R               REFFLD(VAL)
     A                                      COLHDG('Valutakode LOKAL BÅT')
     A            BOBLL     R               REFFLD(BEL7)
     A                                      COLHDG('RATE BELØP LOKAL BÅT')
     A            BOBLCP    R               REFFLD(BEL7)
     A                                      COLHDG('BELØP C/P LOKAL BÅT')
     A            BOBLG     R               REFFLD(BEL7)
     A                                      COLHDG('GEBYR LOKAL BÅT')
      *
     A            BOKNTO         8P 0       COLHDG('OVERSJØ TO')
     A            BOKNCO         8P 0       COLHDG('OVERSJØ CC')
     A            BOKNFO         8P 0       COLHDG('OVERSJØ FROM')
     A            BOTFXO         1          COLHDG('T=TELEX F=TELEFAX')
EV5  A            BODTO          8P 0       COLHDG('OVERSJØ TELEX/FAX')
     A            BOTIDO         6P 0       COLHDG('OVERSJØ TELEX/FAX')
     A            BOKNTL         8P 0       COLHDG('LOKAL TO')
     A            BOKNCL         8P 0       COLHDG('LOKAL CC')
     A            BOKNFL         8P 0       COLHDG('LOKAL FROM')
     A            BOTFXL         1          COLHDG('T=TELEX F=TELEFAX')
EV5  A            BODTL          8P 0       COLHDG('LOKAL TELEX/FAX')
     A            BOTIDL         6P 0       COLHDG('LOKAL TELEX/FAX')
     A            BOKNTT         8P 0       COLHDG('TRANSPORTØR TO')
     A            BOKNCT         8P 0       COLHDG('TRANSPORTØR CC')
     A            BOKNFT         8P 0       COLHDG('TRANSPORTØR FROM')
     A            BOTFXT         1          COLHDG('T=TELEX F=TELEFAX')
EV5  A            BODTT          8P 0       COLHDG('TRANS. TELEX/FAX')
     A            BOTIDT         6P 0       COLHDG('TRANS. TELEX/FAX')
     A            BOKNTP         8P 0       COLHDG('DEPOT TO')
     A            BOKNCP         8P 0       COLHDG('DEPOT CC')
     A            BOKNFP         8P 0       COLHDG('DEPOT FROM')
     A            BOTFXP         1          COLHDG('T=TELEX F=TELEFAX')
EV5  A            BODTP          8P 0       COLHDG('DEPOT TELEX/FAX')
     A            BOTIDP         6P 0       COLHDG('DEPOT TELEX/FAX')
     A            BOKNTE         8P 0       COLHDG('TERMINAL TO')
     A            BOKNCE         8P 0       COLHDG('TERMINAL CC')
     A            BOKNFE         8P 0       COLHDG('TERMINAL FROM')
     A            BOTFXE         1          COLHDG('T=TELEX F=TELEFAX')
EV5  A            BODTE          8P 0       COLHDG('TERMINAL TELEX/FAX')
     A            BOTIDE         6P 0       COLHDG('TERMINAL TELEX/FAX')
EV5  A            BODTS          8P 0       COLHDG('SAMLASTSPESIFIKASJON')
EV5  A            BODTB          8P 0       COLHDG('LOKAL BILL OF LADING')
EV5  A            BODTA          8P 0       COLHDG('LASTESEDDEL')
     A            BOKNBB         8P 0       COLHDG('BOOKING BEKREFTEL')
     A            BOTFBB         1          COLHDG('T=TELEX F=TELEFAX')
EV5  A            BODTBB         8P 0       COLHDG('BOOKING BEKREFTEL')
     A            BOTIBB         6P 0       COLHDG('BOOKING BEKREFTEL')
     A          K BOAVD
     A          K BOOPD
