     A*__________________________
     A* SYSPED / BOOKINGregister DEL-2
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R BOOKIN2R
     A            B2AVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            B2OPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            B2KDA         12          COLHDG('AVSENDERSKODE')
     A            B2KDM         12          COLHDG('MOTTAKERSKODE')
     A            B2KDN         12          COLHDG('NTF.KODE')
     A            B2IMCO         6          COLHDG('IMCO-CLASS')
     A            B2PGNO         6          COLHDG('PAGE-NO')
     A            B2UNNO         8          COLHDG('UN-NO')
     A            B2COC         20          COLHDG('COND. OF CARGO')
     A            B2FP          14          COLHDG('FLASHPOINT')
     A            B2NT1     R               REFFLD(NT)
     A                                      COLHDG('Antall kolli 1')
     A            B2VT1     R               REFFLD(VT15)
     A                                      COLHDG('FORPAKNING 1')
     A            B2VS1     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-1')
     A            B2VKB1    R               REFFLD(VKT9)
     A                                      COLHDG('BRUTTO Vekt 1')
     A            B2VKN1    R               REFFLD(VKT9)
     A                                      COLHDG('NETTO Vekt 1')
     A            B2M31          7P 3       COLHDG('KUBIKK 1')
     A            B2NT2     R               REFFLD(NT)
     A                                      COLHDG('Antall kolli 2')
     A            B2VT2     R               REFFLD(VT15)
     A                                      COLHDG('FORPAKNING 2')
     A            B2VS2     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-2')
     A            B2VKB2    R               REFFLD(VKT9)
     A                                      COLHDG('BRUTTO Vekt 2')
     A            B2VKN2    R               REFFLD(VKT9)
     A                                      COLHDG('NETTO Vekt 2')
     A            B2M32          7P 3       COLHDG('KUBIKK 2')
     A            B2NT3     R               REFFLD(NT)
     A                                      COLHDG('Antall kolli 3')
     A            B2VT3     R               REFFLD(VT15)
     A                                      COLHDG('FORPAKNING 3')
     A            B2VS3     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-3')
     A            B2VKB3    R               REFFLD(VKT9)
     A                                      COLHDG('BRUTTO Vekt 3')
     A            B2VKN3    R               REFFLD(VKT9)
     A                                      COLHDG('NETTO Vekt 3')
     A            B2M33          7P 3       COLHDG('KUBIKK 1')
     A            B2NT4     R               REFFLD(NT)
     A                                      COLHDG('Antall kolli 4')
     A            B2VT4     R               REFFLD(VT15)
     A                                      COLHDG('FORPAKNING 4')
     A            B2VS4     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-4')
     A            B2VKB4    R               REFFLD(VKT9)
     A                                      COLHDG('BRUTTO Vekt 4')
     A            B2VKN4    R               REFFLD(VKT9)
     A                                      COLHDG('NETTO Vekt 4')
     A            B2M34          7P 3       COLHDG('KUBIKK 4')
     A            B2FRP         48          COLHDG('FR.PAYER')
      *
     A            B2KNS          8P 0       COLHDG('STEVEDOR')
     A            B2NAS     R               REFFLD(NA)
     A                                      COLHDG('STEVEDOR NAVN')
     A            B2ADL     R               REFFLD(AD)
     A                                      COLHDG('LEVERINGSADRESSE')
     A            B2EMS          8          COLHDG('FARLIGLASTKLASS EMS')
     A            B2MFAG         8          COLHDG('FARLIGLASTKLASS MFAG')
     A            B2MP           1          COLHDG('MARINE PLLUTANT')
     A            B2TLF         25          COLHDG('EMERGENCY PHONE')
     A            B2KNVH         8P 0       COLHDG('AGENT VIAHAVN')
     A            B2NAVH        30          COLHDG('VIAHAVNS NAVN')
     A            B2HSNR        11          COLHDG('HS-KODE NR.')
     A            B2PG          14          COLHDG('PSCKING GROUP')
     A          K B2AVD
     A          K B2OPD
