     A*__________________________________
     A* SYSPED / BOOKINGregister
     A*""""""""""""""""""""""""""""""""""
     A          R BOOKINGR                  PFILE(BOOKING)
     A          K BOOB
     A          K BODT1
