     A          R BRIDFR
     A            BIAKT          1A         TEXT('AKTIVKODE')
     A                                      COLHDG('AKTIVKODE')
     A            BIBRID        10A         TEXT('BRUKER-ID')
     A                                      COLHDG('BRUKER-ID')
     A            BIPO          10A         TEXT('PASSORD')
     A                                      COLHDG('PASSORD')
     A            BIBESK        30A         TEXT('BESKRIVELSE')
     A                                      COLHDG('BESKRIVELSE')
     A            BIFIRM         2A         TEXT('KODE FOR FIRMA')
     A                                      COLHDG('KODE FOR FIRMA')
     A            BISTDL         1A         TEXT('KODE FOR BIBL.LISTE')
     A                                      COLHDG('KODE FOR BIBL.LISTE')
     A            BILIBL        10A         TEXT('..ELLER HELT EGET LIBL-PGM')
     A                                      COLHDG('..EL. EGET LIBL-PGM')
     A            BIWELC        50A         TEXT('AVVIKENDE INNG.SIDE')
     A                                      COLHDG('AVVIKENDE INNG.SIDE')
     A            BIKUNR         8S 0       TEXT('KUNDENUMMER I SYSPED')
     A                                      COLHDG('KUNDENUMMER I SYSPED')
     A            BIANTF         1S 0       TEXT('ANTALL FEIL')
     A                                      COLHDG('ANTALL FEIL')
     A            BIDTV          8S 0       TEXT('SISTE INNLOGGINGDATO')
     A                                      COLHDG('SISTE INNLOGGINGDATO')
     A            BITIDV         6S 0       TEXT('SISTE INNLOGGINGTID')
     A                                      COLHDG('SISTE INNLOGGINGTID')
     A            BIDTF          8S 0       TEXT('FEIL INNLOGGINGDATO')
     A                                      COLHDG('FEIL INNLOGGINGDATO')
     A            BITIDF         6S 0       TEXT('FEIL INNLOGGINGTID')
     A                                      COLHDG('FEIL INNLOGGINGTID')
     A            BIINN          1A         TEXT('STATUS FOR INNLOGGING')
     A                                      COLHDG('STATUS FOR INNLOGG.')
     A            BIFARG        10A         TEXT('FARGE PÅ BACKGRUNN')
     A                                      COLHDG('FARGE PÅ BACKGRUNN')
     A            BIKNG          8S 0       TEXT('KUNDENUMMER I GRUPPE')
     A                                      COLHDG('KUNDENUMMER I GRIPPE')
     A            BIEIER         5A         TEXT('VAREEIER')
     A                                      COLHDG('VAREEIER')
     A          K BIBRID
