********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 AUTORITETSKODE OG ENDGELSK BESKRIVELSE
********************************************************************
     A          R BRPRFR
     A            BPAKT          1A         COLHDG('AKTIVKODE')
     A            BPKUNR         8S 0       COLHDG('KUNDNR')
     A            BPPRD        128A         COLHDG('PRODUKT')
     A            BPPRD2       128A         COLHDG('PRODUKT-2')
     A            BPTXT         50A         COLHDG('BESKRIVELSE')
N01  A            BPTXTE        50A         COLHDG('ENGELSK BESKRIVELSE')
     A            BPBILD        50A         COLHDG('BILDENAVN')
     A            BPLIN          3S 0       COLHDG('LINJENR')
     A            BPKOL          1S 0       COLHDG('KOLONNENR')
     A            BPRECN         7S 0       COLHDG('RECORDNR')
     A          K BPKUNR
     A          K BPLIN
     A          K BPKOL
