     A          R BRPRFR
     A            BPKUNR         8S 0       COLHDG('KUNDNR')
     A            KOVK1          5P 0       TEXT('VEKTGRUPPE - 1')
     A            KOVK2          5P 0       TEXT('VEKTGRUPPE - 2')
     A            KOVK3          5P 0       TEXT('VEKTGRUPPE - 3')
     A            KOVK4          5P 0       TEXT('VEKTGRUPPE - 4')
     A            KOVK5          5P 0       TEXT('VEKTGRUPPE - 5')
     A            KOVK6          5P 0       TEXT('VEKTGRUPPE - 6')
     A            KOVK7          5P 0       TEXT('VEKTGRUPPE - 7')
     A            KOVK8          5P 0       TEXT('VEKTGRUPPE - 8')
     A            KOVK9          5P 0       TEXT('VEKTGRUPPE - 9')
     A            KOVK10         5P 0       TEXT('VEKTGRUPPE - 10')
     A            KOVK11         5P 0       TEXT('VEKTGRUPPE - 11')
     A          K BPKUNR
