     A*_________________________________________
     A* SYSPED / KUNDEAVTALER  FRAKT
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R AVFRHR                    PFILE(BUFRH)
     A          K AFAVNR
