     A*_________________________________________
     A* SYSPED / KUNDEAVTALER  FRAKT
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R AVFRDR                    PFILE(BUFRD)
     A          K AFAVNR
     A          K AFCDE1
