     A          R CARGOOR
      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10153 * 01 JOV PTF10 LM
********************************************************************
     A            COAVD          4S 0       COLHDG('AVD ')
     A            COOPD          7S 0       COLHDG('OPD ')
     A            COLNR          7S 0       COLHDG('LØPENR HENOP')
     A            COLNR2         3S 0       COLHDG('LØPENR HENOS')
     A            COMNT          5S 0       COLHDG('ANT KLL I CARGOSC')
     A            COMNTP         3S 0       COLHDG('ANT PLL I CARGOSC')
     A            COMVKT         7S 2       COLHDG('MÅLT VKT I KG')
     A            COMM3          7S 5       COLHDG('MÅLT M3')
N01  A            COMLM          4S 2       COLHDG('MÅLT LM')
     A            COMFBV         5S 0       COLHDG('FRAKTVEKT')
     A            COAVVP         6S 1       COLHDG('AVVIKS % F.VKT')
      * GAMLE VERDIER FRA OPPDRAGET (BYTTES UT HVIS.....)
     A            COGNTA         5S 0       COLHDG('GML. KLL I DOKUFM')
     A            COGNTB         5S 0       COLHDG('GML. KLL PÅ HEADF')
     A            COGNTP         3S 0       COLHDG('GML. PLL PÅ HEADF')
     A            COGVKT         7S 0       COLHDG('GML. VKT PÅ HEADF')
     A            COGM3          7S 3       COLHDG('GML. M3  PÅ HEADF')
N01  A            COGLM          4S 2       COLHDG('GML. LM  PÅ HEADF')
     A            COGFBV         5S 0       COLHDG('GML. VKT PÅ HEADF')
     A            COFRAB         7S 0       COLHDG('GML. FRAKT  HEADF')
     A          K COAVD
     A          K COOPD
