     A          R CARGOFR
     A            KOID          20          COLHDG('EAN KLL ID ')
      * STATUS FRA SCANNER 0 = OK, 2 = FLERE STREKKODER...
     A            KOSTAT         3          COLHDG('STATUS')
      * VERDIER MÅLT (CARGOSCAN EL.LIGN - 0, NÅR FRA PDA..)
     A            KOMVKT         7S 2       COLHDG('MÅLT VKT I KG')
     A            KOMLM          4S 2       COLHDG('MÅLT LM')
     A            KOMM3          7S 5       COLHDG('MÅLT M3')
     A            KOMLEN         3S 0       COLHDG('MÅLT LEN I CM')
     A            KOMBRE         3S 0       COLHDG('MÅLT BRE I CM')
     A            KOMHØY         3S 0       COLHDG('MÅLT HØY I CM')
      * INN    EGEN TERMINAL
     A            KOTERM        20A         COLHDG('NAVN EGEN TERM')
     A            KOSTNR         5A         COLHDG('STASJON PÅ TERM')
     A            KOINDT         8S 0       COLHDG('INN TERM DATO')
     A            KOINTI         6S 0       COLHDG('INN TERM TID')
     A            KOUSER        10          COLHDG('PDA USER')
      * AVD/OPPDRAG
     A            KOAVD          4S 0       COLHDG('AVD (SISTE HEND)')
     A            KOOPD          7S 0       COLHDG('OPD (SISTE HEND)')
     A            KOLNR          7S 0       COLHDG('LØPENR HENOP')
     A            KOLNR2         3S 0       COLHDG('LØPENR HENOS')
      * DIV EKSTRA
     A            KOGTYP        20          COLHDG('GODSTYPE V.PDA')
     A            KOKRAV         5          COLHDG('PDA KRAV V,M,')
     A            KOLMIN         1          COLHDG('LM.INDIKATOR')
     A            KOPATH        35          COLHDG('IMAGE PATH')
     A          K KOID
     A          K KOTERM
