     A          R CASSFASTR
     A            CALEVN         8S 0       COLHDG('LEVNR')
     A            CAGEBO         3A         COLHDG('GEB OVERSKUDD')
     A            CAGEBM         3A         COLHDG('GEB MOMSDFØRING')
     A            CAPRT         10A         COLHDG('PRINTER')
