     A          R CCBLV1R                   PFILE(CCBLV1)
     A          K BVAVD
     A          K BVOPD
     A          K BVSORT
     A          K BVLI
