     A                                      REF(SR)
     A          R CCBLV2R
     A            BVAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            BVOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            BVTXT1       100A         COLHDG('FREE TEXT 1')
     A            BVTXT2       100A         COLHDG('FREE TEXT 2')
     A            BVTXT3       100A         COLHDG('FREE TEXT 3')
     A            BVTXT4       100A         COLHDG('FREE TEXT 4')
     A          K BVAVD
     A          K BVOPD
