     A*_____________________
     A* SYSPED / INFORMASJON
     A*"""""""""""""""""""""
     A          R CDBINFOR
     A            CBIBK          5          COLHDG('BÅKODE')
     A            CBILI          3P 0       COLHDG('LINJENR.')
     A            CBITXT        62          COLHDG('FRITEKST')
     A          K CBIBK
     A          K CBILI
