     A*__________________________________
     A* SYSPED / Register FOR B/L-FORMULAR, BESKRIVELSE
     A*""""""""""""""""""""""""""""""""""
     A          R CDBLF2R                   PFILE(CDBLF2)
     A          K CF2FT
