     A*__________________________________
     A* SYSPED / BÅTKODEregister, BÅTNAVN
     A*""""""""""""""""""""""""""""""""""
     A          R CDBOATR                   PFILE(CDBOAT)
     A                                      TEXT('BÅTNAVN')
     A          K CBNAB
