     A*__________________________________
     A* SYSPED / BÅTKODEregister, BÅTEIER
     A*""""""""""""""""""""""""""""""""""
     A          R CDBOATR                   PFILE(CDBOAT)
     A          K CBKN
