     A*__________________________________
     A* SYSPED / BÅTKODEregister, EDIBÅTKODE 2
     A*""""""""""""""""""""""""""""""""""
     A          R CDBOATR                   PFILE(CDBOAT)
     A          K CBKN
     A          K CBKDE2
