     A*__________________________________
     A* SYSPED / BÅTKODEregister, EDIBÅTKODE 1
     A*""""""""""""""""""""""""""""""""""
     A          R CDBOATR                   PFILE(CDBOAT)
     A          K CBKN
     A          K CBKDE1
