     A*__________________________
     A* SYSPED / REGISTER FOR KODER (CONTAINER) INN/UT
     A*""""""""""""""""""""""""""
     A          R CDCONTR
     A            CCKD           1A         COLHDG('KODE FOR INN/UT')
     A            CCFT          30A         COLHDG('BESKRIVELSE')
     A            CCST           3A         COLHDG('STATUS')
     A          K CCKD
