     A*__________________________________
     A* SYSPED / Register FOR KODER (CONTAINER) DEPOT
     A*""""""""""""""""""""""""""""""""""
     A          R CDCON2R                   PFILE(CDCON2)
     A          K CC2NA
