     A*__________________________________
     A* SYSPED / Register FOR KODER (CONTAINER) INNHOLD
     A*""""""""""""""""""""""""""""""""""
     A          R CDCON3R                   PFILE(CDCON3)
     A          K CC3FT
