     A*__________________________________
     A* SYSPED / Register FOR KODER (CONTAINER) STØRRELSE
     A*""""""""""""""""""""""""""""""""""
     A          R CDCON4R                   PFILE(CDCON4)
     A          K CC4FT
