     A*__________________________
     A* SYSPED / REGISTER FOR KODER (CONTAINER) DEPOT
     A*""""""""""""""""""""""""""
     A          R CDCON2R
     A            CC2KD          3A         COLHDG('DEPOT')
     A            CC2NA         30A         COLHDG('NAVN')
     A            CC2AD1        30A         COLHDG('ADRESSE-1')
     A            CC2AD2        30A         COLHDG('ADRESSE-2')
     A            CC2AD3        30A         COLHDG('ADRESSE-3')
     A          K CC2KD
