     A          R CDERAFR
     A            CEAKN          8S 0       COLHDG('CLIENTSNO.')
     A            CEAVAL         3          COLHDG('CODE OF CORRENCY')
     A            CEAPR          5S 2       COLHDG('PROSENT')
     A            CEABL          5S 2       COLHDG('ADDITIONAL PRICE')
     A          K CEAKN
     A          K CEAVAL
