     A*__________________________________
     A* SYSPED / KODE FOR INFORMASJON
     A*""""""""""""""""""""""""""""""""""
     A          R CDINFOR                   PFILE(CDINFO)
     A          K CINA
