     A*______________________________
     A* SYSPED / KODE FOR INFORMASJON
     A*""""""""""""""""""""""""""""""
     A          R CDINFOR
     A            CIKD           3          COLHDG('KODE FOR INFO.')
     A            CINA          30          COLHDG('BESKRIVELSE')
     A          K CIKD
