     A*__________________________________
     A* SYSPED / Register FOR LASTETYPER (KODEBESKRIVELSE)
     A*""""""""""""""""""""""""""""""""""
     A          R CDLASTR                   PFILE(CDLAST)
     A          K CLFT
