     A*____________________________________
     A* SYSPED / KODEREGISTER FOR PRODUKTER
     A*""""""""""""""""""""""""""""""""""""
     A          R CDPRFR
     A            CPPROD         1          COLHDG('PRODUKT')
     A            CPTEXT        30          COLHDG('BESKRIVELSE')
     A          K CPPROD
