     A*__________________________
     A* SYSPED / REGISTER FOR TRAFIKK
     A*""""""""""""""""""""""""""
     A          R CDTRAFR
     A            CTAKT          1A         COLHDG('AKTIVKODE')
     A            CTFIRM         2A         COLHDG('FIRMA')
     A            CTKN           8S 0       COLHDG('KUNDENR.')
     A            CTKD           4A         COLHDG('TRAFIKK KODE')
     A            CTFT          30A         COLHDG('BESKRIVELSE')
     A          K CTFIRM
     A          K CTKN
     A          K CTKD
