     A*__________________________________
     A* SYSPED / Register FOR TRAFIKK (KODEBESKRIVELSE
     A*""""""""""""""""""""""""""""""""""
     A          R CDTRAFR                   PFILE(CDTRAF)
     A          K CTFIRM
     A          K CTKN
     A          K CTFT
