     A*=========================================================================
     A*
     A* The record format of this file
     A* is to be used as an external data structure for CGI programs.
     A*
     A* The external data structure is used by http server API QtmhCvtDb
     A* to format the string input from html to a CGI program
     A*
     A* To perform this function, the API looks for input keywords
     A* and formats the related values into the corresponding field
     A* names.
     A* For instance, if the input string where
     A*     action=add&lng=de&cgiinp01=000817&cgiinp02=Johannes&cgiinp03=Grueber
     A* the API would format
     A*          add          into field named ACTION
     A*          de           into field named LNG
     A*          000817       into field named CGIINP01
     A*          Johannes     into field named CGIINP02
     A*          Grueber      into field named CGIINP03
     A*
     A*  Please note that input keywords do not have to be in the
     A*  same sequence of fields in your external data structure.
     A*  Input keywords, if missing, wil cause the corresponding
     A*  fields in the external data structure to be initialized
     A*  to their defaul values.
     A*
     A*=========================================================================
     A          R EXTERDS                   TEXT('External DS for CGIs')
      * CGI INPUT FIELDS
      * 1- Input fields for CGI main actions
     A            ACTION        10A         TEXT('Action CGI should perform')
     A            SUBACTION     10A         TEXT('Subaction CGI should perform')
     A            LNG            2A         TEXT('National language used')
      * 2- Input fields (hope they are enough and large enough)
     A            CGIINP01     100A         TEXT('CGI generic input field')
     A            CGIINP02     100A         TEXT('CGI generic input field')
     A            CGIINP03     100A         TEXT('CGI generic input field')
      *    The following fields are commented,
      *    for performance reasons.
      *    Just uncomment and/or change the ones you believe you need
     A*           CGIINP04     100A         TEXT('CGI generic input field')
     A*           CGIINP05     100A         TEXT('CGI generic input field')
     A*           CGIINP06     100A         TEXT('CGI generic input field')
     A*           CGIINP07     100A         TEXT('CGI generic input field')
     A*           CGIINP08     100A         TEXT('CGI generic input field')
     A*           CGIINP09     100A         TEXT('CGI generic input field')
     A*           CGIINP10     100A         TEXT('CGI generic input field')
     A*           CGIINP11     100A         TEXT('CGI generic input field')
     A*           CGIINP12     100A         TEXT('CGI generic input field')
     A*           CGIINP13     100A         TEXT('CGI generic input field')
     A*           CGIINP14     100A         TEXT('CGI generic input field')
     A*           CGIINP15     100A         TEXT('CGI generic input field')
     A*           CGIINP16     100A         TEXT('CGI generic input field')
     A*           CGIINP17     100A         TEXT('CGI generic input field')
     A*           CGIINP18     100A         TEXT('CGI generic input field')
     A*           CGIINP19     100A         TEXT('CGI generic input field')
     A*           CGIINP20     100A         TEXT('CGI generic input field')
     A*           CGIINP21     100A         TEXT('CGI generic input field')
     A*           CGIINP22     100A         TEXT('CGI generic input field')
     A*           CGIINP23     100A         TEXT('CGI generic input field')
     A*           CGIINP24     100A         TEXT('CGI generic input field')
     A*           CGIINP25     100A         TEXT('CGI generic input field')
     A*           CGIINP26     100A         TEXT('CGI generic input field')
     A*           CGIINP27     100A         TEXT('CGI generic input field')
     A*           CGIINP28     100A         TEXT('CGI generic input field')
     A*           CGIINP29     100A         TEXT('CGI generic input field')
     A*           CGIINP30     100A         TEXT('CGI generic input field')
     A*           CGIINP31     100A         TEXT('CGI generic input field')
     A*           CGIINP32     100A         TEXT('CGI generic input field')
     A*           CGIINP33     100A         TEXT('CGI generic input field')
     A*           CGIINP34     100A         TEXT('CGI generic input field')
     A*           CGIINP35     100A         TEXT('CGI generic input field')
     A*           CGIINP36     100A         TEXT('CGI generic input field')
     A*           CGIINP37     100A         TEXT('CGI generic input field')
     A*           CGIINP38     100A         TEXT('CGI generic input field')
     A*           CGIINP39     100A         TEXT('CGI generic input field')
     A*           CGIINP40     100A         TEXT('CGI generic input field')
     A*           CGIINP41     100A         TEXT('CGI generic input field')
     A*           CGIINP42     100A         TEXT('CGI generic input field')
     A*           CGIINP43     100A         TEXT('CGI generic input field')
     A*           CGIINP44     100A         TEXT('CGI generic input field')
     A*           CGIINP45     100A         TEXT('CGI generic input field')
     A*           CGIINP46     100A         TEXT('CGI generic input field')
     A*           CGIINP47     100A         TEXT('CGI generic input field')
     A*           CGIINP48     100A         TEXT('CGI generic input field')
     A*           CGIINP49     100A         TEXT('CGI generic input field')
     A*           CGIINP50     100A         TEXT('CGI generic input field')
      * 3- Input fields for textareas (they must be real large)
     A*           CGIINPT1   10000A         TEXT('Input field for a textarea')
     A*           CGIINPT2   10000A         TEXT('Input field for a textarea')
