     A          R CGIWSTIR
     A            CWUNIK        15A         COLHDG('SESSIONID')
     A            CWSONR         2  0       COLHDG('SONE NR')
     A            CWSONA        20A         COLHDG('SONE NAVN')
      *
     A            ANT01W         9P 0
     A            ANT02W         9P 0
     A            ANT03W         9P 0
     A            ANT04W         9P 0
     A            ANT05W         9P 0
     A            ANT06W         9P 0
     A            ANT07W         9P 0
     A            ANT08W         9P 0
     A            ANT09W         9P 0
     A            ANT10W         9P 0
     A            ANT11W         9P 0
     A            ANT12W         9P 0
     A            ANT13W         9P 0
      *
     A            KLL01W         9P 0
     A            KLL02W         9P 0
     A            KLL03W         9P 0
     A            KLL04W         9P 0
     A            KLL05W         9P 0
     A            KLL06W         9P 0
     A            KLL07W         9P 0
     A            KLL08W         9P 0
     A            KLL09W         9P 0
     A            KLL10W         9P 0
     A            KLL11W         9P 0
     A            KLL12W         9P 0
     A            KLL13W         9P 0
      *
     A            VKT01W         9P 0
     A            VKT02W         9P 0
     A            VKT03W         9P 0
     A            VKT04W         9P 0
     A            VKT05W         9P 0
     A            VKT06W         9P 0
     A            VKT07W         9P 0
     A            VKT08W         9P 0
     A            VKT09W         9P 0
     A            VKT10W         9P 0
     A            VKT11W         9P 0
     A            VKT12W         9P 0
     A            VKT13W         9P 0
      *
     A            FVK01W         9P 0
     A            FVK02W         9P 0
     A            FVK03W         9P 0
     A            FVK04W         9P 0
     A            FVK05W         9P 0
     A            FVK06W         9P 0
     A            FVK07W         9P 0
     A            FVK08W         9P 0
     A            FVK09W         9P 0
     A            FVK10W         9P 0
     A            FVK11W         9P 0
     A            FVK12W         9P 0
     A            FVK13W         9P 0
      *
     A            EBL01W         9P 0
     A            EBL02W         9P 0
     A            EBL03W         9P 0
     A            EBL04W         9P 0
     A            EBL05W         9P 0
     A            EBL06W         9P 0
     A            EBL07W         9P 0
     A            EBL08W         9P 0
     A            EBL09W         9P 0
     A            EBL10W         9P 0
     A            EBL11W         9P 0
     A            EBL12W         9P 0
     A            EBL13W         9P 0
      *
     A            EGE01W         9P 0
     A            EGE02W         9P 0
     A            EGE03W         9P 0
     A            EGE04W         9P 0
     A            EGE05W         9P 0
     A            EGE06W         9P 0
     A            EGE07W         9P 0
     A            EGE08W         9P 0
     A            EGE09W         9P 0
     A            EGE10W         9P 0
     A            EGE11W         9P 0
     A            EGE12W         9P 0
     A            EGE13W         9P 0
      *
     A            MBL01W         9P 0
     A            MBL02W         9P 0
     A            MBL03W         9P 0
     A            MBL04W         9P 0
     A            MBL05W         9P 0
     A            MBL06W         9P 0
     A            MBL07W         9P 0
     A            MBL08W         9P 0
     A            MBL09W         9P 0
     A            MBL10W         9P 0
     A            MBL11W         9P 0
     A            MBL12W         9P 0
     A            MBL13W         9P 0
      *
     A            TBL01W         9P 0
     A            TBL02W         9P 0
     A            TBL03W         9P 0
     A            TBL04W         9P 0
     A            TBL05W         9P 0
     A            TBL06W         9P 0
     A            TBL07W         9P 0
     A            TBL08W         9P 0
     A            TBL09W         9P 0
     A            TBL10W         9P 0
     A            TBL11W         9P 0
     A            TBL12W         9P 0
     A            TBL13W         9P 0
      *
     A          K CWUNIK
     A          K CWSONR
