     A          R CHARR
     A            CHARP         99          COLHDG('TEGN')
     A            CHARK          1          COLHDG('KEY')
     A            CHSIST         2S 0       COLHDG('SISTE')
     A          K CHARK
