     A          R CI2KUNR
     A            FIRMA          2A         COLHDG('FIRMAKODE')
     A            KUNDNR         8S 0       COLHDG('KUNDENR')
     A            ENDKO1         1A         COLHDG('ENDR.KODE KUN')
     A            ENDKO2         1A         COLHDG('ENDR.KODE K.PERS')
      * FELT FRA VADR, ADRESSE NR 1 (=EGEN VARE/GATEADRESSE)
     A            VADRNA        30          TEXT('FIRMANAVN')
     A            VADRN1        30          TEXT('ADRESSE 1')
     A            VADRN2        30          TEXT('ADRESSE 2')
     A            VADRN3        30          TEXT('ADRESSE 3')
      * FELT FRA LØSNING 1
     A            DISTR          4S 0
      * FELT FRA ANDRE BASER ....
     A          K FIRMA
     A          K KUNDNR
