      *_____________________
      * STYRINGSOPPLYSNINGER
      *"""""""""""""""""""""
     A          R CSTYR
     A            CSPKUN         8P 0       COLHDG('Partners kundenummer')
     A            CSFKUN         8P 0       COLHDG('Fraktbrevskundenr.')
     A            CSBET          1A         COLHDG('Betaler (A/M)')
     A            CSFRAN         3A         COLHDG('Frankatur')
     A            CSINNL         1A         COLHDG('Innlandsbereg. (J/N)')
     A            CSKPGM        10A         COLHDG('Konverteringspgm.')
     A            CSMERK         1A         COLHDG('Merkelapp (J,N)')
     A            CSFRAK         1A         COLHDG('Fraktbrev (J,N)')
      *_________________
      * UNB OPPLYSNINGER
      *"""""""""""""""""
      * S001 Syntax identifier
     A            CS001          4          COLHDG('Syntax id')
     A            CS002          1          COLHDG('Syntax v.no')
      * S002 Interchange sender
     A            CS004         35          COLHDG('Sender id')
     A            CS007S         4          COLHDG('Part.id.code Q')
     A            CS008         14          COLHDG('Adr.for rev.rout')
      * S003 Interchange recipient
     A            CS010         35          COLHDG('Recip. id')
     A            CS007R         4          COLHDG('Part.id.code Q')
     A            CS014         14          COLHDG('Routing adr')
      * S004 Date/Time of preparation
     A            CS017          8          COLHDG('Date of prep')
     A            CS019          4          COLHDG('Time of prep')
      *
     A            CS020A        14          COLHDG('Interchange ctl ref')
      * S005 Recipients Reference Password
     A            CS022         14          COLHDG('Rec ref/pwd')
     A            CS025          2          COLHDG('Rec ref/pwd Q')
      *
     A            CS026         14          COLHDG('Application ref')
     A            CS029          1          COLHDG('Proc prior code')
     A            CS031          1          COLHDG('Ack req')
     A            CS032         35          COLHDG('Cmn agree id')
     A            CS035          1          COLHDG('Test ind')
