     A*____________________________
     A* SYSPED400 FELT - FELTUTVALG PR XXX (KUND) FOR UTSKRIFT. YYY.
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R CUFLDR
     A            CFKEY1         8S 0       COLHDG('Kundenr(el.l)')
     A            CFKEY2        10          COLHDG('Dokument')
     A            CFL            2S 0       COLHDG('Linjenr')
     A            CFR            3S 0       COLHDG('Rekkefølge')
     A            CFB            3S 0       COLHDG('BLANKE FORAN')
     A            CFP            3S 0       COLHDG('Startposisjon')
     A            CFS            3S 0       COLHDG('Sluttposisjon')
     A            CFN            3S 0       COLHDG('Felt nr i SYFLD')
     A            CFOVER        20          COLHDG('Overskrift')
     A            CFLEN          3S 0       COLHDG('Feltlengde')
     A            CFDEC          1          COLHDG('Ant desim')
     A                                      VALUES(' ' '0' '1' '2' '3' '5' '6')
     A            CFEDIT         1          COLHDG('Editeringskode')
     A          K CFKEY1
     A          K CFKEY2
     A          K CFL
     A          K CFR
