      *= FLATFIL "INVOICE"  FRA AVSENDER SOM OGSÅ BRUKER SYSPED..
      * AVSENDERID / KUNDENUMMER KOBLET TIL LEV-NR
      * KONV-TABELL FOR GEBYR-KODER
     A          R CMFAMOR
     A            CMSEID        35          COLHDG('SENDER-ID')
     A            CMKUNR         8S 0       COLHDG('KUNDENR')
     A            CMLEV          8S 0       COLHDG('LEVERANDØR')
     A            CMBETB         2          COLHDG('BET.BET')
     A            CMBISE         1          COLHDG('BILAGS-SERIE')
     A            CMAUTF         1          COLHDG('AUTOM. FERDIGMLD.')
     A            CMPRKO         1          COLHDG('PRINT-KODE...')
     A            CMMAIL        50          COLHDG('MAIL TIL (=IKKE PRT)')
     A            CMKRES         8S 0       COLHDG('TIL K-RES.NR.. ')
     A            CMVK           3          COLHDG('VAREKODE')
     A            CMVK1F         3          COLHDG('VAREK. 1 FRA')
     A            CMVK1T         3          COLHDG('VAREK. 1 TIL')
     A            CMVK2F         3          COLHDG('VAREK. 2 FRA')
     A            CMVK2T         3          COLHDG('VAREK. 2 TIL')
     A            CMVK3F         3          COLHDG('VAREK. 3 FRA')
     A            CMVK3T         3          COLHDG('VAREK. 3 TIL')
     A            CMVK4F         3          COLHDG('VAREK. 4 FRA')
     A            CMVK4T         3          COLHDG('VAREK. 4 TIL')
     A            CMVK5F         3          COLHDG('VAREK. 5 FRA')
     A            CMVK5T         3          COLHDG('VAREK. 5 TIL')
     A            CMVK6F         3          COLHDG('VAREK. 6 FRA')
     A            CMVK6T         3          COLHDG('VAREK. 6 TIL')
     A            CMVK7F         3          COLHDG('VAREK. 7 FRA')
     A            CMVK7T         3          COLHDG('VAREK. 7 TIL')
     A            CMVK8F         3          COLHDG('VAREK. 8 FRA')
     A            CMVK8T         3          COLHDG('VAREK. 8 TIL')
     A            CMVK9F         3          COLHDG('VAREK. 9 FRA')
     A            CMVK9T         3          COLHDG('VAREK. 9 TIL')
     A            CMVK10F        3          COLHDG('VAREK.10 FRA')
     A            CMVK10T        3          COLHDG('VAREK.10 TIL')
     A            CMVK11F        3          COLHDG('VAREK.11 FRA')
     A            CMVK11T        3          COLHDG('VAREK.11 TIL')
     A            CMVK12F        3          COLHDG('VAREK.12 FRA')
     A            CMVK12T        3          COLHDG('VAREK.12 TIL')
     A            CMVK13F        3          COLHDG('VAREK.13 FRA')
     A            CMVK13T        3          COLHDG('VAREK.13 TIL')
     A            CMVK14F        3          COLHDG('VAREK.14 FRA')
     A            CMVK14T        3          COLHDG('VAREK.14 TIL')
     A            CMVK15F        3          COLHDG('VAREK.15 FRA')
     A            CMVK15T        3          COLHDG('VAREK.15 TIL')
     A          K CMSEID
     A          K CMKUNR
