      * KUNDENUMMER SOM SKAL "INTERN-FAKTURERES"
      *= FLATFIL "INVOICE"  TIL MOTTAKER (SOM OGSÅ BRUKER SYSPED..)
     A          R CIFAKR
     A            CIKUNR         8S 0       COLHDG('KUNDENR')
     A            CISEID        35          COLHDG('SENDER-ID')
     A            CIMOID        35          COLHDG('MOTTAKER-ID')
     A            CIPRT          1          COLHDG('UTSKRIFT ?')
     A          K CIKUNR
