     A          R CUM3LMR
     A            M3FIRM         2          COLHDG('FIRMA')
     A            M3KUND         8S 0       COLHDG('KUNDENR')
     A            M3M3           5S 0       COLHDG('KUBIKK OMREGNING')
     A            MLLM           5S 0       COLHDG('LASTEMETER OMREGNING')
     A          K M3FIRM
     A          K M3KUND
