********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12001 * 02 YBC PTF12 NYTT FELT FOR MVA-REGISTRTERT
********************************************************************
     A          R KUNDR
     A            AKTKOD         1A         COLHDG('ACT.CODE')
     A            FIRMA          2A         COLHDG('FIRMCODE')
     A            KUNDNR         8S 0       COLHDG('CUST.NO')
     A            DKUND          1A         COLHDG('DIV.CUST')
     A            KNAVN         30A         COLHDG('NAME')
     A            ADR1          30A         COLHDG('ADR. 1')
     A            ADR2          30A         COLHDG('ADR. 3')
     A            POSTNR         4S 0       COLHDG('POSTAL.NO 4.0')
     A            ADR3          24A         COLHDG('ADR. 3')
     A            KPERS         30A         COLHDG('CONT.PERS')
     A            TLF           15A         COLHDG('PHONE NO')
     A            SONAVN        10A         COLHDG('SEARCH NAME')
     A            VALKOD         3A         COLHDG('CURR.CODE')
     A            SPRAAK         1A         COLHDG('LANGUAGECODE')
     A            BANKG         15A         COLHDG('BANK GIRONO.')
     A            POSTG         20A         COLHDG('GIRONO POST')
     A            FMOT           8S 0       COLHDG('INV.REC.')
     A            BETBET         2A         COLHDG('DUE.CODE')
     A            BETMAT         1A         COLHDG('PAYM.WAY')
     A            SFAKT          1A         COLHDG('CONSOL. INV')
     A            KGRENS         7P 0       COLHDG('CREDIT LIMIT')
     A            TFAXNR        15A         COLHDG('FAX.NO')
     A            SYREGN         8S 0       COLHDG('REGNO TAX')
     A            SYKONT         7P 0       COLHDG('ACCOUNT CUST')
     A            SYLIKV         1          COLHDG('LIQ.CODE')
     A            SYOPDT         2          COLHDG('ORDER-TYPE')
     A            SYMINU         4S 2       COLHDG('MIN DISP.FEE')
     A            SYUTLP         4S 2       COLHDG('DISP FEE %')
      * SYRG: POS 1-9 (ORGANISASJONSNR), POS 1-11 (PERSONNR)
     A            SYRG          14          COLHDG('REGNR')
     A            SYPOGE         9          COLHDG('POSTAL')
     A            SYSTAT         3          COLHDG('STATE')
     A            SYLAND         2          COLHDG('COUNTRY')
     A            SYSELG         3          COLHDG('SALESMAN')
     A            SYIAT1         7S 0       COLHDG('IATACODE 1')
     A            SYIAT2         4S 0       COLHDG('IATACODE 2')
     A            SYCOTY         1          COLHDG('COM.TYPE')
     A            SYFR01         1          COLHDG('SKAL FAXADVISERES')
     A            SYFR02         1          COLHDG('IKKE HAR TOLLKRED.')
     A            SYFR03         2          COLHDG('FAKTURA FRITXTKODE')
     A            SYFR04         2          COLHDG('SECURED/UNSECURED')
     A            SYFR05         3          COLHDG('1.=S.TAK,2.=.3.=. ')
     A            SYFR06         3          COLHDG('FREE 06')
     A            SYSALU        13P 0       COLHDG('SALDO UFAKTURERT')
     A            SYEPOS        70          COLHDG('EPOST-ADRESSE')
     A            AKNRKU         8S 0       COLHDG('AVTALEKUNDE')
     A            VATKKU        14          COLHDG('VAT NUMMER')
     A            XXBRE          8S 6       COLHDG('BREDDEGRAD, DESIMAL')
     A            XXLEN          9S 6       COLHDG('LENGDEGRAD, DESIMAL')
     A            XXINM3         3S 0       COLHDG('INNLAND M3FAKT')
     A            XXINLM         4S 0       COLHDG('INNLAND LM-FAKT')
     A            RNRAKU        20          COLHDG('TAX-NR FAKTURA')
     A            GOLK           4          COLHDG('TDS GODSLOKALKOD')
     A            KUNDGR         2          COLHDG('KUNDEGRUPPE')
     A            PNPBKU        10          COLHDG('POSTBOKSNR')
     A            ADR21         30          COLHDG('ADRESSE 3')
     A            EORI          17          COLHDG('EU FELLES KUNDE')
N01  A            SYMVJN         1A         COLHDG('J/N MVA-REGISTRERT')
N01  A            SYMVSP         1A         COLHDG('J/N MV-SPESIFIKASJON')
