     A          R KUNDR                     PFILE(CUNDF)
     A                                      TEXT('Kunderegister SAMLEF.')
     A          K FIRMA
     A          K KUNDNR
     A          O SFAKT                     COMP(EQ ' ')
