     A          R CUNDCR                    PFILE(CUNDC)
     A                                      TEXT('Customer Contact File')
     A          K CFIRMA
     A          K CCONTA
     A          K CCOMPN
