     A          R CUNDCR                    TEXT('Customer Contact File')
     A            CFIRMA         2A         COLHDG('Firmcode')
     A            CCOMPN         8S 0       COLHDG('Cust.No')
     A            CCONTA        30          COLHDG('Contact.ID')
     A            CTYPE         30          COLHDG('Contact.Type')
     A            CPHONE        15          COLHDG('Phone.No')
     A            CMOBIL        15          COLHDG('Mobil.No')
     A            CFAX          15          COLHDG('Fax.No')
     A            CEMAIL        70          COLHDG('E-Mail.Addr')
     A            CLIVE          1          COLHDG('Link/attachment')
     A            CPRINT         1          COLHDG('Also print')
     A            SONAVN        10          COLHDG('Searchname')
     A            CEMNE         80          COLHDG('Subject /Email')
     A            CAVD          80          COLHDG('Department')
     A            CAVDIO         1          COLHDG('Inc/Omit Departmens')
     A            COPD          10          COLHDG('Ordertypes')
     A            COPDIO         1          COLHDG('Inc/Omit Ordertypes')
     A            CMERGE         1          COLHDG('Merge PDF')
