     A                                      ALTSEQ(IBMALPHA)
     A          R KUNDR                     PFILE(CUNDF)
     A                                      TEXT('Kunderegister Alfasøk')
     A          K FIRMA
     A          K KUNDGR
