     A          R CUNDCR                    PFILE(CUNDC)
     A                                      TEXT('CUSTOMER CONTACT FILE')
     A          K CFIRMA
     A          K CTYPE
     A          K SONAVN
     A          K CCOMPN
