     A          R CUOTIGR                   PFILE(CUOTIG)
     A          K COFIRM
     A          K COKUNR
     A          K COKODE
     A          K COFRI
