     A*____________________________
     A* SYSPED / KUNDES SAMLEF.PROFIL SKAL HA... PR AVD..
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R CUSAAVR
     A            CAKN      R               REFFLD(KN)
     A                                      COLHDG('Kundenr.')
     A            CAAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            CASFAK         1
     A                                      COLHDG('Samlefakt.kode')
     A          K CAKN
     A          K CAAVD
