     A*__________________________
     A* SYSPED400 REGISTER FOR DAG JOURNAL
     A*""""""""""""""""""""""""""
     A          R DAYJOR
     A            DADATO         8S 0       COLHDG('DAGB.DATO')
     A            DABILK         3          COLHDG('BILKODE')
     A            DADIST         1          COLHDG('DISP.STATUS')
     A*  ' ' = PÅ TUR 'U' = UDISPONERT  - PÅ SLUTTEN AV LISTA
     A            DABILN        10          COLHDG('BILNUMMER')
     A            DAHENG        10          COLHDG('HENGER')
     A            DASJN1        24          COLHDG('SJÅFØR 1 NAVN')
     A            DADTF          8S 0       COLHDG('DATO FRA ')
N01  A            DASDFL         2          COLHDG('LANDKODE  FRA')
N01  A            DASDFK         5          COLHDG('STEDSKODE FRA')
     A            DASDF         20          COLHDG('STED FRA ')
     A            DADTT          8S 0       COLHDG('DATO TIL ')
N01  A            DASDTL         2          COLHDG('LANDKODE  TIL')
N01  A            DASDTK         5          COLHDG('STEDSKODE TIL')
     A            DASDT         20          COLHDG('STED TIL ')
     A            DAAVD          4S 0       COLHDG('AVD')
     A            DAPRO          8S 0       COLHDG('TURNUMMER')
     A            DARUND         8S 0       COLHDG('RUNDTUR')
     A            DABTXT        20          COLHDG('BILKODE TEKST')
     A          K DADATO
     A          K DABILK
     A          K DADIST
     A          K DABILN
