     A*__________________________
     A* SYSPED400 REGISTER FOR DAG JOURNAL - SPOOLFILE INKL BLANKE LINJER
     A*""""""""""""""""""""""""""
     A          R DAYJBR
     A            JBTXT        128          COLHDG('EN LINJE JOURN.')
