     A*__________________________
     A* SYSPED400 REGISTER FOR DAG JOURNAL - SPOOLFILE INKL SKIPP/SPACE KONTR.
     A*""""""""""""""""""""""""""
     A          R DAYJAR
     A            SKIPP          3          COLHDG('SKIPP TO LINE.')
     A            SPACEB         1          COLHDG('SPACE BEFORE.')
     A            JATXT        132          COLHDG('EN LINJE JOURN.')
