      * SLETTEDE MERGEDE  POSTER
     A          R DELMRGR
     A            MRGOBJ        30          COLHDG('POST SLETTET')
     A            MRGDAT         8S 0       COLHDG('DATO LAGET')
     A          K MRGOBJ
