     A          R DHLCUSORDR
     A            CUSORD_ID     25          COLHDG('EVO Order ID')
     A            TRIP_F_ID     38          COLHDG('EVO Trip No')
     A            REQUEST_NO    18          COLHDG('Request number')
     A            DOC_TYPE       3          COLHDG('Customs Doc. type')
     A            DEC_STATUS    16          COLHDG('DECLARATION_STATUS')
     A            DEC_NO        30          COLHDG('DECLARATION_NO')
     A            REGIST_NO     30          COLHDG('Gods/invent. Nr')
     A            DECL_DATE      8S 0       COLHDG('DECLARATION DATE')
     A            CL_OFF_ID     16          COLHDG('Customs Office')
     A            TOT_TAR_CD     9S 0       COLHDG('Nbr tariff lines')
     A            CLEARED_TC     9S 0       COLHDG('Nbr taric codes')
     A            CLEARED_QT     9S 0       COLHDG('quatities')
     A            CLEARED_WG    11S 0       COLHDG('Gross weight')
     A            CUST_ACD      35          COLHDG('Customs Acc cd')
     A            CUST_PW       35          COLHDG('Customs PWD ref')
     A            PRSTATUS       1          COLHDG('Pross status')
     A            PR_DATE        8S 0       COLHDG('Pross. date')
     A            PR_TIME        6S 0       COLHDG('Pross time')
     A          K PRSTATUS
     A          K PR_DATE
     A          K PR_TIME
