     A*__________________________
     A* SYSPED400 REGISTER FOR DISPONERING
     A*""""""""""""""""""""""""""
     A          R DISPR
     A            DISTEF         5          COLHDG('FRA STED')
     A            DISTET         5          COLHDG('TIL STED')
     A            DISONF         5          COLHDG('FRA SONE')
     A            DISONT         5          COLHDG('TIL SONE')
EV5  A            DIDATF         8S 0       COLHDG('FRA DATO')
EV5  A            DIDATT         8S 0       COLHDG('TIL DATO')
     A            DITIMF         4S 0       COLHDG('FRA TIME')
     A            DITIMT         4S 0       COLHDG('TIL TIME')
     A            DIAVD          4S 0       COLHDG('AVD')
     A            DIOPD          7S 0       COLHDG('OPPDRAGSNUMMER')
     A            DITUAV         4S 0       COLHDG('AVD TURNUMMER')
     A            DITUR          8S 0       COLHDG('TURNUMMER')
     A            DIRUND         8S 0       COLHDG('RUNDTUR')
     A            DISTA1         1          COLHDG('DISPONERINGSSTATUS')
     A            DISTA2         1          COLHDG('STATUS 2')
     A            DISTA3         1          COLHDG('STATUS 3')
     A            DISTA4         1          COLHDG('STATUS 4')
     A            DISIGN         3          COLHDG('SIGNATUR')
     A            DIOT           2          COLHDG('OPPDRAGSTYPE')
     A          K DIAVD
     A          K DIOPD
