     A          R DISPR                     PFILE(DISP)
     A          K DIOT
     A          K DIDATF
     A          O DITUR                     CMP(EQ 0)
     A          O DISTA1                    CMP(GT 'A')
