     A          R DISPR                     PFILE(DISP)
     A          K DIAVD
     A          K DISTEF
     A          K DIDATF
     A          K DISTET
