     A          R DISPR                     PFILE(DISP)
     A          K DISTA1
     A          K DITUR
     A          K DIAVD
     A          K DIDATT
