     A          R DISPR                     PFILE(DISP)
     A          K DIAVD
     A          K DISONF
     A          K DIDATF
     A          K DISONT
