     A          R DISPR                     PFILE(DISP)
     A          K DISTA1
     A          K DITUR
     A          K DIOT
     A          K DIDATF
