      *__________________________
      * SYSPED / DISTRIBUSJONSLISTER
      *""""""""""""""""""""""""""
     A          R DISTLHR
     A            DISNVN         6          COLHDG('DIST NAVN')
     A            DISTXT        70          COLHDG('EPOSTADRESSE')
     A          K DISNVN
