     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(7 15 8 55 *NOMSGLIN)
     A                                      OVERLAY
     A          R BILDE01
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'DKE503R'
     A                                      COLOR(BLU)
     A                                  1 10'Eksport fortolling via PLL'
     A                                      DSPATR(HI)
     A                                  3  2'Denne plukklisten har flere enn 99-
     A                                       linjer.'
     A                                      COLOR(RED)
     A                                  4  2'Max tillatet linjer på en fortolli-
     A                                      ng er 99 linjer.'
     A                                      COLOR(RED)
     A                                  6  2'Vennligst sammenslå like artikkel.'
     A                                      COLOR(YLW)
     A                                  8  2'PLL referanse:'
     A            LHPAK         17A  O  8 17DSPATR(UL)
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
