     A          R DKEAR
     A            DKEA_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            DKEA_SYOP      7S 0       COLHDG('SYSPED opdnr s.b.')
     A            DKEA_14A      18          COLHDG('Klarerer, EORI')
     A            DKEA_14B       1          COLHDG('Klarerer, reprst')
     A            DKEA_14C      35          COLHDG('Klarerer, navn')
     A            DKEA_14D      35          COLHDG('Klarerer, adr-1')
     A            DKEA_14E       9          COLHDG('Klarerer, postnr')
     A            DKEA_14F      35          COLHDG('Klarerer, sted')
     A            DKEA_0035      1          COLHDG('Testindikator')
      *                                             1=Test  blank=Produktion
     A          K DKEA_SYAV
