     A          R DKEHHR
     A            DKEHH_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            DKEHH_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            DKEHH_DTH     12          COLHDG('Datum før hændelse')
     A            DKEHH_TMH      6          COLHDG('Tid før hændelse')
     A            DKEHH_SR       1          COLHDG('Send/Receive')
     A            DKEHH_TXH     35          COLHDG('Text, huvud')
     A            DKEHH_TX1     70          COLHDG('Text, detalj-1')
     A            DKEHH_TX2     70          COLHDG('Text, detalj-2')
     A            DKEHH_TX3     70          COLHDG('Text, detalj-3')
     A            DKEHH_TX4     70          COLHDG('Text, detalj-4')
     A            DKEHH_TX5     70          COLHDG('Text, detalj-5')
     A          K DKEHH_SYA
     A          K DKEHH_SYO
