     A*%%TS  SD  20140331  130801  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      REF(*LIBL/DKTKD)
     A                                      PRINT
     A                                      CF03(03 'Gå ut')
     A                                      CF12(12 'Forrige')
     A          R DKG210DA
     A*%%TS  SD  20140331  130801  CB          REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A                                  1  2'TOLD'
     A                                      COLOR(BLU)
     A                                  1 58'Underhold af koder'
     A                                      COLOR(WHT)
     A                                  1126'DKG210D'
     A                                  3  2'Vælg og tryk Enter.'
     A                                      COLOR(BLU)
     A                                  3 25'Kodetype . . . . . . . . . . . . :'
     A            WDKKD_TYP      3A  B  3 62
     A  31                                  DSPATR(PC)
     A  31                                  COLOR(RED)
     A                                      RANGE('001' '999')
     A                                  4  2'IMPORT:'
     A                                  4 49'EKSPORT:'
     A                                  4 91'EKSPORT:'
     A                                  5  2'001=Angivelsesarter'
     A                                  5 49'101=Svartekstkoder'
     A                                  5 91'121=Procedurekoder ECS-YM'
     A                                  6  2'002=Angivelsesmedier'
     A                                  6 49'102=Angivelsesart'
     A                                  6 91'122=Erklæringskoder'
     A                                  7  2'003=Beregningsarter, præferencekod-
     A                                      er'
     A                                  7 49'103=Ekspeditionssted'
     A                                  7 91'123=T-status'
     A                                  8  2'004=Beregningslinier, arter'
     A                                  8 49'104=Angivelsestype R1.1'
     A                                  8 91'124=Alternativ mængde'
     A                                  9  2'005=Certifikatkoder R44.2'
     A                                  9 49'105=Bestemmelsesland'
     A                                  9 91'125=Lokationskoder i eEksport'
     A                                 10  2'006=Ekspeditionssted RA.2'
     A                                 10 49'106=Leveringsbetingelser'
     A                                 10 91'126=Angivelsestype R1.2'
     A                                 11  2'007=Emballagekoder R31.4'
     A                                 11 49'107=Valutakoder'
     A                                 12  2'008=Landekoder R15, R34'
     A                                 12 49'108=Transportmåde'
     A                                 13  2'009=Oplysningstypekoder R44.9'
     A                                 13 49'109=Bet.måte transportutgifter'
     A                                 14  2'010=Procedurekoder og bevillingsko-
     A                                      der'
     A                                 14 49'110=Emballagekoder'
     A                                 15  2'011=Procedurekoder R37'
     A                                 15 49'111=Indikator R.S32'
     A                                 16  2'012=Præferencedokumentationskoder -
     A                                      R44.4'
     A                                 16 49'112=Procedurekoder R37'
     A                                 17  2'013=Præferencekoder R36'
     A                                 17 49'113=Certifikattyper'
     A                                 18  2'014=Præferencekoder, toldordninger-
     A                                      , noter'
     A                                 18 49'114=VAB-kode R44.3'
     A                                 19  2'015=Statuskoder, toldordninger, no-
     A                                      ter'
     A                                 19 49'115=FN-kode R44.4'
     A                                 20  2'016=Svartekstkoder'
     A                                 20 49'116=Transportdokumenter R44.5.1'
     A                                 21  2'017=Transportdokumentkoder R40'
     A                                 21 49'117=Udgangstoldsted'
     A                                 22  2'018=Transportkoder R25, R26'
     A                                 22 49'118=Summarisk angivelse'
     A                                 23  2'019=VAB, certifikatkoder R44.3, R4-
     A                                      4.2'
     A                                 23 49'119=Eksportartkoder'
     A                                 24  2'020=Valutakoder R22'
     A                                 24 49'120=Procedurekoder'
     A                                 26 49'F3=Afslut'
     A                                      COLOR(BLU)
     A                                 25  2'021=Suppl_vare_opl_kod R44.6a'
     A                                 26  2'022=Suppl_enheder.koder R41.1'
     A                                 11 91'127=Statuskoder CUSRES'
     A          R DKG210DB                  SFL
     A*%%TS  SD  20131029  092138  CB          REL-V7R1M0  5770-WDS
     A            ZOP            1A  I  9  3
     A  41                                  DSPATR(ND)
     A                                      DSPATR(PC)
     A                                      VALUES(' ' '1' '2' '3' '4' '5')
     A            DKKD_KD   R        O  9  6
     A            DKKD_KD2  R        O  9 27
     A            DKKD_KD3  R        O  9 37
     A            ZDKKD_TXT     90A  O  9 43
     A          R DKG210DC                  SFLCTL(DKG210DB)
     A*%%TS  SD  20131029  092138  CB          REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A  91N93N94                            ROLLUP(25 'Rollup')
     A  91N93N94                            ROLLDOWN(26 'Rolldown')
     A                                      CF05(05 'Refresh')
     A                                      CF06(06 'Create')
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                  1  2'TOLD   '
     A                                      COLOR(BLU)
     A                                  1 57'Underhold af koder'
     A                                      COLOR(WHT)
     A                                  1126'DKG210D'
     A            ZRECNO         4S 0O  2  3SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  3  2'Kodetype:'
     A            WDKKD_TYP      3A  O  3 12
     A            WTYPTXT       50A  O  3 16
     A                                  3 69'Start fra kode:'
     A            XDKKD_KD      20A  I  3 85DFT('*ALL')
     A                                  4 69'Start fra alfa:'
     A            XDKKD_TXT     10A  I  4 85DFT('*ALL')
     A                                      CHECK(LC)
     A                                  5  2'Vælg og tryk Enter.'
     A                                      COLOR(BLU)
     A                                  6  4'1=Vælg   2=Ændre   3=Kopier   4=Sl-
     A                                      ette   5=Vise'
     A                                      COLOR(BLU)
     A                                  8  2'Alt'
     A                                      COLOR(WHT)
     A                                  8  6'Kode'
     A                                      COLOR(WHT)
     A                                  8 27'Kode2'
     A                                      COLOR(WHT)
     A                                  8 37'Kode3'
     A                                      COLOR(WHT)
     A                                  8 43'Tekst'
     A                                      COLOR(WHT)
     A          R DKG210DD
     A*%%TS  SD  20131025  094527  CB          REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A                                 25  2'F3=Afslut'
     A                                      COLOR(BLU)
     A                                 25 15'F5=Genopfrisk'
     A                                      COLOR(BLU)
     A                                 25 31'F6=Oprette ny'
     A                                      COLOR(BLU)
     A                                 25 47'F12=Annuler'
     A                                      COLOR(BLU)
     A          R DKG210DE
     A*%%TS  SD  20131025  125018  CB          REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A                                  1  2'TOLD   '
     A                                      COLOR(BLU)
     A                                  1 57'Underhold af koder'
     A                                      COLOR(WHT)
     A                                  1126'DKG210D'
     A                                  3  2'Kodetype:'
     A            WDKKD_TYP      3A  O  3 12
     A            WTYPTXT       50A  O  3 16
     A                                  5  2'Vælg og tryk Enter.'
     A                                      COLOR(BLU)
     A                                  7  2'Kode . . . . . . . . . . . . . . :'
     A            ÅDKKD_KD      20A  B  7 39
     A  31                                  COLOR(RED)
     A  61                                  DSPATR(PR)
     A                                  8  4'Kode 2 . . . . . . . . . . . . :'
     A            ÅDKKD_KD2      9A  B  8 39CHECK(LC)
     A  62                                  DSPATR(PR)
     A                                  9  6'Kode 3 . . . . . . . . . . . :'
     A            ÅDKKD_KD3      5A  B  9 39CHECK(LC)
     A  62                                  DSPATR(PR)
     A                                 11  4'Tekst  . . . . . . . . . . . . :'
     A            ÅDKKD_TXT    256A  B 12  4CHECK(LC)
     A  62                                  DSPATR(PR)
     A                                 25  2'F3=Afslut'
     A                                      COLOR(BLU)
     A                                 25 14'F12=Annuler'
     A                                      COLOR(BLU)
     A          R DKG210DØ
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79A  O 26  2MSGID(&ZMSGNO SYMSGF)
     A N30                                  COLOR(WHT)
     A  30                                  COLOR(RED)
