      * 105/103 80 LPT9
     A                                      REF(DKIH)
      *________
      * Heading
      *""""""""
     A          R DKI046PA
     A                                  4 12'Intern Ref:'
     A            DKIH_SYAV R           4 24EDTCDE(Z)
     A                                  4 28'/'
     A            DKIH_SYOP R           4 29EDTCDE(Z)
     A                                  4 36'/'
     A            DKIH_SYSG R           4 37
     A                                  4 48'R7.Reference:'
     A            DKIH_07   R           4 62
     A            DKIH_02B  R           9 13
     A            DKIH_02C  R          10 13
     A            DKIH_02D  R          11 13
     A            DKIH_02E  R          11 20
     A            DKIH_02F  R          12 13
     A            DKIH_08B  R          18 13
     A            DKIH_08C  R          19 13
     A            DKIH_08D  R          20 13
     A            DKIH_08E  R          20 20
     A            DKIH_08F  R          21 13
     A            DKIA_14C      35     27 13
     A            DKIA_14D      35     28 13
     A            DKIA_14E       9     29 13
     A            DKIA_14F      35     29 20
     A                                 33 48'RAD33 POS48'
     A                                 33 48'RAD33 POS48'
     A            DKIH_T04A R          36 48
     A            DKIH_T04B R          36 65
     A            DKIH_T05A R          39 48
     A            DKIH_T05B R          39 65
     A            DKIH_T06A R          42 13
     A            DKIH_T06B R          42 33
     A            W07AJ          1     45 73
     A            W07AN          1     45 78
     A            W07BJ          1     48 73
     A            W07BN          1     48 78
     A            W07CJ          1     52 73
     A            W07CN          1     52 78
     A            DKIH_T07D R          55 13
     A            W08AJ          1     68 73
     A            W08AN          1     68 78
     A            W08BJ          1     71 73
     A            W08BN          1     71 78
     A            DKIH_T08C R          77 13
     A            W09AJ          1     81 73
     A            W09AN          1     81 78
     A            W09BJ          1     85 73
     A            W09BN          1     85 78
     A            W10A           2S 0  92 59EDTCDE(Z)
     A            W10B1         25     95 59
     A            DKIH_SYDT R          98 59
     A            WT10B3        25    101 59
