     A                                      REF(DKIH)
      *________
      * Heading
      *""""""""
     A          R DKI006PA
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
     A            DKIH_A    R           8 85
     A            DKIH_02B  R          11 18
     A            DKIH_R011 R          11 67
     A            DKIH_R012 R          11 72
     A            WKIH_AART      4     11 75
     A                                 11 84'Intern ref:'
     A            DKIH_02C  R          12 18
     A            DKIH_SYAV R          12 84EDTCDE(Z)
     A                                 12 88'/'
     A            DKIH_SYOP R          12 89EDTCDE(Z)
     A                                 12 96'/'
     A            DKIH_SYSG R          12 97
     A            WKIH_02D      35     13 18
     A            DKIH_02F  R          14 18
     A            WKIH_XREF     15     14 84
     A            WRUBR5         4  0  17 69EDTCDE(Z)
     A            DKIH_06   R          17 74EDTCDE(Z)
     A            DKIH_07   R          17 87
     A            DKIH_08A  R          19 44
     A            DKIH_08B  R          20 18
     A            DKIH_08C  R          21 18
     A            WKIH_08D      35     22 18
     A            DKIH_12   R          25 79EDTCDE(K)
     A                                 27 31'('
     A            DKIH_14B  R          27 32
     A                                 27 33')'
     A            DKIH_14A  R          27 45
     A            WKIH_14C      35     28 18
     A            DKIH_15   R          28 94
     A            WKIH_14D      35     29 18
     A            WKIH_14E      35     30 18
     A            DKIH_181  R          34 18
     A            DKIH_211  R          37 62
     A            DKIH_221  R          37 67
     A            DKIH_222  R          37 70EDTCDE(K)
     A            DKIH_221B R          37 94EDTCDE(K)
     A            DKIH_25   R          40 18
     A            DKIH_26   R          40 30
     A            DKIH_28B  R          40 67
     A            WKIH_30       26     43 44
     A            WRUBR31A      54     46 18
     A            WRUBR33A       8     46 80
     A            WRUBR33B       2     46 92
     A            WRUBR33C       4     46 97
     A            WRUBR33D       4     46105
     A            WRUBR33E       4     46107
     A            WRUBR31B      54     47 18
     A            WRUBR31C      54     48 18
     A            WRUBR31D      54     49 18
     A            WRUBR34        2     49 81
     A            WRUBR35        9  0  49 97EDTCDE(Z)
     A            WRUBR36        3     49110
     A            WRUBR31E      54     50 18
     A            WRUBR37A       4     52 80
     A            WRUBR37B       3     52 86
     A            WRUBR38        9  0  52 97EDTCDE(Z)
     A            WRUBR39        6     52107
     A            WRUBR31F      54     53 18
     A            WRUBR31G      54     54 18
     A            WRUBR40       25     55 80
     A            WRUBR31H      54     56 18
     A            WRUBR44A      54     58 18
     A            WRUBR41        9  0  58 75EDTCDE(Z)
     A            WRUBR42        9  0  58 97EDTCDE(K)
     A            WRUBR44B      54     59 18
     A            WRUBR44C      54     60 18
     A            WRUBR44D      54     61 18
     A            WRUBR44E      54     62 18
     A            WRUBR44F      54     63 18
     A            WRUBR46       11  0  64 95EDTCDE(K)
     A            WRUBR47A1      3     67 16
     A            WRUBR47B1     11  0  67 16EDTCDE(4)
     A            WRUBR47C1      9  2  67 34EDTCDE(4)
     A            WRUBR47D1      7  0  67 47EDTCDE(Z)
     A            DKIH_49   R          67 94
     A            WRUBR47A2      3     68 16
     A            WRUBR47B2     11  0  68 16EDTCDE(4)
     A            WRUBR47C2      9  2  68 34EDTCDE(4)
     A            WRUBR47D2      7  0  68 47EDTCDE(Z)
     A            WRUBR47A3      3     69 16
     A            WRUBR47B3     11  0  69 16EDTCDE(4)
     A            WRUBR47C3      9  2  69 34EDTCDE(4)
     A            WRUBR47D3      7  0  69 47EDTCDE(Z)
     A            WRUBR47A4      3     70 16
     A            WRUBR47B4     11  0  70 16EDTCDE(4)
     A            WRUBR47C4      9  2  70 34EDTCDE(4)
     A            WRUBR47D4      7  0  70 47EDTCDE(Z)
     A            WRUBR47A5      3     71 16
     A            WRUBR47B5     11  0  71 16EDTCDE(4)
     A            WRUBR47C5      9  2  71 34EDTCDE(4)
     A            WRUBR47D5      7  0  71 47EDTCDE(Z)
     A            WRUBR47A6      3     72 16
     A            WRUBR47B6     11  0  72 16EDTCDE(4)
     A            WRUBR47C6      9  2  72 34EDTCDE(4)
     A            WRUBR47D6      7  0  72 47EDTCDE(Z)
     A            WRUBR47A7      3     72 16
     A            WRUBR47B7     11  0  73 16EDTCDE(4)
     A            WRUBR47C7      9  2  73 34EDTCDE(4)
     A            WRUBR47D7      7  0  73 47EDTCDE(Z)
     A            WRUBR47A8      3     74 16
     A            WRUBR47B8     11  0  74 16EDTCDE(4)
     A            WRUBR47C8      9  2  74 34EDTCDE(4)
     A            WRUBR47D8      7  2  74 47EDTCDE(Z)
     A            WRUBR47S       7  0  79 34EDTCDE(Z)
     A            WKIH_54A      25     96 81
     A            DKIH_SYDT R          96104
     A            WKIH_54C      25     99 81
