     A          R DKIFR
     A            DKIF_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            DKIF_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            DKIF_FATY      4          COLHDG('Fakturatyp')
     A            DKIF_FATX     17          COLHDG('Fakturanummer')
     A            DKIF_VAKD      3          COLHDG('Valutaslag, kod')
     A            DKIF_VAKU      7S 4       COLHDG('Valutaslag, kurs')
     A            DKIF_FABL     11S 3       COLHDG('Fakturabelopp')
     A          K DKIF_SYAV
     A          K DKIF_SYOP
     A          K DKIF_FATX
