     A          R DKIHHR
     A            DKIHH_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            DKIHH_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            DKIHH_DTH     12          COLHDG('Datum før hændelse')
     A            DKIHH_TMH      6          COLHDG('Tid før hændelse')
     A            DKIHH_SR       1          COLHDG('Send/Receive')
     A            DKIHH_TXH     35          COLHDG('Text, huvud')
     A            DKIHH_TX1     70          COLHDG('Text, detalj-1')
     A            DKIHH_TX2     70          COLHDG('Text, detalj-2')
     A            DKIHH_TX3     70          COLHDG('Text, detalj-3')
     A            DKIHH_TX4     70          COLHDG('Text, detalj-4')
     A            DKIHH_TX5     70          COLHDG('Text, detalj-5')
     A          K DKIHH_SYA
     A          K DKIHH_SYO
