     A          R DKIVR
     A            DKIV_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            DKIV_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            DKIV_SYLI      2S 0       COLHDG('SYSPED Linjenr')
     A            DKIV_311A     16          COLHDG('Kollimærke')
     A            DKIV_311B     16          COLHDG('Kollimærke')
     A            DKIV_311C     16          COLHDG('Kollimærke')
     A            DKIV_311D     16          COLHDG('Kollimærke')
     A            DKIV_311E     16          COLHDG('Kollimærke')
     A            DKIV_312A     11          COLHDG('Containernr')
     A            DKIV_312B     11          COLHDG('Containernr')
     A            DKIV_312C     11          COLHDG('Containernr')
     A            DKIV_312D     11          COLHDG('Containernr')
     A            DKIV_312E     11          COLHDG('Containernr')
     A            DKIV_313A      6S 0       COLHDG('Kolliantal')
     A            DKIV_313B      6S 0       COLHDG('Kolliantal')
     A            DKIV_313C      6S 0       COLHDG('Kolliantal')
     A            DKIV_313D      6S 0       COLHDG('Kolliantal')
     A            DKIV_313E      6S 0       COLHDG('Kolliantal')
     A            DKIV_314A      2          COLHDG('Kolliart')
     A            DKIV_314B      2          COLHDG('Kolliart')
     A            DKIV_314C      2          COLHDG('Kolliart')
     A            DKIV_314D      2          COLHDG('Kolliart')
     A            DKIV_314E      2          COLHDG('Kolliart')
     A            DKIV_315A     45          COLHDG('Varebeskrivelse')
     A            DKIV_315B     45          COLHDG('Varebeskrivelse')
     A            DKIV_315C     45          COLHDG('Varebeskrivelse')
     A            DKIV_315D     45          COLHDG('Varebeskrivelse')
     A            DKIV_315E     45          COLHDG('Varebeskrivelse')
     A            DKIV_32        2S 0       COLHDG('Varepost nr.')
     A            DKIV_331      10          COLHDG('Varekode')
     A            DKIV_332       4          COLHDG('Tillægskode 1')
     A            DKIV_333       4          COLHDG('Tillægskode 2')
     A            DKIV_SIKK      2          COLHDG('Sikkerhedsstillesle')
     A            DKIV_34        2          COLHDG('Oprindelsesland')
     A            DKIV_35       12S 3       COLHDG('Bruttovægt')
     A            DKIV_36        3          COLHDG('Præference')
     A            DKIV_37        7          COLHDG('Procedure')
     A            DKIV_38        9S 0       COLHDG('Nettovægt')
     A            DKIV_39        6          COLHDG('Kontingenter')
     A            DKIV_S27       6          COLHDG('FN Farlig gods')
     A            DKIV_401A      1          COLHDG('Sum.ang.kat')
     A            DKIV_401B      1          COLHDG('Sum.ang.kat')
     A            DKIV_401C      1          COLHDG('Sum.ang.kat')
     A            DKIV_401D      1          COLHDG('Sum.ang.kat')
     A            DKIV_401E      1          COLHDG('Sum.ang.kat')
     A            DKIV_401F      1          COLHDG('Sum.ang.kat')
     A            DKIV_401G      1          COLHDG('Sum.ang.kat')
     A            DKIV_401H      1          COLHDG('Sum.ang.kat')
     A            DKIV_401I      1          COLHDG('Sum.ang.kat')
     A            DKIV_401J      1          COLHDG('Sum.ang.kat')
     A            DKIV_401K      1          COLHDG('Sum.ang.kat')
     A            DKIV_401L      1          COLHDG('Sum.ang.kat')
     A            DKIV_401M      1          COLHDG('Sum.ang.kat')
     A            DKIV_401N      1          COLHDG('Sum.ang.kat')
     A            DKIV_401O      1          COLHDG('Sum.ang.kat')
     A            DKIV_401P      1          COLHDG('Sum.ang.kat')
     A            DKIV_401Q      1          COLHDG('Sum.ang.kat')
     A            DKIV_401R      1          COLHDG('Sum.ang.kat')
     A            DKIV_401S      1          COLHDG('Sum.ang.kat')
     A            DKIV_401T      1          COLHDG('Sum.ang.kat')
     A            DKIV_401U      1          COLHDG('Sum.ang.kat')
     A            DKIV_401V      1          COLHDG('Sum.ang.kat')
     A            DKIV_401W      1          COLHDG('Sum.ang.kat')
     A            DKIV_401X      1          COLHDG('Sum.ang.kat')
     A            DKIV_401Y      1          COLHDG('Sum.ang.kat')
     A            DKIV_402A      3          COLHDG('Sum.ang.art')
     A            DKIV_402B      3          COLHDG('Sum.ang.art')
     A            DKIV_402C      3          COLHDG('Sum.ang.art')
     A            DKIV_402D      3          COLHDG('Sum.ang.art')
     A            DKIV_402E      3          COLHDG('Sum.ang.art')
     A            DKIV_402F      3          COLHDG('Sum.ang.art')
     A            DKIV_402G      3          COLHDG('Sum.ang.art')
     A            DKIV_402H      3          COLHDG('Sum.ang.art')
     A            DKIV_402I      3          COLHDG('Sum.ang.art')
     A            DKIV_402J      3          COLHDG('Sum.ang.art')
     A            DKIV_402K      3          COLHDG('Sum.ang.art')
     A            DKIV_402L      3          COLHDG('Sum.ang.art')
     A            DKIV_402M      3          COLHDG('Sum.ang.art')
     A            DKIV_402N      3          COLHDG('Sum.ang.art')
     A            DKIV_402O      3          COLHDG('Sum.ang.art')
     A            DKIV_402P      3          COLHDG('Sum.ang.art')
     A            DKIV_402Q      3          COLHDG('Sum.ang.art')
     A            DKIV_402R      3          COLHDG('Sum.ang.art')
     A            DKIV_402S      3          COLHDG('Sum.ang.art')
     A            DKIV_402T      3          COLHDG('Sum.ang.art')
     A            DKIV_402U      3          COLHDG('Sum.ang.art')
     A            DKIV_402V      3          COLHDG('Sum.ang.art')
     A            DKIV_402W      3          COLHDG('Sum.ang.art')
     A            DKIV_402X      3          COLHDG('Sum.ang.art')
     A            DKIV_402Y      3          COLHDG('Sum.ang.art')
     A            DKIV_403A     20          COLHDG('Sum.ang.ID')
     A            DKIV_403B     20          COLHDG('Sum.ang.ID')
     A            DKIV_403C     20          COLHDG('Sum.ang.ID')
     A            DKIV_403D     20          COLHDG('Sum.ang.ID')
     A            DKIV_403E     20          COLHDG('Sum.ang.ID')
     A            DKIV_403F     20          COLHDG('Sum.ang.ID')
     A            DKIV_403G     20          COLHDG('Sum.ang.ID')
     A            DKIV_403H     20          COLHDG('Sum.ang.ID')
     A            DKIV_403I     20          COLHDG('Sum.ang.ID')
     A            DKIV_403J     20          COLHDG('Sum.ang.ID')
     A            DKIV_403K     20          COLHDG('Sum.ang.ID')
     A            DKIV_403L     20          COLHDG('Sum.ang.ID')
     A            DKIV_403M     20          COLHDG('Sum.ang.ID')
     A            DKIV_403N     20          COLHDG('Sum.ang.ID')
     A            DKIV_403O     20          COLHDG('Sum.ang.ID')
     A            DKIV_403P     20          COLHDG('Sum.ang.ID')
     A            DKIV_403Q     20          COLHDG('Sum.ang.ID')
     A            DKIV_403R     20          COLHDG('Sum.ang.ID')
     A            DKIV_403S     20          COLHDG('Sum.ang.ID')
     A            DKIV_403T     20          COLHDG('Sum.ang.ID')
     A            DKIV_403U     20          COLHDG('Sum.ang.ID')
     A            DKIV_403V     20          COLHDG('Sum.ang.ID')
     A            DKIV_403W     20          COLHDG('Sum.ang.ID')
     A            DKIV_403X     20          COLHDG('Sum.ang.ID')
     A            DKIV_403Y     20          COLHDG('Sum.ang.ID')
     A            DKIV_411       3          COLHDG('Suppl.enheder.kode')
     A            DKIV_412       9S 0       COLHDG('Suppl.enheder.verdi')
     A            DKIV_42       15S 0       COLHDG('Varens pris')
     A            DKIV_441      13          COLHDG('Bevillingsnr')
     A            DKIV_4421      4          COLHDG('Certifikatkode')
     A            DKIV_4422      4          COLHDG('Certifikatkode')
     A            DKIV_4423      4          COLHDG('Certifikatkode')
     A            DKIV_4424      4          COLHDG('Certifikatkode')
     A            DKIV_4425      4          COLHDG('Certifikatkode')
     A            DKIV_4426      4          COLHDG('Certifikatkode')
     A            DKIV_4427      4          COLHDG('Certifikatkode')
     A            DKIV_4428      4          COLHDG('Certifikatkode')
     A            DKIV_4429      4          COLHDG('Certifikatkode')
     A            DKIV_442A     35          COLHDG('Certifikatnr')
     A            DKIV_442B     35          COLHDG('Certifikatnr')
     A            DKIV_442C     35          COLHDG('Certifikatnr')
     A            DKIV_442D     35          COLHDG('Certifikatnr')
     A            DKIV_442E     35          COLHDG('Certifikatnr')
     A            DKIV_442F     35          COLHDG('Certifikatnr')
     A            DKIV_442G     35          COLHDG('Certifikatnr')
     A            DKIV_442H     35          COLHDG('Certifikatnr')
     A            DKIV_442I     35          COLHDG('Certifikatnr')
     A            DKIV_443       4          COLHDG('VAB bestemmelse')
     A            DKIV_444A     20          COLHDG('Præferencedok.nr')
     A            DKIV_444B      4          COLHDG('Præferencedok.kode')
     A            DKIV_446KA     5          COLHDG('Suppl.vareopl.kode')
     A            DKIV_446KB     5          COLHDG('Suppl.vareopl.kode')
     A            DKIV_446KF     5          COLHDG('Suppl.vareopl.kode')
     A            DKIV_446KJ     5          COLHDG('Suppl.vareopl.kode')
     A            DKIV_446KN     5          COLHDG('Suppl.vareopl.kode')
     A            DKIV_446KR     5          COLHDG('Suppl.vareopl.kode')
      *
     A            DKIV_446TA   255          COLHDG('Suppl.vareopl.txt')
      *
     A            DKIV_446TB    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TC    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TD    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TE    35          COLHDG('Suppl.vareopl.txt')
      *
     A            DKIV_446TF    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TG    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TH    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TI    35          COLHDG('Suppl.vareopl.txt')
      *
     A            DKIV_446TJ    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TK    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TL    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TM    35          COLHDG('Suppl.vareopl.txt')
      *
     A            DKIV_446TN    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TO    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TP    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TQ    35          COLHDG('Suppl.vareopl.txt')
      *
     A            DKIV_446TR    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_446TS    35          COLHDG('Suppl.vareopl.txt')
     A            DKIV_449A     20          COLHDG('Oplysningstype kode')
     A            DKIV_449B     16          COLHDG('Oplysningstype værdi')
     A            DKIV_46       15S 0       COLHDG('Statistisk værdi')
      *----------------------Toldværdideklaration--------------------
     A            DKIV_T11B     15S 2       COLHDG('T.11b')
     A            DKIV_T12      15S 2       COLHDG('T.12')
     A            DKIV_T13A     15S 2       COLHDG('T.13a')
     A            DKIV_T13B     15S 2       COLHDG('T.13b')
     A            DKIV_T13C     15S 2       COLHDG('T.13c')
     A            DKIV_T14A     15S 2       COLHDG('T.14a')
     A            DKIV_T14B     15S 2       COLHDG('T.14b')
     A            DKIV_T14C     15S 2       COLHDG('T.14c')
     A            DKIV_T14D     15S 2       COLHDG('T.14d')
     A            DKIV_T15      15S 2       COLHDG('T.15')
     A            DKIV_T16      15S 2       COLHDG('T.16')
     A            DKIV_T17A     15S 2       COLHDG('T.17a')
     A            DKIV_T17B     15S 2       COLHDG('T.17b')
     A            DKIV_T17C     15S 2       COLHDG('T.17c')
     A            DKIV_T18      15S 2       COLHDG('T.18')
     A            DKIV_T19      15S 2       COLHDG('T.19')
     A            DKIV_T20      15S 2       COLHDG('T.20')
     A            DKIV_T21A     35          COLHDG('T.21a')
     A            DKIV_T21B     15S 2       COLHDG('T.21b')
     A            DKIV_T22      15S 2       COLHDG('T.22')
     A            DKIV_T23      15S 2       COLHDG('T.23')
     A            DKIV_T24      15S 2       COLHDG('T.24')
     A            DKIV_T25A     35          COLHDG('T.25a')
     A            DKIV_T25B     15S 2       COLHDG('T.25b')
     A            DKIV_T25C      3          COLHDG('T.25c')
     A            DKIV_T25D      7S 4       COLHDG('T.25d')
      *----------------------Intern/extern ref-----------------------
     A            DKIV_28A       4          COLHDG('Intern fakturatyp')
     A            DKIV_28B      17          COLHDG('Intern fakturanummer')
     A            DKIV_28C       8S 0       COLHDG('Intern fakturadato')
     A            DKIV_X01       5A         COLHDG('Ekstern system')
     A            DKIV_X02      35A         COLHDG('Ekstern ref1')
     A            DKIV_X03      35A         COLHDG('Ekstern ref2')
     A            DKIV_X04       9S 0       COLHDG('Ekstern linjenr')
     A            DKIV_X05       5S 0       COLHDG('Ekstern Ulinjenr')
     A            DKIV_X06       3A         COLHDG('Ekstern valutakod')
     A            DKIV_X07      11S 2       COLHDG('Ekstern valutabeløb')
      *-----------------------------Key------------------------------
     A          K DKIV_SYAV
     A          K DKIV_SYOP
     A          K DKIV_SYLI
