     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, GODSNR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKNHR                     PFILE(DKNH)
     A          K TIGN
