     A*_______________________________________________
     A* SYSPED / TET-IMPORT, VARELINJE LOSSETILLATELSE
     A*"""""""""""""""""""""""""""""""""""""""""""""""
     A          R DKNLR                     PFILE(DKNL)
     A          K TVAVD
     A          K TVTDN
     A          K TVLI
     A          S TV01                      VALUES('N')
