      *_____________________________________
      * SYSPED / Tolldekl. TRANSIT Varelinjer
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R DKNVR
     A            TV01           1          COLHDG('IKKE I BRUK')
     A            TVAVD     R               REFFLD(AVD)
     A            TVTDN          7S 0       COLHDG('OPPDRAGSNR')
     A            TVLI      R               REFFLD(LI5)
      * HENDELSE UNDERVEI
     A            TVST          35          COLHDG('STED FOR HENDELSE')
     A            TVSTSK         2A         COLHDG('SPRÅKKODE')
     A            TVSTLK         2A         COLHDG('LANDKODE')
      * KONTROLL
     A            TVCTL          1S 0       COLHDG('ALLEREDE I TET')
      * HENDELSE
     A            TVFLG          1S 0       COLHDG('HENDELSE FLAGG')
     A            TVINF1        70A         COLHDG('INFORMASJON 1')
     A            TVINF2        70A         COLHDG('INFORMASJON 2')
     A            TVINF3        70A         COLHDG('INFORMASJON 3')
     A            TVINF4        70A         COLHDG('INFORMASJON 4')
     A            TVINSK         2A         COLHDG('SPRÅKKODE FOR INFOR.')
     A            TVGDT          8S 0       COLHDG('GODKJENNINGSDATO')
     A            TVGM          35A         COLHDG('GODKJ.MYNDIHET')
     A            TVGMSK         2A         COLHDG('SPRÅKKODE GODKJ.MYN.')
     A            TVGMST        35A         COLHDG('GODKJENNINGSSTED')
     A            TVGMSS         2A         COLHDG('SPRÅKKODE GODSKJ.ST.')
     A            TVGMLK         2A         COLHDG('GOKJENNIGSLAND')
      * NY FORSEGLINGS INFORMASJON
     A            TVDANT         3S 0       COLHDG('ANTALL FORSEGLING')
     A            TVDFKD        20A         COLHDG('FORSEGLING-ID KODE')
     A            TVDFSK         2A         COLHDG('FORSEGLING-ID SPRÅK')
      * OMLASTING
     A            TVTAID        27A         COLHDG('NY TR.MIDDEL-ID')
     A            TVTASK         2A         COLHDG('SPRÅK')
     A            TVTALK         2A         COLHDG('LANDKODE')
     A            TVGODT         8S 0       COLHDG('GODKJENNINGSDATO')
     A            TVOM          35A         COLHDG('GODKJ.MYNDIHET')
     A            TVOMSK         2A         COLHDG('SPRÅKKODE GODKJ.MYN.')
     A            TVOMST        35A         COLHDG('GODKJENNINGSSTED')
     A            TVOMSS         2A         COLHDG('SPRÅKKODE GODSKJ.ST.')
     A            TVOMLK         2A         COLHDG('GOKJENNIGSLAND')
      * NY CONTAINER
S01  A*           TVCNR         11A         COLHDG('31 CONTAINERNR')
N01  A            TVCNR         17A         COLHDG('31 CONTAINERNR')
      *
     A          K TVAVD
     A          K TVTDN
     A          K TVLI
