     A          R DKPOSTFR
     A            DKPFIR         2A         COLHDG('FIRMAKODE')
     A            DKPNNR        10S 0       COLHDG('NESTE NUMMER')
     A            DKPMNR        10S 0       COLHDG('MAX NUMMER')
     A            DKPNSN        10S 0       COLHDG('NESTE SERIENR')
     A            DKPNSM        10S 0       COLHDG('NESTE SERIENR MAX')
     A          K DKPFIR
