     A*%%TS  SD  20141029  100235  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      CF03(03 'Gå ut')
     A                                      CF12(12 'Forrige')
     A          R DKT058DA
     A*%%TS  SD  20141029  091250  CB          REL-V7R1M0  5770-WDS
     A                                      CF04(04)
     A                                      OVERLAY
     A                                  1  2'EDI'
     A                                      COLOR(BLU)
     A                                  1 24'SKAT  Underhold af sertifikater'
     A                                      COLOR(WHT)
     A                                  1 74'DKT058D'
     A                                  3  2'Vælg og tryk Enter.'
     A                                      COLOR(BLU)
     A                                  5  2'Kundenummer  . . . . . . . . . . :'
     A            WKSE_KNR       8Y 0B  5 39
     A  31                                  COLOR(RED)
     A                                  5 50'Nr, F4 for liste'
     A                                  6 50'0=Generell'
     A                                 22  3'F3=Afslut   F4=Søg'
     A                                      COLOR(BLU)
     A          R DKT058DB                  SFL
     A            ZOP            1A  I  9  3
     A  41                                  DSPATR(ND)
     A                                      DSPATR(PC)
     A                                      VALUES(' ' '4')
     A            DKSE_331      10   O  9  6
     A            DKSE_34        2   O  9 17
     A            DKSE_4421      4   O  9 20
     A            DKSE_442A     35   O  9 25
     A          R DKT058DC                  SFLCTL(DKT058DB)
     A*%%TS  SD  20141029  100235  CB          REL-V7R1M0  5770-WDS
     A  *DS3                                SFLSIZ(0011)
     A  *DS4                                SFLSIZ(0011)
     A  *DS3                                SFLPAG(0010)
     A  *DS4                                SFLPAG(0010)
     A  91N93N94                            ROLLUP(25 'Rollup')
     A  91N93N94                            ROLLDOWN(26 'Rolldown')
     A                                      CF05(05 'Refresh')
     A                                      CF06(06 'Create')
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                  1  2'EDI    '
     A                                      COLOR(BLU)
     A                                  1 24'SKAT  Underhold af sertifikater'
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  1 60SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1 74'DKT058D'
     A                                  3  2'Kundenummer:'
     A            WKSE_KNR       8S 0O  3 15
     A            WKNAVN        35A  O  3 24
     A                                  5  2'Vælg og tryk Enter.'
     A                                      COLOR(BLU)
     A                                  6  4'4=Slette'
     A                                      COLOR(BLU)
     A                                  7 20'______________ Certifikat ________-
     A                                      ______'
     A                                      COLOR(WHT)
     A                                  8  2'Alt'
     A                                      COLOR(WHT)
     A                                  8  6'Varekode'
     A                                      COLOR(WHT)
     A                                  8 17'LK'
     A                                      COLOR(WHT)
     A                                  8 20'Kode'
     A                                      COLOR(WHT)
     A                                  8 25'Nummer'
     A                                      COLOR(WHT)
     A*
     A          R DKT058DD
     A                                      OVERLAY
     A                                 22  2'F3=Afslut   F4=Søg   F6=Oprette ny-
     A                                         F12=Annuler'
     A                                      COLOR(BLU)
     A          R DKT058DE
     A                                      OVERLAY
     A            ZKSE_331      10   B 20  6
     A                                      DSPATR(PC)
     A  31                                  COLOR(RED)
     A            ZKSE_34        2   B 20 17
     A            ZKSE_4421      4   B 20 20
     A            ZKSE_442A     35   B 20 25
     A          R DKT058DF
     A                                 20  2' '
     A                                 21  2' '
     A          R DKT058DØ
     A*%%TS  SD  20141029  091250  CB          REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79A  O 23  2MSGID(&ZMSGNO SYMSGF)
     A N30                                  COLOR(WHT)
     A  30                                  COLOR(RED)
