     A          R DKTARDR
     A            DKTARD01      10A         COLHDG('Taric kode')
     A            DKTARD02       8A         COLHDG('Start dato')
     A            DKTARD03       8A         COLHDG('Slut dato')
      *
     A            DKTARD04       2A         COLHDG('Toldsatstype(1)')
     A            DKTARD05       7A         COLHDG('Toldsats(1)')
     A            DKTARD06       3A         COLHDG('Enhedsgrundlag(1)')
     A            DKTARD07       1A         COLHDG('Enhedstillæg(1)')
     A            DKTARD08       5A         COLHDG('Komponent(1)')
     A            DKTARD09       1A         COLHDG('EURO type(1)')
      *
     A            DKTARD10       2A         COLHDG('Toldsatstype(2)')
     A            DKTARD11       7A         COLHDG('Toldsats(2)')
     A            DKTARD12       3A         COLHDG('Enhedsgrundlag(2)')
     A            DKTARD13       1A         COLHDG('Enhedstillæg(2)')
     A            DKTARD14       5A         COLHDG('Komponent(2)')
     A            DKTARD15       1A         COLHDG('EURO type(2)')
      *
     A            DKTARD16       2A         COLHDG('Toldsatstype(3)')
     A            DKTARD17       7A         COLHDG('Toldsats(3)')
     A            DKTARD18       3A         COLHDG('Enhedsgrundlag(3)')
     A            DKTARD19       1A         COLHDG('Enhedstillæg(3)')
     A            DKTARD20       5A         COLHDG('Komponent(3)')
     A            DKTARD21       1A         COLHDG('EURO type(3)')
      *
     A            DKTARD22       2A         COLHDG('Toldsatstype(4)')
     A            DKTARD23       7A         COLHDG('Toldsats(4)')
     A            DKTARD24       3A         COLHDG('Enhedsgrundlag(4)')
     A            DKTARD25       1A         COLHDG('Enhedstillæg(4)')
     A            DKTARD26       5A         COLHDG('Komponent(4)')
     A            DKTARD27       1A         COLHDG('EURO type(4)')
      *
     A            DKTARD28       2A         COLHDG('Toldsatstype(5)')
     A            DKTARD29       7A         COLHDG('Toldsats(5)')
     A            DKTARD30       3A         COLHDG('Enhedsgrundlag(5)')
     A            DKTARD31       1A         COLHDG('Enhedstillæg(5)')
     A            DKTARD32       5A         COLHDG('Komponent(5)')
     A            DKTARD33       1A         COLHDG('EURO type(5)')
      *
     A            DKTARD34       1A         COLHDG('Bilag-1')
     A            DKTARD35       1A         COLHDG('Bilag-2')
     A            DKTARD36       1A         COLHDG('Bilag-3')
     A            DKTARD37       1A         COLHDG('Bilag-4')
      *
     A            DKTARD38       2A         COLHDG('Varebestemmelse(1)')
     A            DKTARD39       2A         COLHDG('Varebestemmelse(2)')
     A            DKTARD40       2A         COLHDG('Varebestemmelse(3)')
     A            DKTARD41       2A         COLHDG('Varebestemmelse(4)')
     A            DKTARD42       2A         COLHDG('Varebestemmelse(5)')
     A            DKTARD43       2A         COLHDG('Varebestemmelse(6)')
     A            DKTARD44       2A         COLHDG('Varebestemmelse(7)')
     A            DKTARD45       2A         COLHDG('Varebestemmelse(8)')
     A            DKTARD46       2A         COLHDG('Varebestemmelse(9)')
      *
     A            DKTARD47       3A         COLHDG('Supplerende mængde')
     A            DKTARD48     182A         COLHDG('Varekodetekst')
      *
     A          K DKTARD01
