     A          R DKTARAR
     A            DKTARA01       3A         COLHDG('Record type')
     A            DKTARA02      10A         COLHDG('Taric kode')
     A            DKTARA03       2A         COLHDG('Nomenclaturkode')
     A            DKTARA04       1A         COLHDG('Nationalitetskode')
     A            DKTARA05       6A         COLHDG('Start dato')
     A            DKTARA06       6A         COLHDG('Slut dato')
      *
     A            DKTARA07       5A         COLHDG('Note(1)')
     A            DKTARA08       5A         COLHDG('Note(2)')
     A            DKTARA09       5A         COLHDG('Note(3)')
     A            DKTARA10       5A         COLHDG('Note(4)')
     A            DKTARA11       5A         COLHDG('Note(5)')
     A            DKTARA12       5A         COLHDG('Note(6)')
      *
     A            DKTARA13       2A         COLHDG('Indrykningsstreger')
      *
     A            DKTARA14       2A         COLHDG('Toldsatstype(1)')
     A            DKTARA15       7A         COLHDG('Toldsats(1)')
     A            DKTARA16       3A         COLHDG('Enhedsgrundlag(1)')
     A            DKTARA17       1A         COLHDG('Enhedstillæg(1)')
     A            DKTARA18       5A         COLHDG('Komponent(1)')
     A            DKTARA19       1A         COLHDG('EURO type(1)')
      *
     A            DKTARA20       2A         COLHDG('Toldsatstype(2)')
     A            DKTARA21       7A         COLHDG('Toldsats(2)')
     A            DKTARA22       3A         COLHDG('Enhedsgrundlag(2)')
     A            DKTARA23       1A         COLHDG('Enhedstillæg(2)')
     A            DKTARA24       5A         COLHDG('Komponent(2)')
     A            DKTARA25       1A         COLHDG('EURO type(2)')
      *
     A            DKTARA26       2A         COLHDG('Toldsatstype(3)')
     A            DKTARA27       7A         COLHDG('Toldsats(3)')
     A            DKTARA28       3A         COLHDG('Enhedsgrundlag(3)')
     A            DKTARA29       1A         COLHDG('Enhedstillæg(3)')
     A            DKTARA30       5A         COLHDG('Komponent(3)')
     A            DKTARA31       1A         COLHDG('EURO type(3)')
      *
     A            DKTARA32       2A         COLHDG('Toldsatstype(4)')
     A            DKTARA33       7A         COLHDG('Toldsats(4)')
     A            DKTARA34       3A         COLHDG('Enhedsgrundlag(4)')
     A            DKTARA35       1A         COLHDG('Enhedstillæg(4)')
     A            DKTARA36       5A         COLHDG('Komponent(4)')
     A            DKTARA37       1A         COLHDG('EURO type(4)')
      *
     A            DKTARA38       2A         COLHDG('Toldsatstype(5)')
     A            DKTARA39       7A         COLHDG('Toldsats(5)')
     A            DKTARA40       3A         COLHDG('Enhedsgrundlag(5)')
     A            DKTARA41       1A         COLHDG('Enhedstillæg(5)')
     A            DKTARA42       5A         COLHDG('Komponent(5)')
     A            DKTARA43       1A         COLHDG('EURO type(5)')
      *
     A            DKTARA44       5A         COLHDG('Note(1)')
     A            DKTARA45       5A         COLHDG('Note(2)')
     A            DKTARA46       5A         COLHDG('Note(3)')
     A            DKTARA47       5A         COLHDG('Note(4)')
     A            DKTARA48       5A         COLHDG('Note(5)')
     A            DKTARA49       5A         COLHDG('Note(6)')
      *
     A            DKTARA50       1A         COLHDG('Bilag-1')
     A            DKTARA51       1A         COLHDG('Bilag-2')
     A            DKTARA52       1A         COLHDG('Bilag-3')
     A            DKTARA53       1A         COLHDG('Bilag-4')
      *
     A            DKTARA54       2A         COLHDG('Varebestemmelse(1)')
     A            DKTARA55       2A         COLHDG('Varebestemmelse(2)')
     A            DKTARA56       2A         COLHDG('Varebestemmelse(3)')
     A            DKTARA57       2A         COLHDG('Varebestemmelse(4)')
     A            DKTARA58       2A         COLHDG('Varebestemmelse(5)')
     A            DKTARA59       2A         COLHDG('Varebestemmelse(6)')
     A            DKTARA60       2A         COLHDG('Varebestemmelse(7)')
     A            DKTARA61       2A         COLHDG('Varebestemmelse(8)')
     A            DKTARA62       2A         COLHDG('Varebestemmelse(9)')
      *
     A            DKTARA63       3A         COLHDG('Supplerende mængde')
     A            DKTARA64     512A         COLHDG('Varekodetekst')
     A          K DKTARA02
