     A          R DKTHAR
     A            DKTH_SYSG      3          COLHDG('Sagsbehandler sign')
     A            DKTH_NAMN     35          COLHDG('Sagsbehandler namn')
     A            DKTH_USID     10          COLHDG('iSeries Userid')
     A          K DKTH_SYSG
