     A          R DKTSER                    PFILE(DKTSE)
     A          K DKSE_KNR
     A          K DKSE_331
     A          K DKSE_34
     A          K DKSE_4421
     A          K DKSE_442A
