     A          R DKTSER
     A            DKSE_KNR       8S 0       COLHDG('Kundenr, 0=Firma')
     A            DKSE_331      10          COLHDG('Varekode')
     A            DKSE_34        2          COLHDG('Oprindelsesland')
     A            DKSE_4421      4          COLHDG('Certifikatkode')
     A            DKSE_442A     35          COLHDG('Certifikatnr')
     A          K DKSE_KNR
     A          K DKSE_331
     A          K DKSE_34
