      *_________________________________
      * KOMBINERT FORHÅNDSVARSEL
      *"""""""""""""""""""""""""""""""""
     A          R DKX014FF1
     A            PFSFM1        75      1  2
     A          R DKX014FF2
     A            PFSFM2        75      1  2
     A                                  2 15'REF.'
     A            THAVD          4  0   2 22EDTCDE(Z)
     A                                  2 26'/'
     A            THTDN          7  0   2 27EDTCDE(Z)
     A                                  2 34'/'
     A            THSG           3      2 35
     A            THDK           5      2 79
     A            XHTRNR        18      2 90BARCODE(CODE128 3 *HRI *HRZ +
     A                                      (*WIDTH 0.008) (*RATIO 2) X'02')
     A            THTINS        17      3 40
     A            THNAS         30      4 15
     A            THSPOM         1      4 73
     A            THADS1        30      5 15
     A            THPNS          9      6 15
     A            THPSS         24      6 25
     A            XSIDET         3  0   6 74EDTCDE(Z)
     A            THSIK          1  0   6 81
     A            THLKS          2      7 15
     A            THVPOS         5  0   8 69EDTCDE(Z)
     A            THNTK          7  0   8 78EDTCDE(Z)
     A            THVKB         11  3   8 92EDTCDE(4)
     A            THTINK        17      9 40
     A            THNAK         30     10 15
     A            XHKREF        40     10 69
     A            THADK1        30     11 15
     A            THPNK          9     12 15
     A            THPSK         24     12 25
     A            THTSSD         8     12 69
     A            THTSLK         2     12 78
     A            THTSN1        35     12 81
     A            THLKK          2     13 15
     A            THTSPN         9     13 69
     A            THTSPS        24     13 79
     A            THTSN2        35     14 69
     A            THDTA          8  0  16 17EDTWRD('    .  .  ')
     A            THTMA          4  0  16 39EDTWRD('  :  ')
     A N41        XXALKT        17     16 69
     A  41                             16 69'-----'
     A N42        XXBLKT        17     16 97
     A  42                             16 97'-----'
     A            THTKBM         1     18 15
     A            THTAID        27     20 15
     A            THTALK         2     20 57
     A            THTGID        27     22 15
     A            THTGLK         2     22 57
     A            THTRM          2  0  24 15
     A            THLASD        17     26 15
     A            THLOSD        35     26 42
     A            THLAS2        17     27 15
     A            THLKR1         2     27 69
     A            THLKR2         2     27 73
     A            THLKR3         2     27 77
     A            THLKR4         2     27 81
     A            THLKR5         2     27 85
     A            THLKR6         2     27 89
     A            THLKR7         2     27 93
     A            THLKR8         2     27 97
     A            THTREF        35     29 15
     A            THTINKS       17     30 40
     A            THTINSS       17     30 94
     A            THNAKS        30     31 15
     A            THNASS        30     31 69
     A            THADKS1       30     32 15
     A            THADSS1       30     32 69
     A            THPNKS         9     33 15
     A            THPSKS        24     33 25
     A            THPNSS         9     33 69
     A            THPSSS        24     33 79
     A            THLKKS         2     34 15
     A            THLKSS         2     34 69
     A            THTINT        17     36 40
     A            XHDFKD1       20     36 69
     A            THNAT         30     37 15
     A            XHDFKD2       20     37 69
     A            THADT1        30     38 15
     A            XHDFKD3       20     38 72
     A            THPNT          9     39 15
     A            THPST         24     39 25
     A            XHDFKD4       20     39 72
     A            THLKT          2     40 15
     A            XHDFKD5       20     40 72
      *
     A          R DKX014FF3
     A            THTINA        17     53 40
     A            THNAA         30     54 15
     A                                 54 88'NO'
     A            XKTXTC        16     54 98
     A            THADA1        30     55 15
     A                                 55 88'------'
     A            THTRDT         8  0  55108EDTWRD('    .  .  ')
     A            THPNA          9     56 15
     A            THPSA         24     56 25
     A            XHCNA1        12     56 88
     A            XHCNR1         6     56108
     A            THLKA          2     57 15
     A            THDST         15     57 25
     A                                 57 52'FRITATT FOR UNDERSKRIFT'
     A            XHCNA2        10     57 88
     A            XHCNR2         6     57108
     A            XIDAG          8  0  58 53EDTWRD('    .  .  ')
      *
S01  A*         R DKX014FF4                 FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XKTXT1S       18     59 11
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XKTXT2S       18     59 29
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XKTXT3S       18     59 47
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XKTXT4S       18     59 65
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XKTXT5        25     59 83
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XKTXT6        25     59101
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XHTSD1         2     60 11
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XHTSD2         2     60 29
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XHTSD3         2     60 47
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XHTSD4         2     60 65
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XHTSD5         2     60 83
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
S01  A*           XHTSD6         2     60101
S01  A*                                     FNTCHRSET(C0H20060 +
S01  A*                                     T1V10277)
N01  A          R DKX014FF4                 FONT(755 (*POINTSIZE 4.8))
N01  A            XKTXT1        25     59 14
N01  A            XKTXT2        25     59 33
N01  A            XKTXT3        25     59 52
N01  A            XKTXT4        25     59 71
N01  A            XKTXT5        25     59 89
N01  A            XKTXT6        25     59107
N01  A            XHTSD1         2     60 14
N01  A            XHTSD2         2     60 33
N01  A            XHTSD3         2     60 52
N01  A            XHTSD4         2     60 71
N01  A            XHTSD5         2     60 89
N01  A            XHTSD6         2     60107
      *
     A          R DKX014FF5
     A N49        THGFT1        24     61 15
     A  49        THGFT2        35     61 15
     A            XHGBGI         2     61 75
     A            THGBGU         2     62 15
     A            XHGBGU        30     62 22
     A            THGKD          1  0  62 83
     A            XKTXTB2       25     62 87
     A            XXTSB          2     62116
     A N46                             62104'*'
     A            XHDKR         35     64 21
     A N47        THDANT         4  0  65 21EDTCDE(Z)
     A  47                             65 21'--'
     A N47        THDFKD        20     66 21
     A  47                             66 21'--'
     A            THDDT          8  0  67 21EDTWRD('    .  .  ')
     A N46                             67 39'OMDIRIGERING FORBUDT'
     A N48                             68 39'BINDENDE REISERUTE'
     A            PFSFM3        75     69  2
