      *____________________________________________________
      * MELDING OM TILDELING AV MRN-NR VED NORMAL PROSEDYRE
      *""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R DKX014R1
     A N50        PRPFM1        75      1  2
     A N50        PRPFM2        75      2  2
     A                                  4  2'TILDELING AV MRN-NR'
     A  28                              4 30'(IE28)'
     A N28                              4 30'(MANUELL)'
     A                                  4 55'UTSKRIFTDATO:'
     A            XIDAG          8  0   4 69EDTWRD('    .  .  ')
     A                                  5 55'         TID:'
     A            XTID           6  0   5 69EDTWRD('  .  .  ')
     A                                  8  2'OPPDRAGSNR    :'
     A            THAVD          4  0   8 18
     A                                  8 22'/'
     A            THTDN          7  0   8 23
     A                                  8 30'/'
     A            THSG           3A     8 31
     A                                 10  2'MRN-NUMMER    :'
     A            THTRNR        18A    10 18HIGHLIGHT
     A                                 12  2'DATO          :'
     A            THTRDT         8  0  12 18EDTWRD('    .  .  ')
     A                                      HIGHLIGHT
     A                                 14  2'AVG.TOLLSTED  :'
     A            THCATS         8A    14 18HIGHLIGHT
     A            XHCATS        35A    14 28HIGHLIGHT
     A                                 16  2'BEST.TOLLSTED :'
     A            THTSB          8A    16 18
     A            XHTSB         35A    16 28
     A                                 18  2'AVSENDER      :'
     A            THNAS         30A    18 18
     A            THTINS        17A    18 49
     A                                 20  2'MOTTAKER      :'
     A            THNAK         30A    20 18
     A            THTINK        17A    20 49
     A                                 22  2'HOVEDANSVARLIG:'
     A            THNAA         30A    22 18
     A            THTINA        17A    22 49
     A                                 24  2'BRUTTO VEKT   :'
     A            THVKB         11  3  24 18EDTCDE(4)
     A                                 26  2'ANTALL KOLLI  :'
     A            THNTK          7  0  26 18EDTCDE(Z)
     A                                 28  2'TRANSPORTMÅTE :'
     A            THTRM          2  0  28 18
     A                                 30  2'TR.MIDDELS ID :'
     A            THTAID        27A    30 18
     A            PRPFM3        75     68  2
