     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE01
     A                                      CA03(03 'Avslutt program')
     A                                      CA04(04 'Søking')
     A                                  1  2'SYSPED/DKX005R'
     A                                      COLOR(BLU)
     A                                  1 20'Konvertera platskoder'
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                  6  2'Landkod:       '
     A            WSLK           2A  B  6 20DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                 23  2'F3=Avsluta   F4=Søk'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R BILDE02
     A                                      CA12(12 'Avbryt')
     A                                  1  2'SYSPED/DKX005R'
     A                                      COLOR(BLU)
     A                                  1 20'Konvertera platskoder'
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                  6  2'Landkod: '
     A            WSLK           2A  O  6 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            KS2FTX        55A  O  6 23DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9  2'Tullkontornamn'
     A                                  9 60'X=Vælj'
     A            L43224C1      35A  O 11 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WS01           1A  B 11 60DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                      VALUES(' ' 'X')
     A            L43224C2      35A  O 13 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WS02           1A  B 13 60DSPATR(UL)
     A                                      VALUES(' ' 'X')
     A            T24052B       35A  O 15 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WS03           1A  B 15 60DSPATR(UL)
     A                                      VALUES(' ' 'X')
     A            T24052D       35A  O 17 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WS04           1A  B 17 60DSPATR(UL)
     A                                      VALUES(' ' 'X')
     A                                 23  2'F12=Avbryt'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
