     A          R DKX157P1
     A            PVFM1         75      1  2
     A            PVFM2         75      2  2
     A                                  3  2'LOSSETILLATELSE'
     A                                  3100'SIDE:'
     A                                  3107PAGNBR
     A                                  4  2'MRN-nr:'
     A            TITRNR        18      4 10
     A                                  4 40'TET godkjeningsdato:'
     A            TITRDT         8  0   4 61EDTWRD('    .  .  ')
     A                                  4 81'Vår ref.:'
     A            TIAVD          4  0   4 91
     A                                  4 95'/'
     A            TITDN          7  0   4 96
     A                                  4103'/'
     A            TISG           3      4104
     A                                  5  2'Godsnr:'
     A            TIGN          35      5 10
     A                                  5 50'Avg.tollsted:'
     A            TICATS         8      5 64
     A                                  5 74'Freml.tollsted:'
     A            TITSB          8      5 90
     A                                  6  2'Næringsliv:'
     A            TINA          30      6 14
     A            TIAD1         30      6 45
     A            TIPN           9      6 76
     A            TIPS          24      6 86
     A                                  7  2'Hovedans. :'
     A            TINAA         30      7 14
     A            TIADA1        30      7 45
     A            TIPNA          9      7 76
     A            TIPSA         24      7 86
     A                                  8  2'Avsender  :'
     A            TINAS         30      8 14
     A            TIADS1        30      8 45
     A            TIPNS          9      8 76
     A            TIPSS         24      8 86
     A                                  9  2'Mottaker  :'
     A            TINAK         30      9 14
     A            TIADK1        30      9 45
     A            TIPNK          9      9 76
     A            TIPSK         24      9 86
     A                                 10  2'Tr.middels-ID:'
     A            TITAID        27     10 17
     A                                 10 52'Container:'
     A            TIKDC          1     10 62
     A                                 11  2'Lasteliste:'
     A            TILSTL         4  0  11 14EDTCDE(3)
     A                                 11 22'Ant. varepost:'
     A            TIVPOS         5  0  11 37EDTCDE(3)
     A                                 11 44'Tot. kolli:'
     A            TINTK          7  0  11 56EDTCDE(3)
     A                                 11 65'Tot. br.vekt:'
     A            TIVKB         11  3  11 79EDTCDE(4)
     A                                 11 93'Status:'
     A            TIDK           5     11101
     A                                 11108'CTL:'
     A            TICTL          1     11113
      *
     A          R DKX157P21                 SPACEB(1)
     A N41                                 2'Forsegling:'
     A N41        TIDANT         4  0     14EDTCDE(Z)
     A            XDFKD1        20        20
     A            XDFKD2        20        41
     A            XDFKD3        20        62
     A            XDFKD4        20        83
      *
     A          R DKX157P22                 SPACEB(1)
     A            XDFK01        20        20
     A            XDFK02        20        41
     A            XDFK03        20        62
     A            XDFK04        20        83
      *
     A          R DKX157P3                  SPACEB(1)
     A                                     4'____________________________'
     A                                    32'____________________________'
     A                                    60'____________________________'
     A                                    88'____________________________'
     A                                      SPACEA(1)
     A                                     4'|Varepostnr.  |Merke og nummer  |'
     A                                    37'Antall og type |Containernr. |'
     A                                    67'Varebeskrivelse'
     A                                   115'|'
     A                                      SPACEA(1)
     A                                     4'|(32)         |(31.1)           |'
     A                                      UNDERLINE
     A                                    37'(31.2)         |(31.3)       |'
     A                                      UNDERLINE
     A                                    67'(31.4)                            '
     A                                      UNDERLINE
     A                                   101'              |'
     A                                      UNDERLINE
     A                                      SPACEA(1)
     A                                     4'|Status       |Varenummer       |'
     A                                    37'Følsomhetskode |Følsom mengde|'
     A                                    67'Summarisk deklarasjon/'
     A                                    89'Tidligere dokument'
     A                                   115'|'
     A                                      SPACEA(1)
     A                                     4'|(1/3)        |(33)             |'
     A                                      UNDERLINE
     A                                    37'(31.5)         |(31.6)       |'
     A                                      UNDERLINE
     A                                    67'(40)                              '
     A                                      UNDERLINE
     A                                   101'              |'
     A                                      UNDERLINE
     A                                      SPACEA(1)
     A                                     4'|Avsender-    |Bestemmelsesland |'
     A                                    37'    Bruttovekt |   Nettovekt |'
     A                                    67'Tilleggsopplysninger/Fremlagte '
     A                                    98'Sertifikater og'
     A                                   115'|'
     A                                      SPACEA(1)
     A                                     4'|utførselsland|                 |'
     A                                    37'          (kg) |        (kg) |'
     A                                    67'autorisasjoner'
     A                                   115'|'
     A                                      SPACEA(1)
     A                                     4'|(15)         |(17)             |'
     A                                      UNDERLINE
     A                                    37'(35)           |(38)         |'
     A                                      UNDERLINE
     A                                    67'(44)                              '
     A                                      UNDERLINE
     A                                   101'              |'
     A                                      UNDERLINE
     A                                      SPACEA(1)
     A                                     4'|Avsender/Eksportør'
     A                                    59'|Mottaker'
     A                                   115'|'
     A                                      SPACEA(1)
     A                                     4'|(2)                              '
     A                                      UNDERLINE
     A                                    38'                     '
     A                                      UNDERLINE
     A                                    59'|(8)                              '
     A                                      UNDERLINE
     A                                    93'                      |'
     A                                      UNDERLINE
     A                                      SPACEA(1)
     A                                     4'____________________________'
     A                                    32'____________________________'
     A                                    60'____________________________'
     A                                    88'____________________________'
      *
      *
     A          R DKX157P4                  SPACEB(1)
     A                                     4'|'
     A N98        TVLI           5  0      5EDTCDE(Z)
     A                                    18'|'
     A            TVMNXX        17        19
     A                                    36'|'
     A            TVNT           5  0     38EDTCDE(Z)
     A            TVEH           2        45
     A                                    48'|'
     A            TVCNR         17        49
     A                                    66'|'
     A            TVVT48        48        67
     A                                   115'|'
      *
     A          R DKX157P5                  SPACEB(1)
     A                                     4'|'
     A N98        TVDK           5         6
     A                                    18'|'
     A N98        TVVNT          6  0     20
     A                                    36'|'
     A            TVFV           2        42
     A                                    52'|'
     A            TVFVNT        11  3     53EDTWRD('        ,   ')
     A                                    66'|'
     A                                   115'|'
      *
     A          R DKX157P6                  SPACEB(1)
     A                                     4'|'
     A N98        TVALK          2         6
     A                                    18'|'
     A N98        TVBLK          2        20
     A                                    36'|'
     A N98        TVVKTB         9  3     40EDTCDE(4)
     A                                    52'|'
     A N98        TVVKTN         9  3     54EDTCDE(4)
     A                                    66'|'
     A            XVDTY         20        67
     A            XVDREF        27        88
     A                                   115'|'
      *
     A          R DKX157P7                  SPACEB(1)
     A                                     4'|'
     A N98        TVALK          2         6
     A                                    18'|'
     A N98        TVBLK          2        20
     A                                    36'|'
     A N98        TVVKTB         9  3     40EDTCDE(4)
     A                                    52'|'
     A N98        TVVKTN         9  3     54EDTCDE(4)
     A                                    66'|'
     A            TVDO          26        67
     A                                   115'|'
      *
     A          R DKX157P8                  SPACEB(1)
     A                                     4'|'
     A N98        TVALK          2         6
     A                                    18'|'
     A N98        TVBLK          2        20
     A                                    36'|'
     A N98        TVVKTB         9  3     40EDTCDE(4)
     A                                    52'|'
     A N98        TVVKTN         9  3     54EDTCDE(4)
     A                                    66'|'
     A            XVTLO         35        67
     A            XVEXKD         2       107
     A            TVEXLK         2       111
     A                                   115'|'
      *
     A          R DKX157P9                  SPACEB(1)
     A                                     4'|'
     A N98        TVALK          2         6
     A                                    18'|'
     A N98        TVBLK          2        20
     A                                    36'|'
     A N98        TVVKTB         9  3     40EDTCDE(4)
     A                                    52'|'
     A N98        TVVKTN         9  3     54EDTCDE(4)
     A                                    66'|'
     A*           TVMTXT        48        67
     A                                   115'|'
      *
     A          R DKX157PA                  SPACEB(1)
     A                                     4'|'
     A            TVNAS         30         6
     A                                    59'|'
     A            TVNAK         30        61
     A                                   115'|'
      *
     A          R DKX157PB                  SPACEB(1)
     A                                     4'|'
     A            TVADS1        30         6
     A                                    59'|'
     A            TVADK1        30        61
     A                                   115'|'
      *
     A          R DKX157PC                  SPACEB(1)
     A                                     4'|'
     A            TVPNS          9         6
     A            TVPSS         24        16
     A            TVLKS          2        46
     A                                    59'|'
     A            TVPNK          9        61
     A            TVPSK         24        71
     A            TVLKK          2        91
     A                                   115'|'
      *
     A          R DKX157PD
     A            PVFM3         75     64  2
      *
     A          R DKX157PE
     A                                     4'____________________________'
     A                                    32'____________________________'
     A                                    60'____________________________'
     A                                    88'____________________________'
