     A*_____________________________________
     A* SYSPED / KODEREG. FOR FØLSOMME VARER
     A*"""""""""""""""""""""""""""""""""""""
     A          R DKXFKDFR
     A            TFTANR         6S 0       COLHDG('TARIFFNR')
     A            TFTXT         35A         COLHDG('BESKRIVELSE')
     A            TFMNGD        11S 3       COLHDG('MINST MENGDE')
     A            TFKODE         2A         COLHDG('KODE')
     A          K TFTANR
