      *__________________________________
      * SYSPED / TET-EKSPORT, GARANTI
      *""""""""""""""""""""""""""""""""""
     A          R DKXGDR
     A            TDGNR         24A         COLHDG('GARANTINR')
     A            TDAK           4A         COLHDG('ADGANGSKODE')
      *
     A          K TDGNR
     A          K TDAK
