     A          R DKXHHR
     A            DKXHH_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            DKXHH_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            DKXHH_DTH     12          COLHDG('Datum før hændelse')
     A            DKXHH_TMH      6          COLHDG('Tid før hændelse')
     A            DKXHH_SR       1          COLHDG('Send/Receive')
     A            DKXHH_TXH     35          COLHDG('Text, huvud')
     A            DKXHH_TX1     70          COLHDG('Text, detalj-1')
     A            DKXHH_TX2     70          COLHDG('Text, detalj-2')
     A            DKXHH_TX3     70          COLHDG('Text, detalj-3')
     A            DKXHH_TX4     70          COLHDG('Text, detalj-4')
     A            DKXHH_TX5     70          COLHDG('Text, detalj-5')
     A          K DKXHH_SYA
     A          K DKXHH_SYO
