     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, Regdato
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKXHR                     PFILE(DKXH)
     A                                      TEXT('Regdato')
     A          K THAVD
     A          K THDT
