     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, SELGER
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKXHR                     PFILE(DKXH)
     A          K THAVD
     A          K THKNS
     A          K THDT
