     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, ARBEIDSSTASJON
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKXHR                     PFILE(DKXH)
     A                                      TEXT('ARBEIDSSTASJON')
     A          K THWS
     A          K THST
