     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, TUR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKXHR                     PFILE(DKXH)
     A          K THAVD
     A          K THPRO
