     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R DKXHR                     PFILE(DKXH)
     A          K THST
     A          K THAVD
     A          K THTDN
