     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner TRANSIT VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R DKXVR                     PFILE(DKXV)
     A          K TVAVD
     A          K TVTDN
     A          K TVREFL
