     A          R DOK29R
     A            D29AVD         4S 0       COLHDG('AVDELING')
     A            D29OPD         7S 0       COLHDG('OPPDRAGSNR.')
     A            D29FNR         3S 0       COLHDG('FRAKTBREVNR.')
     A            D29TXT        70          COLHDG('FRITEKST R38')
     A          K D29AVD
     A          K D29OPD
     A          K D29FNR
