     A          R DOK36R
     A            D36AVD         4S 0       COLHDG('AVDELING')
     A            D36OPD         7S 0       COLHDG('OPPDRAGSNR.')
     A            D36FNR         3S 0       COLHDG('FRAKTBREVNR.')
     A            D36TXT        70          COLHDG('INFORMASJON')
     A          K D36AVD
     A          K D36OPD
     A          K D36FNR
