     A*___________________
     A* SYSPED / Fraktbrev  'C'
     A*"""""""""""""""""""
     A                                      REF(SR)
     A          R DOKECETR
     A            DEAVD     R               REFFLD(AVD)
     A            DEOPD     R               REFFLD(OPD)
     A            DELIN          1S 0       COLHDG('VARELINJENR.')
     A            DEFRT         68          COLHDG('FRITEKST')
     A          K DEAVD
     A          K DEOPD
     A          K DELIN
