     A*___________________
     A* SYSPED / Fraktbrev  'C'
     A*"""""""""""""""""""
     A                                      REF(SR)
     A          R DOKECELR
     A            DEAVD     R               REFFLD(AVD)
     A            DEOPD     R               REFFLD(OPD)
     A            DELIN          1S 0       COLHDG('VARELINJENR.')
     A            DEMN          13          COLHDG('MERKE & NR. 01')
     A            DENT           5P 0       COLHDG('ANTALL KOLLI 01')
     A            DEEH          11          COLHDG('ENHET 01')
     A            DEVS          14          COLHDG('VAREBESK. 01')
     A            DEVK           9P 0       COLHDG('VEKT 01')
     A            DEM3           7P 3       COLHDG('KUBIKK 01')
     A          K DEAVD
     A          K DEOPD
     A          K DELIN
