     A*___________________
     A* SYSPED / Fraktbrev  'B'
     A*"""""""""""""""""""
     A                                      REF(SR)
     A          R DOKEBR
     A            DBST      R               REFFLD(ST)
     A            DBKNM     R               REFFLD(KN)
     A                                      COLHDG('MOTTAGERSNR.')
     A            DBNAM     R               REFFLD(NA)
     A                                      COLHDG('MOTTAGERSNAVN')
     A            DBADM1    R               REFFLD(AD)
     A                                      COLHDG('MOTT.ADRESSE-1')
     A            DBADM2    R               REFFLD(AD)
     A                                      COLHDG('MOTT.ADRESSE-2')
     A            DBADM3    R               REFFLD(AD)
     A                                      COLHDG('MOTT.ADRESSE-3')
     A            DBFORT        16          COLHDG('FORTRANSPORT FRA')
     A            DBSD          16          COLHDG('FRA STED')
     A            DBBÅTN        16          COLHDG('BÅTNAVN')
     A            DBSDLA        16          COLHDG('LASTESTED')
     A            DBSDLO        16          COLHDG('LOSSESTED')
     A            DBSDM         16          COLHDG('ENDELIG MOTTAGERSTED')
     A            DBGM1     R               REFFLD(GM)
     A            DBNT1     R               REFFLD(NTS)
     A            DBVS1     R               REFFLD(VS)
     A            DBVKT1    R               REFFLD(VKT9)
     A            DBM31     R               REFFLD(M3)
     A            DBGM2     R               REFFLD(GM)
     A            DBNT2     R               REFFLD(NTS)
     A            DBVS2     R               REFFLD(VS)
     A            DBVKT2    R               REFFLD(VKT9)
     A            DBM32     R               REFFLD(M3)
     A            DBGM3     R               REFFLD(GM)
     A            DBNT3     R               REFFLD(NTS)
     A            DBVS3     R               REFFLD(VS)
     A            DBVKT3    R               REFFLD(VKT9)
     A            DBM33     R               REFFLD(M3)
     A            DBGM4     R               REFFLD(GM)
     A            DBNT4     R               REFFLD(NTS)
     A            DBVS4     R               REFFLD(VS)
     A            DBVKT4    R               REFFLD(VKT9)
     A            DBM34     R               REFFLD(M3)
     A            DBGM5     R               REFFLD(GM)
     A            DBNT5     R               REFFLD(NTS)
     A            DBVS5     R               REFFLD(VS)
     A            DBVKT5    R               REFFLD(VKT9)
     A            DBM35     R               REFFLD(M3)
     A            DBGM6     R               REFFLD(GM)
     A            DBNT6     R               REFFLD(NTS)
     A            DBVS6     R               REFFLD(VS)
     A            DBVKT6    R               REFFLD(VKT9)
     A            DBM36     R               REFFLD(M3)
     A            DBGM7     R               REFFLD(GM)
     A            DBNT7     R               REFFLD(NTS)
     A            DBVS7     R               REFFLD(VS)
     A            DBVKT7    R               REFFLD(VKT9)
     A            DBM37     R               REFFLD(M3)
     A            DBGM8     R               REFFLD(GM)
     A            DBNT8     R               REFFLD(NTS)
     A            DBVS8     R               REFFLD(VS)
     A            DBVKT8    R               REFFLD(VKT9)
     A            DBM38     R               REFFLD(M3)
     A            DBKDDP         1          COLHDG('DISTINASJON/PREPAID')
     A            DBSDDT        27          COLHDG('STED/DATO')
     A            DBABSL        15          COLHDG('ANT. BS/L')
     A            DBSG      R               REFFLD(SG)
     A            DBXXX         40          COLHDG('LEDIGE 40 LANG')
     A            DBAVD     R               REFFLD(AVD)
     A            DBOPD     R               REFFLD(OPD)
     A          K DBAVD
     A          K DBOPD
