     A*___________________
     A* SYSPED / Fraktbrev  'C'
     A*"""""""""""""""""""
     A                                      REF(SR)
     A          R DOKECR
     A            DCST      R               REFFLD(ST)
     A            DCKNA     R               REFFLD(KN)
     A                                      COLHDG('AVSENDERSNR.')
     A            DCKNM     R               REFFLD(KN)
     A                                      COLHDG('MOTTAGERSNR.')
     A            DCNAM     R               REFFLD(NA)
     A                                      COLHDG('MOTTAGERSNAVN')
     A            DCNAL     R               REFFLD(NA)
     A                                      COLHDG('LEVERINGSNAVN')
     A            DCADM1    R               REFFLD(AD)
     A                                      COLHDG('MOTT.ADRESSE-1')
     A            DCADL1    R               REFFLD(AD)
     A                                      COLHDG('LEV.ADRESSE-1')
     A            DCADM2    R               REFFLD(AD)
     A                                      COLHDG('MOTT.ADRESSE-2')
     A            DCADL2    R               REFFLD(AD)
     A                                      COLHDG('LEV.ADRESSE-2')
     A            DCADM3    R               REFFLD(AD)
     A                                      COLHDG('MOTT.ADRESSE-3')
     A            DCADL3    R               REFFLD(AD)
     A                                      COLHDG('LEV.ADRESSE-3')
     A            DCAI1     R               REFFLD(AI)
     A                                      COLHDG('AVS.INSTRUKS-1')
     A            DCVL1     R               REFFLD(VL)
     A                                      COLHDG('VEDLEGG-1')
     A            DCAI2     R               REFFLD(AI)
     A                                      COLHDG('AVS.INSTRUKS-2')
     A            DCVL2     R               REFFLD(VL)
     A                                      COLHDG('VEDLEGG-2')
     A            DCAI3     R               REFFLD(AI)
     A                                      COLHDG('AVS.INSTRUKS-3')
     A            DCVL3     R               REFFLD(VL)
     A                                      COLHDG('VEDLEGG-3')
     A            DCAI4     R               REFFLD(AI)
     A                                      COLHDG('AVS.INSTRUKS-4')
     A            DCFR      R               REFFLD(FR)
     A            DCFRFT    R               REFFLD(FT26)
     A                                      COLHDG('FRANKATURTEKST')
     A            DCKNFF    R               REFFLD(KN)
     A                                      COLHDG('FRAKTFØRERSNR.')
     A            DCFT      R               REFFLD(FT50)
     A            DCVAL     R               REFFLD(VAL)
     A            DCBEL     R               REFFLD(BEL6S)
     A            DCDT      R               REFFLD(DT)
     A                                      COLHDG('Dato DMÅ')
     A            DCSG      R               REFFLD(SG)
     A            DCXXX        187          COLHDG('LEDIGE 187 LANG')
     A            DCR12A        30          COLHDG('RUBRIKK 12')
     A            DCR12B        30          COLHDG('RUBRIKK 12')
     A            DCR12C        30          COLHDG('RUBRIKK 12')
     A            DCR13A        30          COLHDG('RUBRIKK 13')
     A            DCR13B        30          COLHDG('RUBRIKK 13')
     A            DCR13C        30          COLHDG('RUBRIKK 13')
     A            DCR13D        30          COLHDG('RUBRIKK 13')
     A            DCAVD     R               REFFLD(AVD)
     A            DCOPD     R               REFFLD(OPD)
     A            DCSNR         17          COLHDG('SENDNINGSNR')
     A            DCMLAP         1          COLHDG('MERKELAPP J/N')
     A          K DCAVD
     A          K DCOPD
