     A*___________________
     A* SYSPED / Fraktbrev
     A*"""""""""""""""""""
     A                                      REF(SR)
     A          R DOKEFR
     A            DFST      R               REFFLD(ST)
     A            DFXX1         54          COLHDG('LEDIGE 55 LANG')
     A            DFTLFS    R               REFFLD(TLF15)
     A            DFTLFK    R               REFFLD(TLF15)
     A            DFKDDC    R               REFFLD(KDDC)
     A            DFBLDC    R               REFFLD(BEL9S2)
     A                                      COLHDG('DUE CARRIER BELØP')
     A            DFINF1    R               REFFLD(FT35)
     A                                      COLHDG('INFORMASJON-1')
     A            DFINF2    R               REFFLD(FT35)
     A                                      COLHDG('INFORMASJON-2')
      *
      *** FØRSTE 100 POS. TIL DFXX2 ER TATT I BRUK   1/2-90
      *           DFXX2        122          COLHDG('LEDIGE 122 LANG')
     A            DFVS7     R               REFFLD(VS)
     A            DFVS8     R               REFFLD(VS)
     A            DFVS9     R               REFFLD(VS)
     A            DFVS10    R               REFFLD(VS)
     A            DFXX2         22          COLHDG('LEDIGE 22 LANG')
     A            DFFT      R               REFFLD(FT41)
     A                                      COLHDG('DOKUMENT TEKST')
     A            DFSG      R               REFFLD(SG)
     A            DFFSN     R               REFFLD(FSN)
     A            DFROA1    R               REFFLD(ROA)
     A            DFROB1    R               REFFLD(ROB)
     A            DFROC1    R               REFFLD(ROC)
     A            DFROA2    R               REFFLD(ROA)
     A            DFROB2    R               REFFLD(ROB)
     A            DFROC2    R               REFFLD(ROC)
     A            DFROA3    R               REFFLD(ROA)
     A            DFROB3    R               REFFLD(ROB)
     A            DFROC3    R               REFFLD(ROC)
     A            DFVAL     R               REFFLD(VAL)
     A            DFCCPP    R               REFFLD(CCPP)
     A            DFDVCA    R               REFFLD(DVCA)
     A            DFDVCU    R               REFFLD(DVCU)
     A            DFBELF    R               REFFLD(BEL7S)
     A                                      COLHDG('FORIKRING BELØP')
     A            DFINFA    R               REFFLD(FT71)
     A            DFINFB    R               REFFLD(FT71)
     A            DFINFC    R               REFFLD(FT71)
     A            DFNT1     R               REFFLD(NT4A)
     A            DFVKT1         7P 1       COLHDG('VEKT-1')
     A            DFRC1     R               REFFLD(KDC)
     A                                      COLHDG('RATE CLASS')
     A            DFCOM1    R               REFFLD(COM)
     A            DFFBV1         7P 1       COLHDG('FRAKTBR.VEKT-1')
     A            DFRK1     R               REFFLD(KDC)
     A                                      COLHDG('RATE KODE')
     A            DFRPR1    R               REFFLD(BEL8S)
     A            DFBLT1    R               REFFLD(BEL102)
     A            DFVS1     R               REFFLD(VS)
     A            DFNT2     R               REFFLD(NT4A)
     A            DFVKT2         7P 1       COLHDG('VEKT-2')
     A            DFRC2     R               REFFLD(KDC)
     A                                      COLHDG('RATE CLASS')
     A            DFCOM2    R               REFFLD(COM)
     A            DFFBV2         7P 1       COLHDG('FRAKTBR.VEKT-2')
     A            DFRK2     R               REFFLD(KDC)
     A                                      COLHDG('RATE KODE')
     A            DFRPR2    R               REFFLD(BEL8S)
     A            DFBLT2    R               REFFLD(BEL102)
     A            DFVS2     R               REFFLD(VS)
     A            DFNT3     R               REFFLD(NT4A)
     A            DFVKT3         7P 1       COLHDG('VEKT-3')
     A            DFRC3     R               REFFLD(KDC)
     A                                      COLHDG('RATE CLASS')
     A            DFCOM3    R               REFFLD(COM)
     A            DFFBV3         7P 1       COLHDG('FRAKTBR.VEKT-3')
     A            DFRK3     R               REFFLD(KDC)
     A                                      COLHDG('RATE KODE')
     A            DFRPR3    R               REFFLD(BEL8S)
     A            DFBLT3    R               REFFLD(BEL102)
     A            DFVS3     R               REFFLD(VS)
     A            DFNT4     R               REFFLD(NT4A)
     A            DFVKT4         7P 1       COLHDG('VEKT-4')
     A            DFRC4     R               REFFLD(KDC)
     A                                      COLHDG('RATE CLASS')
     A            DFCOM4    R               REFFLD(COM)
     A            DFFBV4         7P 1       COLHDG('FRAKTBR.VEKT-4')
     A            DFRK4     R               REFFLD(KDC)
     A                                      COLHDG('RATE KODE')
     A            DFRPR4    R               REFFLD(BEL8S)
     A            DFBLT4    R               REFFLD(BEL102)
     A            DFVS4     R               REFFLD(VS)
     A            DFNT5     R               REFFLD(NT4A)
     A            DFVKT5         7P 1       COLHDG('VEKT-5')
     A            DFRC5     R               REFFLD(KDC)
     A                                      COLHDG('RATE CLASS')
     A            DFCOM5    R               REFFLD(COM)
     A            DFFBV5         7P 1       COLHDG('FRAKTBR.VEKT-5')
     A            DFRK5     R               REFFLD(KDC)
     A                                      COLHDG('RATE KODE')
     A            DFRPR5    R               REFFLD(BEL8S)
     A            DFBLT5    R               REFFLD(BEL102)
     A            DFVS5     R               REFFLD(VS)
     A            DFNT6     R               REFFLD(NT4A)
     A            DFVKT6         7P 1       COLHDG('VEKT-6')
     A            DFRC6     R               REFFLD(KDC)
     A                                      COLHDG('RATE CLASS')
     A            DFCOM6    R               REFFLD(COM)
     A            DFFBV6         7P 1       COLHDG('FRAKTBR.VEKT-6')
     A            DFRK6     R               REFFLD(KDC)
     A                                      COLHDG('RATE KODE')
     A            DFRPR6    R               REFFLD(BEL8S)
     A            DFBLT6    R               REFFLD(BEL102)
     A            DFVS6     R               REFFLD(VS)
     A                                      COLHDG('Kundenr Selger')
     A            DFNTT     R               REFFLD(NT4S)
     A            DFBLT     R               REFFLD(BEL92)
     A            DFVKTT         7P 1       COLHDG('TOTALL VEKT')
     A            DFBLA     R               REFFLD(BEL92)
     A            DFBLAV    R               REFFLD(BEL92)
     A                                      COLHDG('AVGIFT BELØP')
     A            DFKDME    R               REFFLD(KDME)
     A            DFXX3          7          COLHDG('LEDIGE')
     A            DFRI      R               REFFLD(RI)
     A            DFAVD     R               REFFLD(AVD)
     A            DFOPD     R               REFFLD(OPD)
     A            DFLOP          3S 0       COLHDG('LOPENR')
     A            DFCMN          1          COLHDG('COMUNICATION')
     A            DFTRID         9P 0       COLHDG('CMN. TRANS ID')
     A            DFTOLS         2          COLHDG('Tollstatus')
     A            DFETD1         4S 0       COLHDG('Est tim dep-1')
     A            DFETA1         4S 0       COLHDG('Est tim arr-1')
     A            DFEDA1         2S 0       COLHDG('Est day arr-1')
     A            DFETD2         4S 0       COLHDG('Est tim dep-2')
     A            DFETA2         4S 0       COLHDG('Est tim arr-2')
     A            DFEDA2         2S 0       COLHDG('Est day arr-2')
     A            DFETD3         4S 0       COLHDG('Est tim dep-3')
     A            DFETA3         4S 0       COLHDG('Est tim arr-3')
     A            DFEDA3         2S 0       COLHDG('Est day arr-3')
     A            DFFUEL    R               REFFLD(BEL9S2)
     A                                      COLHDG('FUEL SURCHARGE')
     A            DFNETT    R               REFFLD(BEL9S2)
     A                                      COLHDG('NETTO FRAKT')
     A            DFSPH1         3          COLHDG('SPH Code-1')
     A            DFSPH2         3          COLHDG('SPH Code-2')
     A            DFSPH3         3          COLHDG('SPH Code-3')
     A            DFSPH4         3          COLHDG('SPH Code-4')
     A            DFSPH5         3          COLHDG('SPH Code-5')
     A            DFSPH6         3          COLHDG('SPH Code-6')
     A            DFSPH7         3          COLHDG('SPH Code-7')
     A            DFSPH8         3          COLHDG('SPH Code-8')
     A            DFSPH9         3          COLHDG('SPH Code-9')
     A          K DFRI
     A          K DFAVD
     A          K DFOPD
     A          K DFLOP
