     A*___________________________
     A* SYSPED / Fraktbrev, Status
     A*"""""""""""""""""""""""""""
     A          R DOKECER                   PFILE(DOKECE)
     A                                      TEXT('Status')
     A          K DEST
