      *
      * OBS! FELTER SOM VEDRØRER STATISTIKK, MÅ OGSÅ FINNES I STATVF.
     A*__________________________
     A* SYSPED / Oppdragsregister
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R DOKEFIMR
     A            IMAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            IMOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            IMLOP          3S 0       COLHDG('Lopenr')
     A            HESDF     R               REFFLD(SD)
     A                                      COLHDG('Frakt fra')
     A            HESDT     R               REFFLD(SD)
     A                                      COLHDG('Frakt til')
     A            HEGN      R               REFFLD(GN)
     A                                      COLHDG('Godsnr')
     A            HEHAWB    R               REFFLD(HAWB)
     A                                      COLHDG('Bil/Hawbnr')
     A            HELKA     R               REFFLD(LKA)
     A                                      COLHDG('Landkode')
     A            HELKK     R               REFFLD(LKA)
     A                                      COLHDG('Landkode kjøper')
     A            TRSTA4         1          COLHDG('Produkt fly')
     A            HEFR      R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            DOMOMS         1          COLHDG('MOMSKODE')
     A            HEKNS     R               REFFLD(KN)
     A          K IMAVD
     A          K IMOPD
     A          K IMLOP
