     A*___________________________
     A* SYSPED / Fraktbrev, Status
     A*"""""""""""""""""""""""""""
     A          R DOKEFR                    PFILE(DOKEF)
     A                                      TEXT('Status')
     A          K DFST
