     A*_________________________________
     A* SYSPED / Flyfrakt, other charges
     A*"""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R DOKOTR
     A            DOAVD     R               REFFLD(AVD)
     A            DOOPD     R               REFFLD(OPD)
     A            DOLOP          3S 0       COLHDG('LOPENR')
     A            DO1322         1          COLHDG('P/C indicator')
     A            DO1331         2          COLHDG('Other Charge Code')
     A            DO1332         1          COLHDG('Entitlement Code A/C')
     A            DO1333        11P 2       COLHDG('Charge Amount')
     A          K DOAVD
     A          K DOOPD
     A          K DOLOP
     A          K DO1331
     A          K DO1332
