     A*________________________________________________________
     A* SYSPED / Flyfrakt, Other Customs Information singel FWB
     A*""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R DOKOCIR
     A            DOKOCIAVD      4S 0       COLHDG('Avdeling')
     A            DOKOCIOPD      7S 0       COLHDG('Oppdragsnummer')
     A            DOKOCILOP      3S 0       COLHDG('Løpenummer')
     A            DOKOCI293      2          COLHDG('ISO Country Code')
     A            DOKOCI295      3          COLHDG('Information Id')
     A            DOKOCI297      2          COLHDG('Customs Inf Id')
     A            DOKOCI299     35          COLHDG('Suppl Customs Inf')
     A          K DOKOCIAVD
     A          K DOKOCIOPD
     A          K DOKOCILOP
