     A                                      REF(SR)
     A          R DOKULGR
      *====================================================
      * KEY, EQUEL TO DOKUF
      *====================================================
     A            LGAVD     R               REFFLD(AVD)
     A            LGOPD     R               REFFLD(OPD)
     A            LGFBNR    R               REFFLD(FRBN)
      *====================================================
      * SYEDI REFERANSE
      *====================================================
     A            LGMN           7S 0       COLHDG('SYEDI.REF.MMN')
      *====================================================
      * RFF SEGMENT
      *====================================================
     A            LG1154        35          COLHDG('FR.BREV.NR.LG')
      *====================================================
      * FTX SEGMENT
      *====================================================
     A            LG4440A       70            COLHDG('FEIL.MELD-1')
     A            LG4440B       70            COLHDG('FEIL.MELD-2')
     A            LG4440C       70            COLHDG('FEIL.MELD-3')
     A            LG4440D       70            COLHDG('FEIL.MELD-4')
     A            LG4440E       70            COLHDG('FEIL.MELD-5')
     A            LG4440F       70            COLHDG('FEIL.MELD-6')
      *====================================================
      * KEY
      *====================================================
     A          K LGAVD
     A          K LGOPD
     A          K LGFBNR
