     A*___________________________
     A* SYSPED / Fraktbrev, Status
     A*"""""""""""""""""""""""""""
     A          R DOKUFR                    PFILE(DOKUF)
     A                                      TEXT('Status/Utlev postnr.')
     A          K DFST
     A          K DFSG
     A          K DFAVD
     A          K DFPOUL
