     A*___________________________
     A* SYSPED / Fraktbrev, Status
     A*"""""""""""""""""""""""""""
     A          R DOKUFR                    PFILE(DOKUF)
     A                                      TEXT('Stat/UTENL.LK-PNR./NAVN')
     A          K DFST
     A          K DFAVD
     A          K DFOPD
     A          K DFLKM
     A          K DFPNUM
     A          K DFNAVM
