     A*_ BRINGTMS-PROSJEKT ___________
     A* SYSPED / Fraktbrev - varelinje/TILLEGSGEBYRER
     A*"""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R DOKUFVGR
     A            FGAVD     R               REFFLD(AVD)
     A            FGOPD     R               REFFLD(OPD)
     A            FGFBNR    R               REFFLD(FRBN)
     A            FGLINR         2S 0       COLHDG('Linjenr.')
     A            FGLIN2         2S 0       COLHDG('SUBLinjenr.')
     A            FGSKX          1          COLHDG('PARTSKODE')
     A            FGVK           3          COLHDG('GEBYRKODE')
     A            FGVT          20          COLHDG('TEKST')
     A            FGVAL          3          COLHDG('VALUTA')
     A            FGBELV        13S 2       COLHDG('BELØP VAL')
     A            FGBELN        13S 2       COLHDG('BEL FI-CURRENCY')
     A            FGKDM          1          COLHDG('MOMSKODE')
     A            FGKDA          1          COLHDG('AUTOKOD A=AUTO/M=MAN')
     A            FGFALI         5S 0       COLHDG('FAKT LI.NR')
     A          K FGAVD
     A          K FGOPD
     A          K FGFBNR
     A          K FGLINR
     A          K FGLIN2
