     A*___________________
     A* SYSPED / Fraktbrev 'T'
     A*"""""""""""""""""""
     A                                      REF(SR)
     A          R DOKUTR
     A            DTST      R               REFFLD(ST)
     A            DTTOLL         2          COLHDG('TOLL')
     A            DTSG           3          COLHDG('SIGNATUR')
     A            DTRI      R               REFFLD(RI)
     A            DTAVD     R               REFFLD(AVD)
     A            DTOPD     R               REFFLD(OPD)
     A            DTFBNR    R               REFFLD(FRBN)
     A            DTXXX         13          COLHDG('LEDIGE PLASSER')
     A          K DTRI
     A          K DTAVD
     A          K DTOPD
     A          K DTFBNR
