     A*___________________
     A* SYSPED / Fraktbrev 'M'
     A*"""""""""""""""""""
     A                                      REF(SR)
     A          R DOKUMR
     A            DMST      R               REFFLD(ST)
     A            DMXXX1         7          COLHDG('LEDIGE PLASSER')
     A            DMAWB         11S 0       COLHDG('HAWB-NR')
     A            DMXXX2         1          COLHDG('LEDIGE PLASSER')
     A            DMFRA          5          COLHDG('FRA-DESTINASJON')
     A            DMTIL          5          COLHDG('TIL-DESTINASJON')
     A            DMRUNR         6          COLHDG('RUNR')
     A            DMCCPP         2          COLHDG('CCPP')
     A            DMPREF         3S 0       COLHDG('PREF')
     A            DMFNAV        30          COLHDG('FNAV')
     A            DMSKNR         8S 0       COLHDG('SKNR')
     A            DMSNAV        30          COLHDG('SNAV')
     A            DMSAD1        30          COLHDG('SAD1')
     A            DMSAD2        30          COLHDG('SAD2')
     A            DMSAD3        30          COLHDG('SAD3')
     A            DMSTLF        15          COLHDG('STLF')
     A            DMKNAV        30          COLHDG('KNAV')
     A            DMKAD1        30          COLHDG('KAD1')
     A            DMKAD2        30          COLHDG('KAD2')
     A            DMKAD3        30          COLHDG('KAD3')
     A            DMKTLF        15          COLHDG('KTLF')
     A            DMANT          7S 0       COLHDG('ANT')
     A            DMVEKT         5S 0       COLHDG('VEKT')
     A            DMSLAG        20          COLHDG('SLAG')
     A            DMXXX3         5          COLHDG('LEDIGE PLASSER')
     A            DMFVKT         5S 0       COLHDG('FVKT')
     A            DMTARI         1          COLHDG('TARI')
     A            DMPRIS         5S 2       COLHDG('PRIS')
     A            DMMERK        50          COLHDG('MERK')
     A            DMFORS         9S 0       COLHDG('FORS')
     A            DMFORA        25          COLHDG('FORA')
     A            DMFRAK         7S 0       COLHDG('FRAK')
     A            DMFS           7S 0       COLHDG('FS')
     A            DMFPRE         7S 0       COLHDG('FPRE')
     A            DMDAG1         2S 0       COLHDG('DAG1')
     A            DMDAG2         2S 0       COLHDG('DAG2')
     A            DMDAG3         2S 0       COLHDG('DAG3')
     A            DMMLAP         1          COLHDG('MLAP')
     A            DMSUM          7S 2       COLHDG('SUM AV GEBYRER')
     A            DMVGEB         7S 0       COLHDG('VGEB')
     A            DMMVA          9S 2       COLHDG('MVA')
     A            DMVSL2        20          COLHDG('VSL2')
     A            DMRUN2         6          COLHDG('RUN2')
     A            DMRUN3         6          COLHDG('RUN3')
     A            DMXXX4        24          COLHDG('LEDIGE PLASSER')
     A            DMSD      R               REFFLD(SD3)
     A            DMLNR     R               REFFLD(NR)
     A            DMXXX5         6          COLHDG('LEDIGE PLASSER')
     A            DMFUEL    R               REFFLD(BEL9S2)
     A                                      COLHDG('FUEL SURCHARGE')
     A            DMFT      R               REFFLD(FT41)
     A                                      COLHDG('DOKUMENT TEKST')
     A          K DMSD
     A          K DMLNR
