     A*___________________________
     A* SYSPED / Fraktbrev, Status
     A*"""""""""""""""""""""""""""
     A          R DOKUFR                    PFILE(DOKUF)
     A                                      TEXT('MOTTAKER/DATO')
     A          K DFKNM
     A          K DFDTU
