     A                                      REF(SR)
     A          R DOKUDGSR
      *====================================================
      * KEY, EQUEL TO DOKUFV
      *====================================================
     A            DGSAVD    R               REFFLD(AVD)
     A            DGSOPD    R               REFFLD(OPD)
     A            DGSFBNR   R               REFFLD(FRBN)
     A            DGSLINR        2S 0       COLHDG('Linjenr.')
      *====================================================
      * DGS SEGMENT
      *====================================================
     A            DGS8273        3          COLHDG('DANG GOODS REG, C')
      * C205 Hazard code
     A            DGS8351        7          COLHDG('HAZARD CODE ID')
     A            DGS8078        7          COLHDG('HAZ SUBS/ITEM/PAGE')
     A            DGS8092       10          COLHDG('HAZ CODE VER NO')
      * C234 UNDG information
     A            DGS7124        4S 0       COLHDG('UNDG NO')
     A            DGS7088        8          COLHDG('DANG GOODS FLASHP')
      * C223 Dangerous goods shipment flashpoint
     A            DGS7106        3S 0       COLHDG('SHIPMENT FLASHPOINT')
     A            DGS6411        3          COLHDG('MEA UNIT Q')
      *
     A            DGS8339        3          COLHDG('PACKING GROUP, C')
     A            DGS8364        6          COLHDG('EMS NUMBER')
     A            DGS8410        4          COLHDG('MFAG')
     A            DGS8126       10          COLHDG('TREM CARD NUMBER')
      * C235 Hazard identification
     A            DGS8158        4          COLHDG('HAZ ID NO, UPP PART')
     A            DGS8186        4          COLHDG('SUBS ID NO, LOW PART')
      * C236 Dangerous goods label
     A            DGS8246A       4          COLHDG('DANG GOODS LBL MARK')
     A            DGS8246B       4          COLHDG('DANG GOODS LBL MARK')
     A            DGS8246C       4          COLHDG('DANG GOODS LBL MARK')
      *
     A            DGS8255        3          COLHDG('PACK INSTR, C')
     A            DGS8325        3          COLHDG('CAT MEANS TRANS, C')
     A            DGS8211        3          COLHDG('PERM FOR TRANS, C')
      *====================================================
      * FTX SEGMENT
      *====================================================
     A            DGS4440A      70            COLHDG('ERKLÆRING-1')
     A            DGS4440B      70            COLHDG('ERKLÆRING-2')
     A            DGS4440C      70            COLHDG('ERKLÆRING-3')
     A            DGS4440D      70            COLHDG('ERKLÆRING-4')
     A            DGS4440E      70            COLHDG('ERKLÆRING-5')
     A            DGS4440F      70            COLHDG('TEKNISK NAVN')
      *====================================================
      * KEY
      *====================================================
     A          K DGSAVD
     A          K DGSOPD
     A          K DGSFBNR
     A          K DGSLINR
