     A*___________________________
     A* SYSPED / Fraktbrev, Status
     A*"""""""""""""""""""""""""""
     A          R DOKUFR                    PFILE(DOKUF)
     A                                      TEXT('Status')
     A          K DFST
     A          K DFSG
     A          K DFAVD
     A          K DFOPD
     A          K DFFBNR
