     A*_______________________________
     A* SYSPED / Kolli-IDer, TELLING PÅ GITT DATO/KODE
     A*"""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R DOKUFTR
     A            FTDATE         8S 0       COLHDG('Dato')
     A            FTTERM         5          COLHDG('TERM-Kode')
     A            FTCLID        35          COLHDG('KOLLI-ID')
     A            FTTIME         6S 0       COLHDG('Klokka')
     A            FTUSER        10          COLHDG('Bruker')
     A            FTTEXT        35          COLHDG('Merknad')
     A            FTAVD          4S 0       COLHDG('AVD')
     A            FTOPD          7S 0       COLHDG('OPD')
     A            FTFBNR         3S 0       COLHDG('FBN')
     A          K FTDATE
     A          K FTTERM
     A          K FTCLID
