     A*___________________________
     A* SYSPED / Fraktbrev 'T', Status
     A*"""""""""""""""""""""""""""
     A          R DOKUTR                    PFILE(DOKUT)
     A                                      TEXT('Status')
     A          K DTST
