     A                                      REF(DSPFFDF)
     A          R DSPFFDF2R
     A            WHFLDI    R
     A            XXFTXT       105A
     A            WHFOBO    R
     A            SLUPOS         5S 0       COLHDG('SLUTT POS.')
     A            WHFLDB    R
     A            WHFLDD    R
     A            WHFLDP    R
     A            WHFLDT    R
