     A*__________________________________
     A* SYSPED / DUMMIFIL (SAMME SOM SKPO1)
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SKPOSR
     A            SKKN      R               REFFLD(KN)
     A            SKPOS          7A         COLHDG('POSISJON')
     A            SKAVD     R               REFFLD(AVD)
     A            SKOPD     R               REFFLD(OPD)
     A          K SKKN
     A          K SKPOS
