     A          R RCD000
     A                                  1 27'FAKTURA MOTTATT ELEKTRONISK'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A            Z3039         17   O  5  5
     A            Z3036         35   O  6  5
     A            Z3042         35   O  7  5
     A            Z3251          9   O  8  5
     A            Z3164         35   O  8 16
     A                                 13  5'RESKONTROFØRT'
     A            Å3039         17   O 14  5
     A            Å3036         35   O 15  5
     A            Å3042         35   O 16  5
     A            Å3251          9   O 17  5
     A            Å3164         35   O 17 16
     A                                 21 44'FAKTURANUMMER:'
     A            X1004         17   O 21 60
     A                                 22 44'FAKTURADATO__:'
     A            X2380          8   O 22 60
     A                                 23 44'FORFALLSDATO_:'
     A            X2380B         8   O 23 60
     A                                 24 44'BELØP________:'
     A            X5004         18   O 24 60
     A                                 25 44'HERAV MOMS___:'
     A            X5004M        18   O 25 60
     A                                 26 44'BILAGSNUMMER_:'
     A            KABNR          7  0O 26 60EDTCDE(Z)
     A                                 27 44'SIDE_________:'
     A            XPAG1          3  0O 27 60EDTCDE(Z)
     A                                 27 64'AV'
     A            XPAG2          3  0O 27 67EDTCDE(Z)
     A                                 29  5'==================================+
     A                                      ===================================+
     A                                      ===================================+
     A                                      ===================================+
     A                                      ==================================='
     A                                 30  5'FØLGENDE SENDINGER ER GRUNNLAG FOR'
     A                                 30 39' DENNE FAKTURA.'
     A                                 32  5'SENDINGSNUMMER'
     A                                       UNDERLINE
     A                                 32 23'SENDERS REF.'
     A                                       UNDERLINE
     A                                 32 37'MOTTAKER'
     A                                       UNDERLINE
     A                                 32 64'UTLEV.STED'
     A                                       UNDERLINE
     A                                 32 81'DATO'
     A                                       UNDERLINE
     A                                 32 88'SYSPED-REF'
     A                                       UNDERLINE
     A                                 32101'ANTALL'
     A                                       UNDERLINE
     A                                 32109'VEKT'
     A                                       UNDERLINE
     A                                 32117'FR.VEKT'
     A                                       UNDERLINE
     A                                 32125'FRAKT'
     A                                       UNDERLINE
     A                                 32135'RABATT'
     A                                       UNDERLINE
     A                                 32145'TOTAL'
     A                                       UNDERLINE
     A          R RCD001                     SPACEB(1)
     A            X1154B        17   O     5
     A            X1154         12   O    23
     A            X3036A        25   O    37
     A            X3164         15   O    64
     A            HEDTD          2  0O    81EDTCDE(Z)
     A            HEDTM          2  0O    83EDTCDE(Z)
     A            HEDTÅ          2  0O    85EDTCDE(Z)
     A            HEAVD          4  0O    88EDTCDE(Z)
     A            HEOPD          7  0O    93EDTCDE(Z)
     A            X6314A         7   O   101
     A            X6314B         7   O   109
     A            X6060A         7   O   117
     A            X5004A         9   O   125
     A            X5004B         9   O   135
     A            X5004C         9   O   145
