      * DENNE FILEN KAN ENDRES ETTER KUNDERS ØNSKER.
      * OBS! FILEN SKAL LIGGE I SYEDIE HOS KUNDER.
     A                                      UNIQUE
     A          R E125F2R
     A            EF2ST          1A         COLHDG('STATUS')
     A            EF2MN          9S 0       COLHDG('MELDINGSNR.')
     A            EF2AVD         3S 0       COLHDG('AVDELING')
     A            EF2FN         10A         COLHDG('FAKT./KRE.NOTANR')
     A            EF2MVA         1A         COLHDG('MOMSKODE')
     A            EF2TOT        11S 2       COLHDG('TOTALL')
     A            EF2UID        10A         COLHDG('BRUKER-ID')
     A          K EF2AVD
     A          K EF2FN
