     A          R E125FR
     A            XFK            1A         COLHDG('FAKTURA/KRE.NOTA')
     A            XFN           10A         COLHDG('F/K-NR.')
     A            XDT            8S 0       COLHDG('MELDINGSDATO')
     A            XTIDW          4S 0       COLHDG('MELDINGSTID')
     A            XBN           15A         COLHDG('BESTILLINGSNR.')
     A            XKON           7A         COLHDG('KUNDERS ORDRENR.')
     A            XDTF           8S 0       COLHDG('FORFALLSDATO')
     A            XAVD           3  0       COLHDG('AVDELING')
     A            XNAS20        20A         COLHDG('AVSENDERSNAVN')
     A            XTOTAL        11S 2       COLHDG('FAKTURASUM')
     A            XGODKJ         3A         COLHDG('BEHANDLINGSSTATUS')
     A            WSTXT1        40A         COLHDG('BEGRUNNELSE 1')
     A            WSTXT2        40A         COLHDG('BEGRUNNELSE 2')
     A            WSTXT3        40A         COLHDG('BEGRUNNELSE 3')
     A            WSTXT4        40A         COLHDG('BEGRUNNELSE 4')
     A            WSTXT5        40A         COLHDG('BEGRUNNELSE 5')
     A          K XGODKJ
     A          K XFN
