     A          R E125P01
     A                                  2  2'UTSKRIFT AV BEHANDLET FAKTURA/KRED-
     A                                      ITNOTA'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                  2 66'E125R_93A'
     A                                  2 84'DATO:'
     A                                  2 90DATE EDTCDE(Y)
     A                                  2106'SIDE:'
     A                                  2112PAGNBR EDTCDE(Z)
     A                                  4  2'L.nr. F/K F/K-nr.    Avd Selgersna-
     A                                      vn          F./k.totall   Meld. dat-
     A                                      o/tid   Bestillingsnr.  Ordrenr God-
     A                                      kj?'
     A                                  5  2'-----------------------------------
     A                                      ------------------------------------
     A                                      ------------------------------------
     A                                      ----------'
     A                                  6  2' '
     A          R E125P02
     A            XLNR           5  0O     2EDTCDE(Z)
     A            XFK            1   O     8
     A            XFN           10   O    12
     A            XAVD           3  0O    23EDTCDE(Z)
     A            XNAS20        20   O    27
     A            XTOTAL        11  2O    48EDTCDE(L)
     A            XDT            8  0O    62EDTWRD('    .  .  ')
     A            XTID           4  0O    73EDTWRD('0  .  ')
     A            XBN           15   O    79
     A            XKON           7   O    95
     A*           XDTF           8  0O    89EDTWRD('    .  .  ')
     A            XGODKJ         3   O   103SPACEA(1)
     A          R E125P03
     A            XTXT          40   O     8SPACEA(1)
