     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      ALTPAGEUP
     A                                      ALTPAGEDWN
     A                                      CF03(03 'End')
     A                                      CF12(12 'Cancel')
     A                                      HELP
      *
     A          R E131DB                    SFL
     A                                      SFLNXTCHG
     A            MMN            7S 0H
     A            ZALT           1A  B  7  3VALUES(' ' 'd' 'D' '1' '4' '5' '6')
     A            ZAVS          22A  O  7  6
     A            ZMOTT         22A  O  7 30
     A            ZANT           5A  O  7 54
     A            ZVEKT         10A  O  7 61
     A            ZDATL          8A  O  7 72
      *
     A          R E131DC                    SFLCTL(E131DB)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CA05(05 'Refresh')
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND(*MORE)
     A                                  1  2'EDI'
     A                                      COLOR(BLU)
     A                                  1 25MSGCON(032 EDI0485 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 74'E131D B'
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  3  2MSGCON(029 EDI0602 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  4MSGCON(051 EDI0487 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(003 EDI0609 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6  6MSGCON(008 EDI0410 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6 30MSGCON(009 EDI0411 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6 53MSGCON(006 EDI0412 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6 61MSGCON(006 EDI0413 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6 72MSGCON(008 EDI0492 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R E131DD
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      OVERLAY
     A            MSGNR          7A  P
     A                                 23  2MSGCON(010 EDI0803 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 15MSGCON(010 EDI0805 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 28MSGCON(010 EDI0812 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R E131DF
     A                                      OVERLAY
     A            MSGNR          7A  P
     A                                  1  2'EDI'
     A                                      COLOR(BLU)
     A                                  1 27MSGCON(034 EDI0485 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 72'EDI131D F'
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(023 EDI0602 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 30MSGCON(025 EDI0496 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                  5  2MSGCON(036 EDI0425 *LIBL/SYMSGF)
     A            ÆSAVD          4Y 0B  5 41EDTCDE(4)
     A                                  6  4MSGCON(034 EDI0498 *LIBL/SYMSGF)
     A            ÆSSG           3A  B  6 41
     A                                  7  4MSGCON(034 EDI0427 *LIBL/SYMSGF)
     A            ÆWRKOP         1A  B  7 41VALUES(' ' 'J' 'N' 'Y')
     A                                  7 55MSGCON(008 EDI0607 *LIBL/SYMSGF)
     A                                  9  2MSGCON(036 EDI0501 *LIBL/SYMSGF)
     A            Æ2782          8A  B  9 41
     A                                  9 55MSGCON(008 EDI0605 *LIBL/SYMSGF)
     A                                 11  2MSGCON(036 EDI0503 *LIBL/SYMSGF)
     A            Æ4440A        70A  B 12  2
     A            Æ4440B        70A  B 13  2
     A            Æ4440C        70A  B 14  2
     A            Æ4440D        70A  B 15  2
     A            Æ4440E        70A  B 16  2
     A                                 18  4MSGCON(034 EDI0505 *LIBL/SYMSGF)
     A            Æ3413         17A  B 18 41
     A                                 19  6MSGCON(032 EDI0504 *LIBL/SYMSGF)
     A            Æ4774         35A  B 19 41
     A                                 23  2MSGCON(010 EDI0803 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 15MSGCON(010 EDI0812 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
