     A          R RCD000
     A                                  1 27'TRANSPORTKONTRAKT'
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                  5  5'TRANSPORTØR      :'
     A                                      UNDERLINE
     A            X3039         17   O  5 25
     A            X3036         35   O  6 25
     A            X3042         35   O  7 25
     A            X3251          9   O  8 25
     A            X3164         35   O  8 36
     A                                 11  5'SENDER           :'
     A                                      UNDERLINE
     A            Z3039         17   O 11 25
     A            Z3036         35   O 12 25
     A            Z3042         35   O 13 25
     A            Z3251          9   O 14 25
     A            Z3164         35   O 14 36
     A                                 17  5'MOTTAGER         :'
     A                                      UNDERLINE
     A            Å3039         17   O 17 25
     A            Å3036         35   O 18 25
     A            Å3042         35   O 19 25
     A            Å3251          9   O 20 25
     A            Å3164         35   O 20 36
     A                                 29  5'MOTTAKSDATO      :'
     A                                      UNDERLINE
     A                                 29 25DATE EDTCDE(Y)
     A                                 30  5'SENDNINGSNUMMER  :'
     A                                       UNDERLINE
     A            X1004         17   O 30 25
     A                                 31  5'INNLEVERINGSDATO :'
     A                                       UNDERLINE
     A            X2782          8  0O 31 25EDTCDE(Z)
     A                                 32  5'SYSPED400 REF    :'
     A                                       UNDERLINE
     A            HEAVD          4  0O 32 25EDTCDE(Z)
     A            HEOPD          7  0O 32 30EDTCDE(Z)
     A                                 33  7'SENDERS REF.   :'
     A                                       UNDERLINE
     A            X1154         35   O 33 25
     A                                 36  5'ANTALL           :'
     A                                       UNDERLINE
     A            X7224          7   O 36 25
     A                                 37  7'VEKT           :'
     A                                       UNDERLINE
     A            X6314A         7   O 37 25
     A                                 38  9'FR.VEKT      :'
     A                                       UNDERLINE
     A            X6060A         7   O 38 25
     A                                 42  5'FRAKT            :'
     A                                       UNDERLINE
     A            X5004A         9   O 42 25
     A                                 43  7'RABATT         :'
     A                                       UNDERLINE
     A            X5004B         9   O 43 25
     A                                 44  9'FORSIKRING   :'
     A                                       UNDERLINE
     A            X5004D         9   O 44 25
     A                                 45 11'TOTAL AVS. :'
     A                                       UNDERLINE
     A            X5004C         9   O 45 25
     A                                 46 11'ETTERKRAV  :'
     A                                       UNDERLINE
     A            X5004E         9   O 46 25
     A                                 47 11'GIROBELØP  :'
     A                                       UNDERLINE
     A            X5004F         9   O 47 25
     A                                 50  5'SKADE/MANKO      :'
     A                                       UNDERLINE
     A            X4440A        70   O 51  5
     A            X4440B        70   O 52  5
     A            X4440C        70   O 53  5
     A            X4440D        70   O 54  5
     A            X4440E        70   O 55  5
