     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      ALTPAGEUP
     A                                      ALTPAGEDWN
     A                                      HELP
      *
     A          R E152DB                    SFL
     A            ZDATA         79   O  2  2
     A N41                                  COLOR(GRN)
     A  41                                  COLOR(WHT)
      *
     A          R E152DC                    SFLCTL(E152DB)
     A                                      SFLSIZ(0023)
     A                                      SFLPAG(0022)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND(*MORE)
     A                                  1  2'EDI    '
     A                                      COLOR(BLU)
     A                                  1 74'E152D B'
     A                                      COLOR(BLU)
     A            ZRN            4S 0O  1 60SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1 26MSGCON(028 EDI0525 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
