     A          R E154FR
     A            E154LK         2A         COLHDG('LANDKODE')
     A            E154FC         6S 0       COLHDG('LIST ACCOUNT')
     A          K E154LK
