     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/SR)
     A                                      PRINT
      *
     A          R E160DA
     A                                      WINDOW(*DFT 12 50 *NOMSGLIN)
     A                                      CF03(03 'Exit')
     A                                      CF10(10 'Send status')
     A                                      OVERLAY
     A            MSGNR          7A  P
     A                                  1  1'E160D'
     A                                  1 17MSGCON(014 EDI0538 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  1MSGCON(041 EDI0544 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  3MSGCON(021 EDI0539 *LIBL/SYMSGF)
     A            ZMAWB         12A  B  5 27
     A  31                                  DSPATR(PC)
     A                                  6  3MSGCON(021 EDI0540 *LIBL/SYMSGF)
     A            ZHAWB         24A  B  6 27
     A  32                                  DSPATR(PC)
     A                                  7  3MSGCON(021 EDI0541 *LIBL/SYMSGF)
     A            ZPLDLV         4A  B  7 27
     A  33                                  DSPATR(PC)
     A                                  8  3MSGCON(021 EDI0542 *LIBL/SYMSGF)
     A            ZSIGN         24A  B  8 27
     A  34                                  DSPATR(PC)
     A                                  9  3MSGCON(021 EDI0543 *LIBL/SYMSGF)
     A            ZNOPK          9A  B  9 27
     A  35                                  DSPATR(PC)
     A                                 11  1MSGCON(010 EDI0803 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 11 14MSGCON(008 EDI0810 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        50A  O 12  1MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
      * DUMMY FOR ASSUME
     A          R E160DB
     A                                      ASSUME
     A                                 24 79' '
