      * OBS! LAGE OGSÅ LOAD MED NAVN = E170PBARK
     A          R E170PB1
     A                                  2  5'TVINN-FAKTURA MOTTATT ELEKTRONISK'
     A                                      HIGHLIGHT
     A            XKOPI          6A     2 39
     A                                  2 64'FAKTURANUMMER:'
     A            KAFNR         13A     2 80
     A                                  3  5'*  K O N T R O L L I S T E  *'
     A                                      HIGHLIGHT
     A                                  3 64'FAKTURADATO__:'
     A            XKAFDT         8S 0   3 80EDTWRD('  .  .    ')
     A                                  4  5'FAKTURASENDER'
     A            XTNAVN        35A     4 20
     A                                  4 64'FORFALLSDATO_:'
     A            XKAFFDT        8S 0   4 80EDTWRD('  .  .    ')
     A            XTADR1        35A     5 20
     A                                  5 64'BILAGSNUMMER_:'
     A            KABNR          7  0O  5 80EDTCDE(Z)
     A            XTADR2        35A     6 20
     A                                  6 64'SIDE_________:'
     A            XPAG1          3  0O  6 80EDTCDE(Z)
     A*                                 6 84'AV'
     A*           XPAG2          3  0O  6 87EDTCDE(Z)
     A            XTPN           4S 0   7 20
     A            XTPS          35A     7 25
     A                                  8  5'==================================+
     A                                      ===================================+
     A                                      ===================================+
     A                                      ========'
     A                                  9  5'FØLGENDE SENDINGER ER GRUNNLAG FOR'
     A                                  9 39' DENNE FAKTURA.'
     A                                 10  5'NR.'
     A                                 10  9'SYSPED-REF'
     A                                 10 22'TVINN-REF'
     A                                 10 40'MOTTAKER'
     A                                 10 76'     KOSTNAD'
     A                                 10 90'     INNTEKT'
     A                                 10104'        DIFF'
     A          R E170PB2                    SPACEB(1)
     A            XLNR           3S 0      5EDTCDE(Z)
     A N41        SIAVD          4S 0      9EDTCDE(Z)
     A N41        SITDN          7S 0     14EDTCDE(Z)
     A  41                                 9'*IKKE MATCH*'
     A                                      HIGHLIGHT
     A            SITLE          6A       22
     A            SITLL         10A       29
     A            XKNAVN        35A       40
     A            KBBLHB1       11S 2     76EDTCDE(L)
     A            FASUM         11S 2     90EDTCDE(L)
N24  A            STAR           1       103
     A            DIFF          11S 2    104EDTCDE(L)
S24  A*           STAR           1       117
      *
     A          R E170PB3                    SPACEB(2)
     A*                                   44'MOMS_________:'
     A*           XTOTMV1       11S 2     76EDTCDE(L)
     A                                    44'TOTALSUM_____:'
     A            KABL1         11S 2     76EDTCDE(L)
N16  A            FASUMT        11S 2     90EDTCDE(L)
S21  A*           STAR           1       103
N16  A            DIFFT         11S 2    104EDTCDE(L)
