     A                                      REF(EFR01B)
     A          R ADRR
      * Key
     A            AMN       R               REFFLD(ØMN)
     A            AGN       R               REFFLD(ØGN)
     A            AREP0     R               REFFLD(ØREP0)
     A            AREP1     R               REFFLD(ØREP1)
     A            AREP2     R               REFFLD(ØREP2)
     A            AREP3     R               REFFLD(ØREP3)
     A            AREP4     R               REFFLD(ØREP4)
     A            AREP5     R               REFFLD(ØREP5)
     A            AREP6     R               REFFLD(ØREP6)
     A            AREP7     R               REFFLD(ØREP7)
     A            AREP8     R               REFFLD(ØREP8)
      * C817 Address usage
     A            A3299     R               REFFLD(Ø3299)
     A            A3131     R               REFFLD(Ø3131)
     A            A3475     R               REFFLD(Ø3475)
      * C090 Address details
     A            A3477     R               REFFLD(Ø3477)
     A            A3286A    R               REFFLD(Ø3286)
     A            A3286B    R               REFFLD(Ø3286)
     A            A3286C    R               REFFLD(Ø3286)
     A            A3286D    R               REFFLD(Ø3286)
     A            A3286E    R               REFFLD(Ø3286)
      *
     A            A3164     R               REFFLD(Ø3164)
     A            A3251     R               REFFLD(Ø3251)
     A            A3207     R               REFFLD(Ø3207)
      * C819 Country sub-entity details
     A            A3229     R               REFFLD(Ø3229)
     A            A1131A    R               REFFLD(Ø1131)
     A            A3055A    R               REFFLD(Ø3055)
     A            A3228     R               REFFLD(Ø3228)
      * C517 Location identification
     A            A3225     R               REFFLD(Ø3225)
     A            A1131B    R               REFFLD(Ø1131)
     A            A3055B    R               REFFLD(Ø3055)
     A            A3224     R               REFFLD(Ø3224)
      * Key
     A          K AMN
     A          K AGN
     A          K AREP0
     A          K AREP1
     A          K AREP2
     A          K AREP3
     A          K AREP4
     A          K AREP5
     A          K AREP6
     A          K AREP7
     A          K AREP8
