     A                                      REF(EFR94B)
     A          R AJTR
      * Key
     A            AMN       R               REFFLD(ØMN)
     A            AGN       R               REFFLD(ØGN)
     A            AREP0     R               REFFLD(ØREP0)
     A            AREP1     R               REFFLD(ØREP1)
     A            AREP2     R               REFFLD(ØREP2)
     A            AREP3     R               REFFLD(ØREP3)
     A            AREP4     R               REFFLD(ØREP4)
     A            AREP5     R               REFFLD(ØREP5)
     A            AREP6     R               REFFLD(ØREP6)
     A            AREP7     R               REFFLD(ØREP7)
     A            AREP8     R               REFFLD(ØREP8)
      *
     A            A4465     R               REFFLD(Ø4465)
      *
     A            A1082     R               REFFLD(Ø1082)
      * Key
     A          K AMN
     A          K AGN
     A          K AREP0
     A          K AREP1
     A          K AREP2
     A          K AREP3
     A          K AREP4
     A          K AREP5
     A          K AREP6
     A          K AREP7
     A          K AREP8
