     A                                      REF(EFR901)
     A          R APIR
      * Key
     A            AMN       R               REFFLD(ØMN)
     A            AGN       R               REFFLD(ØGN)
     A            AREP0     R               REFFLD(ØREP0)
     A            AREP1     R               REFFLD(ØREP1)
     A            AREP2     R               REFFLD(ØREP2)
     A            AREP3     R               REFFLD(ØREP3)
     A            AREP4     R               REFFLD(ØREP4)
     A            AREP5     R               REFFLD(ØREP5)
     A            AREP6     R               REFFLD(ØREP6)
     A            AREP7     R               REFFLD(ØREP7)
     A            AREP8     R               REFFLD(ØREP8)
      *
     A            A4043     R               REFFLD(Ø4043)
      * C262 Reason for change
     A            A4295     R               REFFLD(Ø4295)
     A            A4294     R               REFFLD(Ø4294)
      * C134 REFERENCE PRICE INFORMATION
     A            A5110     R               REFFLD(Ø5110)
     A            A5375     R               REFFLD(Ø5375)
     A            A5387     R               REFFLD(Ø5387)
     A            A5284     R               REFFLD(Ø5284)
     A            A6411A    R               REFFLD(Ø6411)
      * C138 Price multiplier information
     A            A5394     R               REFFLD(Ø5394)
     A            A5393     R               REFFLD(Ø5393)
      * C280 QUANTITY/RANGE
     A            A6060A    R               REFFLD(Ø6060)
     A            A6060B    R               REFFLD(Ø6060)
     A            A6411B    R               REFFLD(Ø6411)
      * C282 PERIOD
     A            A2001A    R               REFFLD(Ø2001)
     A            A2001B    R               REFFLD(Ø2001)
      * C284 AMOUNT/RANGE
     A            A5383     R               REFFLD(Ø5383)
     A            A5004A    R               REFFLD(Ø5004)
     A            A5004B    R               REFFLD(Ø5004)
      * Key
     A          K AMN
     A          K AGN
     A          K AREP0
     A          K AREP1
     A          K AREP2
     A          K AREP3
     A          K AREP4
     A          K AREP5
     A          K AREP6
     A          K AREP7
     A          K AREP8
