     A                                      REF(EFR93A)
     A          R ATTR
      * Key
     A            AMN       R               REFFLD(ØMN)
     A            AGN       R               REFFLD(ØGN)
     A            AREP0     R               REFFLD(ØREP0)
     A            AREP1     R               REFFLD(ØREP1)
     A            AREP2     R               REFFLD(ØREP2)
     A            AREP3     R               REFFLD(ØREP3)
     A            AREP4     R               REFFLD(ØREP4)
     A            AREP5     R               REFFLD(ØREP5)
     A            AREP6     R               REFFLD(ØREP6)
     A            AREP7     R               REFFLD(ØREP7)
     A            AREP8     R               REFFLD(ØREP8)
      *
     A            A9017     R               REFFLD(Ø9017)
      * C955 Attribute Type
     A            A9021     R               REFFLD(Ø9021)
     A            A1131A    R               REFFLD(Ø1131)
     A            A3055A    R               REFFLD(Ø3055)
      * C956 Attribute Details
     A            A9019     R               REFFLD(Ø9019)
     A            A1131B    R               REFFLD(Ø1131)
     A            A3055B    R               REFFLD(Ø3055)
     A            A9018     R               REFFLD(Ø9018)
      * Key
     A          K AMN
     A          K AGN
     A          K AREP0
     A          K AREP1
     A          K AREP2
     A          K AREP3
     A          K AREP4
     A          K AREP5
     A          K AREP6
     A          K AREP7
     A          K AREP8
