     A                                      REF(EFR04A)
     A          R BUSR
      * Key
     A            BMN       R               REFFLD(ØMN)
     A            BGN       R               REFFLD(ØGN)
     A            BREP0     R               REFFLD(ØREP0)
     A            BREP1     R               REFFLD(ØREP1)
     A            BREP2     R               REFFLD(ØREP2)
     A            BREP3     R               REFFLD(ØREP3)
     A            BREP4     R               REFFLD(ØREP4)
     A            BREP5     R               REFFLD(ØREP5)
     A            BREP6     R               REFFLD(ØREP6)
     A            BREP7     R               REFFLD(ØREP7)
     A            BREP8     R               REFFLD(ØREP8)
      * C521 Business Function
     A            B4027     R               REFFLD(Ø4027)
     A            B4025     R               REFFLD(Ø4025)
     A            B1131A    R               REFFLD(Ø1131)
     A            B3055A    R               REFFLD(Ø3055)
     A            B4022     R               REFFLD(Ø4022)
      *
     A            B3279     R               REFFLD(Ø3279)
      *
     A            B4487     R               REFFLD(Ø4487)
      * C551 Bank Operation
     A            B4383     R               REFFLD(Ø4383)
     A            B1131B    R               REFFLD(Ø1131)
     A            B3055B    R               REFFLD(Ø3055)
      *
     A            B4463     R               REFFLD(Ø4463)
      * Key
     A          K BMN
     A          K BGN
     A          K BREP0
     A          K BREP1
     A          K BREP2
     A          K BREP3
     A          K BREP4
     A          K BREP5
     A          K BREP6
     A          K BREP7
     A          K BREP8
