     A                                      REF(EFR95B)
     A          R CCIR
      * Key
     A            CMN       R               REFFLD(ØMN)
     A            CGN       R               REFFLD(ØGN)
     A            CREP0     R               REFFLD(ØREP0)
     A            CREP1     R               REFFLD(ØREP1)
     A            CREP2     R               REFFLD(ØREP2)
     A            CREP3     R               REFFLD(ØREP3)
     A            CREP4     R               REFFLD(ØREP4)
     A            CREP5     R               REFFLD(ØREP5)
     A            CREP6     R               REFFLD(ØREP6)
     A            CREP7     R               REFFLD(ØREP7)
     A            CREP8     R               REFFLD(ØREP8)
      *
     A            C7059     R               REFFLD(Ø7059)
      * C502 Measurement Details
     A            C6313     R               REFFLD(Ø6313)
     A            C6321     R               REFFLD(Ø6321)
     A            C6155     R               REFFLD(Ø6155)
     A            C6154     R               REFFLD(Ø6154)
      * C240 Product Characteristic
     A            C7037     R               REFFLD(Ø7037)
     A            C1131     R               REFFLD(Ø1131)
     A            C3055     R               REFFLD(Ø3055)
     A            C7036A    R               REFFLD(Ø7036)
     A            C7036B    R               REFFLD(Ø7036)
      * Key
     A          K CMN
     A          K CGN
     A          K CREP0
     A          K CREP1
     A          K CREP2
     A          K CREP3
     A          K CREP4
     A          K CREP5
     A          K CREP6
     A          K CREP7
     A          K CREP8
