     A                                      REF(EFR03A)
     A          R CEDR
      * Key
     A            CMN       R               REFFLD(ØMN)
     A            CGN       R               REFFLD(ØGN)
     A            CREP0     R               REFFLD(ØREP0)
     A            CREP1     R               REFFLD(ØREP1)
     A            CREP2     R               REFFLD(ØREP2)
     A            CREP3     R               REFFLD(ØREP3)
     A            CREP4     R               REFFLD(ØREP4)
     A            CREP5     R               REFFLD(ØREP5)
     A            CREP6     R               REFFLD(ØREP6)
     A            CREP7     R               REFFLD(ØREP7)
     A            CREP8     R               REFFLD(ØREP8)
      *
     A            C1501     R               REFFLD(Ø1501)
      * C079 COMPUTER ENVIROMENT IDENTIFICATION
     A            C1511     R               REFFLD(Ø1511)
     A            C1131     R               REFFLD(Ø1131)
     A            C3055     R               REFFLD(Ø3055)
     A            C1510     R               REFFLD(Ø1510)
     A            C1056     R               REFFLD(Ø1056)
     A            C1058     R               REFFLD(Ø1058)
     A            C7402     R               REFFLD(Ø7402)
      *
     A            C9448     R               REFFLD(Ø9448)
      * Key
     A          K CMN
     A          K CGN
     A          K CREP0
     A          K CREP1
     A          K CREP2
     A          K CREP3
     A          K CREP4
     A          K CREP5
     A          K CREP6
     A          K CREP7
     A          K CREP8
