      * OBS! - I VERSJON 11 BØR FIRMA DROPPES FRA ECMSG
      * OBS! - DA BORTFALLER BEHOV FOR ECMSG4
     A          R ECMSGR                    PFILE(ECMSG)
     A          K ECCNO
     A          K ECSR
     A          K EC0065
