     A          R ECMSGR                    PFILE(ECMSG)
     A          K ECIIDC
     A          K ECIIDI
     A          K ECSR
     A          K EC0065
