     A                                      REF(EFR95A)
     A          R CODR
      * Key
     A            CMN       R               REFFLD(ØMN)
     A            CGN       R               REFFLD(ØGN)
     A            CREP0     R               REFFLD(ØREP0)
     A            CREP1     R               REFFLD(ØREP1)
     A            CREP2     R               REFFLD(ØREP2)
     A            CREP3     R               REFFLD(ØREP3)
     A            CREP4     R               REFFLD(ØREP4)
     A            CREP5     R               REFFLD(ØREP5)
     A            CREP6     R               REFFLD(ØREP6)
     A            CREP7     R               REFFLD(ØREP7)
     A            CREP8     R               REFFLD(ØREP8)
      * C823 TYPE OF UNIT/COMPONENT
     A            C7505     R               REFFLD(Ø7505)
     A            C1131A    R               REFFLD(Ø1131)
     A            C3055A    R               REFFLD(Ø3055)
     A            C7504     R               REFFLD(Ø7504)
      * C824 COMPONENT MATERIAL
     A            C7507     R               REFFLD(Ø7507)
     A            C1131B    R               REFFLD(Ø1131)
     A            C3055B    R               REFFLD(Ø3055)
     A            C7506     R               REFFLD(Ø7506)
      * Key
     A          K CMN
     A          K CGN
     A          K CREP0
     A          K CREP1
     A          K CREP2
     A          K CREP3
     A          K CREP4
     A          K CREP5
     A          K CREP6
     A          K CREP7
     A          K CREP8
