     A                                      REF(EFR04A)
     A          R COTR
      * Key
     A            CMN       R               REFFLD(ØMN)
     A            CGN       R               REFFLD(ØGN)
     A            CREP0     R               REFFLD(ØREP0)
     A            CREP1     R               REFFLD(ØREP1)
     A            CREP2     R               REFFLD(ØREP2)
     A            CREP3     R               REFFLD(ØREP3)
     A            CREP4     R               REFFLD(ØREP4)
     A            CREP5     R               REFFLD(ØREP5)
     A            CREP6     R               REFFLD(ØREP6)
     A            CREP7     R               REFFLD(ØREP7)
     A            CREP8     R               REFFLD(ØREP8)
      *
     A            C5047     R               REFFLD(Ø5047)
      * C953 Contribution Type
     A            C5049     R               REFFLD(Ø5049)
     A            C1131A    R               REFFLD(Ø1131)
     A            C3055A    R               REFFLD(Ø3055)
     A            C5048     R               REFFLD(Ø5048)
      * C522 Instruction
     A            C4403     R               REFFLD(Ø4403)
     A            C4401     R               REFFLD(Ø4401)
     A            C1131B    R               REFFLD(Ø1131)
     A            C3055B    R               REFFLD(Ø3055)
     A            C4400     R               REFFLD(Ø4400)
      * C203 Rate/Tariff Class
     A            C5243     R               REFFLD(Ø5243)
     A            C1131C    R               REFFLD(Ø1131)
     A            C3055C    R               REFFLD(Ø3055)
     A            C5242     R               REFFLD(Ø5242)
     A            C5275A    R               REFFLD(Ø5275)
     A            C1131D    R               REFFLD(Ø1131)
     A            C3055D    R               REFFLD(Ø3055)
     A            C5275B    R               REFFLD(Ø5275)
     A            C1131E    R               REFFLD(Ø1131)
     A            C3055E    R               REFFLD(Ø3055)
      * C960 Reason For Change
     A            C4295     R               REFFLD(Ø4295)
     A            C1131F    R               REFFLD(Ø1131)
     A            C3055F    R               REFFLD(Ø3055)
     A            C4294     R               REFFLD(Ø4294)
      * Key
     A          K CMN
     A          K CGN
     A          K CREP0
     A          K CREP1
     A          K CREP2
     A          K CREP3
     A          K CREP4
     A          K CREP5
     A          K CREP6
     A          K CREP7
     A          K CREP8
