     A                                      REF(EFR901)
     A          R CTAR
      * Key
     A            CMN       R               REFFLD(ØMN)
     A            CGN       R               REFFLD(ØGN)
     A            CREP0     R               REFFLD(ØREP0)
     A            CREP1     R               REFFLD(ØREP1)
     A            CREP2     R               REFFLD(ØREP2)
     A            CREP3     R               REFFLD(ØREP3)
     A            CREP4     R               REFFLD(ØREP4)
     A            CREP5     R               REFFLD(ØREP5)
     A            CREP6     R               REFFLD(ØREP6)
     A            CREP7     R               REFFLD(ØREP7)
     A            CREP8     R               REFFLD(ØREP8)
      *
     A            C3139     R               REFFLD(Ø3139)
      * C056
     A            C3413     R               REFFLD(Ø3413)
     A            C3412     R               REFFLD(Ø3412)
      * C076
     A            C3148A    R               REFFLD(Ø3148)
     A            C3153A    R               REFFLD(Ø3153)
      * C076
     A            C3148B    R               REFFLD(Ø3148)
     A            C3153B    R               REFFLD(Ø3153)
      * C076
     A            C3148C    R               REFFLD(Ø3148)
     A            C3153C    R               REFFLD(Ø3153)
      * C076
     A            C3148D    R               REFFLD(Ø3148)
     A            C3153D    R               REFFLD(Ø3153)
      * C076
     A            C3148E    R               REFFLD(Ø3148)
     A            C3153E    R               REFFLD(Ø3153)
      * Key
     A          K CMN
     A          K CGN
     A          K CREP0
     A          K CREP1
     A          K CREP2
     A          K CREP3
     A          K CREP4
     A          K CREP5
     A          K CREP6
     A          K CREP7
     A          K CREP8
