     A                                      REF(EFR96A)
     A          R DAMR
      * Key
     A            DMN       R               REFFLD(ØMN)
     A            DGN       R               REFFLD(ØGN)
     A            DREP0     R               REFFLD(ØREP0)
     A            DREP1     R               REFFLD(ØREP1)
     A            DREP2     R               REFFLD(ØREP2)
     A            DREP3     R               REFFLD(ØREP3)
     A            DREP4     R               REFFLD(ØREP4)
     A            DREP5     R               REFFLD(ØREP5)
     A            DREP6     R               REFFLD(ØREP6)
     A            DREP7     R               REFFLD(ØREP7)
     A            DREP8     R               REFFLD(ØREP8)
      *
     A            D7493     R               REFFLD(Ø7493)
      * C821 TYPE OF DAMAGE
     A            D7501     R               REFFLD(Ø7501)
     A            D1131A    R               REFFLD(Ø1131)
     A            D3055A    R               REFFLD(Ø3055)
     A            D7500     R               REFFLD(Ø7500)
      * C822 DAMAGE AREA
     A            D7503     R               REFFLD(Ø7503)
     A            D1131B    R               REFFLD(Ø1131)
     A            D3055B    R               REFFLD(Ø3055)
     A            D7502     R               REFFLD(Ø7502)
      * C825 DAMAGE SEVERITY
     A            D7509     R               REFFLD(Ø7509)
     A            D1131C    R               REFFLD(Ø1131)
     A            D3055C    R               REFFLD(Ø3055)
     A            D7508     R               REFFLD(Ø7508)
      * C826 ACTION
     A            D1229     R               REFFLD(Ø1229)
     A            D1131D    R               REFFLD(Ø1131)
     A            D3055D    R               REFFLD(Ø3055)
     A            D1228     R               REFFLD(Ø1228)
      * Key
     A          K DMN
     A          K DGN
     A          K DREP0
     A          K DREP1
     A          K DREP2
     A          K DREP3
     A          K DREP4
     A          K DREP5
     A          K DREP6
     A          K DREP7
     A          K DREP8
