     A          R EDI10F8R
     A            FPATH        256
     A            FNAME        120
     A            FTIME         10
     A          K FTIME
