     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/EDIM)
     A                                      PRINT
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(12 'Annuller')
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
      *
     A          R EDI60DA
     A                                      OVERLAY
     A            M0065     R        H
     A                                  1  2'EDI'
     A                                      COLOR(BLU)
     A                                  1 28MSGCON(014 EDI0200 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 73'EDI60D B'
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(036 EDI0188 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  4MSGCON(008 EDI0704 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(003 EDI0609 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6  7MSGCON(009 EDI0191 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6 24MSGCON(004 EDI0192 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6 32'Tst'
     A                                      COLOR(WHT)
     A                                  6 37'MSG ID'
     A                                      COLOR(WHT)
     A                                  6 44'Funk'
     A                                      COLOR(WHT)
     A                                  6 50MSGCON(004 EDI0196 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6 57MSGCON(004 EDI0197 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6 64'Vers'
     A                                      COLOR(WHT)
     A                                  6 71'Exp '
     A                                      COLOR(WHT)
     A                                  7  3'4'
     A                                      COLOR(RED)
     A            MAVD      R        O  7  6
     A            MTDN      R        O  7 12
     A            MVEN      R        O  7 24
     A            M0035     R        O  7 33
     A            WSIMEX         6A  O  7 37
     A            M1N07     R        O  7 44
     A            M0068A    R        H
     A            X0068A         6  0O  7 50
     A            M0068B    R        O  7 57
     A            M0068C    R        O  7 65
     A            M3039E    R        O  7 69
     A                                 23  2MSGCON(010 EDI0803 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 15MSGCON(012 EDI0812 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R EDI60DØ
     A                                      OVERLAY
     A            ZMSGTX        79A  O 24  2MSGID(&ZMSGNO SYMSGF)
     A N30                                  COLOR(WHT)
     A  30                                  COLOR(RED)
     A            ZMSGNO         7A  P
