     A*%%TS  SD  20131112  192538  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      REF(*LIBL/EUNHJ1)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR EDI61PNL)
     A                                      HLPTITLE('EDI MELDINGER')
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'SØK')
     A                                      HELP
     A                                      ALTHELP
     A*
     A          R EDI61DA
     A*%%TS  SD  20131112  192538  CB          REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYEDI'
     A                                      COLOR(BLU)
     A                                  1 60MSGCON(012 EDI0226 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1125'EDI61D A'
     A                                      COLOR(BLU)
     A                                  2 62'Seleksjon'
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(026 EDI0602 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(028 EDI0204 *LIBL/SYMSGF)
     A            ZDTF      R     D  B  6 33REFFLD(MDT)
     A  31                                  COLOR(WHT)
     A                                  6 71MSGCON(008 EDI0605 *LIBL/SYMSGF)
     A                                  7  4MSGCON(026 EDI0206 *LIBL/SYMSGF)
     A            ZTMF      R     D  B  7 33REFFLD(MTM)
     A  32                                  DSPATR(PC)
     A  32                                  COLOR(WHT)
     A                                  7 71MSGCON(006 EDI0606 *LIBL/SYMSGF)
     A                                  9  2MSGCON(028 EDI0208 *LIBL/SYMSGF)
     A            ZDTT      R     D  B  9 33REFFLD(MDT)
     A  31                                  COLOR(WHT)
     A                                  9 71MSGCON(008 EDI0605 *LIBL/SYMSGF)
     A                                 10  4MSGCON(026 EDI0206 *LIBL/SYMSGF)
     A            ZTMT      R     D  B 10 33REFFLD(MTM)
     A  32                                  DSPATR(PC)
     A  32                                  COLOR(WHT)
     A                                 10 71MSGCON(006 EDI0606 *LIBL/SYMSGF)
     A                                 12  2MSGCON(028 EDI0212 *LIBL/SYMSGF)
     A            ZJNS           1A  B 12 33
     A  35                                  DSPATR(PC)
     A  35                                  COLOR(WHT)
     A                                 12 71MSGCON(005 EDI0607 *LIBL/SYMSGF)
     A                                 13  2MSGCON(028 EDI0214 *LIBL/SYMSGF)
     A            ZJNR           1A  B 13 33
     A  36                                  DSPATR(PC)
     A  36                                  COLOR(WHT)
     A                                 13 71MSGCON(005 EDI0607 *LIBL/SYMSGF)
     A                                 15  2MSGCON(028 EDI0216 *LIBL/SYMSGF)
     A            ZIID      R        B 15 33REFFLD(M0004)
     A                                 15 71MSGCON(009 EDI0217 *LIBL/SYMSGF)
     A                                 16  2MSGCON(028 EDI0218 *LIBL/SYMSGF)
     A            Z0062     R        B 16 33REFFLD(M0062)
     A                                 16 71MSGCON(010 EDI0219 *LIBL/SYMSGF)
     A                                 18  2'Status . . . . . . . . . . :'
     A            ZST       R        B 18 33REFFLD(UNHJ1/MST *LIBL/EUNHJ1)
     A                                 18 37'Blank=Ny'
     A                                 18 48'A=Oversatt'
     A                                 18 61'B=Sendt'
     A                                 19 37'C=Levert'
     A                                 19 48'D=Slettet'
     A                                 19 61'E=Feil'
     A                                 19 71'*=Alle'
     A                                 20  2'Meldingstype . . . . . . . :'
     A            Z0065     R        B 20 33REFFLD(M0065)
     A                                 20 48'*=Alle'
     A                                 21  4'Meldingsnavn . . . . . . :'
     A            Z1001     R        B 21 33REFFLD(M1001)
     A                                 21 48'*=Alle'
     A                                 22  2'Ventekode  . . . . . . . . :'
     A            ZVEN      R        B 22 33REFFLD(UNHJ1/MVEN *LIBL/EUNHJ1)
     A                                 22 37MSGCON(006 EDI0225 *LIBL/SYMSGF)
     A                                 26  2MSGCON(010 EDI0803 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 15MSGCON(014 EDI0804 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R EDI61DB                   SFL
     A            SFILE     R        H
     A            SMBR      R        H
     A            MSN       R        H
     A            MMN       R        H
     A            M0068     R        H
     A            M0004     R        H
     A            M0010     R        H
     A            ZOP            1A  I  7  2VALUES(' ' '2' '5' '7' '9')
     A            WSMOTP        18A  O  7  5
     A            M0065     R        O  7 25
     A            U0054     R        O  7 32
     A            M0062     R        O  7 37
     A            MVEN      R        O  7 57REFFLD(UNHJ1/MVEN *LIBL/EUNHJ1)
     A            MSR       R        O  7 61
     A            MST       R        O  7 64
     A            MDT       R        O  7 66
     A            MTM       R        O  7 75
     A*
     A          R EDI61DC                   SFLCTL(EDI61DB)
     A*%%TS  SD  20131112  192538  CB          REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0019)
     A                                      SFLPAG(0018)
     A                                      TEXT('EDI Meldingslogg, Heading')
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF05(05 'Forny')
     A                                      CF12(12 'Annuller')
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A          H                           HLPPNLGRP(EDI61R20 EDI61PNL)
     A                                      HLPARA(01 001 27 132)
     A                                  1  2'SYEDI'
     A                                      COLOR(BLU)
     A                                  1 60MSGCON(012 EDI0226 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1125'EDI61D B'
     A                                      COLOR(BLU)
     A                                  2 63'Liste'
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(026 EDI0602 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  3 69SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  4  4'2=Endre'
     A                                      COLOR(BLU)
     A                                  4 14'5=Vise'
     A                                      COLOR(BLU)
     A                                  4 23'7=Se EDIfact'
     A                                      COLOR(BLU)
     A                                  4 38'9=Se EDIfact med LF'
     A                                      COLOR(BLU)
     A                                  6  1MSGCON(003 EDI0609 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6  5MSGCON(075 EDI0230 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A*
     A          R EDI61DD
     A*%%TS  SD  20131112  192538  CB          REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A                                 26  2MSGCON(010 EDI0803 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 15MSGCON(010 EDI0805 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 26MSGCON(010 EDI0812 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A*
     A          R EDI61DØ
     A*%%TS  SD  20131112  192538  CB          REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79A  O 27  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
