********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SENDINGSNR/MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(ESR)
     A          R EDICR
     A            CSN       R               REFFLD(SN)
     A                                      COLHDG('Interchange_no' 'last_used')
S01  A*           CMN       R               REFFLD(N0036)
N01  A            CMN       R               REFFLD(MN)
     A                                      COLHDG('Message_no' 'last_used')
