     A          R EDIIJ1R                   JFILE(EDII ECMSG)
     A          J
     A                                      JFLD(INID ECIIDC)
      *
     A            INID
     A            IN0007
     A            IN0022
     A            IN0026
     A            IN0032
     A            INNA
     A            INNETW
     A            INACC
     A            INUSR
     A            INPW
     A            INTCHN
     A            INTCUS
     A            INTCPW
     A            INTCRD
     A            INTCRF
     A            INTCLL
     A            INTCLF
     A            INEX
     A            INLIND
     A            INCTLD
     A            INDEVD
     A            INOUSR
     A            INOADR
      *
     A            ECFIR
     A            ECCNO
     A            ECSR
     A            EC0065
     A            EC0054
     A            ECIIDC
     A            ECIIDI
     A            ECPGM
     A            ECDTAQ
     A            ECLIB
     A            ECSEND
     A            EC0001
     A            EC0002
      *
     A          K INNA
