      * FRITEKST KNYTTET TIL EDII - PARTSIDENTER
     A          R EDIIFR
     A            INID          35          COLHDG('Interchange ID')
     A            INFTX01       65          COLHDG('FRITEKST LINJE 01')
     A            INFTX02       65          COLHDG('FRITEKST LINJE 02')
     A            INFTX03       65          COLHDG('FRITEKST LINJE 03')
     A            INFTX04       65          COLHDG('FRITEKST LINJE 04')
     A            INFTX05       65          COLHDG('FRITEKST LINJE 05')
     A            INFTX06       65          COLHDG('FRITEKST LINJE 06')
     A            INFTX07       65          COLHDG('FRITEKST LINJE 07')
     A            INFTX08       65          COLHDG('FRITEKST LINJE 08')
     A            INFTX09       65          COLHDG('FRITEKST LINJE 09')
     A            INFTX10       65          COLHDG('FRITEKST LINJE 10')
     A          K INID
