     A          R EDIJR                     PFILE(EDIJ)
     A          K J0004
     A          K J0010
     A          K JLI5
     A          K JCLFE
