     A          R EDIMR                     PFILE(EDIM)
     A          K MSR
     A          K MST
     A          K MVEN
     A          K M0004
     A          K M0010
     A          K M0035
