     A          R EDIMR                     PFILE(EDIM)
     A          K MST
     A          K MDT
     A          K MTM
     A          K MAVD
     A          K MTDN
     A          K M0068A
     A          K M0068B
     A          K M0068C
