     A          R EDIMR                     PFILE(EDIM)
     A          K M0068A
     A          K M0068B
     A          K M0068C
     A          K MMN
