     A                                      REF(ESR)
     A          R EDIRER
     A            RDATA     R               REFFLD(DATA)
     A            REMBR     R               REFFLD(MBR)
     A          K REMBR
