     A                                      REF(ESR)
     A          R EDISSR
     A            SSSN      R               REFFLD(SN)
     A            SSDT      R               REFFLD(DT)
     A                                      COLHDG('Status_date')
     A            SSTM      R               REFFLD(TM)
     A                                      COLHDG('Status_time')
     A            SSST      R               REFFLD(ST)
     A            SSTEXT        70          COLHDG('Status_text')
     A          K SSSN
