********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 CB  PTF10 Duplikatkontroll på sendningsref. + avs. + mot.
********************************************************************
     A          R EDISR                     PFILE(EDIS)
     A          K S0020
     A          K S0004
N01  A          K S0010
