     A                                      REF(ESR)
     A          R EDISER
     A            SDATA     R               REFFLD(DATA)
     A            SEMBR     R               REFFLD(MBR)
     A          K SEMBR
