********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10018 * 01 CB  PTF10 NYTT FELT FOR IFS
10XXX * 02 YBC PTF10 SENDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(ESR)
     A          R EDISR
     A            S0004     R               REFFLD(N0004)
     A            S0010     R               REFFLD(N0010)
     A            S0020     R               REFFLD(N0020)
     A            S0026     R               REFFLD(N0026)
     A            S0035     R               REFFLD(N0035)
     A            S0036     R               REFFLD(N0036)
     A            SSN       R               REFFLD(SN)
     A            SSR       R               REFFLD(SR)
     A            SST       R               REFFLD(ST)
     A            SDT       R               REFFLD(DT)
     A                                      COLHDG('Status_date')
     A            STM       R               REFFLD(TM)
     A                                      COLHDG('Status_time')
     A            SLIB      R               REFFLD(LIB)
     A            SFILE     R               REFFLD(FILE)
     A            SMBR      R               REFFLD(MBR)
     A            SMBRS     R               REFFLD(MBRS)
N01  A            SIFS         256A         COLHDG('IFS Filnavn')
     A          K SSN
