     A                                      REF(EFR901)
     A          R DLMR
      * Key
     A            DMN       R               REFFLD(ØMN)
     A            DGN       R               REFFLD(ØGN)
     A            DREP0     R               REFFLD(ØREP0)
     A            DREP1     R               REFFLD(ØREP1)
     A            DREP2     R               REFFLD(ØREP2)
     A            DREP3     R               REFFLD(ØREP3)
     A            DREP4     R               REFFLD(ØREP4)
     A            DREP5     R               REFFLD(ØREP5)
     A            DREP6     R               REFFLD(ØREP6)
     A            DREP7     R               REFFLD(ØREP7)
     A            DREP8     R               REFFLD(ØREP8)
      *
     A            D4703     R               REFFLD(Ø4703)
      * C278 MAXIMUM VALUE INSTRUCTIONS
     A            D5004     R               REFFLD(Ø5004)
     A            D5705     R               REFFLD(Ø5705)
      * C214 SPECIAL SERVICES SUBSTITUTION, CODED
     A            D7161     R               REFFLD(Ø7161)
     A            D3055     R               REFFLD(Ø3055)
     A            D1131     R               REFFLD(Ø1131)
      *
     A            D4705     R               REFFLD(Ø4705)
      * C034 DATE/TIME OF RATE
     A            D2005     R               REFFLD(Ø2005)
     A            D2001     R               REFFLD(Ø2001)
     A            D2002     R               REFFLD(Ø2002)
     A            D2461     R               REFFLD(Ø2461)
      * Key
     A          K DMN
     A          K DGN
     A          K DREP0
     A          K DREP1
     A          K DREP2
     A          K DREP3
     A          K DREP4
     A          K DREP5
     A          K DREP6
     A          K DREP7
     A          K DREP8
