     A                                      REF(EFR96A)
     A          R DOCR
      * Key
     A            DMN       R               REFFLD(ØMN)
     A            DGN       R               REFFLD(ØGN)
     A            DREP0     R               REFFLD(ØREP0)
     A            DREP1     R               REFFLD(ØREP1)
     A            DREP2     R               REFFLD(ØREP2)
     A            DREP3     R               REFFLD(ØREP3)
     A            DREP4     R               REFFLD(ØREP4)
     A            DREP5     R               REFFLD(ØREP5)
     A            DREP6     R               REFFLD(ØREP6)
     A            DREP7     R               REFFLD(ØREP7)
     A            DREP8     R               REFFLD(ØREP8)
      * C002 Document/message name
     A            D1001     R               REFFLD(Ø1001)
     A            D1131     R               REFFLD(Ø1131)
     A            D3055     R               REFFLD(Ø3055)
     A            D1000     R               REFFLD(Ø1000)
      * C503 Document/message details
     A            D1004     R               REFFLD(Ø1004)
     A            D1373     R               REFFLD(Ø1373)
     A            D1366     R               REFFLD(Ø1366)
     A            D3453     R               REFFLD(Ø3453)
      *
     A            D3153     R               REFFLD(Ø3153)
     A            D1220     R               REFFLD(Ø1220)
     A            D1218     R               REFFLD(Ø1218)
      * Key
     A          K DMN
     A          K DGN
     A          K DREP0
     A          K DREP1
     A          K DREP2
     A          K DREP3
     A          K DREP4
     A          K DREP5
     A          K DREP6
     A          K DREP7
     A          K DREP8
