     A                                      REF(EFR901)
     A          R DTMR
      * Key
     A            DMN       R               REFFLD(ØMN)
     A            DGN       R               REFFLD(ØGN)
     A            DREP0     R               REFFLD(ØREP0)
     A            DREP1     R               REFFLD(ØREP1)
     A            DREP2     R               REFFLD(ØREP2)
     A            DREP3     R               REFFLD(ØREP3)
     A            DREP4     R               REFFLD(ØREP4)
     A            DREP5     R               REFFLD(ØREP5)
     A            DREP6     R               REFFLD(ØREP6)
     A            DREP7     R               REFFLD(ØREP7)
     A            DREP8     R               REFFLD(ØREP8)
      *
     A            D2005     R               REFFLD(Ø2005)
     A            D2001     R               REFFLD(Ø2001)
     A            D2002     R               REFFLD(Ø2002)
     A            D2461     R               REFFLD(Ø2461)
      * Key
     A          K DMN
     A          K DGN
     A          K DREP0
     A          K DREP1
     A          K DREP2
     A          K DREP3
     A          K DREP4
     A          K DREP5
     A          K DREP6
     A          K DREP7
     A          K DREP8
