********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(EFR911)
     A          R DTMR
      * Key
S01  A*           DMN            7S 0       COLHDG('Msg.no')
N01  A            DMN       R               REFFLD(ØMN)
     A            DGN            2S 0       COLHDG('Group no')
     A            DREP0     R               REFFLD(ØREP0)
     A            DREP1     R               REFFLD(ØREP1)
     A            DREP2     R               REFFLD(ØREP2)
     A            DREP3     R               REFFLD(ØREP3)
     A            DREP4     R               REFFLD(ØREP4)
     A            DREP5     R               REFFLD(ØREP5)
     A            DREP6     R               REFFLD(ØREP6)
     A            DREP7     R               REFFLD(ØREP7)
     A            DREP8     R               REFFLD(ØREP8)
      * C507 Date/time/period
     A            D2005          3          COLHDG('Q')
     A            D2782         35          COLHDG('Time')
     A            D2781          3          COLHDG('Time format Q')
      * Key
     A          K DMN
     A          K DGN
     A          K DREP0
     A          K DREP1
     A          K DREP2
     A          K DREP3
     A          K DREP4
     A          K DREP5
     A          K DREP6
     A          K DREP7
     A          K DREP8
