     A                                      REF(EFR901)
     A          R EQFR
      * Key
     A            EMN       R               REFFLD(ØMN)
     A            EGN       R               REFFLD(ØGN)
     A            EREP0     R               REFFLD(ØREP0)
     A            EREP1     R               REFFLD(ØREP1)
     A            EREP2     R               REFFLD(ØREP2)
     A            EREP3     R               REFFLD(ØREP3)
     A            EREP4     R               REFFLD(ØREP4)
     A            EREP5     R               REFFLD(ØREP5)
     A            EREP6     R               REFFLD(ØREP6)
     A            EREP7     R               REFFLD(ØREP7)
     A            EREP8     R               REFFLD(ØREP8)
      *
     A            E8053     R    3          REFFLD(Ø8053)
      * C271
     A            E8114     R               REFFLD(Ø8114)
     A            E8260     R               REFFLD(Ø8260)
      * C224
     A            E8155     R               REFFLD(Ø8155)
     A            E8154     R               REFFLD(Ø8154)
      *
     A            E8077     R               REFFLD(Ø8077)
      * C272
     A            E6165     R               REFFLD(Ø6165)
     A            E6150     R               REFFLD(Ø6150)
     A            E6411     R               REFFLD(Ø6411)
      * Key
     A          K EMN
     A          K EGN
     A          K EREP0
     A          K EREP1
     A          K EREP2
     A          K EREP3
     A          K EREP4
     A          K EREP5
     A          K EREP6
     A          K EREP7
     A          K EREP8
