     A                                      REF(EFR96A)
     A          R FNSR
      * Key
     A            FMN       R               REFFLD(ØMN)
     A            FGN       R               REFFLD(ØGN)
     A            FREP0     R               REFFLD(ØREP0)
     A            FREP1     R               REFFLD(ØREP1)
     A            FREP2     R               REFFLD(ØREP2)
     A            FREP3     R               REFFLD(ØREP3)
     A            FREP4     R               REFFLD(ØREP4)
     A            FREP5     R               REFFLD(ØREP5)
     A            FREP6     R               REFFLD(ØREP6)
     A            FREP7     R               REFFLD(ØREP7)
     A            FREP8     R               REFFLD(ØREP8)
      * C783 FOOTNOTE SET IDENTIFICATION
     A            F9430     R               REFFLD(Ø9430)
     A            F7405     R               REFFLD(Ø7405)
      * C082 PARTY IDENT IDENTIFICATION
     A            F3039     R               REFFLD(Ø3039)
     A            F1131     R               REFFLD(Ø1131)
     A            F3055     R               REFFLD(Ø3055)
      *
     A            F4405     R               REFFLD(Ø4405)
     A            F4513     R               REFFLD(Ø4513)
      * Key
     A          K FMN
     A          K FGN
     A          K FREP0
     A          K FREP1
     A          K FREP2
     A          K FREP3
     A          K FREP4
     A          K FREP5
     A          K FREP6
     A          K FREP7
     A          K FREP8
