     A          R FR
     A            ØIN            9S 0       COLHDG('Interchg.no')
     A            ØMN            9S 0       COLHDG('Msg.no')
     A            ØGN            2S 0       COLHDG('Group no')
     A            ØREP0          4S 0       COLHDG('Repet No Lvl 0')
     A            ØREP1          4S 0       COLHDG('Repet No Lvl 1')
     A            ØREP2          4S 0       COLHDG('Repet No Lvl 2')
     A            ØREP3          4S 0       COLHDG('Repet No Lvl 3')
     A            ØREP4          4S 0       COLHDG('Repet No Lvl 4')
     A            ØREP5          4S 0       COLHDG('Repet No Lvl 5')
     A            ØREP6          4S 0       COLHDG('Repet No Lvl 6')
     A            ØREP7          4S 0       COLHDG('Repet No Lvl 7')
     A            ØREP8          4S 0       COLHDG('Repet No Lvl 8')
     A            Ø1000         35          COLHDG('Doc/msg name')
     A            Ø1001          3          COLHDG('Doc/msg c')
     A            Ø1004         35          COLHDG('Doc/msg number')
     A            Ø1049          3          COLHDG('Msg sect, c')
     A            Ø1050          6          COLHDG('Seq number')
     A            Ø1052         35          COLHDG('Msg item number')
     A            Ø1054          6          COLHDG('Msg sub-item no')
     A            Ø1073          3          COLHDG('Doc line ind, c')
     A            Ø1082          6          COLHDG('Line item number')
     A            Ø1131          3          COLHDG('Code list q')
     A            Ø1153          3          COLHDG('Reference q')
     A            Ø1154         35          COLHDG('Reference number')
     A            Ø1156          6          COLHDG('Line number')
     A            Ø1159          3          COLHDG('Seq no source, c')
     A            Ø1218          2          COLHDG('No of orig doc req')
     A            Ø1220          2          COLHDG('No of cop doc req')
     A            Ø1222          2          COLHDG('Configuration level')
     A            Ø1225          3          COLHDG('Msg func, c')
     A            Ø1227          3          COLHDG('Calc seq ind, c')
     A            Ø1229          3          COLHDG('Act req/not, c')
     A            Ø1230         35          COLHDG('Allow or charge no')
     A            Ø1245          3          COLHDG('Stat ind, c')
     A            Ø1312          4          COLHDG('Cons load seq number')
     A            Ø1366         35          COLHDG('Doc/msg source')
     A            Ø1373          3          COLHDG('Doc/msg stat, c')
     A            Ø1490          4          COLHDG('Cons item no')
     A            Ø1496          5          COLHDG('Goods item no')
     A            Ø2005          3          COLHDG('Date/time/per q')
     A            Ø2009          3          COLHDG('Time relation, c')
     A            Ø2013          3          COLHDG('Freq, c')
     A            Ø2015          3          COLHDG('Desp patt, c')
     A            Ø2017          3          COLHDG('Desp patt tim, c')
     A            Ø2151          3          COLHDG('Type of per, c')
     A            Ø2152          3          COLHDG('No of per')
     A            Ø2379          3          COLHDG('Date/time/per fmt q')
     A            Ø2380         35          COLHDG('Date/time/per')
     A            Ø2475          3          COLHDG('Pay time ref, c')
     A            Ø3035          3          COLHDG('Party q')
     A            Ø3036         35          COLHDG('Party name')
     A            Ø3039         17          COLHDG('Party id')
     A            Ø3042         35          COLHDG('Street & no/p.o. box')
     A            Ø3045          3          COLHDG('Party name fmt, c')
     A            Ø3055          3          COLHDG('Code l rsp ag, c')
     A            Ø3077          3          COLHDG('Test media, c')
     A            Ø3124         35          COLHDG('Name and addr line')
     A            Ø3127         17          COLHDG('Carrier id')
     A            Ø3128         35          COLHDG('Carrier name')
     A            Ø3139          3          COLHDG('Contact func, c')
     A            Ø3148         25          COLHDG('Cmn no')
     A            Ø3153          3          COLHDG('Cmn chn id, c')
     A            Ø3155          3          COLHDG('Cmn channel q')
     A            Ø3164         35          COLHDG('City name')
     A            Ø3192         35          COLHDG('Account holder name')
     A            Ø3194         17          COLHDG('Account holder no')
     A            Ø3207          3          COLHDG('Country, c')
     A            Ø3222         70          COLHDG('Rel place/loc one')
     A            Ø3223         25          COLHDG('Rel place/loc one id')
     A            Ø3224         17          COLHDG('Place/loc')
     A            Ø3225         25          COLHDG('Place/loc id')
     A            Ø3227          3          COLHDG('Place/loc q')
     A            Ø3229          9          COLHDG('Country sub-ent id')
     A            Ø3232         70          COLHDG('Rel place/loc two')
     A            Ø3233         25          COLHDG('Rel place/loc two id')
     A            Ø3236         35          COLHDG('Sample loc')
     A            Ø3237          3          COLHDG('Sample loc, c')
     A            Ø3239          3          COLHDG('Count of orig, c')
     A            Ø3251          9          COLHDG('Postcode id')
     A            Ø3279          3          COLHDG('Geog env, c')
     A            Ø3285         17          COLHDG('Recip of the inst id')
     A            Ø3301         17          COLHDG('Party enact inst id')
     A            Ø3412         35          COLHDG('Department or empl')
     A            Ø3413         17          COLHDG('Dep or empl id')
     A            Ø3432         70          COLHDG('Institution name')
     A            Ø3433         11          COLHDG('Institution name id')
     A            Ø3434         17          COLHDG('Institut branch no')
     A            Ø3436         70          COLHDG('Inst branch place')
     A            Ø3446         20          COLHDG('Party tax id no')
     A            Ø3453          3          COLHDG('Language, c')
     A            Ø3494         35          COLHDG('Job title')
     A            Ø4000         35          COLHDG('Ref v. no')
     A            Ø4017          3          COLHDG('Del plan ind, c')
     A            Ø4022         70          COLHDG('Business desc')
     A            Ø4025          3          COLHDG('Business func, c')
     A            Ø4027          3          COLHDG('Business func q')
     A            Ø4043          3          COLHDG('Cls of trade, c')
     A            Ø4052         70          COLHDG('Terms of delivery')
     A            Ø4053          3          COLHDG('TOD, c')
     A            Ø4055          3          COLHDG('TOD func , c')
     A            Ø4065          3          COLHDG('Cont&carr cond, c')
     A            Ø4078         70          COLHDG('Handling instr')
     A            Ø4079          3          COLHDG('Handl instr, c    ')
     A            Ø4183          3          COLHDG('Spec conditions, c')
     A            Ø4215          3          COLHDG('Tranchgmeth of pay c')
     A            Ø4219          3          COLHDG('Trans prior, c')
     A            Ø4221          3          COLHDG('Discrepancy, c')
     A            Ø4233          3          COLHDG('Marking instr, c')
     A            Ø4237          3          COLHDG('PP/CC ind, c')
     A            Ø4276         35          COLHDG('Terms of payment')
     A            Ø4277         17          COLHDG('Terms of payment id')
     A            Ø4279          3          COLHDG('Payment terms type q')
     A            Ø4294         35          COLHDG('Change reason')
     A            Ø4295          3          COLHDG('Change reason, c')
     A            Ø4343          3          COLHDG('Response type, c')
     A            Ø4347          3          COLHDG('Product id func q')
     A            Ø4383          3          COLHDG('Bank operation, c')
     A            Ø4400         35          COLHDG('Intsruction')
     A            Ø4401          3          COLHDG('Instruction, c')
     A            Ø4403          3          COLHDG('Instruction q')
     A            Ø4405          3          COLHDG('Status, c')
     A            Ø4407          3          COLHDG('Samp proc stat, c')
     A            Ø4415         17          COLHDG('Test method id')
     A            Ø4416         70          COLHDG('Test description')
     A            Ø4419          3          COLHDG('Tst route of adm, c')
     A            Ø4424         35          COLHDG('Test reason')
     A            Ø4425         17          COLHDG('Test reason id')
     A            Ø4431          3          COLHDG('Payment guarantee, c')
     A            Ø4435          3          COLHDG('Payment channel, c')
     A            Ø4439          3          COLHDG('Paym conditions, c')
     A            Ø4440         70          COLHDG('Free text')
     A            Ø4441          3          COLHDG('Free text, c')
     A            Ø4451          3          COLHDG('Text subject q')
     A            Ø4453          3          COLHDG('Text func, c')
     A            Ø4455          3          COLHDG('Back order, c')
     A            Ø4457          3          COLHDG('Prod/serv subst, c')
     A            Ø4461          3          COLHDG('Payment means, c')
     A            Ø4463          3          COLHDG('Intra-comp pay, c')
     A            Ø4465          3          COLHDG('Adj reason, c')
     A            Ø4471          3          COLHDG('Settlement, c')
     A            Ø4487          3          COLHDG('Type of fin trans, c')
     A            Ø4493          3          COLHDG('Delivery req, c')
     A            Ø5004         18          COLHDG('Monetary amount')
     A            Ø5007          3          COLHDG('Mon func, c')
     A            Ø5013          3          COLHDG('Index q')
     A            Ø5025          3          COLHDG('Mon amount type q')
     A            Ø5027          3          COLHDG('Index type, c')
     A            Ø5030          6          COLHDG('Index value')
     A            Ø5039          3          COLHDG('Index v. rep, c')
     A            Ø5047          3          COLHDG('Contribution q')
     A            Ø5048         35          COLHDG('Contribution type')
     A            Ø5049          3          COLHDG('Contribution type, c')
     A            Ø5118         15          COLHDG('Price')
     A            Ø5125          3          COLHDG('Price q')
     A            Ø5152         35          COLHDG('Duty/tax/fee type')
     A            Ø5153          3          COLHDG('Duty/tax/fee type, c')
     A            Ø5189          3          COLHDG('Chg/allow desc, c')
     A            Ø5213          3          COLHDG('Subline price chg, c')
     A            Ø5237          3          COLHDG('Charge category, c')
     A            Ø5242         35          COLHDG('Rate/tariff class')
     A            Ø5243          6          COLHDG('Rate/tariff class id')
     A            Ø5245          3          COLHDG('Percentage q')
     A            Ø5255          3          COLHDG('Percentage basis, c')
     A            Ø5273         12          COLHDG('Dut/tax/fee rate id')
     A            Ø5275          6          COLHDG('Suppl rate/tar id')
     A            Ø5278         17          COLHDG('Duty/tax/fee rate')
     A            Ø5279          7          COLHDG('Duty/tax/fee rate id')
     A            Ø5283          3          COLHDG('Duty/tax/fee func q')
     A            Ø5284          9          COLHDG('Unit price basis')
     A            Ø5286         15          COLHDG('Duty/tax/fee ass')
     A            Ø5289          6          COLHDG('Duty/tax/fee acc id')
     A            Ø5305          3          COLHDG('Duty/tax/fee cat, c')
     A            Ø5375          3          COLHDG('Price type, c')
     A            Ø5377          3          COLHDG('Price chg ind, c')
     A            Ø5379          3          COLHDG('Price/tariff type, c')
     A            Ø5387          3          COLHDG('Price type q')
     A            Ø5388         35          COLHDG('Pricing group')
     A            Ø5389          3          COLHDG('Pricing group, c')
     A            Ø5393          3          COLHDG('Price multiplier q')
     A            Ø5394         12          COLHDG('Price multiplier')
     A            Ø5402         12          COLHDG('Rate of exchange')
     A            Ø5419          3          COLHDG('Rate type q')
     A            Ø5420         15          COLHDG('Rate per unit')
     A            Ø5463          3          COLHDG('Allow or charge q')
     A            Ø5479          3          COLHDG('Relation, c')
     A            Ø5482          8          COLHDG('Percentage')
     A            Ø5495          3          COLHDG('Subline ind, c')
     A            Ø6008         15          COLHDG('Height dimension')
     A            Ø6060         15          COLHDG('Quantity')
     A            Ø6063          3          COLHDG('Quantity q')
     A            Ø6064         15          COLHDG('Quantity difference')
     A            Ø6066         18          COLHDG('Control value')
     A            Ø6069          3          COLHDG('Control q')
     A            Ø6071          3          COLHDG('Frequency q')
     A            Ø6072          9          COLHDG('Frequency value')
     A            Ø6074          6          COLHDG('Confidence limit')
     A            Ø6140         15          COLHDG('Width dimension')
     A            Ø6145          3          COLHDG('Dimension q')
     A            Ø6152         18          COLHDG('Range maximum')
     A            Ø6155          3          COLHDG('Mea attr, c')
     A            Ø6162         18          COLHDG('Range minimum')
     A            Ø6167          3          COLHDG('Range type q')
     A            Ø6168         15          COLHDG('Length dimension')
     A            Ø6173          3          COLHDG('Size q')
     A            Ø6174         15          COLHDG('Size')
     A            Ø6245          3          COLHDG('Temp q')
     A            Ø6246          3          COLHDG('Temp setting')
     A            Ø6311          3          COLHDG('Mea appl q')
     A            Ø6313          3          COLHDG('Mea dim, c')
     A            Ø6314         18          COLHDG('Mea value')
     A            Ø6321          3          COLHDG('Mea significance, c')
     A            Ø6331          3          COLHDG('Statistic type, c')
     A            Ø6341          3          COLHDG('Curr market exch, c')
     A            Ø6343          3          COLHDG('Curr q')
     A            Ø6345          3          COLHDG('Curr, c')
     A            Ø6347          3          COLHDG('Curr details q')
     A            Ø6348          4          COLHDG('Curr rate base')
     A            Ø6350         15          COLHDG('No of units')
     A            Ø6353          3          COLHDG('No of units q')
     A            Ø6411          3          COLHDG('Mea unit q')
     A            Ø6424          9          COLHDG('Sample freq value')
     A            Ø7008         35          COLHDG('Item description')
     A            Ø7009          7          COLHDG('Item description id')
     A            Ø7011          3          COLHDG('Article avail, c')
     A            Ø7036         35          COLHDG('Characteristic')
     A            Ø7037         17          COLHDG('Characteristic id')
     A            Ø7039          3          COLHDG('Sample sel method, c')
     A            Ø7045          3          COLHDG('Sample descr, c')
     A            Ø7047          3          COLHDG('Sample direction, c')
     A            Ø7059          3          COLHDG('Property class, c')
     A            Ø7064         35          COLHDG('Type of packages')
     A            Ø7065          7          COLHDG('Type of packages id')
     A            Ø7073          3          COLHDG('Pack terms & cond, c')
     A            Ø7075          3          COLHDG('Pack lvl, c')
     A            Ø7077          3          COLHDG('Item desc type, c')
     A            Ø7081          3          COLHDG('Item char, c')
     A            Ø7083          3          COLHDG('Cnfg, c')
     A            Ø7085          3          COLHDG('Nature of cargo, c')
     A            Ø7088          8          COLHDG('Dang goods flashp')
     A            Ø7102         35          COLHDG('Shipping marks')
     A            Ø7106          3          COLHDG('Shipment flashpoint')
     A            Ø7124          4          COLHDG('Undg no')
     A            Ø7130         17          COLHDG('Cust auth no')
     A            Ø7140         35          COLHDG('Item no')
     A            Ø7143          3          COLHDG('Item no type, c')
     A            Ø7160         35          COLHDG('Spec services')
     A            Ø7161          3          COLHDG('Spec serv, c')
     A            Ø7164         12          COLHDG('Hierarchical id no')
     A            Ø7166         12          COLHDG('Hierarchical par id')
     A            Ø7186         35          COLHDG('Process type')
     A            Ø7187         17          COLHDG('Process type id')
     A            Ø7188         30          COLHDG('Test revision no')
     A            Ø7224          8          COLHDG('No of packages')
     A            Ø7233          3          COLHDG('Pack rel inf, c')
     A            Ø7240         15          COLHDG('Total no of items')
     A            Ø7273          3          COLHDG('Serv req, c')
     A            Ø7293          3          COLHDG('Sector/subject id q')
     A            Ø7295         17          COLHDG('Req/cond id')
     A            Ø7297          3          COLHDG('Set id q')
     A            Ø7357         18          COLHDG('Commodity/rate id')
     A            Ø7361         18          COLHDG('Customs code id')
     A            Ø7365          3          COLHDG('Proc ind, c')
     A            Ø7383          3          COLHDG('Surface/layer ind, c')
     A            Ø7402         35          COLHDG('Identity no')
     A            Ø7405          3          COLHDG('Identity no q')
     A            Ø7419          4          COLHDG('Haz mtrl cls c, id')
     A            Ø7429          3          COLHDG('Indexing struc. q')
     A            Ø7431          3          COLHDG('Agree type q')
     A            Ø7433          3          COLHDG('Agree type, c')
     A            Ø7434         70          COLHDG('Agree type desc')
     A            Ø7436         17          COLHDG('Lvl 1 ID')
     A            Ø7438         17          COLHDG('Lvl 2 ID')
     A            Ø7440         17          COLHDG('Lvl 3 ID')
     A            Ø7442         17          COLHDG('Lvl 4 ID')
     A            Ø7444         17          COLHDG('Lvl 5 ID')
     A            Ø7446         17          COLHDG('Lvl 6 ID')
     A            Ø7449          3          COLHDG('Membership q')
     A            Ø7450         35          COLHDG('Membership cat')
     A            Ø7451          4          COLHDG('Membership cat ID')
     A            Ø7452         35          COLHDG('Membership stat')
     A            Ø7453          3          COLHDG('Membership stat, c')
     A            Ø7455          3          COLHDG('Membership lvl q')
     A            Ø7456         35          COLHDG('Membership lvl')
     A            Ø7457         35          COLHDG('Membership lvl id')
     A            Ø8022         26          COLHDG('Freight and charges')
     A            Ø8023         17          COLHDG('Freight & charges id')
     A            Ø8028         17          COLHDG('Conveyance ref no')
     A            Ø8051          3          COLHDG('Transport stage q')
     A            Ø8053          3          COLHDG('Equipment q')
     A            Ø8066         17          COLHDG('Mode of trans')
     A            Ø8067          3          COLHDG('Mode of trans, c')
     A            Ø8077          3          COLHDG('Equ suppl, c')
     A            Ø8078          7          COLHDG('Haz subs/item/page')
     A            Ø8092         10          COLHDG('Haz code ver no')
     A            Ø8101          3          COLHDG('Trans dir, c')
     A            Ø8126         10          COLHDG('TREM card number')
     A            Ø8154         35          COLHDG('Equip size & type')
     A            Ø8155          4          COLHDG('Equip size & type id')
     A            Ø8158          4          COLHDG('Haz id no, upp part')
     A            Ø8169          3          COLHDG('Full/empty ind, c')
     A            Ø8178         17          COLHDG('Type of means trans')
     A            Ø8179          8          COLHDG('Type means trans id')
     A            Ø8186          4          COLHDG('Subs id no, low part')
     A            Ø8211          3          COLHDG('Perm for trans, c')
     A            Ø8212         17          COLHDG('Id the means trans')
     A            Ø8213          9          COLHDG('Id of means trans id')
     A            Ø8246          4          COLHDG('Dang goods lbl mark')
     A            Ø8249          3          COLHDG('Equip stat, c')
     A            Ø8255          3          COLHDG('Pack instr, c')
     A            Ø8260         17          COLHDG('Equip id no')
     A            Ø8273          3          COLHDG('Dang goods reg, c')
     A            Ø8275          3          COLHDG('Cont/pack stat, c')
     A            Ø8323          3          COLHDG('Transp mov, c')
     A            Ø8325          3          COLHDG('Cat means trans, c')
     A            Ø8332         26          COLHDG('Equipment plan')
     A            Ø8334         35          COLHDG('Movement type')
     A            Ø8335          3          COLHDG('Movement type, c')
     A            Ø8339          3          COLHDG('Packing group, c')
     A            Ø8341          3          COLHDG('Haulage arr, c')
     A            Ø8351          7          COLHDG('Hazard code id')
     A            Ø8364          6          COLHDG('EMS number')
     A            Ø8393          3          COLHDG('Ret pack load cont')
     A            Ø8395          3          COLHDG('Ret pack freight pay')
     A            Ø8410          4          COLHDG('MFAG')
     A            Ø8453          3          COLHDG('Nat means trans, c')
     A            Ø8457          3          COLHDG('Exc trans reason, c')
     A            Ø8459          3          COLHDG('Exc trans resp, c')
     A            Ø9003          3          COLHDG('Employment q')
     A            Ø9004         35          COLHDG('Employment cat')
     A            Ø9005          3          COLHDG('Employment cat, c')
     A            Ø9006         35          COLHDG('Q classification')
     A            Ø9007          3          COLHDG('Q classification, c')
     A            Ø9008         35          COLHDG('Occupation')
     A            Ø9009          3          COLHDG('Occupation, c')
     A            Ø9011          3          COLHDG('Stat event, c')
     A            Ø9012         35          COLHDG('Stat reason')
     A            Ø9013          3          COLHDG('Stat reason, c')
     A            Ø9015          3          COLHDG('Stat type, c')
     A            Ø9017          3          COLHDG('Attr func q')
     A            Ø9018         35          COLHDG('Attribute')
     A            Ø9019          3          COLHDG('Attribute, c')
     A            Ø9021          3          COLHDG('Attribute type, c')
     A            Ø9141          3          COLHDG('Relationship q')
     A            Ø9142         35          COLHDG('Relationship')
     A            Ø9143          3          COLHDG('Relationship, c')
     A            Ø9213          3          COLHDG('Type duty regime, c')
     A            Ø9280         35          COLHDG('Validation result')
     A            Ø9282         35          COLHDG('Validation key id')
     A            Ø9302         17          COLHDG('Sealing party')
     A            Ø9303          3          COLHDG('Sealing party, c')
     A            Ø9308         10          COLHDG('Seal no')
     A            Ø9321          3          COLHDG('Appl error, c')
     A            Ø9353          3          COLHDG('Gov proc, c')
     A            Ø9411          3          COLHDG('Gov inv, c')
     A            Ø9415          3          COLHDG('Gov agency, c')
     A            Ø9417          3          COLHDG('Gov act, c')
     A            Ø9419          3          COLHDG('Serv layer, c')
