     A                                      REF(EFR98A)
     A          R FTXR
      * Key
     A            FMN       R               REFFLD(ØMN)
     A            FGN       R               REFFLD(ØGN)
     A            FREP0     R               REFFLD(ØREP0)
     A            FREP1     R               REFFLD(ØREP1)
     A            FREP2     R               REFFLD(ØREP2)
     A            FREP3     R               REFFLD(ØREP3)
     A            FREP4     R               REFFLD(ØREP4)
     A            FREP5     R               REFFLD(ØREP5)
     A            FREP6     R               REFFLD(ØREP6)
     A            FREP7     R               REFFLD(ØREP7)
     A            FREP8     R               REFFLD(ØREP8)
      *
     A            F4451     R               REFFLD(Ø4451)
     A            F4453     R               REFFLD(Ø4453)
      * C107 Text reference
     A            F4441     R               REFFLD(Ø4441)
     A            F1131     R               REFFLD(Ø1131)
     A            F3055     R               REFFLD(Ø3055)
      * C108 Text literal
     A            F4440A    R               REFFLD(Ø4440)
     A            F4440B    R               REFFLD(Ø4440)
     A            F4440C    R               REFFLD(Ø4440)
     A            F4440D    R               REFFLD(Ø4440)
     A            F4440E    R               REFFLD(Ø4440)
      *
     A            F3453     R               REFFLD(Ø3453)
      * Key
     A          K FMN
     A          K FGN
     A          K FREP0
     A          K FREP1
     A          K FREP2
     A          K FREP3
     A          K FREP4
     A          K FREP5
     A          K FREP6
     A          K FREP7
     A          K FREP8
