********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(EFR911)
     A          R FTXR
      * Key
S01  A*           FMN            7S 0       COLHDG('Msg.no')
N01  A            FMN       R               REFFLD(ØMN)
     A            FGN            2S 0       COLHDG('Group no')
     A            FREP0     R               REFFLD(ØREP0)
     A            FREP1     R               REFFLD(ØREP1)
     A            FREP2     R               REFFLD(ØREP2)
     A            FREP3     R               REFFLD(ØREP3)
     A            FREP4     R               REFFLD(ØREP4)
     A            FREP5     R               REFFLD(ØREP5)
     A            FREP6     R               REFFLD(ØREP6)
     A            FREP7     R               REFFLD(ØREP7)
     A            FREP8     R               REFFLD(ØREP8)
      *
     A            F4451          3          COLHDG('Text subj.Q')
     A            F4453          3          COLHDG('Text func.code')
      * C107 Text reference
     A            F4441          3          COLHDG('Free text, code')
     A            F1131          3          COLHDG('Code list Q')
     A            F3055          3          COLHDG('Resp.agency')
      * C108 Text literal
     A            F4440A        70          COLHDG('Text line-1')
     A            F4440B        70          COLHDG('Text line-2')
     A            F4440C        70          COLHDG('Text line-3')
     A            F4440D        70          COLHDG('Text line-4')
     A            F4440E        70          COLHDG('Text line-5')
      *
     A            F3701          3          COLHDG('Language,coded')
      * Key
     A          K FMN
     A          K FGN
     A          K FREP0
     A          K FREP1
     A          K FREP2
     A          K FREP3
     A          K FREP4
     A          K FREP5
     A          K FREP6
     A          K FREP7
     A          K FREP8
