     A                                      REF(EFR911)
     A          R GIDR
      * Key
     A            GMN       R               REFFLD(ØMN)
     A            GGN       R               REFFLD(ØGN)
     A            GREP0     R               REFFLD(ØREP0)
     A            GREP1     R               REFFLD(ØREP1)
     A            GREP2     R               REFFLD(ØREP2)
     A            GREP3     R               REFFLD(ØREP3)
     A            GREP4     R               REFFLD(ØREP4)
     A            GREP5     R               REFFLD(ØREP5)
     A            GREP6     R               REFFLD(ØREP6)
     A            GREP7     R               REFFLD(ØREP7)
     A            GREP8     R               REFFLD(ØREP8)
      *
     A            G1496     R               REFFLD(Ø1496)
      * C213 Number and type of packages
     A            G7224A    R               REFFLD(Ø7224)
     A            G7065A    R               REFFLD(Ø7065)
     A            G1131A    R               REFFLD(Ø1131)
     A            G3055A    R               REFFLD(Ø3055)
     A            G7064A    R               REFFLD(Ø7064)
      * C213 Number and type of packages
     A            G7224B    R               REFFLD(Ø7224)
     A            G7065B    R               REFFLD(Ø7065)
     A            G1131B    R               REFFLD(Ø1131)
     A            G3055B    R               REFFLD(Ø3055)
     A            G7064B    R               REFFLD(Ø7064)
      * C213 Number and type of packages
     A            G7224C    R               REFFLD(Ø7224)
     A            G7065C    R               REFFLD(Ø7065)
     A            G1131C    R               REFFLD(Ø1131)
     A            G3055C    R               REFFLD(Ø3055)
     A            G7064C    R               REFFLD(Ø7064)
      * Key
     A          K GMN
     A          K GGN
     A          K GREP0
     A          K GREP1
     A          K GREP2
     A          K GREP3
     A          K GREP4
     A          K GREP5
     A          K GREP6
     A          K GREP7
     A          K GREP8
