     A                                      REF(EFR96B)
     A          R GRUR
      * Key
     A            GMN       R               REFFLD(ØMN)
     A            GGN       R               REFFLD(ØGN)
     A            GREP0     R               REFFLD(ØREP0)
     A            GREP1     R               REFFLD(ØREP1)
     A            GREP2     R               REFFLD(ØREP2)
     A            GREP3     R               REFFLD(ØREP3)
     A            GREP4     R               REFFLD(ØREP4)
     A            GREP5     R               REFFLD(ØREP5)
     A            GREP6     R               REFFLD(ØREP6)
     A            GREP7     R               REFFLD(ØREP7)
     A            GREP8     R               REFFLD(ØREP8)
      *
     A            G9164     R               REFFLD(Ø9164)
     A            G7299     R               REFFLD(Ø7299)
     A            G6176     R               REFFLD(Ø6176)
     A            G4513     R               REFFLD(Ø4513)
     A            G1050     R               REFFLD(Ø1050)
      * Key
     A          K GMN
     A          K GGN
     A          K GREP0
     A          K GREP1
     A          K GREP2
     A          K GREP3
     A          K GREP4
     A          K GREP5
     A          K GREP6
     A          K GREP7
     A          K GREP8
