     A                                      REF(EFR03A)
     A          R IDER
      * Key
     A            IMN       R               REFFLD(ØMN)
     A            IGN       R               REFFLD(ØGN)
     A            IREP0     R               REFFLD(ØREP0)
     A            IREP1     R               REFFLD(ØREP1)
     A            IREP2     R               REFFLD(ØREP2)
     A            IREP3     R               REFFLD(ØREP3)
     A            IREP4     R               REFFLD(ØREP4)
     A            IREP5     R               REFFLD(ØREP5)
     A            IREP6     R               REFFLD(ØREP6)
     A            IREP7     R               REFFLD(ØREP7)
     A            IREP8     R               REFFLD(ØREP8)
      *
     A            I7495     R               REFFLD(Ø7495)
      * C206 Identification number
     A            I7402     R               REFFLD(Ø7402)
     A            I7405     R               REFFLD(Ø7405)
      * C082 PARTY IDENT IDENTIFICATION
     A            I3039     R               REFFLD(Ø3039)
     A            I1131     R               REFFLD(Ø1131)
     A            I3055     R               REFFLD(Ø3055)
      *
     A            I4405     R               REFFLD(Ø4405)
     A            I1222     R               REFFLD(Ø1222)
      * C778 POSITION IDENTIFICATION
     A            I7164     R               REFFLD(Ø7164)
     A            I1050     R               REFFLD(Ø1050)
      * C240 PRODUCT CHARACTERISTIC
     A            I7037     R               REFFLD(Ø7037)
     A            I1131B    R               REFFLD(Ø1131)
     A            I3055B    R               REFFLD(Ø3055)
     A            I7036A    R               REFFLD(Ø7036)
     A            I7036B    R               REFFLD(Ø7036)
      * Key
     A          K IMN
     A          K IGN
     A          K IREP0
     A          K IREP1
     A          K IREP2
     A          K IREP3
     A          K IREP4
     A          K IREP5
     A          K IREP6
     A          K IREP7
     A          K IREP8
