     A                                      REF(EFR98A)
     A          R IMDR
      * Key
     A            IMN       R               REFFLD(ØMN)
     A            IGN       R               REFFLD(ØGN)
     A            IREP0     R               REFFLD(ØREP0)
     A            IREP1     R               REFFLD(ØREP1)
     A            IREP2     R               REFFLD(ØREP2)
     A            IREP3     R               REFFLD(ØREP3)
     A            IREP4     R               REFFLD(ØREP4)
     A            IREP5     R               REFFLD(ØREP5)
     A            IREP6     R               REFFLD(ØREP6)
     A            IREP7     R               REFFLD(ØREP7)
     A            IREP8     R               REFFLD(ØREP8)
      *
     A            I7077     R               REFFLD(Ø7077)
     A            I7081     R               REFFLD(Ø7081)
      * C273 Item description
     A            I7009     R               REFFLD(Ø7009)
     A            I1131     R               REFFLD(Ø1131)
     A            I3055     R               REFFLD(Ø3055)
     A            I7008A    R               REFFLD(Ø7008)
     A            I7008B    R               REFFLD(Ø7008)
      *
     A            I7383     R               REFFLD(Ø7383)
      * Key
     A          K IMN
     A          K IGN
     A          K IREP0
     A          K IREP1
     A          K IREP2
     A          K IREP3
     A          K IREP4
     A          K IREP5
     A          K IREP6
     A          K IREP7
     A          K IREP8
