     A          R EISO19PA
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
     A                                 12  2'TO:'
     A            IFMOTT        50A    12  6
     A                                 13  2'CC:'
     A            IFCC01        50A    13  6
     A            IFCC02        50A    14  6
     A            IFCC03        50A    15  6
     A            IFSTD         20     17 40
     A            IFDTS          8  0  17 61EDTWRD('    .  .  ')
     A                                 19  2'Your ref.:'
     A            IFDREF        35A    19 13
     A                                 20  2'Our ref. :'
     A            IFSAKN         7  0  20 13EDTCDE(Z)
     A                                 20 20'/'
     A            ISFAVD         4  0  20 21
     A                                 20 25'/'
     A            ISFOPD         7  0  20 26
     A            IFHD01        70A    27  5
     A            IFHD02        70A    28  5
     A            IFHD03        70A    29  5
     A            IFHD04        70A    30  5
     A            IFTXT01       70A    33  5
     A            IFTXT02       70A    34  5
     A            IFTXT03       70A    35  5
     A            IFTXT04       70A    36  5
     A            IFTXT05       70A    37  5
     A            IFTXT06       70A    38  5
     A            IFTXT07       70A    39  5
     A            IFTXT08       70A    40  5
     A            IFTXT09       70A    41  5
     A            IFTXT10       70A    42  5
     A            IFTXT11       70A    43  5
     A            IFTXT12       70A    44  5
     A            IFTXT13       70A    45  5
     A            IFTXT14       70A    46  5
     A            IFTXT15       70A    47  5
     A            IFBT01        70A    52  5
     A            IFBT02        70A    53  5
     A            IFBT03        70A    54  5
