     A          R EQNR                      PFILE(EEQN95B)
     A          K EMN
     A          R ERCR                      PFILE(EERC95B)
     A          K EMN
     A          R ERPR                      PFILE(EERP95B)
     A          K EMN
     A          R FCAR                      PFILE(EFCA95B)
     A          K FMN
     A          R FIIR                      PFILE(EFII95B)
     A          K FMN
     A          R FTXR                      PFILE(EFTX95B)
     A          K FMN
     A          R GDSR                      PFILE(EGDS95B)
     A          K GMN
     A          R GIDR                      PFILE(EGID95B)
     A          K GMN
     A          R GINR                      PFILE(EGIN95B)
     A          K GMN
     A          R GIRR                      PFILE(EGIR95B)
     A          K GMN
     A          R GISR                      PFILE(EGIS95B)
     A          K GMN
     A          R GORR                      PFILE(EGOR95B)
     A          K GMN
     A          R HANR                      PFILE(EHAN95B)
     A          K HMN
     A          R IMDR                      PFILE(EIMD95B)
     A          K IMN
     A          R INDR                      PFILE(EIND95B)
     A          K IMN
     A          R INPR                      PFILE(EINP95B)
     A          K IMN
     A          R IRQR                      PFILE(EIRQ95B)
     A          K IMN
     A          R LINR                      PFILE(ELIN95B)
     A          K LMN
     A          R LOCR                      PFILE(ELOC95B)
     A          K LMN
     A          R MEAR                      PFILE(EMEA95B)
     A          K MMN
     A          R MEMR                      PFILE(EMEM95B)
     A          K MMN
     A          R MOAR                      PFILE(EMOA95B)
     A          K MMN
     A          R NADR                      PFILE(ENAD95B)
     A          K NMN
     A          R PACR                      PFILE(EPAC95B)
     A          K PMN
     A          R PAIR                      PFILE(EPAI95B)
     A          K PMN
     A          R PATR                      PFILE(EPAT95B)
     A          K PMN
     A          R PCDR                      PFILE(EPCD95B)
     A          K PMN
     A          R PCIR                      PFILE(EPCI95B)
     A          K PMN
     A          R PGIR                      PFILE(EPGI95B)
     A          K PMN
     A          R PIAR                      PFILE(EPIA95B)
     A          K PMN
     A          R PITR                      PFILE(EPIT95B)
     A          K PMN
     A          R PRCR                      PFILE(EPRC95B)
     A          K PMN
