     A          R DGSR                      PFILE(EDGS99A)
     A          K DMN
     A          R DIIR                      PFILE(EDII99A)
     A          K DMN
     A          R DIMR                      PFILE(EDIM99A)
     A          K DMN
     A          R DLIR                      PFILE(EDLI99A)
     A          K DMN
     A          R DLMR                      PFILE(EDLM99A)
     A          K DMN
     A          R DMSR                      PFILE(EDMS99A)
     A          K DMN
     A          R DOCR                      PFILE(EDOC99A)
     A          K DMN
     A          R DSIR                      PFILE(EDSI99A)
     A          K DMN
     A          R DTMR                      PFILE(EDTM99A)
     A          K DMN
     A          R EFIR                      PFILE(EEFI99A)
     A          K EMN
     A          R ELMR                      PFILE(EELM99A)
     A          K EMN
     A          R ELUR                      PFILE(EELU99A)
     A          K EMN
     A          R EMPR                      PFILE(EEMP99A)
     A          K EMN
     A          R EQAR                      PFILE(EEQA99A)
     A          K EMN
     A          R EQDR                      PFILE(EEQD99A)
     A          K EMN
     A          R EQNR                      PFILE(EEQN99A)
     A          K EMN
     A          R ERCR                      PFILE(EERC99A)
     A          K EMN
     A          R ERPR                      PFILE(EERP99A)
     A          K EMN
     A          R FCAR                      PFILE(EFCA99A)
     A          K FMN
     A          R FIIR                      PFILE(EFII99A)
     A          K FMN
     A          R FNSR                      PFILE(EFNS99A)
     A          K FMN
     A          R FNTR                      PFILE(EFNT99A)
     A          K FMN
     A          R FTXR                      PFILE(EFTX99A)
     A          K FMN
     A          R GDSR                      PFILE(EGDS99A)
     A          K GMN
     A          R GIDR                      PFILE(EGID99A)
     A          K GMN
     A          R GINR                      PFILE(EGIN99A)
     A          K GMN
     A          R GIRR                      PFILE(EGIR99A)
     A          K GMN
     A          R GISR                      PFILE(EGIS99A)
     A          K GMN
     A          R GORR                      PFILE(EGOR99A)
     A          K GMN
     A          R GRUR                      PFILE(EGRU99A)
     A          K GMN
     A          R HANR                      PFILE(EHAN99A)
     A          K HMN
     A          R ICDR                      PFILE(EICD99A)
     A          K IMN
