     A          R SGPR                      PFILE(ESGP911)
     A          K SMN
     A          R TCCR                      PFILE(ETCC911)
     A          K TMN
     A          R TDTR                      PFILE(ETDT911)
     A          K TMN
     A          R TMDR                      PFILE(ETMD911)
     A          K TMN
     A          R TMPR                      PFILE(ETMP911)
     A          K TMN
     A          R TODR                      PFILE(ETOD911)
     A          K TMN
     A          R TPLR                      PFILE(ETPL911)
     A          K TMN
     A          R TSRR                      PFILE(ETSR911)
     A          K TMN
