     A          R DGSR                      PFILE(EDGS97A)
     A          K DMN
     A          R DIIR                      PFILE(EDII97A)
     A          K DMN
     A          R DIMR                      PFILE(EDIM97A)
     A          K DMN
     A          R DLIR                      PFILE(EDLI97A)
     A          K DMN
     A          R DLMR                      PFILE(EDLM97A)
     A          K DMN
     A          R DMSR                      PFILE(EDMS97A)
     A          K DMN
     A          R DOCR                      PFILE(EDOC97A)
     A          K DMN
     A          R DSIR                      PFILE(EDSI97A)
     A          K DMN
     A          R DTMR                      PFILE(EDTM97A)
     A          K DMN
     A          R EFIR                      PFILE(EEFI97A)
     A          K EMN
     A          R ELMR                      PFILE(EELM97A)
     A          K EMN
     A          R ELUR                      PFILE(EELU97A)
     A          K EMN
     A          R EMPR                      PFILE(EEMP97A)
     A          K EMN
     A          R EQAR                      PFILE(EEQA97A)
     A          K EMN
     A          R EQDR                      PFILE(EEQD97A)
     A          K EMN
     A          R EQNR                      PFILE(EEQN97A)
     A          K EMN
     A          R ERCR                      PFILE(EERC97A)
     A          K EMN
     A          R ERPR                      PFILE(EERP97A)
     A          K EMN
     A          R FCAR                      PFILE(EFCA97A)
     A          K FMN
     A          R FIIR                      PFILE(EFII97A)
     A          K FMN
     A          R FNSR                      PFILE(EFNS97A)
     A          K FMN
     A          R FNTR                      PFILE(EFNT97A)
     A          K FMN
     A          R FTXR                      PFILE(EFTX97A)
     A          K FMN
     A          R GDSR                      PFILE(EGDS97A)
     A          K GMN
     A          R GIDR                      PFILE(EGID97A)
     A          K GMN
     A          R GINR                      PFILE(EGIN97A)
     A          K GMN
     A          R GIRR                      PFILE(EGIR97A)
     A          K GMN
     A          R GISR                      PFILE(EGIS97A)
     A          K GMN
     A          R GORR                      PFILE(EGOR97A)
     A          K GMN
     A          R GRUR                      PFILE(EGRU97A)
     A          K GMN
     A          R HANR                      PFILE(EHAN97A)
     A          K HMN
     A          R ICDR                      PFILE(EICD97A)
     A          K IMN
