     A          R DGSR                      PFILE(EDGS98A)
     A          K DMN
     A          R DIIR                      PFILE(EDII98A)
     A          K DMN
     A          R DIMR                      PFILE(EDIM98A)
     A          K DMN
     A          R DLIR                      PFILE(EDLI98A)
     A          K DMN
     A          R DLMR                      PFILE(EDLM98A)
     A          K DMN
     A          R DMSR                      PFILE(EDMS98A)
     A          K DMN
     A          R DOCR                      PFILE(EDOC98A)
     A          K DMN
     A          R DSIR                      PFILE(EDSI98A)
     A          K DMN
     A          R DTMR                      PFILE(EDTM98A)
     A          K DMN
     A          R EFIR                      PFILE(EEFI98A)
     A          K EMN
     A          R ELMR                      PFILE(EELM98A)
     A          K EMN
     A          R ELUR                      PFILE(EELU98A)
     A          K EMN
     A          R EMPR                      PFILE(EEMP98A)
     A          K EMN
     A          R EQAR                      PFILE(EEQA98A)
     A          K EMN
     A          R EQDR                      PFILE(EEQD98A)
     A          K EMN
     A          R EQNR                      PFILE(EEQN98A)
     A          K EMN
     A          R ERCR                      PFILE(EERC98A)
     A          K EMN
     A          R ERPR                      PFILE(EERP98A)
     A          K EMN
     A          R FCAR                      PFILE(EFCA98A)
     A          K FMN
     A          R FIIR                      PFILE(EFII98A)
     A          K FMN
     A          R FNSR                      PFILE(EFNS98A)
     A          K FMN
     A          R FNTR                      PFILE(EFNT98A)
     A          K FMN
     A          R FTXR                      PFILE(EFTX98A)
     A          K FMN
     A          R GDSR                      PFILE(EGDS98A)
     A          K GMN
     A          R GIDR                      PFILE(EGID98A)
     A          K GMN
     A          R GINR                      PFILE(EGIN98A)
     A          K GMN
     A          R GIRR                      PFILE(EGIR98A)
     A          K GMN
     A          R GISR                      PFILE(EGIS98A)
     A          K GMN
     A          R GORR                      PFILE(EGOR98A)
     A          K GMN
     A          R GRUR                      PFILE(EGRU98A)
     A          K GMN
     A          R HANR                      PFILE(EHAN98A)
     A          K HMN
     A          R ICDR                      PFILE(EICD98A)
     A          K IMN
