     A          R ICDR                      PFILE(EICD01B)
     A          K IMN
     A          R IDER                      PFILE(EIDE01B)
     A          K IMN
     A          R IHCR                      PFILE(EIHC01B)
     A          K IMN
     A          R IMDR                      PFILE(EIMD01B)
     A          K IMN
     A          R INDR                      PFILE(EIND01B)
     A          K IMN
     A          R INPR                      PFILE(EINP01B)
     A          K IMN
     A          R INVR                      PFILE(EINV01B)
     A          K IMN
     A          R IRQR                      PFILE(EIRQ01B)
     A          K IMN
     A          R LANR                      PFILE(ELAN01B)
     A          K LMN
     A          R LINR                      PFILE(ELIN01B)
     A          K LMN
     A          R LOCR                      PFILE(ELOC01B)
     A          K LMN
     A          R MEAR                      PFILE(EMEA01B)
     A          K MMN
     A          R MEMR                      PFILE(EMEM01B)
     A          K MMN
     A          R MKSR                      PFILE(EMKS01B)
     A          K MMN
     A          R MOAR                      PFILE(EMOA01B)
     A          K MMN
     A          R MSGR                      PFILE(EMSG01B)
     A          K MMN
     A          R MTDR                      PFILE(EMTD01B)
     A          K MMN
     A          R NADR                      PFILE(ENAD01B)
     A          K NMN
     A          R NATR                      PFILE(ENAT01B)
     A          K NMN
     A          R PACR                      PFILE(EPAC01B)
     A          K PMN
     A          R PAIR                      PFILE(EPAI01B)
     A          K PMN
     A          R PATR                      PFILE(EPAT01B)
     A          K PMN
     A          R PCDR                      PFILE(EPCD01B)
     A          K PMN
     A          R PCIR                      PFILE(EPCI01B)
     A          K PMN
     A          R PDIR                      PFILE(EPDI01B)
     A          K PMN
     A          R PGIR                      PFILE(EPGI01B)
     A          K PMN
     A          R PIAR                      PFILE(EPIA01B)
     A          K PMN
     A          R PITR                      PFILE(EPIT01B)
     A          K PMN
     A          R PNAR                      PFILE(EPNA01B)
     A          K PMN
     A          R PRCR                      PFILE(EPRC01B)
     A          K PMN
     A          R PRIR                      PFILE(EPRI01B)
     A          K PMN
     A          R PSDR                      PFILE(EPSD01B)
     A          K PMN
