     A          R IDER                      PFILE(EIDE98B)
     A          K IMN
     A          R IHCR                      PFILE(EIHC98B)
     A          K IMN
     A          R IMDR                      PFILE(EIMD98B)
     A          K IMN
     A          R INDR                      PFILE(EIND98B)
     A          K IMN
     A          R INPR                      PFILE(EINP98B)
     A          K IMN
     A          R INVR                      PFILE(EINV98B)
     A          K IMN
     A          R IRQR                      PFILE(EIRQ98B)
     A          K IMN
     A          R LANR                      PFILE(ELAN98B)
     A          K LMN
     A          R LINR                      PFILE(ELIN98B)
     A          K LMN
     A          R LOCR                      PFILE(ELOC98B)
     A          K LMN
     A          R MEAR                      PFILE(EMEA98B)
     A          K MMN
     A          R MEMR                      PFILE(EMEM98B)
     A          K MMN
     A          R MKSR                      PFILE(EMKS98B)
     A          K MMN
     A          R MOAR                      PFILE(EMOA98B)
     A          K MMN
     A          R MSGR                      PFILE(EMSG98B)
     A          K MMN
     A          R NADR                      PFILE(ENAD98B)
     A          K NMN
     A          R NATR                      PFILE(ENAT98B)
     A          K NMN
     A          R PACR                      PFILE(EPAC98B)
     A          K PMN
     A          R PAIR                      PFILE(EPAI98B)
     A          K PMN
     A          R PATR                      PFILE(EPAT98B)
     A          K PMN
     A          R PCDR                      PFILE(EPCD98B)
     A          K PMN
     A          R PCIR                      PFILE(EPCI98B)
     A          K PMN
     A          R PDIR                      PFILE(EPDI98B)
     A          K PMN
     A          R PGIR                      PFILE(EPGI98B)
     A          K PMN
     A          R PIAR                      PFILE(EPIA98B)
     A          K PMN
     A          R PITR                      PFILE(EPIT98B)
     A          K PMN
     A          R PNAR                      PFILE(EPNA98B)
     A          K PMN
     A          R PRCR                      PFILE(EPRC98B)
     A          K PMN
     A          R PRIR                      PFILE(EPRI98B)
     A          K PMN
     A          R PSDR                      PFILE(EPSD98B)
     A          K PMN
     A          R PTYR                      PFILE(EPTY98B)
     A          K PMN
     A          R QTYR                      PFILE(EQTY98B)
     A          K QMN
