     A          R PRIR                      PFILE(EPRI95B)
     A          K PMN
     A          R PSDR                      PFILE(EPSD95B)
     A          K PMN
     A          R QTYR                      PFILE(EQTY95B)
     A          K QMN
     A          R QVAR                      PFILE(EQVA95B)
     A          K QMN
     A          R QVRR                      PFILE(EQVR95B)
     A          K QMN
     A          R RCSR                      PFILE(ERCS95B)
     A          K RMN
     A          R RELR                      PFILE(EREL95B)
     A          K RMN
     A          R RFFR                      PFILE(ERFF95B)
     A          K RMN
     A          R RNGR                      PFILE(ERNG95B)
     A          K RMN
     A          R RTER                      PFILE(ERTE95B)
     A          K RMN
     A          R SCCR                      PFILE(ESCC95B)
     A          K SMN
     A          R SELR                      PFILE(ESEL95B)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ95B)
     A          K SMN
     A          R SGPR                      PFILE(ESGP95B)
     A          K SMN
     A          R SPSR                      PFILE(ESPS95B)
     A          K SMN
     A          R STAR                      PFILE(ESTA95B)
     A          K SMN
     A          R STSR                      PFILE(ESTS95B)
     A          K SMN
     A          R TAXR                      PFILE(ETAX95B)
     A          K TMN
     A          R TCCR                      PFILE(ETCC95B)
     A          K TMN
     A          R TDTR                      PFILE(ETDT95B)
     A          K TMN
     A          R TEMR                      PFILE(ETEM95B)
     A          K TMN
     A          R TMDR                      PFILE(ETMD95B)
     A          K TMN
     A          R TMPR                      PFILE(ETMP95B)
     A          K TMN
     A          R TODR                      PFILE(ETOD95B)
     A          K TMN
     A          R TPLR                      PFILE(ETPL95B)
     A          K TMN
     A          R TSRR                      PFILE(ETSR95B)
     A          K TMN
