     A          R PRIR                      PFILE(EPRI94B)
     A          K PMN
     A          R PSDR                      PFILE(EPSD94B)
     A          K PMN
     A          R QTYR                      PFILE(EQTY94B)
     A          K QMN
     A          R QVAR                      PFILE(EQVA94B)
     A          K QMN
     A          R QVRR                      PFILE(EQVR94B)
     A          K QMN
     A          R RCSR                      PFILE(ERCS94B)
     A          K RMN
     A          R RELR                      PFILE(EREL94B)
     A          K RMN
     A          R RFFR                      PFILE(ERFF94B)
     A          K RMN
     A          R RNGR                      PFILE(ERNG94B)
     A          K RMN
     A          R RTER                      PFILE(ERTE94B)
     A          K RMN
     A          R SCCR                      PFILE(ESCC94B)
     A          K SMN
     A          R SELR                      PFILE(ESEL94B)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ94B)
     A          K SMN
     A          R SGPR                      PFILE(ESGP94B)
     A          K SMN
     A          R SPSR                      PFILE(ESPS94B)
     A          K SMN
     A          R STAR                      PFILE(ESTA94B)
     A          K SMN
     A          R STSR                      PFILE(ESTS94B)
     A          K SMN
     A          R TAXR                      PFILE(ETAX94B)
     A          K TMN
     A          R TCCR                      PFILE(ETCC94B)
     A          K TMN
     A          R TDTR                      PFILE(ETDT94B)
     A          K TMN
     A          R TEMR                      PFILE(ETEM94B)
     A          K TMN
     A          R TMDR                      PFILE(ETMD94B)
     A          K TMN
     A          R TMPR                      PFILE(ETMP94B)
     A          K TMN
     A          R TODR                      PFILE(ETOD94B)
     A          K TMN
     A          R TPLR                      PFILE(ETPL94B)
     A          K TMN
     A          R TSRR                      PFILE(ETSR94B)
     A          K TMN
