     A          R QTYR                      PFILE(EQTY93A)
     A          K QMN
     A          R QVAR                      PFILE(EQVA93A)
     A          K QMN
     A          R QVRR                      PFILE(EQVR93A)
     A          K QMN
     A          R RCSR                      PFILE(ERCS93A)
     A          K RMN
     A          R RELR                      PFILE(EREL93A)
     A          K RMN
     A          R RFFR                      PFILE(ERFF93A)
     A          K RMN
     A          R RNGR                      PFILE(ERNG93A)
     A          K RMN
     A          R RTER                      PFILE(ERTE93A)
     A          K RMN
     A          R SCCR                      PFILE(ESCC93A)
     A          K SMN
     A          R SELR                      PFILE(ESEL93A)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ93A)
     A          K SMN
     A          R SGPR                      PFILE(ESGP93A)
     A          K SMN
     A          R SPSR                      PFILE(ESPS93A)
     A          K SMN
     A          R STAR                      PFILE(ESTA93A)
     A          K SMN
     A          R STSR                      PFILE(ESTS93A)
     A          K SMN
     A          R TAXR                      PFILE(ETAX93A)
     A          K TMN
     A          R TCCR                      PFILE(ETCC93A)
     A          K TMN
     A          R TDTR                      PFILE(ETDT93A)
     A          K TMN
     A          R TEMR                      PFILE(ETEM93A)
     A          K TMN
     A          R TMDR                      PFILE(ETMD93A)
     A          K TMN
     A          R TMPR                      PFILE(ETMP93A)
     A          K TMN
     A          R TODR                      PFILE(ETOD93A)
     A          K TMN
     A          R TPLR                      PFILE(ETPL93A)
     A          K TMN
     A          R TSRR                      PFILE(ETSR93A)
     A          K TMN
