     A          R IDER                      PFILE(EIDE98A)
     A          K IMN
     A          R IHCR                      PFILE(EIHC98A)
     A          K IMN
     A          R IMDR                      PFILE(EIMD98A)
     A          K IMN
     A          R INDR                      PFILE(EIND98A)
     A          K IMN
     A          R INPR                      PFILE(EINP98A)
     A          K IMN
     A          R INVR                      PFILE(EINV98A)
     A          K IMN
     A          R IRQR                      PFILE(EIRQ98A)
     A          K IMN
     A          R LANR                      PFILE(ELAN98A)
     A          K LMN
     A          R LINR                      PFILE(ELIN98A)
     A          K LMN
     A          R LOCR                      PFILE(ELOC98A)
     A          K LMN
     A          R MEAR                      PFILE(EMEA98A)
     A          K MMN
     A          R MEMR                      PFILE(EMEM98A)
     A          K MMN
     A          R MKSR                      PFILE(EMKS98A)
     A          K MMN
     A          R MOAR                      PFILE(EMOA98A)
     A          K MMN
     A          R MSGR                      PFILE(EMSG98A)
     A          K MMN
     A          R NADR                      PFILE(ENAD98A)
     A          K NMN
     A          R NATR                      PFILE(ENAT98A)
     A          K NMN
     A          R PACR                      PFILE(EPAC98A)
     A          K PMN
     A          R PAIR                      PFILE(EPAI98A)
     A          K PMN
     A          R PATR                      PFILE(EPAT98A)
     A          K PMN
     A          R PCDR                      PFILE(EPCD98A)
     A          K PMN
     A          R PCIR                      PFILE(EPCI98A)
     A          K PMN
     A          R PDIR                      PFILE(EPDI98A)
     A          K PMN
     A          R PGIR                      PFILE(EPGI98A)
     A          K PMN
     A          R PIAR                      PFILE(EPIA98A)
     A          K PMN
     A          R PITR                      PFILE(EPIT98A)
     A          K PMN
     A          R PNAR                      PFILE(EPNA98A)
     A          K PMN
     A          R PRCR                      PFILE(EPRC98A)
     A          K PMN
     A          R PRIR                      PFILE(EPRI98A)
     A          K PMN
     A          R PSDR                      PFILE(EPSD98A)
     A          K PMN
     A          R PTYR                      PFILE(EPTY98A)
     A          K PMN
     A          R QTYR                      PFILE(EQTY98A)
     A          K QMN
