     A          R IDER                      PFILE(EIDE99A)
     A          K IMN
     A          R IHCR                      PFILE(EIHC99A)
     A          K IMN
     A          R IMDR                      PFILE(EIMD99A)
     A          K IMN
     A          R INDR                      PFILE(EIND99A)
     A          K IMN
     A          R INPR                      PFILE(EINP99A)
     A          K IMN
     A          R INVR                      PFILE(EINV99A)
     A          K IMN
     A          R IRQR                      PFILE(EIRQ99A)
     A          K IMN
     A          R LANR                      PFILE(ELAN99A)
     A          K LMN
     A          R LINR                      PFILE(ELIN99A)
     A          K LMN
     A          R LOCR                      PFILE(ELOC99A)
     A          K LMN
     A          R MEAR                      PFILE(EMEA99A)
     A          K MMN
     A          R MEMR                      PFILE(EMEM99A)
     A          K MMN
     A          R MKSR                      PFILE(EMKS99A)
     A          K MMN
     A          R MOAR                      PFILE(EMOA99A)
     A          K MMN
     A          R MSGR                      PFILE(EMSG99A)
     A          K MMN
     A          R NADR                      PFILE(ENAD99A)
     A          K NMN
     A          R NATR                      PFILE(ENAT99A)
     A          K NMN
     A          R PACR                      PFILE(EPAC99A)
     A          K PMN
     A          R PAIR                      PFILE(EPAI99A)
     A          K PMN
     A          R PATR                      PFILE(EPAT99A)
     A          K PMN
     A          R PCDR                      PFILE(EPCD99A)
     A          K PMN
     A          R PCIR                      PFILE(EPCI99A)
     A          K PMN
     A          R PDIR                      PFILE(EPDI99A)
     A          K PMN
     A          R PGIR                      PFILE(EPGI99A)
     A          K PMN
     A          R PIAR                      PFILE(EPIA99A)
     A          K PMN
     A          R PITR                      PFILE(EPIT99A)
     A          K PMN
     A          R PNAR                      PFILE(EPNA99A)
     A          K PMN
     A          R PRCR                      PFILE(EPRC99A)
     A          K PMN
     A          R PRIR                      PFILE(EPRI99A)
     A          K PMN
     A          R PSDR                      PFILE(EPSD99A)
     A          K PMN
     A          R PTYR                      PFILE(EPTY99A)
     A          K PMN
     A          R QTYR                      PFILE(EQTY99A)
     A          K QMN
