     A          R PTYR                      PFILE(EPTY01B)
     A          K PMN
     A          R QTYR                      PFILE(EQTY01B)
     A          K QMN
     A          R QVRR                      PFILE(EQVR01B)
     A          K QMN
     A          R RCSR                      PFILE(ERCS01B)
     A          K RMN
     A          R RELR                      PFILE(EREL01B)
     A          K RMN
     A          R RFFR                      PFILE(ERFF01B)
     A          K RMN
     A          R RNGR                      PFILE(ERNG01B)
     A          K RMN
     A          R RTER                      PFILE(ERTE01B)
     A          K RMN
     A          R SALR                      PFILE(ESAL01B)
     A          K SMN
     A          R SCCR                      PFILE(ESCC01B)
     A          K SMN
     A          R SCDR                      PFILE(ESCD01B)
     A          K SMN
     A          R SEGR                      PFILE(ESEG01B)
     A          K SMN
     A          R SELR                      PFILE(ESEL01B)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ01B)
     A          K SMN
     A          R SFIR                      PFILE(ESFI01B)
     A          K SMN
     A          R SGPR                      PFILE(ESGP01B)
     A          K SMN
     A          R SGUR                      PFILE(ESGU01B)
     A          K SMN
     A          R SPSR                      PFILE(ESPS01B)
     A          K SMN
     A          R STAR                      PFILE(ESTA01B)
     A          K SMN
     A          R STCR                      PFILE(ESTC01B)
     A          K SMN
     A          R STGR                      PFILE(ESTG01B)
     A          K SMN
     A          R STSR                      PFILE(ESTS01B)
     A          K SMN
     A          R TAXR                      PFILE(ETAX01B)
     A          K TMN
     A          R TCCR                      PFILE(ETCC01B)
     A          K TMN
     A          R TDTR                      PFILE(ETDT01B)
     A          K TMN
     A          R TEMR                      PFILE(ETEM01B)
     A          K TMN
     A          R TMDR                      PFILE(ETMD01B)
     A          K TMN
     A          R TMPR                      PFILE(ETMP01B)
     A          K TMN
     A          R TODR                      PFILE(ETOD01B)
     A          K TMN
     A          R TPLR                      PFILE(ETPL01B)
     A          K TMN
     A          R TRUR                      PFILE(ETRU01B)
     A          K TMN
     A          R TSRR                      PFILE(ETSR01B)
     A          K TMN
