     A          R QVRR                      PFILE(EQVR99A)
     A          K QMN
     A          R RCSR                      PFILE(ERCS99A)
     A          K RMN
     A          R RELR                      PFILE(EREL99A)
     A          K RMN
     A          R RFFR                      PFILE(ERFF99A)
     A          K RMN
     A          R RNGR                      PFILE(ERNG99A)
     A          K RMN
     A          R RTER                      PFILE(ERTE99A)
     A          K RMN
     A          R SALR                      PFILE(ESAL99A)
     A          K SMN
     A          R SCCR                      PFILE(ESCC99A)
     A          K SMN
     A          R SCDR                      PFILE(ESCD99A)
     A          K SMN
     A          R SEGR                      PFILE(ESEG99A)
     A          K SMN
     A          R SELR                      PFILE(ESEL99A)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ99A)
     A          K SMN
     A          R SFIR                      PFILE(ESFI99A)
     A          K SMN
     A          R SGPR                      PFILE(ESGP99A)
     A          K SMN
     A          R SGUR                      PFILE(ESGU99A)
     A          K SMN
     A          R SPSR                      PFILE(ESPS99A)
     A          K SMN
     A          R STAR                      PFILE(ESTA99A)
     A          K SMN
     A          R STCR                      PFILE(ESTC99A)
     A          K SMN
     A          R STGR                      PFILE(ESTG99A)
     A          K SMN
     A          R STSR                      PFILE(ESTS99A)
     A          K SMN
     A          R TAXR                      PFILE(ETAX95A)
     A          K TMN
     A          R TCCR                      PFILE(ETCC95A)
     A          K TMN
     A          R TDTR                      PFILE(ETDT95A)
     A          K TMN
     A          R TEMR                      PFILE(ETEM95A)
     A          K TMN
     A          R TMDR                      PFILE(ETMD95A)
     A          K TMN
     A          R TMPR                      PFILE(ETMP95A)
     A          K TMN
     A          R TODR                      PFILE(ETOD95A)
     A          K TMN
     A          R TPLR                      PFILE(ETPL95A)
     A          K TMN
     A          R TSRR                      PFILE(ETSR95A)
     A          K TMN
     A          R VLIR                      PFILE(EVLI95A)
     A          K VMN
