     A          R QVAR                      PFILE(EQVA96A)
     A          K QMN
     A          R QVRR                      PFILE(EQVR96A)
     A          K QMN
     A          R RCSR                      PFILE(ERCS96A)
     A          K RMN
     A          R RELR                      PFILE(EREL96A)
     A          K RMN
     A          R RFFR                      PFILE(ERFF96A)
     A          K RMN
     A          R RNGR                      PFILE(ERNG96A)
     A          K RMN
     A          R RTER                      PFILE(ERTE96A)
     A          K RMN
     A          R SALR                      PFILE(ESAL96A)
     A          K SMN
     A          R SCCR                      PFILE(ESCC96A)
     A          K SMN
     A          R SCDR                      PFILE(ESCD96A)
     A          K SMN
     A          R SEGR                      PFILE(ESEG96A)
     A          K SMN
     A          R SELR                      PFILE(ESEL96A)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ96A)
     A          K SMN
     A          R SFIR                      PFILE(ESFI96A)
     A          K SMN
     A          R SGPR                      PFILE(ESGP96A)
     A          K SMN
     A          R SGUR                      PFILE(ESGU96A)
     A          K SMN
     A          R SPSR                      PFILE(ESPS96A)
     A          K SMN
     A          R STAR                      PFILE(ESTA96A)
     A          K SMN
     A          R STCR                      PFILE(ESTC96A)
     A          K SMN
     A          R STGR                      PFILE(ESTG96A)
     A          K SMN
     A          R STSR                      PFILE(ESTS96A)
     A          K SMN
     A          R TAXR                      PFILE(ETAX95A)
     A          K TMN
     A          R TCCR                      PFILE(ETCC95A)
     A          K TMN
     A          R TDTR                      PFILE(ETDT95A)
     A          K TMN
     A          R TEMR                      PFILE(ETEM95A)
     A          K TMN
     A          R TMDR                      PFILE(ETMD95A)
     A          K TMN
     A          R TMPR                      PFILE(ETMP95A)
     A          K TMN
     A          R TODR                      PFILE(ETOD95A)
     A          K TMN
     A          R TPLR                      PFILE(ETPL95A)
     A          K TMN
     A          R TSRR                      PFILE(ETSR95A)
     A          K TMN
     A          R VLIR                      PFILE(EVLI95A)
     A          K VMN
