     A          R QVRR                      PFILE(EQVR98B)
     A          K QMN
     A          R RCSR                      PFILE(ERCS98B)
     A          K RMN
     A          R RELR                      PFILE(EREL98B)
     A          K RMN
     A          R RFFR                      PFILE(ERFF98B)
     A          K RMN
     A          R RNGR                      PFILE(ERNG98B)
     A          K RMN
     A          R RTER                      PFILE(ERTE98B)
     A          K RMN
     A          R SALR                      PFILE(ESAL98B)
     A          K SMN
     A          R SCCR                      PFILE(ESCC98B)
     A          K SMN
     A          R SCDR                      PFILE(ESCD98B)
     A          K SMN
     A          R SEGR                      PFILE(ESEG98B)
     A          K SMN
     A          R SELR                      PFILE(ESEL98B)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ98B)
     A          K SMN
     A          R SFIR                      PFILE(ESFI98B)
     A          K SMN
     A          R SGPR                      PFILE(ESGP98B)
     A          K SMN
     A          R SGUR                      PFILE(ESGU98B)
     A          K SMN
     A          R SPSR                      PFILE(ESPS98B)
     A          K SMN
     A          R STAR                      PFILE(ESTA98B)
     A          K SMN
     A          R STCR                      PFILE(ESTC98B)
     A          K SMN
     A          R STGR                      PFILE(ESTG98B)
     A          K SMN
     A          R STSR                      PFILE(ESTS98B)
     A          K SMN
     A          R TAXR                      PFILE(ETAX98B)
     A          K TMN
     A          R TCCR                      PFILE(ETCC98B)
     A          K TMN
     A          R TDTR                      PFILE(ETDT98B)
     A          K TMN
     A          R TEMR                      PFILE(ETEM98B)
     A          K TMN
     A          R TMDR                      PFILE(ETMD98B)
     A          K TMN
     A          R TMPR                      PFILE(ETMP98B)
     A          K TMN
     A          R TODR                      PFILE(ETOD98B)
     A          K TMN
     A          R TPLR                      PFILE(ETPL98B)
     A          K TMN
     A          R TSRR                      PFILE(ETSR98B)
     A          K TMN
     A          R VLIR                      PFILE(EVLI98B)
     A          K VMN
