     A          R QVRR                      PFILE(EQVR98A)
     A          K QMN
     A          R RCSR                      PFILE(ERCS98A)
     A          K RMN
     A          R RELR                      PFILE(EREL98A)
     A          K RMN
     A          R RFFR                      PFILE(ERFF98A)
     A          K RMN
     A          R RNGR                      PFILE(ERNG98A)
     A          K RMN
     A          R RTER                      PFILE(ERTE98A)
     A          K RMN
     A          R SALR                      PFILE(ESAL98A)
     A          K SMN
     A          R SCCR                      PFILE(ESCC98A)
     A          K SMN
     A          R SCDR                      PFILE(ESCD98A)
     A          K SMN
     A          R SEGR                      PFILE(ESEG98A)
     A          K SMN
     A          R SELR                      PFILE(ESEL98A)
     A          K SMN
     A          R SEQR                      PFILE(ESEQ98A)
     A          K SMN
     A          R SFIR                      PFILE(ESFI98A)
     A          K SMN
     A          R SGPR                      PFILE(ESGP98A)
     A          K SMN
     A          R SGUR                      PFILE(ESGU98A)
     A          K SMN
     A          R SPSR                      PFILE(ESPS98A)
     A          K SMN
     A          R STAR                      PFILE(ESTA98A)
     A          K SMN
     A          R STCR                      PFILE(ESTC98A)
     A          K SMN
     A          R STGR                      PFILE(ESTG98A)
     A          K SMN
     A          R STSR                      PFILE(ESTS98A)
     A          K SMN
     A          R TAXR                      PFILE(ETAX98A)
     A          K TMN
     A          R TCCR                      PFILE(ETCC98A)
     A          K TMN
     A          R TDTR                      PFILE(ETDT98A)
     A          K TMN
     A          R TEMR                      PFILE(ETEM98A)
     A          K TMN
     A          R TMDR                      PFILE(ETMD98A)
     A          K TMN
     A          R TMPR                      PFILE(ETMP98A)
     A          K TMN
     A          R TODR                      PFILE(ETOD98A)
     A          K TMN
     A          R TPLR                      PFILE(ETPL98A)
     A          K TMN
     A          R TSRR                      PFILE(ETSR98A)
     A          K TMN
     A          R VLIR                      PFILE(EVLI98A)
     A          K VMN
