     A          R TRUR                      PFILE(ETRU03A)
     A          K TMN
     A          R TSRR                      PFILE(ETSR03A)
     A          K TMN
     A          R VLIR                      PFILE(EVLI03A)
     A          K VMN
