     A          R ADRR                      PFILE(EADR01B)
     A          K AMN
     A          R AGRR                      PFILE(EAGR01B)
     A          K AMN
     A          R AJTR                      PFILE(EAJT01B)
     A          K AMN
     A          R ALCR                      PFILE(EALC01B)
     A          K AMN
     A          R ALIR                      PFILE(EALI01B)
     A          K AMN
     A          R APRR                      PFILE(EAPR01B)
     A          K AMN
     A          R ARDR                      PFILE(EARD01B)
     A          K AMN
     A          R ARRR                      PFILE(EARR01B)
     A          K AMN
     A          R ASIR                      PFILE(EASI01B)
     A          K AMN
     A          R ATTR                      PFILE(EATT01B)
     A          K AMN
     A          R AUTR                      PFILE(EAUT01B)
     A          K AMN
     A          R BIIR                      PFILE(EBII01B)
     A          K BMN
     A          R BUSR                      PFILE(EBUS01B)
     A          K BMN
     A          R CAVR                      PFILE(ECAV01B)
     A          K CMN
     A          R CCDR                      PFILE(ECCD01B)
     A          K CMN
     A          R CCIR                      PFILE(ECCI01B)
     A          K CMN
     A          R CDIR                      PFILE(ECDI01B)
     A          K CMN
     A          R CDSR                      PFILE(ECDS01B)
     A          K CMN
     A          R CDVR                      PFILE(ECDV01B)
     A          K CMN
     A          R CEDR                      PFILE(ECED01B)
     A          K CMN
     A          R CMPR                      PFILE(ECMP01B)
     A          K CMN
     A          R CNIR                      PFILE(ECNI01B)
     A          K CMN
     A          R CNTR                      PFILE(ECNT01B)
     A          K CMN
     A          R CODR                      PFILE(ECOD01B)
     A          K CMN
     A          R COMR                      PFILE(ECOM01B)
     A          K CMN
     A          R COTR                      PFILE(ECOT01B)
     A          K CMN
     A          R CPIR                      PFILE(ECPI01B)
     A          K CMN
     A          R CPSR                      PFILE(ECPS01B)
     A          K CMN
     A          R CSTR                      PFILE(ECST01B)
     A          K CMN
     A          R CTAR                      PFILE(ECTA01B)
     A          K CMN
     A          R CUXR                      PFILE(ECUX01B)
     A          K CMN
     A          R DAMR                      PFILE(EDAM01B)
     A          K DMN
