     A          R AAIR                      PFILE(EAAI03A)
     A          K AMN
     A          R ADIR                      PFILE(EADI03A)
     A          K AMN
     A          R ADRR                      PFILE(EADR03A)
     A          K AMN
     A          R AGRR                      PFILE(EAGR03A)
     A          K AMN
     A          R AJTR                      PFILE(EAJT03A)
     A          K AMN
     A          R ALCR                      PFILE(EALC03A)
     A          K AMN
     A          R ALIR                      PFILE(EALI03A)
     A          K AMN
     A          R APRR                      PFILE(EAPR03A)
     A          K AMN
     A          R ARDR                      PFILE(EARD03A)
     A          K AMN
     A          R ARRR                      PFILE(EARR03A)
     A          K AMN
     A          R ASIR                      PFILE(EASI03A)
     A          K AMN
     A          R ATTR                      PFILE(EATT03A)
     A          K AMN
     A          R AUTR                      PFILE(EAUT03A)
     A          K AMN
     A          R BIIR                      PFILE(EBII03A)
     A          K BMN
     A          R BUSR                      PFILE(EBUS03A)
     A          K BMN
     A          R CAVR                      PFILE(ECAV03A)
     A          K CMN
     A          R CCDR                      PFILE(ECCD03A)
     A          K CMN
     A          R CCIR                      PFILE(ECCI03A)
     A          K CMN
     A          R CDIR                      PFILE(ECDI03A)
     A          K CMN
     A          R CDSR                      PFILE(ECDS03A)
     A          K CMN
     A          R CDVR                      PFILE(ECDV03A)
     A          K CMN
     A          R CEDR                      PFILE(ECED03A)
     A          K CMN
     A          R CMPR                      PFILE(ECMP03A)
     A          K CMN
     A          R CNIR                      PFILE(ECNI03A)
     A          K CMN
     A          R CNTR                      PFILE(ECNT03A)
     A          K CMN
     A          R CODR                      PFILE(ECOD03A)
     A          K CMN
     A          R COMR                      PFILE(ECOM03A)
     A          K CMN
     A          R COTR                      PFILE(ECOT03A)
     A          K CMN
     A          R CPIR                      PFILE(ECPI03A)
     A          K CMN
     A          R CPSR                      PFILE(ECPS03A)
     A          K CMN
     A          R CSTR                      PFILE(ECST03A)
     A          K CMN
     A          R CTAR                      PFILE(ECTA03A)
     A          K CMN
