     A          R ADRR                      PFILE(EADR96A)
     A          K AMN
     A          R AGRR                      PFILE(EAGR96A)
     A          K AMN
     A          R AJTR                      PFILE(EAJT96A)
     A          K AMN
     A          R ALCR                      PFILE(EALC96A)
     A          K AMN
     A          R ALIR                      PFILE(EALI96A)
     A          K AMN
     A          R APRR                      PFILE(EAPR96A)
     A          K AMN
     A          R ARDR                      PFILE(EARD96A)
     A          K AMN
     A          R ARRR                      PFILE(EARR96A)
     A          K AMN
     A          R ASIR                      PFILE(EASI96A)
     A          K AMN
     A          R ATTR                      PFILE(EATT96A)
     A          K AMN
     A          R AUTR                      PFILE(EAUT96A)
     A          K AMN
     A          R BIIR                      PFILE(EBII96A)
     A          K BMN
     A          R BUSR                      PFILE(EBUS96A)
     A          K BMN
     A          R CAVR                      PFILE(ECAV96A)
     A          K CMN
     A          R CCDR                      PFILE(ECCD96A)
     A          K CMN
     A          R CCIR                      PFILE(ECCI96A)
     A          K CMN
     A          R CDIR                      PFILE(ECDI96A)
     A          K CMN
     A          R CDSR                      PFILE(ECDS96A)
     A          K CMN
     A          R CDVR                      PFILE(ECDV96A)
     A          K CMN
     A          R CEDR                      PFILE(ECED96A)
     A          K CMN
     A          R CMPR                      PFILE(ECMP96A)
     A          K CMN
     A          R CNIR                      PFILE(ECNI96A)
     A          K CMN
     A          R CNTR                      PFILE(ECNT96A)
     A          K CMN
     A          R CODR                      PFILE(ECOD96A)
     A          K CMN
     A          R COMR                      PFILE(ECOM96A)
     A          K CMN
     A          R COTR                      PFILE(ECOT96A)
     A          K CMN
     A          R CPIR                      PFILE(ECPI96A)
     A          K CMN
     A          R CPSR                      PFILE(ECPS96A)
     A          K CMN
     A          R CSTR                      PFILE(ECST96A)
     A          K CMN
     A          R CTAR                      PFILE(ECTA96A)
     A          K CMN
     A          R CUXR                      PFILE(ECUX96A)
     A          K CMN
     A          R DAMR                      PFILE(EDAM96A)
     A          K DMN
