     A          R ALCR                      PFILE(EALC921)
     A          K AMN
     A          R ALIR                      PFILE(EALI921)
     A          K AMN
     A          R APIR                      PFILE(EAPI921)
     A          K AMN
     A          R APRR                      PFILE(EAPR921)
     A          K AMN
     A          R CNIR                      PFILE(ECNI921)
     A          K CMN
     A          R CNTR                      PFILE(ECNT921)
     A          K CMN
     A          R COMR                      PFILE(ECOM921)
     A          K CMN
     A          R CPIR                      PFILE(ECPI921)
     A          K CMN
     A          R CTAR                      PFILE(ECTA921)
     A          K CMN
     A          R CUXR                      PFILE(ECUX921)
     A          K CMN
     A          R DGSR                      PFILE(EDGS921)
     A          K DMN
     A          R DIMR                      PFILE(EDIM921)
     A          K DMN
     A          R DOCR                      PFILE(EDOC921)
     A          K DMN
     A          R DTMR                      PFILE(EDTM921)
     A          K DMN
     A          R EQAR                      PFILE(EEQA921)
     A          K EMN
     A          R EQDR                      PFILE(EEQD921)
     A          K EMN
     A          R EQNR                      PFILE(EEQN921)
     A          K EMN
     A          R FIIR                      PFILE(EFII921)
     A          K FMN
     A          R FTXR                      PFILE(EFTX921)
     A          K FMN
     A          R GDSR                      PFILE(EGDS921)
     A          K GMN
     A          R GIDR                      PFILE(EGID921)
     A          K GMN
     A          R GINR                      PFILE(EGIN921)
     A          K GMN
     A          R GIRR                      PFILE(EGIR921)
     A          K GMN
     A          R GORR                      PFILE(EGOR921)
     A          K GMN
     A          R HANR                      PFILE(EHAN921)
     A          K HMN
     A          R IMDR                      PFILE(EIMD921)
     A          K IMN
     A          R LINR                      PFILE(ELIN921)
     A          K LMN
     A          R LOCR                      PFILE(ELOC921)
     A          K LMN
     A          R MEAR                      PFILE(EMEA921)
     A          K MMN
     A          R MOAR                      PFILE(EMOA921)
     A          K MMN
     A          R NADR                      PFILE(ENAD921)
     A          K NMN
     A          R PACR                      PFILE(EPAC921)
     A          K PMN
