     A          R ADRR                      PFILE(EADR97A)
     A          K AMN
     A          R AGRR                      PFILE(EAGR97A)
     A          K AMN
     A          R AJTR                      PFILE(EAJT97A)
     A          K AMN
     A          R ALCR                      PFILE(EALC97A)
     A          K AMN
     A          R ALIR                      PFILE(EALI97A)
     A          K AMN
     A          R APRR                      PFILE(EAPR97A)
     A          K AMN
     A          R ARDR                      PFILE(EARD97A)
     A          K AMN
     A          R ARRR                      PFILE(EARR97A)
     A          K AMN
     A          R ASIR                      PFILE(EASI97A)
     A          K AMN
     A          R ATTR                      PFILE(EATT97A)
     A          K AMN
     A          R AUTR                      PFILE(EAUT97A)
     A          K AMN
     A          R BIIR                      PFILE(EBII97A)
     A          K BMN
     A          R BUSR                      PFILE(EBUS97A)
     A          K BMN
     A          R CAVR                      PFILE(ECAV97A)
     A          K CMN
     A          R CCDR                      PFILE(ECCD97A)
     A          K CMN
     A          R CCIR                      PFILE(ECCI97A)
     A          K CMN
     A          R CDIR                      PFILE(ECDI97A)
     A          K CMN
     A          R CDSR                      PFILE(ECDS97A)
     A          K CMN
     A          R CDVR                      PFILE(ECDV97A)
     A          K CMN
     A          R CEDR                      PFILE(ECED97A)
     A          K CMN
     A          R CMPR                      PFILE(ECMP97A)
     A          K CMN
     A          R CNIR                      PFILE(ECNI97A)
     A          K CMN
     A          R CNTR                      PFILE(ECNT97A)
     A          K CMN
     A          R CODR                      PFILE(ECOD97A)
     A          K CMN
     A          R COMR                      PFILE(ECOM97A)
     A          K CMN
     A          R COTR                      PFILE(ECOT97A)
     A          K CMN
     A          R CPIR                      PFILE(ECPI97A)
     A          K CMN
     A          R CPSR                      PFILE(ECPS97A)
     A          K CMN
     A          R CSTR                      PFILE(ECST97A)
     A          K CMN
     A          R CTAR                      PFILE(ECTA97A)
     A          K CMN
     A          R CUXR                      PFILE(ECUX97A)
     A          K CMN
     A          R DAMR                      PFILE(EDAM97A)
     A          K DMN
