     A          R ADRR                      PFILE(EADR98A)
     A          K AMN
     A          R AGRR                      PFILE(EAGR98A)
     A          K AMN
     A          R AJTR                      PFILE(EAJT98A)
     A          K AMN
     A          R ALCR                      PFILE(EALC98A)
     A          K AMN
     A          R ALIR                      PFILE(EALI98A)
     A          K AMN
     A          R APRR                      PFILE(EAPR98A)
     A          K AMN
     A          R ARDR                      PFILE(EARD98A)
     A          K AMN
     A          R ARRR                      PFILE(EARR98A)
     A          K AMN
     A          R ASIR                      PFILE(EASI98A)
     A          K AMN
     A          R ATTR                      PFILE(EATT98A)
     A          K AMN
     A          R AUTR                      PFILE(EAUT98A)
     A          K AMN
     A          R BIIR                      PFILE(EBII98A)
     A          K BMN
     A          R BUSR                      PFILE(EBUS98A)
     A          K BMN
     A          R CAVR                      PFILE(ECAV98A)
     A          K CMN
     A          R CCDR                      PFILE(ECCD98A)
     A          K CMN
     A          R CCIR                      PFILE(ECCI98A)
     A          K CMN
     A          R CDIR                      PFILE(ECDI98A)
     A          K CMN
     A          R CDSR                      PFILE(ECDS98A)
     A          K CMN
     A          R CDVR                      PFILE(ECDV98A)
     A          K CMN
     A          R CEDR                      PFILE(ECED98A)
     A          K CMN
     A          R CMPR                      PFILE(ECMP98A)
     A          K CMN
     A          R CNIR                      PFILE(ECNI98A)
     A          K CMN
     A          R CNTR                      PFILE(ECNT98A)
     A          K CMN
     A          R CODR                      PFILE(ECOD98A)
     A          K CMN
     A          R COMR                      PFILE(ECOM98A)
     A          K CMN
     A          R COTR                      PFILE(ECOT98A)
     A          K CMN
     A          R CPIR                      PFILE(ECPI98A)
     A          K CMN
     A          R CPSR                      PFILE(ECPS98A)
     A          K CMN
     A          R CSTR                      PFILE(ECST98A)
     A          K CMN
     A          R CTAR                      PFILE(ECTA98A)
     A          K CMN
     A          R CUXR                      PFILE(ECUX98A)
     A          K CMN
     A          R DAMR                      PFILE(EDAM98A)
     A          K DMN
