     A          R FTXR                      PFILE(EFTX912)
     A          K FMN
     A          R GDSR                      PFILE(EGDS912)
     A          K GMN
     A          R GIDR                      PFILE(EGID912)
     A          K GMN
     A          R LOCR                      PFILE(ELOC912)
     A          K LMN
     A          R MEAR                      PFILE(EMEA912)
     A          K MMN
     A          R NADR                      PFILE(ENAD912)
     A          K NMN
     A          R PCIR                      PFILE(EPCI912)
     A          K PMN
     A          R TDTR                      PFILE(ETDT912)
     A          K TMN
