     A          R AGRR                      PFILE(EAGR95A)
     A          K AMN
     A          R AJTR                      PFILE(EAJT95A)
     A          K AMN
     A          R ALCR                      PFILE(EALC95A)
     A          K AMN
     A          R ALIR                      PFILE(EALI95A)
     A          K AMN
     A          R APRR                      PFILE(EAPR95A)
     A          K AMN
     A          R ARDR                      PFILE(EARD95A)
     A          K AMN
     A          R ARRR                      PFILE(EARR95A)
     A          K AMN
     A          R ASIR                      PFILE(EASI95A)
     A          K AMN
     A          R ATTR                      PFILE(EATT95A)
     A          K AMN
     A          R AUTR                      PFILE(EAUT95A)
     A          K AMN
     A          R BIIR                      PFILE(EBII95A)
     A          K BMN
     A          R BUSR                      PFILE(EBUS95A)
     A          K BMN
     A          R CCDR                      PFILE(ECCD95A)
     A          K CMN
     A          R CCIR                      PFILE(ECCI95A)
     A          K CMN
     A          R CDVR                      PFILE(ECDV95A)
     A          K CMN
     A          R CEDR                      PFILE(ECED95A)
     A          K CMN
     A          R CNIR                      PFILE(ECNI95A)
     A          K CMN
     A          R CNTR                      PFILE(ECNT95A)
     A          K CMN
     A          R CODR                      PFILE(ECOD95A)
     A          K CMN
     A          R COMR                      PFILE(ECOM95A)
     A          K CMN
     A          R COTR                      PFILE(ECOT95A)
     A          K CMN
     A          R CPIR                      PFILE(ECPI95A)
     A          K CMN
     A          R CPSR                      PFILE(ECPS95A)
     A          K CMN
     A          R CSTR                      PFILE(ECST95A)
     A          K CMN
     A          R CTAR                      PFILE(ECTA95A)
     A          K CMN
     A          R CUXR                      PFILE(ECUX95A)
     A          K CMN
     A          R DAMR                      PFILE(EDAM95A)
     A          K DMN
     A          R DGSR                      PFILE(EDGS95A)
     A          K DMN
     A          R DIMR                      PFILE(EDIM95A)
     A          K DMN
     A          R DLIR                      PFILE(EDLI95A)
     A          K DMN
     A          R DLMR                      PFILE(EDLM95A)
     A          K DMN
     A          R DMSR                      PFILE(EDMS95A)
     A          K DMN
