     A          R AGRR                      PFILE(EAGR94B)
     A          K AMN
     A          R AJTR                      PFILE(EAJT94B)
     A          K AMN
     A          R ALCR                      PFILE(EALC94B)
     A          K AMN
     A          R ALIR                      PFILE(EALI94B)
     A          K AMN
     A          R APIR                      PFILE(EAPI94B)
     A          K AMN
     A          R APRR                      PFILE(EAPR94B)
     A          K AMN
     A          R ARDR                      PFILE(EARD94B)
     A          K AMN
     A          R ATTR                      PFILE(EATT94B)
     A          K AMN
     A          R AUTR                      PFILE(EAUT94B)
     A          K AMN
     A          R BIIR                      PFILE(EBII94B)
     A          K BMN
     A          R BUSR                      PFILE(EBUS94B)
     A          K BMN
     A          R CCDR                      PFILE(ECCD94B)
     A          K CMN
     A          R CCIR                      PFILE(ECCI94B)
     A          K CMN
     A          R CNIR                      PFILE(ECNI94B)
     A          K CMN
     A          R CNTR                      PFILE(ECNT94B)
     A          K CMN
     A          R COMR                      PFILE(ECOM94B)
     A          K CMN
     A          R COTR                      PFILE(ECOT94B)
     A          K CMN
     A          R CPIR                      PFILE(ECPI94B)
     A          K CMN
     A          R CPSR                      PFILE(ECPS94B)
     A          K CMN
     A          R CSTR                      PFILE(ECST94B)
     A          K CMN
     A          R CTAR                      PFILE(ECTA94B)
     A          K CMN
     A          R CUXR                      PFILE(ECUX94B)
     A          K CMN
     A          R DGSR                      PFILE(EDGS94B)
     A          K DMN
     A          R DIMR                      PFILE(EDIM94B)
     A          K DMN
     A          R DLIR                      PFILE(EDLI94B)
     A          K DMN
     A          R DLMR                      PFILE(EDLM94B)
     A          K DMN
     A          R DMSR                      PFILE(EDMS94B)
     A          K DMN
     A          R DOCR                      PFILE(EDOC94B)
     A          K DMN
     A          R DTMR                      PFILE(EDTM94B)
     A          K DMN
     A          R EMPR                      PFILE(EEMP94B)
     A          K EMN
     A          R EQAR                      PFILE(EEQA94B)
     A          K EMN
     A          R EQDR                      PFILE(EEQD94B)
     A          K EMN
