     A                                      REF(EFR901)
     A          R LINR
      * Key
     A            LMN       R               REFFLD(ØMN)
     A            LGN       R               REFFLD(ØGN)
     A            LREP0     R               REFFLD(ØREP0)
     A            LREP1     R               REFFLD(ØREP1)
     A            LREP2     R               REFFLD(ØREP2)
     A            LREP3     R               REFFLD(ØREP3)
     A            LREP4     R               REFFLD(ØREP4)
     A            LREP5     R               REFFLD(ØREP5)
     A            LREP6     R               REFFLD(ØREP6)
     A            LREP7     R               REFFLD(ØREP7)
     A            LREP8     R               REFFLD(ØREP8)
      *
     A            L1082     R               REFFLD(Ø1082)
     A            L1229     R               REFFLD(Ø1229)
      * C198 Product identification
     A            L7020A    R               REFFLD(Ø7020)
     A            L7023A    R               REFFLD(Ø7023)
      * C198 Product identification
     A            L7020B    R               REFFLD(Ø7020)
     A            L7023B    R               REFFLD(Ø7023)
      * C186 Quantity information
     A            L6063     R               REFFLD(Ø6063)
     A            L6060     R               REFFLD(Ø6060)
     A            L6411A    R               REFFLD(Ø6411)
      * C118 Unit price information
     A            L5110A    R               REFFLD(Ø5110)
     A            L5375A    R               REFFLD(Ø5375)
     A            L5284A    R               REFFLD(Ø5284)
     A            L6411B    R               REFFLD(Ø6411)
      *
     A            L6170     R               REFFLD(Ø6170)
     A            L5116     R               REFFLD(Ø5116)
      * C134 Reference price information
     A            L5110B    R               REFFLD(Ø5110)
     A            L5375B    R               REFFLD(Ø5375)
     A            L5387     R               REFFLD(Ø5387)
     A            L5284B    R               REFFLD(Ø5284)
     A            L6411C    R               REFFLD(Ø6411)
      *
     A            L6318     R               REFFLD(Ø6318)
      * Key
     A          K LMN
     A          K LGN
     A          K LREP0
     A          K LREP1
     A          K LREP2
     A          K LREP3
     A          K LREP4
     A          K LREP5
     A          K LREP6
     A          K LREP7
     A          K LREP8
