     A                                      REF(EFR901)
     A          R LOCR
      * Key
     A            LMN       R               REFFLD(ØMN)
     A            LGN       R               REFFLD(ØGN)
     A            LREP0     R               REFFLD(ØREP0)
     A            LREP1     R               REFFLD(ØREP1)
     A            LREP2     R               REFFLD(ØREP2)
     A            LREP3     R               REFFLD(ØREP3)
     A            LREP4     R               REFFLD(ØREP4)
     A            LREP5     R               REFFLD(ØREP5)
     A            LREP6     R               REFFLD(ØREP6)
     A            LREP7     R               REFFLD(ØREP7)
     A            LREP8     R               REFFLD(ØREP8)
      *
     A            L3227     R               REFFLD(Ø3227)
      * C087
     A            L3225     R               REFFLD(Ø3225)
     A            L1131     R               REFFLD(Ø1131)
     A            L3224     R               REFFLD(Ø3224)
     A            L3438     R               REFFLD(Ø3438)
      * Key
     A          K LMN
     A          K LGN
     A          K LREP0
     A          K LREP1
     A          K LREP2
     A          K LREP3
     A          K LREP4
     A          K LREP5
     A          K LREP6
     A          K LREP7
     A          K LREP8
