     A                                      REF(EFR96B)
     A          R MEAR
      * Key
     A            MMN       R               REFFLD(ØMN)
     A            MGN       R               REFFLD(ØGN)
     A            MREP0     R               REFFLD(ØREP0)
     A            MREP1     R               REFFLD(ØREP1)
     A            MREP2     R               REFFLD(ØREP2)
     A            MREP3     R               REFFLD(ØREP3)
     A            MREP4     R               REFFLD(ØREP4)
     A            MREP5     R               REFFLD(ØREP5)
     A            MREP6     R               REFFLD(ØREP6)
     A            MREP7     R               REFFLD(ØREP7)
     A            MREP8     R               REFFLD(ØREP8)
      *
     A            M6311     R               REFFLD(Ø6311)
      * C502 Measurement details
     A            M6313     R               REFFLD(Ø6313)
     A            M6321     R               REFFLD(Ø6321)
     A            M6155     R               REFFLD(Ø6155)
      * C174 Value/range
     A            M6411     R               REFFLD(Ø6411)
     A            M6314     R               REFFLD(Ø6314)
     A            M6162     R               REFFLD(Ø6162)
     A            M6152     R               REFFLD(Ø6152)
      *
     A            M7383     R               REFFLD(Ø7383)
      * Key
     A          K MMN
     A          K MGN
     A          K MREP0
     A          K MREP1
     A          K MREP2
     A          K MREP3
     A          K MREP4
     A          K MREP5
     A          K MREP6
     A          K MREP7
     A          K MREP8
