     A                                      REF(EFR01B)
     A          R MEMR
      * Key
     A            MMN       R               REFFLD(ØMN)
     A            MGN       R               REFFLD(ØGN)
     A            MREP0     R               REFFLD(ØREP0)
     A            MREP1     R               REFFLD(ØREP1)
     A            MREP2     R               REFFLD(ØREP2)
     A            MREP3     R               REFFLD(ØREP3)
     A            MREP4     R               REFFLD(ØREP4)
     A            MREP5     R               REFFLD(ØREP5)
     A            MREP6     R               REFFLD(ØREP6)
     A            MREP7     R               REFFLD(ØREP7)
     A            MREP8     R               REFFLD(ØREP8)
      *
     A            M7449     R               REFFLD(Ø7449)
      * C942 Membership Category
     A            M7451     R               REFFLD(Ø7451)
     A            M1131A    R               REFFLD(Ø1131)
     A            M3055A    R               REFFLD(Ø3055)
     A            M7450     R               REFFLD(Ø7450)
      * C944 Membership Status
     A            M7453     R               REFFLD(Ø7453)
     A            M1131B    R               REFFLD(Ø1131)
     A            M3055B    R               REFFLD(Ø3055)
     A            M7452     R               REFFLD(Ø7452)
      * C945 Membership Level
     A            M7455     R               REFFLD(Ø7455)
     A            M7457     R               REFFLD(Ø7457)
     A            M1131C    R               REFFLD(Ø1131)
     A            M3055C    R               REFFLD(Ø3055)
     A            M7456     R               REFFLD(Ø7456)
      * C203 Rate/Tariff Class
     A            M5243     R               REFFLD(Ø5243)
     A            M1131D    R               REFFLD(Ø1131)
     A            M3055D    R               REFFLD(Ø3055)
     A            M5242     R               REFFLD(Ø5242)
     A            M5275A    R               REFFLD(Ø5275)
     A            M1131E    R               REFFLD(Ø1131)
     A            M3055E    R               REFFLD(Ø3055)
     A            M5275B    R               REFFLD(Ø5275)
     A            M1131F    R               REFFLD(Ø1131)
     A            M3055F    R               REFFLD(Ø3055)
      * C960 Reason For Change
     A            M4295     R               REFFLD(Ø4295)
     A            M1131G    R               REFFLD(Ø1131)
     A            M3055G    R               REFFLD(Ø3055)
     A            M4294     R               REFFLD(Ø4294)
      * Key
     A          K MMN
     A          K MGN
     A          K MREP0
     A          K MREP1
     A          K MREP2
     A          K MREP3
     A          K MREP4
     A          K MREP5
     A          K MREP6
     A          K MREP7
     A          K MREP8
