     A                                      REF(EFR96A)
     A          R MKSR
      * Key
     A            MMN       R               REFFLD(ØMN)
     A            MGN       R               REFFLD(ØGN)
     A            MREP0     R               REFFLD(ØREP0)
     A            MREP1     R               REFFLD(ØREP1)
     A            MREP2     R               REFFLD(ØREP2)
     A            MREP3     R               REFFLD(ØREP3)
     A            MREP4     R               REFFLD(ØREP4)
     A            MREP5     R               REFFLD(ØREP5)
     A            MREP6     R               REFFLD(ØREP6)
     A            MREP7     R               REFFLD(ØREP7)
     A            MREP8     R               REFFLD(ØREP8)
      *
     A            M7293     R               REFFLD(Ø7293)
      * C332 SALES CHANNEL IDENTIFICATION
     A            M3496     R               REFFLD(Ø3496)
     A            M1131     R               REFFLD(Ø1131)
     A            M3055     R               REFFLD(Ø3055)
      *
     A            M1229     R               REFFLD(Ø1229)
      * Key
     A          K MMN
     A          K MGN
     A          K MREP0
     A          K MREP1
     A          K MREP2
     A          K MREP3
     A          K MREP4
     A          K MREP5
     A          K MREP6
     A          K MREP7
     A          K MREP8
