     A                                      REF(EFR93A)
     A          R NADR
      * Key
     A            NMN       R               REFFLD(ØMN)
     A            NGN       R               REFFLD(ØGN)
     A            NREP0     R               REFFLD(ØREP0)
     A            NREP1     R               REFFLD(ØREP1)
     A            NREP2     R               REFFLD(ØREP2)
     A            NREP3     R               REFFLD(ØREP3)
     A            NREP4     R               REFFLD(ØREP4)
     A            NREP5     R               REFFLD(ØREP5)
     A            NREP6     R               REFFLD(ØREP6)
     A            NREP7     R               REFFLD(ØREP7)
     A            NREP8     R               REFFLD(ØREP8)
      *
     A            N3035     R               REFFLD(Ø3035)
      * C082 Party identification details
     A            N3039     R               REFFLD(Ø3039)
     A            N1131     R               REFFLD(Ø1131)
     A            N3055     R               REFFLD(Ø3055)
      * C058 Name & adress
     A            N3124A    R               REFFLD(Ø3124)
     A            N3124B    R               REFFLD(Ø3124)
     A            N3124C    R               REFFLD(Ø3124)
     A            N3124D    R               REFFLD(Ø3124)
     A            N3124E    R               REFFLD(Ø3124)
      * C080 Party name
     A            N3036A    R               REFFLD(Ø3036)
     A            N3036B    R               REFFLD(Ø3036)
     A            N3036C    R               REFFLD(Ø3036)
      * C059 Street
     A            N3042A    R               REFFLD(Ø3042)
     A            N3042B    R               REFFLD(Ø3042)
     A            N3042C    R               REFFLD(Ø3042)
      *
     A            N3164     R               REFFLD(Ø3164)
     A            N3229     R               REFFLD(Ø3229)
     A            N3251     R               REFFLD(Ø3251)
     A            N3207     R               REFFLD(Ø3207)
      * Key
     A          K NMN
     A          K NGN
     A          K NREP0
     A          K NREP1
     A          K NREP2
     A          K NREP3
     A          K NREP4
     A          K NREP5
     A          K NREP6
     A          K NREP7
     A          K NREP8
