     A                                      INDARA
     A          R RCVDATA
     A            RCVFLD        80A
     A          R SNDDATA
     A            SNDFLD        80A
     A          R SIGNOF
     A                                      EVOKE(CESF)
     A          R STRPGM
     A                                      EVOKE(EXPV)
