     A                                      REF(EFR95B)
     A          R PCIR
      * Key
     A            PMN       R               REFFLD(ØMN)
     A            PGN       R               REFFLD(ØGN)
     A            PREP0     R               REFFLD(ØREP0)
     A            PREP1     R               REFFLD(ØREP1)
     A            PREP2     R               REFFLD(ØREP2)
     A            PREP3     R               REFFLD(ØREP3)
     A            PREP4     R               REFFLD(ØREP4)
     A            PREP5     R               REFFLD(ØREP5)
     A            PREP6     R               REFFLD(ØREP6)
     A            PREP7     R               REFFLD(ØREP7)
     A            PREP8     R               REFFLD(ØREP8)
      *
     A            P4233     R               REFFLD(Ø4233)
      * C210 Marks & labels
     A            P7102A    R               REFFLD(Ø7102)
     A            P7102B    R               REFFLD(Ø7102)
     A            P7102C    R               REFFLD(Ø7102)
     A            P7102D    R               REFFLD(Ø7102)
     A            P7102E    R               REFFLD(Ø7102)
     A            P7102F    R               REFFLD(Ø7102)
     A            P7102G    R               REFFLD(Ø7102)
     A            P7102H    R               REFFLD(Ø7102)
     A            P7102I    R               REFFLD(Ø7102)
     A            P7102J    R               REFFLD(Ø7102)
      *
     A            P8275     R               REFFLD(Ø8275)
      * Key
     A          K PMN
     A          K PGN
     A          K PREP0
     A          K PREP1
     A          K PREP2
     A          K PREP3
     A          K PREP4
     A          K PREP5
     A          K PREP6
     A          K PREP7
     A          K PREP8
