********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(EFR911)
     A          R PCIR
      * Key
S01  A*           PMN            7S 0       COLHDG('Msg.no')
N01  A            PMN       R               REFFLD(ØMN)
     A            PGN            2S 0       COLHDG('Group no')
     A            PREP0     R               REFFLD(ØREP0)
     A            PREP1     R               REFFLD(ØREP1)
     A            PREP2     R               REFFLD(ØREP2)
     A            PREP3     R               REFFLD(ØREP3)
     A            PREP4     R               REFFLD(ØREP4)
     A            PREP5     R               REFFLD(ØREP5)
     A            PREP6     R               REFFLD(ØREP6)
     A            PREP7     R               REFFLD(ØREP7)
     A            PREP8     R               REFFLD(ØREP8)
      *
     A            P4233          3          COLHDG('Mark.instr, coded')
      * C210 Marks & labels
     A            P7102A        35          COLHDG('Shipping marks')
     A            P7102B        35          COLHDG('Shipping marks')
     A            P7102C        35          COLHDG('Shipping marks')
     A            P7102D        35          COLHDG('Shipping marks')
     A            P7102E        35          COLHDG('Shipping marks')
     A            P7102F        35          COLHDG('Shipping marks')
     A            P7102G        35          COLHDG('Shipping marks')
     A            P7102H        35          COLHDG('Shipping marks')
     A            P7102I        35          COLHDG('Shipping marks')
     A            P7102J        35          COLHDG('Shipping marks')
      * C506 Reference
     A            P1153          3          COLHDG('Ref.Q')
     A            P1154         35          COLHDG('Ref.no')
     A            P1156          6          COLHDG('Line no')
      * C507 Date/time/period
     A            P2005          3          COLHDG('Date/time/per Q')
     A            P2782         35          COLHDG('Date/time/period')
     A            P2781          3          COLHDG('Date/time/per fmt Q')
      *
     A            P8731          3          COLHDG('Cont/pack stat')
      * Key
     A          K PMN
     A          K PGN
     A          K PREP0
     A          K PREP1
     A          K PREP2
     A          K PREP3
     A          K PREP4
     A          K PREP5
     A          K PREP6
     A          K PREP7
     A          K PREP8
