     A                                      REF(EFR98A)
     A          R PDIR
      * Key
     A            PMN       R               REFFLD(ØMN)
     A            PGN       R               REFFLD(ØGN)
     A            PREP0     R               REFFLD(ØREP0)
     A            PREP1     R               REFFLD(ØREP1)
     A            PREP2     R               REFFLD(ØREP2)
     A            PREP3     R               REFFLD(ØREP3)
     A            PREP4     R               REFFLD(ØREP4)
     A            PREP5     R               REFFLD(ØREP5)
     A            PREP6     R               REFFLD(ØREP6)
     A            PREP7     R               REFFLD(ØREP7)
     A            PREP8     R               REFFLD(ØREP8)
      *
     A            P3499     R               REFFLD(Ø3499)
      * C085 Marital status details
     A            P3479     R               REFFLD(Ø3479)
     A            P1131A    R               REFFLD(Ø1131)
     A            P3055A    R               REFFLD(Ø3055)
     A            P3478     R               REFFLD(Ø3478)
      * C101 Religon details
     A            P3483     R               REFFLD(Ø3483)
     A            P1131B    R               REFFLD(Ø1131)
     A            P3055B    R               REFFLD(Ø3055)
     A            P3482     R               REFFLD(Ø3482)
      * Key
     A          K PMN
     A          K PGN
     A          K PREP0
     A          K PREP1
     A          K PREP2
     A          K PREP3
     A          K PREP4
     A          K PREP5
     A          K PREP6
     A          K PREP7
     A          K PREP8
