     A                                      REF(EFR901)
     A          R PIAR
      * Key
     A            PMN       R               REFFLD(ØMN)
     A            PGN       R               REFFLD(ØGN)
     A            PREP0     R               REFFLD(ØREP0)
     A            PREP1     R               REFFLD(ØREP1)
     A            PREP2     R               REFFLD(ØREP2)
     A            PREP3     R               REFFLD(ØREP3)
     A            PREP4     R               REFFLD(ØREP4)
     A            PREP5     R               REFFLD(ØREP5)
     A            PREP6     R               REFFLD(ØREP6)
     A            PREP7     R               REFFLD(ØREP7)
     A            PREP8     R               REFFLD(ØREP8)
      *
     A            P4347     R               REFFLD(Ø4347)
      * C212 Product identification
     A            P7020A    R               REFFLD(Ø7020)
     A            P7023A    R               REFFLD(Ø7023)
      * C212 Product identification
     A            P7020B    R               REFFLD(Ø7020)
     A            P7023B    R               REFFLD(Ø7023)
      * C212 Product identification
     A            P7020C    R               REFFLD(Ø7020)
     A            P7023C    R               REFFLD(Ø7023)
      * C212 Product identification
     A            P7020D    R               REFFLD(Ø7020)
     A            P7023D    R               REFFLD(Ø7023)
      * C212 Product identification
     A            P7020E    R               REFFLD(Ø7020)
     A            P7023E    R               REFFLD(Ø7023)
      * Key
     A          K PMN
     A          K PGN
     A          K PREP0
     A          K PREP1
     A          K PREP2
     A          K PREP3
     A          K PREP4
     A          K PREP5
     A          K PREP6
     A          K PREP7
     A          K PREP8
