     A                                      REF(EFR98A)
     A          R PNAR
      * Key
     A            PMN       R               REFFLD(ØMN)
     A            PGN       R               REFFLD(ØGN)
     A            PREP0     R               REFFLD(ØREP0)
     A            PREP1     R               REFFLD(ØREP1)
     A            PREP2     R               REFFLD(ØREP2)
     A            PREP3     R               REFFLD(ØREP3)
     A            PREP4     R               REFFLD(ØREP4)
     A            PREP5     R               REFFLD(ØREP5)
     A            PREP6     R               REFFLD(ØREP6)
     A            PREP7     R               REFFLD(ØREP7)
     A            PREP8     R               REFFLD(ØREP8)
      *
     A            P3035     R               REFFLD(Ø3035)
      * C206 Identification number
     A            P7402     R               REFFLD(Ø7402)
     A            P7405     R               REFFLD(Ø7405)
     A            P4405     R               REFFLD(Ø4405)
      * C082 Party identification details
     A            P3039     R               REFFLD(Ø3039)
     A            P1131     R               REFFLD(Ø1131)
     A            P3055     R               REFFLD(Ø3055)
      *
     A            P3403     R               REFFLD(Ø3403)
     A            P3397     R               REFFLD(Ø3397)
      * C816 Name component details
     A            P3405A    R               REFFLD(Ø3405)
     A            P3398A    R               REFFLD(Ø3398)
     A            P3401A    R               REFFLD(Ø3401)
     A            P3295A    R               REFFLD(Ø3295)
      * C816 Name component details
     A            P3405B    R               REFFLD(Ø3405)
     A            P3398B    R               REFFLD(Ø3398)
     A            P3401B    R               REFFLD(Ø3401)
     A            P3295B    R               REFFLD(Ø3295)
      * C816 Name component details
     A            P3405C    R               REFFLD(Ø3405)
     A            P3398C    R               REFFLD(Ø3398)
     A            P3401C    R               REFFLD(Ø3401)
     A            P3295C    R               REFFLD(Ø3295)
      * C816 Name component details
     A            P3405D    R               REFFLD(Ø3405)
     A            P3398D    R               REFFLD(Ø3398)
     A            P3401D    R               REFFLD(Ø3401)
     A            P3295D    R               REFFLD(Ø3295)
      * C816 Name component details
     A            P3405E    R               REFFLD(Ø3405)
     A            P3398E    R               REFFLD(Ø3398)
     A            P3401E    R               REFFLD(Ø3401)
     A            P3295E    R               REFFLD(Ø3295)
      * Key
     A          K PMN
     A          K PGN
     A          K PREP0
     A          K PREP1
     A          K PREP2
     A          K PREP3
     A          K PREP4
     A          K PREP5
     A          K PREP6
     A          K PREP7
     A          K PREP8
