     A          R EPOATR
     A            EAKUND         8S 0       COLHDG('KUNDE')
     A            EAART         35A         COLHDG('ART.NR')
     A            EATNN1         8S 0       COLHDG('TARIFFNR NO')
     A            EATNN2         8S 0       COLHDG('TARIFFNR NO')
     A            EAVKTE        11S 3       COLHDG('ENHETS VEKT')
     A            EAVKNE        11S 3       COLHDG('ENHETS VEKT NET')
     A            EAM3E         11S 7       COLHDG('ENHETS VOLUM, M3')
      *
     A          K EAKUND
     A          K EAART
