     A*%%TS  SD  20140925  125639  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A*
     A          R BILDE01
     A*%%TS  SD  20140925  125442  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'tILBAKE')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/EPOCVP'
     A                                      COLOR(BLU)
     A                                  1 17MSGCON(040 SHU0750 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  7  1MSGCON(008 SHU0748 *LIBL/SYMSGF)
     A            WSCVP1        70A  B  7 11CHECK(LC)
     A                                  9  1MSGCON(008 SHU0749 *LIBL/SYMSGF)
     A            WSCVP2        40A  B  9 11CHECK(LC)
     A            WSCVP3        40A  B 10 11CHECK(LC)
     A            WSCVP4        40A  B 11 11CHECK(LC)
     A            WSCVP5        40A  B 12 11CHECK(LC)
     A            WSCVP6        40A  B 13 11CHECK(LC)
     A            WSCVP7        40A  B 14 11CHECK(LC)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 SHU0539 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
