     A          R EPOHR                     PFILE(EPOH)
S01  A*         K EHSTA
     A          K EHKUND
     A          K EHBES
N01  A          O EHOPD                     COMP(NE 0)
