     A          R EPOHDPR
     A            EHKUND         8S 0       COLHDG('KUNDE')
     A            EHBES         10A         COLHDG('BESTILLINGSNR')
     A            EHDPNA        30A         COLHDG('LEVERANDØRS NAVN')
     A            EHDPA1        30A         COLHDG('LEVERANDØRS ADR1')
     A            EHDPA2        30A         COLHDG('LEVERANDØRS ADR2')
     A            EHDPA3        30A         COLHDG('LEVERANDØRS ADR3')
      *
     A          K EHKUND
     A          K EHBES
