     A          R EPOHR                     PFILE(EPOH)
     A          K EHKUND
     A          K EHBES
     A          K EHETD
     A          S EHSTA                     COMP(EQ '5')
