     A          R EPOHR
     A            EHKUND         8S 0       COLHDG('KUNDE')
     A            EHBES         10A         COLHDG('BESTILLINGSNR')
     A            EHDATO         8S 0       COLHDG('ORDREDATO')
     A            EHLEVN        17A         COLHDG('LEVERANDØRNR')
     A            EHLKNI         8S 0       COLHDG('LEV.S KNR HOS CC/XX')
     A            EHLVAI         5S 0       COLHDG('LEV.S VADR-NR HOS..')
     A            EHLNAV        30A         COLHDG('LEVERANDØRS NAVN')
     A            EHLAD1        30A         COLHDG('LEVERANDØRS ADR1')
     A            EHLAD2        30A         COLHDG('LEVERANDØRS ADR2')
     A            EHLAD3        30A         COLHDG('LEVERANDØRS ADR3')
     A            EHLAD4        30A         COLHDG('LEVERANDØRS ADR4')
     A            EHLREF        30A         COLHDG('LEVERANDØRS REF.')
     A            EHTTD          8S 0       COLHDG('TIDLIGST SHIP.DATO')
     A            EHETD          8S 0       COLHDG('FORVENTET SHIP.DATO')
     A            EHSTD          8S 0       COLHDG('SENESTE SHIP.DATO')
     A            EHETA          8S 0       COLHDG('FORVENTET ANK.DATO')
     A            EHTRKO        10A         COLHDG('TRANSP.KODE')
     A            EHLBET         3A         COLHDG('LEV.BETINGELSE')
     A            EHLBES        20A         COLHDG('LEV.BET. STED')
     A            EHFLK          2A         COLHDG('FRA LAND')
     A            EHFSTE         5A         COLHDG('FRA STED')
     A            EHTLK          2A         COLHDG('TIL LAND')
     A            EHTSTE         5A         COLHDG('TIL STED')
     A            EHGBES        30A         COLHDG('GODSBESKRIVELSE')
     A            EHANTS        11S 0       COLHDG('ANTALL STYKK')
     A            EHANTK         9S 3       COLHDG('ANTALL KOLLI')
     A            EHVKT         11S 3       COLHDG('VEKT')
     A            EHM3           7S 3       COLHDG('VOLUM, M3')
     A            EHSTA          5A         COLHDG('STATUS')
     A            EHSTA2         1A         COLHDG('STATUS 2')
     A            EHSTA3         1A         COLHDG('STATUS 3')
     A            EHREAS         5A         COLHDG('REASON')
     A            EHBLNR        16A         COLHDG('BL-NR')
     A            EHORIG         1A         COLHDG('ORIGINAL RECEIVED')
     A            EHAVD          4S 0       COLHDG('AVD.(-9999=DELETED)')
     A            EHOPD          7S 0       COLHDG('OPD.(-9999999=DEL.)')
     A            EHIID         10A         COLHDG('INNKJØPERS ID')
     A            EHINV         36A         COLHDG('INNKJØPERS NAVN')
     A            EHIEM         60A         COLHDG('INNKJØPERS MAILADR')
     A            EHITLF        16A         COLHDG('INNKJØPERS TLF-NR')
     A            EHIFAX        16A         COLHDG('INNKJØPERS FAX-NR')
     A            EHLKP         36A         COLHDG('LEVERANDØRS K.PERS')
     A            EHLEM         80A         COLHDG('LEVERANDØRS MAILADR')
     A            EHLTLF        16A         COLHDG('LEVERANDØRS TLF-NR')
     A            EHLFAX        16A         COLHDG('LEVERANDØRS FAX-NR')
     A            EHPRIO         1A         COLHDG('ORDRE PERIORITET')
     A            EHFTXT        70A         COLHDG('MERKNAD/FRITEKST')
      * EUROPRIS
     A            EHFACI         3A         COLHDG('FACILITY')
      *
     A          K EHKUND
     A          K EHBES
