     A          R EPOKR                     PFILE(EPOK)
     A          K EKKUND
     A          S EKDTPR                    COMP(GT 0)
     A            EKDTUT                    COMP(EQ 0)
     A          S EKDTHK                    COMP(GT 0)
     A            EKDTUT                    COMP(EQ 0)
     A          S EKDTIN                    COMP(GT 0)
     A            EKDTUT                    COMP(EQ 0)
