     A          R EPOKLOGR
     A            EGKUND         8S 0       COLHDG('KUNDE')
     A            EGBES         10A         COLHDG('BESTILLINGSNR')
     A            EGLIN          7S 0       COLHDG('LINJENR')
     A            EGULIN         5S 0       COLHDG('U-LINJENR')
     A            EGKLIN         5S 0       COLHDG('KOLLI LINJENR')
     A            EGTYPE         5A         COLHDG('POSTTYPE')
     A            EGDTLG         8S 0       COLHDG('LOGG DATO')
     A            EGTMLG         6S 0       COLHDG('LOGG TID')
     A            EGUSR         10A         COLHDG('BRUKER-ID')
      *
     A            EG1ST          1A         COLHDG('STATUS')
     A            EG1MRK        35A         COLHDG('KOLLI-NR')
     A            EG1DTPR        8S 0       COLHDG('UTSKRIFT DATO')
     A            EG1USR        10A         COLHDG('BRUKER-ID')
     A            EG1DTHK        8S 0       COLHDG('DATO HENTE FRA KUNDE')
     A            EG1DTIN        8S 0       COLHDG('DATO INN TERMINAL')
     A            EG1DTUT        8S 0       COLHDG('DATO UT TERMINAL')
     A            EG1DTLK        8S 0       COLHDG('DATO LEV. TIL KUNDE')
     A            EG1BILN       15A         COLHDG('UT BILNR')
      *
     A            EG2ST          1A         COLHDG('STATUS')
     A            EG2MRK        35A         COLHDG('KOLLI-NR')
     A            EG2DTPR        8S 0       COLHDG('UTSKRIFT DATO')
     A            EG2USR        10A         COLHDG('BRUKER-ID')
     A            EG2DTHK        8S 0       COLHDG('DATO HENTE FRA KUNDE')
     A            EG2DTIN        8S 0       COLHDG('DATO INN TERMINAL')
     A            EG2DTUT        8S 0       COLHDG('DATO UT TERMINAL')
     A            EG2DTLK        8S 0       COLHDG('DATO LEV. TIL KUNDE')
     A            EG2BILN       15A         COLHDG('UT BILNR')
