     A          R EPOL99R
     A            ELKUND         8S 0       COLHDG('KUNDE')
     A            ELBES         10A         COLHDG('BESTILLINGSNR')
     A            ELLIN          7S 0       COLHDG('LINJENR')
     A            ELULIN         5S 0       COLHDG('U-LINJENR')
     A            ELSTA          5A         COLHDG('STATUS')
     A            ELREAS         5A         COLHDG('REASON')
     A            ELAVD          4S 0       COLHDG('SHIPPED AVD.')
     A            ELOPD          7S 0       COLHDG('SHIPPED OPD.')
     A          K ELKUND
     A          K ELBES
     A          K ELLIN
     A          K ELULIN
