     A          R EPOLTR
     A            ETKUND         8S 0       COLHDG('KUNDE')
     A            ETBES         10A         COLHDG('BESTILLINGSNR')
     A            ETLIN          7S 0       COLHDG('LINJENR')
     A            ETULIN         5S 0       COLHDG('U-LINJENR')
      *
     A            ETBES1       256A         COLHDG('ARTIKKELBESKRIVELSE')
     A            ETBES2       256A         COLHDG('ARTIKKELBESKRIVELSE')
      *
     A            ETTNNE         8S 0       COLHDG('TARIFFNR NO')
     A            ETPRIS        11S 2       COLHDG('PRIS')
     A            ETREF1        35A         COLHDG('REFERANSE')
     A            ETREF2        35A         COLHDG('REFERANSE')
      *
     A          K ETKUND
     A          K ETBES
     A          K ETLIN
     A          K ETULIN
