     A          R EPOLR                     PFILE(EPOL)
     A          K ELART
     A          K ELKUND
     A          K ELBES
     A          S ELAVD                     COMP(GE 0)
