     A          R EPOPOSR                   PFILE(EPOPOS)
     A          K EPAVD
     A          K EPOPD
     A          K EPKUND
     A          K EPBES
     A          K EPLIN
     A          K EPULIN
