     A          R EPOPOSR
     A            EPAVD          4S 0       COLHDG('SHIPPED AVD.')
     A            EPOPD          7S 0       COLHDG('SHIPPED OPD.')
     A            EPPOS          5S 0       COLHDG('POSISJON')
     A            EPKUND         8S 0       COLHDG('KUNDE')
     A            EPBES         10A         COLHDG('BESTILLINGSNR')
     A            EPLIN          7S 0       COLHDG('LINJENR')
     A            EPULIN         5S 0       COLHDG('U-LINJENR')
     A          K EPAVD
     A          K EPOPD
     A          K EPPOS
