     A          R EPOS05FR
     A            E5USER        10A
     A            E5LIB         10A
     A            E5QRY         10A
     A            E5SEL          1A
     A            E5PDF          1A
     A            E5EM          70A
     A            E5KN           8S 0
     A            E5NV          30A
     A            E5CVP1        70A
     A            E5CVP2        40A
     A            E5CVP3        40A
     A            E5CVP4        40A
     A            E5CVP5        40A
     A            E5CVP6        40A
     A            E5CVP7        40A
     A            E5CVP8        40A
     A          K E5USER
