     A          R EPOTTR                    PFILE(EPOTT)
     A          K ETKUND
     A          K ETBES
     A          K ETLIN
     A          K ETULIN
     A          K ETACTI
