     A          R EPOTTR
     A            ETKUND         8S 0       COLHDG('KUNDE')
     A            ETBES         10A         COLHDG('BESTILLINGSNR')
     A            ETLIN          7S 0       COLHDG('LINJENR')
     A            ETULIN         5S 0       COLHDG('U-LINJENR')
     A            ETSTAT         1A         COLHDG('S=SEND,F=FERDIG')
     A            ETACTI         5A         COLHDG('HENDELSESKODE')
     A            ETTEXT        70A         COLHDG('TEKST')
     A            ETDATE         8S 0       COLHDG('LOGGDATO')
     A            ETTIME         6S 0       COLHDG('LOGGTID')
     A            ETUSER        10A         COLHDG('USER')
     A          K ETKUND
     A          K ETBES
     A          K ETLIN
     A          K ETULIN
