     A                                      REF(EFR96B)
     A          R QTYR
      * Key
     A            QMN       R               REFFLD(ØMN)
     A            QGN       R               REFFLD(ØGN)
     A            QREP0     R               REFFLD(ØREP0)
     A            QREP1     R               REFFLD(ØREP1)
     A            QREP2     R               REFFLD(ØREP2)
     A            QREP3     R               REFFLD(ØREP3)
     A            QREP4     R               REFFLD(ØREP4)
     A            QREP5     R               REFFLD(ØREP5)
     A            QREP6     R               REFFLD(ØREP6)
     A            QREP7     R               REFFLD(ØREP7)
     A            QREP8     R               REFFLD(ØREP8)
      * C186 Quantity details
     A            Q6063     R               REFFLD(Ø6063)
     A            Q6060     R               REFFLD(Ø6060)
     A            Q6411     R               REFFLD(Ø6411)
      * Key
     A          K QMN
     A          K QGN
     A          K QREP0
     A          K QREP1
     A          K QREP2
     A          K QREP3
     A          K QREP4
     A          K QREP5
     A          K QREP6
     A          K QREP7
     A          K QREP8
