     A          R QUAR
     A            QUALTA         4          COLHDG('Tag number')
     A            QUALCO         6          COLHDG('Qualifier code')
     A            QUALTX        60          COLHDG('Qualf.text')
     A            QUALD1        58          COLHDG('Qualf.description-1')
     A            QUALD2        58          COLHDG('Qualf.description-2')
     A            QUALD3        58          COLHDG('Qualf.description-3')
     A            QUALD4        58          COLHDG('Qualf.description-4')
     A            QUALD5        58          COLHDG('Qualf.description-5')
     A            QUALTY         1          COLHDG('Type' 'P=Private')
     A          K QUALTA
     A          K QUALCO
