     A                                      REF(EFR94B)
     A          R QVAR
      * Key
     A            QMN       R               REFFLD(ØMN)
     A            QGN       R               REFFLD(ØGN)
     A            QREP0     R               REFFLD(ØREP0)
     A            QREP1     R               REFFLD(ØREP1)
     A            QREP2     R               REFFLD(ØREP2)
     A            QREP3     R               REFFLD(ØREP3)
     A            QREP4     R               REFFLD(ØREP4)
     A            QREP5     R               REFFLD(ØREP5)
     A            QREP6     R               REFFLD(ØREP6)
     A            QREP7     R               REFFLD(ØREP7)
     A            QREP8     R               REFFLD(ØREP8)
      * C279 Quantity difference information
     A            Q6064     R               REFFLD(Ø6064)
     A            Q6063     R               REFFLD(Ø6063)
      *
     A            Q4221     R               REFFLD(Ø4221)
      * C262 Reason for change
     A            Q4295     R               REFFLD(Ø4295)
     A            Q4294     R               REFFLD(Ø4294)
      * Key
     A          K QMN
     A          K QGN
     A          K QREP0
     A          K QREP1
     A          K QREP2
     A          K QREP3
     A          K QREP4
     A          K QREP5
     A          K QREP6
     A          K QREP7
     A          K QREP8
