     A                                      REF(EFR95B)
     A          R RCSR
      * Key
     A            RMN       R               REFFLD(ØMN)
     A            RGN       R               REFFLD(ØGN)
     A            RREP0     R               REFFLD(ØREP0)
     A            RREP1     R               REFFLD(ØREP1)
     A            RREP2     R               REFFLD(ØREP2)
     A            RREP3     R               REFFLD(ØREP3)
     A            RREP4     R               REFFLD(ØREP4)
     A            RREP5     R               REFFLD(ØREP5)
     A            RREP6     R               REFFLD(ØREP6)
     A            RREP7     R               REFFLD(ØREP7)
     A            RREP8     R               REFFLD(ØREP8)
      *
     A            R7293     R               REFFLD(Ø7293)
      * C550 Requirement/condition identification
     A            R7295     R               REFFLD(Ø7295)
     A            R1131     R               REFFLD(Ø1131)
     A            R3055     R               REFFLD(Ø3055)
      *
     A            R1229     R               REFFLD(Ø1229)
      * Key
     A          K RMN
     A          K RGN
     A          K RREP0
     A          K RREP1
     A          K RREP2
     A          K RREP3
     A          K RREP4
     A          K RREP5
     A          K RREP6
     A          K RREP7
     A          K RREP8
