     A                                      REF(EFR98A)
     A          R RELR
      * Key
     A            RMN       R               REFFLD(ØMN)
     A            RGN       R               REFFLD(ØGN)
     A            RREP0     R               REFFLD(ØREP0)
     A            RREP1     R               REFFLD(ØREP1)
     A            RREP2     R               REFFLD(ØREP2)
     A            RREP3     R               REFFLD(ØREP3)
     A            RREP4     R               REFFLD(ØREP4)
     A            RREP5     R               REFFLD(ØREP5)
     A            RREP6     R               REFFLD(ØREP6)
     A            RREP7     R               REFFLD(ØREP7)
     A            RREP8     R               REFFLD(ØREP8)
      *
     A            R9141     R               REFFLD(Ø9141)
      * C941 Relationship
     A            R9143     R               REFFLD(Ø9143)
     A            R1131     R               REFFLD(Ø1131)
     A            R3055     R               REFFLD(Ø3055)
     A            R9142     R               REFFLD(Ø9142)
      * Key
     A          K RMN
     A          K RGN
     A          K RREP0
     A          K RREP1
     A          K RREP2
     A          K RREP3
     A          K RREP4
     A          K RREP5
     A          K RREP6
     A          K RREP7
     A          K RREP8
