********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(EFR911)
     A          R RFFR
      * Key
S01  A*           RMN            7S 0       COLHDG('Msg.no')
N01  A            RMN       R               REFFLD(ØMN)
     A            RGN            2S 0       COLHDG('Group no')
     A            RREP0     R               REFFLD(ØREP0)
     A            RREP1     R               REFFLD(ØREP1)
     A            RREP2     R               REFFLD(ØREP2)
     A            RREP3     R               REFFLD(ØREP3)
     A            RREP4     R               REFFLD(ØREP4)
     A            RREP5     R               REFFLD(ØREP5)
     A            RREP6     R               REFFLD(ØREP6)
     A            RREP7     R               REFFLD(ØREP7)
     A            RREP8     R               REFFLD(ØREP8)
      * C506 Reference
     A            R1153          3          COLHDG('Ref.Q')
     A            R1154         35          COLHDG('Ref.no')
     A            R1156          6          COLHDG('Line no')
      * C507 Date/time/period
     A            R2005          3          COLHDG('Time Q')
     A            R2782         35          COLHDG('Time')
     A            R2781          3          COLHDG('Time format Q')
      * Key
     A          K RMN
     A          K RGN
     A          K RREP0
     A          K RREP1
     A          K RREP2
     A          K RREP3
     A          K RREP4
     A          K RREP5
     A          K RREP6
     A          K RREP7
     A          K RREP8
