     A                                      REF(EFR95B)
     A          R RFFR
      * Key
     A            RMN       R               REFFLD(ØMN)
     A            RGN       R               REFFLD(ØGN)
     A            RREP0     R               REFFLD(ØREP0)
     A            RREP1     R               REFFLD(ØREP1)
     A            RREP2     R               REFFLD(ØREP2)
     A            RREP3     R               REFFLD(ØREP3)
     A            RREP4     R               REFFLD(ØREP4)
     A            RREP5     R               REFFLD(ØREP5)
     A            RREP6     R               REFFLD(ØREP6)
     A            RREP7     R               REFFLD(ØREP7)
     A            RREP8     R               REFFLD(ØREP8)
      * C506 Reference
     A            R1153     R               REFFLD(Ø1153)
     A            R1154     R               REFFLD(Ø1154)
     A            R1156     R               REFFLD(Ø1156)
      *
     A            R4000     R               REFFLD(Ø4000)
      * Key
     A          K RMN
     A          K RGN
     A          K RREP0
     A          K RREP1
     A          K RREP2
     A          K RREP3
     A          K RREP4
     A          K RREP5
     A          K RREP6
     A          K RREP7
     A          K RREP8
