     A                                      REF(EFR04A)
     A          R RNGR
      * Key
     A            RMN       R               REFFLD(ØMN)
     A            RGN       R               REFFLD(ØGN)
     A            RREP0     R               REFFLD(ØREP0)
     A            RREP1     R               REFFLD(ØREP1)
     A            RREP2     R               REFFLD(ØREP2)
     A            RREP3     R               REFFLD(ØREP3)
     A            RREP4     R               REFFLD(ØREP4)
     A            RREP5     R               REFFLD(ØREP5)
     A            RREP6     R               REFFLD(ØREP6)
     A            RREP7     R               REFFLD(ØREP7)
     A            RREP8     R               REFFLD(ØREP8)
      *
     A            R6167     R               REFFLD(Ø6167)
      * C280 Range
     A            R6411     R               REFFLD(Ø6411)
     A            R6162     R               REFFLD(Ø6162)
     A            R6152     R               REFFLD(Ø6152)
      * Key
     A          K RMN
     A          K RGN
     A          K RREP0
     A          K RREP1
     A          K RREP2
     A          K RREP3
     A          K RREP4
     A          K RREP5
     A          K RREP6
     A          K RREP7
     A          K RREP8
