     A                                      REF(EFR04A)
     A          R SCDR
      * Key
     A            SMN       R               REFFLD(ØMN)
     A            SGN       R               REFFLD(ØGN)
     A            SREP0     R               REFFLD(ØREP0)
     A            SREP1     R               REFFLD(ØREP1)
     A            SREP2     R               REFFLD(ØREP2)
     A            SREP3     R               REFFLD(ØREP3)
     A            SREP4     R               REFFLD(ØREP4)
     A            SREP5     R               REFFLD(ØREP5)
     A            SREP6     R               REFFLD(ØREP6)
     A            SREP7     R               REFFLD(ØREP7)
     A            SREP8     R               REFFLD(ØREP8)
      *
     A            S7497     R               REFFLD(Ø7497)
      * C786 STRUCTURE COMPONENT IDENTIFICATION
     A            S7512     R               REFFLD(Ø7512)
     A            S7405     R               REFFLD(Ø7405)
      * C082 PARTY IDENT IDENTIFICATION
     A            S3039     R               REFFLD(Ø3039)
     A            S1131A    R               REFFLD(Ø1131)
     A            S3055A    R               REFFLD(Ø3055)
      *
     A            S4405     R               REFFLD(Ø4405)
     A            S1222     R               REFFLD(Ø1222)
      * C778 POSITION IDENTIFICATION
     A            S7164     R               REFFLD(Ø7164)
     A            S1050     R               REFFLD(Ø1050)
      * C240 PRODUCT CHARACTERISTIC
     A            S7037     R               REFFLD(Ø7037)
     A            S1131B    R               REFFLD(Ø1131)
     A            S3055B    R               REFFLD(Ø3055)
     A            S7036A    R               REFFLD(Ø7036)
     A            S7036B    R               REFFLD(Ø7036)
      * Key
     A          K SMN
     A          K SGN
     A          K SREP0
     A          K SREP1
     A          K SREP2
     A          K SREP3
     A          K SREP4
     A          K SREP5
     A          K SREP6
     A          K SREP7
     A          K SREP8
