     A                                      REF(EFR03A)
     A          R SFIR
      * Key
     A            SMN       R               REFFLD(ØMN)
     A            SGN       R               REFFLD(ØGN)
     A            SREP0     R               REFFLD(ØREP0)
     A            SREP1     R               REFFLD(ØREP1)
     A            SREP2     R               REFFLD(ØREP2)
     A            SREP3     R               REFFLD(ØREP3)
     A            SREP4     R               REFFLD(ØREP4)
     A            SREP5     R               REFFLD(ØREP5)
     A            SREP6     R               REFFLD(ØREP6)
     A            SREP7     R               REFFLD(ØREP7)
     A            SREP8     R               REFFLD(ØREP8)
      *
     A            S7164     R               REFFLD(Ø7164)
      * C814 Safety section
     A            S4046     R               REFFLD(Ø4046)
     A            S4044     R               REFFLD(Ø4044)
      * C815 Additional Safety information
     A            S4039     R               REFFLD(Ø4039)
     A            S1131     R               REFFLD(Ø1131)
     A            S3055     R               REFFLD(Ø3055)
     A            S4038     R               REFFLD(Ø4038)
      *
     A            S4513     R               REFFLD(Ø4513)
      * Key
     A          K SMN
     A          K SGN
     A          K SREP0
     A          K SREP1
     A          K SREP2
     A          K SREP3
     A          K SREP4
     A          K SREP5
     A          K SREP6
     A          K SREP7
     A          K SREP8
