     A          R ESGENTABR
     A            GTUSER        10A         COLHDG('USER')
     A            GTPROG        10A         COLHDG('PROG')
     A            GTSEKV       100A         COLHDG('SEKV,1-50')
      *
     A          K GTUSER
     A          K GTPROG
