     A          R ESOSF1R
     A            O1AVD          4S 0       COLHDG('Avdeling')
     A            O1OPD          7S 0       COLHDG('Oppdragsnr')
     A            O1TO          50A         COLHDG('Subcontractor')
     A            O1LDT          8S 0       COLHDG('Loadingdate')
     A            O1LTM          4S 0       COLHDG('Loadingtime')
     A            O1CONT        50A         COLHDG('Size/type of cont. ')
     A            O1PSTD        50A         COLHDG('Pick up depot')
     A            O1PREF        30A         COLHDG('Pick up reference')
     A            O1SNV         50A         COLHDG('Name of loading adr')
     A            O1SAD1        50A         COLHDG('Address 1')
     A            O1SAD2        50A         COLHDG('Address 2')
     A            O1SAD3        50A         COLHDG('Address 3')
     A            O1SLK          2A         COLHDG('Landkode')
     A            O1SREF        30A         COLHDG('Loading reference')
     A            O1NT           7S 0       COLHDG('Colli')
     A            O1DSC         40A         COLHDG('Goods discription')
     A            O1VKT          9S 0       COLHDG('Weight')
     A            O1DOC         50A         COLHDG('Info custom doc.')
     A            O1DSTD        25A         COLHDG('Depot to drop cont.')
     A            O1TSTD        25A         COLHDG('Outgoing terminal')
     A            O1DREF        30A         COLHDG('Drop reference')
     A            O1BCD          5A         COLHDG('Vessel code')
     A            O1TARI        50A         COLHDG('Agreed rate')
     A            O1RDT          8S 0       COLHDG('Reg.date')
     A            O1RTM          6S 0       COLHDG('Reg.time')
     A            O1PDT          8S 0       COLHDG('Printdate')
     A            O1PTM          6S 0       COLHDG('Printtime')
     A          K O1AVD
     A          K O1OPD
