     A          R ESOS13PA
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
     A            O1TO          50A    20 30
     A            O1LDT          8  0  23 25EDTWRD('    .  .  ')
     A            O1LTM          4  0  23 37EDTWRD('  :  ')
     A            O1CONT        50A    26 25
     A            O1PSTD        50A    28 25
     A            O1PREF        30A    30 25
     A            O1SNV         50A    31 25
     A            O1SAD1        50A    32 25
     A            O1SAD2        50A    33 25
     A            O1SAD3        50A    34 25
     A            O1SLK          2A    35 25
     A            KLKNVN        30A    35 29
     A            O1SREF        30A    37 25
     A            O1NT           7  0  39 20EDTCDE(Z)
     A                                 39 28'/'
     A            O1DSC         40A    39 30
     A                                 39 56'/'
     A            O1VKT          9  0  39 58EDTCDE(Z)
     A            O1DOC         50A    42 25
     A            O1DSTD        25A    45 25
     A            O1TSTD        25A    45 51
     A            O1DREF        30A    47 25
     A            O1BCD          5A    49 25
     A            CBNAB         30A    49 32
     A            O1AVD          4  0  51 25EDTCDE(Z)
     A                                 51 30'/'
     A            O1OPD          7  0  51 32EDTCDE(Z)
     A            O1TARI        50A    55 25
