     A          R ESOS19PA
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
     A            O3TO          50A    18 30
     A            O3LDT          8  0  21 25EDTWRD('    .  .  ')
     A            O3LTM          4  0  21 37EDTWRD('  :  ')
     A            O3CONT        50A    24 25
     A            O3SNV         50A    26 25
     A            O3SAD1        50A    27 25
     A            O3SAD2        50A    28 25
     A            O3SAD3        50A    29 25
     A            O3SLK          2A    30 25
     A            O3SLKNV       30A    30 29
     A            O3LREF        30A    31 25
     A            O3NT           7  0  34 25EDTCDE(Z)
     A                                 34 33'/'
     A            O3DSC         40A    34 35
     A                                 34 61'/'
     A            O3VKT          9  0  34 63EDTCDE(Z)
     A            O3DOC         50A    36 25
     A            O3KNV         50A    38 25
     A            O3KAD1        50A    39 25
     A            O3KAD2        50A    40 25
     A            O3KAD3        50A    41 25
     A            O3KLK          2A    42 25
     A            O3KLKNV       30A    42 29
     A            O3KKP         50A    43 25
     A            O3DREF        30A    44 25
     A            O3DDT          8  0  45 25EDTWRD('    .  .  ')
     A            O3DTM          4  0  45 37EDTWRD('  :  ')
     A            O3BCD          5A    47 25
     A            CBNAB         30A    47 32
     A            O3AVD          4  0  50 25EDTCDE(Z)
     A                                 50 30'/'
     A            O3OPD          7  0  50 32EDTCDE(Z)
     A            O3TARI        50A    54 25
