     A                                      REF(EFR98A)
     A          R SPSR
      * Key
     A            SMN       R               REFFLD(ØMN)
     A            SGN       R               REFFLD(ØGN)
     A            SREP0     R               REFFLD(ØREP0)
     A            SREP1     R               REFFLD(ØREP1)
     A            SREP2     R               REFFLD(ØREP2)
     A            SREP3     R               REFFLD(ØREP3)
     A            SREP4     R               REFFLD(ØREP4)
     A            SREP5     R               REFFLD(ØREP5)
     A            SREP6     R               REFFLD(ØREP6)
     A            SREP7     R               REFFLD(ØREP7)
     A            SREP8     R               REFFLD(ØREP8)
      * C526 Frequency details
     A            S6071     R               REFFLD(Ø6071)
     A            S6072     R               REFFLD(Ø6072)
     A            S6411     R               REFFLD(Ø6411)
      *
     A            S6074     R               REFFLD(Ø6074)
      * C512 Size details
     A            S6173A    R               REFFLD(Ø6173)
     A            S6174A    R               REFFLD(Ø6174)
      * C512 Size details
     A            S6173B    R               REFFLD(Ø6173)
     A            S6174B    R               REFFLD(Ø6174)
      * C512 Size details
     A            S6173C    R               REFFLD(Ø6173)
     A            S6174C    R               REFFLD(Ø6174)
      * C512 Size details
     A            S6173D    R               REFFLD(Ø6173)
     A            S6174D    R               REFFLD(Ø6174)
      * C512 Size details
     A            S6173E    R               REFFLD(Ø6173)
     A            S6174E    R               REFFLD(Ø6174)
      * Key
     A          K SMN
     A          K SGN
     A          K SREP0
     A          K SREP1
     A          K SREP2
     A          K SREP3
     A          K SREP4
     A          K SREP5
     A          K SREP6
     A          K SREP7
     A          K SREP8
