     A*___________________________________________
      *  XREF ESPED PARAMETER / PRODUKT (HVILKE BRUKES HVOR)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R ESPXREFR                  PFILE(ESPXREF)
     A          K ESPROD
     A          K ESKODE
