     A*___________________________________________
      *  XREF ESPED PARAMETER / PRODUKT (HVILKE BRUKES HVOR)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R ESPXREFR
     A            ESKODE         5A         COLHDG('PARAM-KODE')
     A            ESPROD        15A         COLHDG('PRODUKT')
     A          K ESKODE
     A          K ESPROD
