     A*__________________________
     A* SYEDI / System referance
     A*""""""""""""""""""""""""""
     A          R SRR                       TEXT('System referance')
     A            AVD            4S 0       COLHDG('Avdeling')
     A            BEL10S        10S 0       COLHDG('Beløp')
     A            DATA          80          COLHDG('RJE Data string')
     A            DATA1K      1024          COLHDG('1024 Data string')
     A            DT             8S 0       COLHDG('Date YYYYMMDD')
     A            FILE          10          COLHDG('File')
     A            FRBN           3S 0       COLHDG('Fraktbrevnummer')
     A            JCLC          80          COLHDG('JCL Command')
     A            JCLFE          1          COLHDG('JCL Command' 'Før/+
     A                                            Etter')
     A            LIB           10          COLHDG('Library')
     A            LI5            5S 0       COLHDG('Line_no.')
     A            MBR           10          COLHDG('Member')
     A            MBRS          13  0       COLHDG('Mbr size-bytes')
     A            MN             9S 0       COLHDG('Message_no.')
     A            NA            30          COLHDG('Navn')
     A            N0004         35          COLHDG('Interchange_ID' 'Sender')
     A            N0010         35          COLHDG('Interchange_ID' 'Receiver')
     A            N0020         14          COLHDG('Interchange_ref.')
     A            N0026         14          COLHDG('Application_ref.')
     A            N0035          1          COLHDG('Testindicator')
     A            N0036          7S 0       COLHDG('No_of_messages')
     A            N0062         14          COLHDG('Message_reference')
     A            N0065          6          COLHDG('Message_ID')
     A            N0068         35          COLHDG('Common Access Ref')
EV5  A            N0068A         8S 0       COLHDG('Dekl.Dato')
     A            N0068B         6S 0       COLHDG('Dekl.Sekvensnr')
     A            N0068C         2S 0       COLHDG('Dekl.Versjonsnr')
     A            N1N07          3          COLHDG('Meldingsfunksjon')
     A            N1N08          2          COLHDG('Meldingsfunksjo+
     A                                            n' 'Korrigert')
     A            N1001          3          COLHDG('Message name')
     A            N1004         35          COLHDG('Message number')
     A            N1225          3          COLHDG('Message Function')
     A            N3039D         8S 0       COLHDG('Deklarantens' 'Ref+
     A                                            eranse')
     A            N3039E         6S 0       COLHDG('Ekspidisjons' 'Enh+
     A                                            et')
     A            N9N01          1S 0       COLHDG('Ekspidisjons' 'Pri+
     A                                            oritet')
     A            SN             9S 0       COLHDG('Interchange_no.')
     A            SR             1          COLHDG('Send/Recive')
     A            ST             1          COLHDG('Status')
     A            TDN            7S 0       COLHDG('Tolldeklarasjonsnr')
     A            TM             6S 0       COLHDG('Time HMS')
