     A          R HEADER
     A                                  8  3'Advisering til :'
     A            FAX           21A     8 23
     A                                 10  3'Kontaktperson  :'
     A            CCONTA        30A    10 23
     A                                 15 54'************************'
     A                                      HIGHLIGHT
     A                                 16 54'* MELDING OM HENDELSE  *'
     A                                      HIGHLIGHT
     A                                 17 54'************************'
     A                                      HIGHLIGHT
     A* possisjoner før detaljlinjer
     A                                 23  3' '
     A
     A* RECORD/FELT-NVN SOM I MAIL-SOURCE-FIL 'ARKSRC' FOR ENKELHET/LIKHET I RPG
     A          R ARCDAT                    SPACEA(1)
     A            SRCDTA        80         3
