     A                                      REF(EFR04A)
     A          R TCCR
      * Key
     A            TMN       R               REFFLD(ØMN)
     A            TGN       R               REFFLD(ØGN)
     A            TREP0     R               REFFLD(ØREP0)
     A            TREP1     R               REFFLD(ØREP1)
     A            TREP2     R               REFFLD(ØREP2)
     A            TREP3     R               REFFLD(ØREP3)
     A            TREP4     R               REFFLD(ØREP4)
     A            TREP5     R               REFFLD(ØREP5)
     A            TREP6     R               REFFLD(ØREP6)
     A            TREP7     R               REFFLD(ØREP7)
     A            TREP8     R               REFFLD(ØREP8)
      * C200 Charge
     A            T8023     R               REFFLD(Ø8023)
     A            T1131A    R               REFFLD(Ø1131)
     A            T3055A    R               REFFLD(Ø3055)
     A            T8022     R               REFFLD(Ø8022)
     A            T4237     R               REFFLD(Ø4237)
      * C203 Rate/tariff class
     A            T5243A    R               REFFLD(Ø5243)
     A            T1131B    R               REFFLD(Ø1131)
     A            T3055B    R               REFFLD(Ø3055)
     A            T5242     R               REFFLD(Ø5242)
     A            T5275A    R               REFFLD(Ø5275)
     A            T1131C    R               REFFLD(Ø1131)
     A            T3055C    R               REFFLD(Ø3055)
     A            T5275B    R               REFFLD(Ø5275)
     A            T1131D    R               REFFLD(Ø1131)
     A            T3055D    R               REFFLD(Ø3055)
      * C528 Commodity/rate detail
     A            T7357     R               REFFLD(Ø7357)
     A            T1131E    R               REFFLD(Ø1131)
     A            T3055E    R               REFFLD(Ø3055)
      * C554 Rate/tariff class detail
     A            T5243B    R               REFFLD(Ø5243)
     A            T1131F    R               REFFLD(Ø1131)
     A            T3055F    R               REFFLD(Ø3055)
      * Key
     A          K TMN
     A          K TGN
     A          K TREP0
     A          K TREP1
     A          K TREP2
     A          K TREP3
     A          K TREP4
     A          K TREP5
     A          K TREP6
     A          K TREP7
     A          K TREP8
