     A                                      REF(EFR98B)
     A          R TDTR
      * Key
     A            TMN       R               REFFLD(ØMN)
     A            TGN       R               REFFLD(ØGN)
     A            TREP0     R               REFFLD(ØREP0)
     A            TREP1     R               REFFLD(ØREP1)
     A            TREP2     R               REFFLD(ØREP2)
     A            TREP3     R               REFFLD(ØREP3)
     A            TREP4     R               REFFLD(ØREP4)
     A            TREP5     R               REFFLD(ØREP5)
     A            TREP6     R               REFFLD(ØREP6)
     A            TREP7     R               REFFLD(ØREP7)
     A            TREP8     R               REFFLD(ØREP8)
      *
     A            T8051     R               REFFLD(Ø8051)
     A            T8028     R               REFFLD(Ø8028)
      * C220 Mode of transport
     A            T8067     R               REFFLD(Ø8067)
     A            T8066     R               REFFLD(Ø8066)
      * C228 Transport means
     A            T8179     R               REFFLD(Ø8179)
     A            T8178     R               REFFLD(Ø8178)
      * C040 Carrier
     A            T3127     R               REFFLD(Ø3127)
     A            T1131A    R               REFFLD(Ø1131)
     A            T3055A    R               REFFLD(Ø3055)
     A            T3128     R               REFFLD(Ø3128)
      *
     A            T8101     R               REFFLD(Ø8101)
      * C401 Excess transportation information
     A            T8457     R               REFFLD(Ø8457)
     A            T8459     R               REFFLD(Ø8459)
     A            T7130     R               REFFLD(Ø7130)
      * C222 Transport identification
     A            T8213     R               REFFLD(Ø8213)
     A            T1131B    R               REFFLD(Ø1131)
     A            T3055B    R               REFFLD(Ø3055)
     A            T8212     R               REFFLD(Ø8212)
     A            T8453     R               REFFLD(Ø8453)
      *
     A            T8281     R               REFFLD(Ø8281)
      * Key
     A          K TMN
     A          K TGN
     A          K TREP0
     A          K TREP1
     A          K TREP2
     A          K TREP3
     A          K TREP4
     A          K TREP5
     A          K TREP6
     A          K TREP7
     A          K TREP8
