********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(EFR912)
     A          R TDTR
      * Key
S01  A*           TMN            7S 0       COLHDG('Msg.no')
N01  A            TMN       R               REFFLD(ØMN)
     A            TGN            2S 0       COLHDG('Group no')
     A            TREP0     R               REFFLD(ØREP0)
     A            TREP1     R               REFFLD(ØREP1)
     A            TREP2     R               REFFLD(ØREP2)
     A            TREP3     R               REFFLD(ØREP3)
     A            TREP4     R               REFFLD(ØREP4)
     A            TREP5     R               REFFLD(ØREP5)
     A            TREP6     R               REFFLD(ØREP6)
     A            TREP7     R               REFFLD(ØREP7)
     A            TREP8     R               REFFLD(ØREP8)
      *
     A            T8051          3          COLHDG('Transport stage Q')
     A            T8028         17          COLHDG('Conveyane ref no')
      * C220 Mode of transport
     A            T8067          3          COLHDG('Trans.mode, coded')
     A            T8066         17          COLHDG('Trans.mode, text')
      * C222 Transport identification
     A            T8213          9          COLHDG('Trans.ID')
     A            T1131A         3          COLHDG('Code list Q')
     A            T3055A         3          COLHDG('Code list R')
     A            T8212A        17          COLHDG('Resp.agency, coded')
     A            T8212B        17          COLHDG('Trans.ID text-1')
     A            T8453          3          COLHDG('Nation of trans.ID')
      * C228 Transport means
     A            T8179          8          COLHDG('Trans.ID meantype')
     A            T8178         17          COLHDG('Trans.ID meantext')
      * C040 Carrier
     A            T3127         17          COLHDG('Carrier ID')
     A            T1131B         3          COLHDG('Code list Q')
     A            T3055B         3          COLHDG('Resp.agency, coded')
     A            T3128         35          COLHDG('Carrier name')
      *
     A            T8101          3          COLHDG('Trans.direction code')
      * C507 Date/time/period
     A            T2005          3          COLHDG('Time Q')
     A            T2380         35          COLHDG('Time')
     A            T2379          3          COLHDG('Time format Q')
      * C401 Excess transportation information
     A            T8457          3          COLHDG('Exc.trans.reason')
     A            T8459          3          COLHDG('Exc.trans.resp.')
     A            T7130         17          COLHDG('Cust.aut.no')
      * Key
     A          K TMN
     A          K TGN
     A          K TREP0
     A          K TREP1
     A          K TREP2
     A          K TREP3
     A          K TREP4
     A          K TREP5
     A          K TREP6
     A          K TREP7
     A          K TREP8
