********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(EFR911)
     A          R TMPR
      * Key
S01  A*           TMN            7S 0       COLHDG('Msg.no')
N01  A            TMN       R               REFFLD(ØMN)
     A            TGN            2S 0       COLHDG('Group no')
     A            TREP0     R               REFFLD(ØREP0)
     A            TREP1     R               REFFLD(ØREP1)
     A            TREP2     R               REFFLD(ØREP2)
     A            TREP3     R               REFFLD(ØREP3)
     A            TREP4     R               REFFLD(ØREP4)
     A            TREP5     R               REFFLD(ØREP5)
     A            TREP6     R               REFFLD(ØREP6)
     A            TREP7     R               REFFLD(ØREP7)
     A            TREP8     R               REFFLD(ØREP8)
      *
     A            T6711          3          COLHDG('Temperature Q')
      * C221 Temperature range
     A            T6411A         3          COLHDG('Measure unit Q')
     A            T6162          3          COLHDG('Temperature min')
     A            T6152          3          COLHDG('Temperature max')
      * C239 Temperature setting
     A            T6712          3          COLHDG('Temperature')
     A            T6411B         3          COLHDG('Measure unit Q')
      * Key
     A          K TMN
     A          K TGN
     A          K TREP0
     A          K TREP1
     A          K TREP2
     A          K TREP3
     A          K TREP4
     A          K TREP5
     A          K TREP6
     A          K TREP7
     A          K TREP8
