     A                                      JDFTVAL
     A          R UNHJ1                     JFILE(EDIM EUNH EDIS)
     A          J                           JOIN(EDIM EUNH)
     A                                      JFLD(MMN UMN)
     A          J                           JOIN(EDIM EDIS)
     A                                      JFLD(MSN SSN)
     A            M0004
     A            M0010
     A            M0035
     A            M0062
     A            M0065
     A            M0068
     A            M1001
     A            M1004
     A            M1225
     A            MSN
     A            MMN
     A            MSR
     A            MST
     A            MDT
     A            MTM
     A            MAVD
     A            MTDN
     A            MFFBNR
     A            MVEN
     A            U0052
     A            U0054
     A            U0051
     A            U0057
     A            S0020
     A            S0026
     A            SST
     A            SDT
     A            STM
     A            SLIB
     A            SFILE
     A            SMBR
     A          K MDT
     A          K MTM
