********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SENDINGSNR/MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A          R UNHR
      *____
      * KEY
      *""""
S01  A*           UIN            7S 0       COLHDG('Interchg.no')
S01  A*           UMN            7S 0       COLHDG('Msg.no')
N01  A            UIN            9S 0       COLHDG('Interchg.no')
N01  A            UMN            9S 0       COLHDG('Msg.no')
      *____
      * UNH
      *""""
     A            U0062A        14          COLHDG('Msg.ref.no')
      * S009 Message identifier
     A            U0065          6          COLHDG('Msg.type ID')
     A            U0052          3          COLHDG('Msg.type ver.no')
     A            U0054          3          COLHDG('Msg.type rel.no')
     A            U0051          2          COLHDG('Controlling agency')
     A            U0057          6          COLHDG('Ass.assigned code')
      *
     A            U0068         35          COLHDG('Common acc.ref')
      * S010 Status of the transfer
     A            U0070          2          COLHDG('Seq.msg.trf.no')
     A            U0073          1          COLHDG('F/L msg.trf.ind')
      *____
      * BGM
      *""""
      * C002 Document/message name
     A            U1001          3          COLHDG('Doc/msg name code')
     A            U1131          3          COLHDG('Code list Q')
     A            U3055          3          COLHDG('Resp.agency')
     A            U4774         35          COLHDG('Doc/msg name text')
      *
     A            U1004         35          COLHDG('Doc/msg no')
      * C507 Date/time/period
     A            U2005A         3          COLHDG('Time Q')
     A            U2782A        35          COLHDG('Time')
     A            U2781A         3          COLHDG('Time format Q')
      *
     A            U1225          3          COLHDG('Msg.func. code')
      * C506 Reference
     A            U1153          3          COLHDG('Ref Q')
     A            U1154         35          COLHDG('Ref no')
     A            U1156          6          COLHDG('Line no')
      * C507 Date/time/period
     A            U2005B         3          COLHDG('Time Q')
     A            U2782B        35          COLHDG('Time')
     A            U2781B         3          COLHDG('Time format Q')
      *
     A            U4343          3          COLHDG('Resp. type code')
      *____
      * UNT
      *""""
     A            U0074          6          COLHDG('No of SEG in msg')
     A            U0062B        14          COLHDG('Msg.ref.no')
      *____
      * KEY
      *""""
     A          K UMN
