     A                                      REF(EFR901)
     A          R UNSR
      * Key
     A            UMN       R               REFFLD(ØMN)
     A            UGN       R               REFFLD(ØGN)
     A            UREP0     R               REFFLD(ØREP0)
     A            UREP1     R               REFFLD(ØREP1)
     A            UREP2     R               REFFLD(ØREP2)
     A            UREP3     R               REFFLD(ØREP3)
     A            UREP4     R               REFFLD(ØREP4)
     A            UREP5     R               REFFLD(ØREP5)
     A            UREP6     R               REFFLD(ØREP6)
     A            UREP7     R               REFFLD(ØREP7)
     A            UREP8     R               REFFLD(ØREP8)
      * 0081 Section Identification
     A            U0081          1A         COLHDG('Section Id.')
      * Key
     A          K UMN
     A          K UGN
     A          K UREP0
     A          K UREP1
     A          K UREP2
     A          K UREP3
     A          K UREP4
     A          K UREP5
     A          K UREP6
     A          K UREP7
     A          K UREP8
