     A*%%TS  SD  20120824  131137  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      CF03(03 'Gå ut')
     A                                      CF05(05 'FRISK OPP')
     A                                      CF12(12 'Forrige')
     A          R EUR11DB                   SFL
     A*%%TS  SD  20120702  095133  CB          REL-V7R1M0  5770-WDS
     A            EUROOH1       35A  H
     A            EUROOH2       35A  H
     A            EUROOH3        8A  H
     A            EUROOH4        6A  H
     A            EUROOH5       35A  H
     A            EUROOH16      30A  H
     A            EUROOH17      17A  H
     A            EUROOH19      30A  H
     A            EUROOH20      30A  H
     A            EUROOH21      30A  H
     A            EUROOH22      30A  H
     A            EUROOH26      36A  H
     A            EUROOH23      10A  H
     A            EUROOH24      36A  H
     A            EUROOH25      60A  H
     A            EUROOH27      16A  H
     A            EUROOH28      16A  H
     A            ZOP            1A  I  7  2VALUES(' ' '4' '5')
     A            EUROOH6       10A  O  7  6
     A            EUROOH7        8A  O  7 17
     A            EUROOH8        3A  O  7 26
     A            EUROOH9        3A  O  7 35
     A            EUROOH10      20A  O  7 39
     A            EUROOH11       2A  O  7 60
     A            EUROOH13       5A  O  7 63
     A            EUROOH12       2A  O  7 69
     A            EUROOH14       5A  O  7 72
     A            EUROOH15       3A  O  7 78
     A            EUROOH18      30A  O  7 87
     A            EUROOH5B      10A  O  7118
     A          R EUR11DC                   SFLCTL(EUR11DB)
     A*%%TS  SD  20120702  095133  CB          REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                  1  2'Europris'
     A                                      COLOR(BLU)
     A                                  1 56'Mottak av Ordre'
     A                                      COLOR(WHT)
     A                                  1125'EUR11D A'
     A                                      COLOR(BLU)
     A                                  2 61'Vise'
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  2 87SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  3  2'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  4  4'4=Slett'
     A                                      COLOR(BLU)
     A                                  4 14'5=Vis'
     A                                      COLOR(BLU)
     A                                  6  1' Alt'
     A                                      COLOR(WHT)
     A                                  6  6'Ordrenr'
     A                                      COLOR(WHT)
     A                                  6 17'Dato'
     A                                      COLOR(WHT)
     A                                  6 26'Trp.kode'
     A                                      COLOR(WHT)
     A                                  6 35'Levbet kode/sted'
     A                                      COLOR(WHT)
     A                                  6 60'LK-sted fra/til'
     A                                      COLOR(WHT)
     A                                  6 78'Facility'
     A                                      COLOR(WHT)
     A                                  6 87'Leverandør'
     A                                      COLOR(WHT)
     A                                  6118'Besvart'
     A                                      COLOR(WHT)
     A          R EUR11DD
     A                                      OVERLAY
     A          R EUR11DE
     A*%%TS  SD  20120824  131137  CB          REL-V7R1M0  5770-WDS
     A                                      CF07(07 'VARELINJER')
     A                                      CF08(08 'ARBEIDE MED SVAR')
     A                                      CF09(09 'SEND SVAR')
     A                                  1  2'Europris'
     A                                      COLOR(BLU)
     A                                  1 56'Mottak av Ordre'
     A                                      COLOR(WHT)
     A                                  1125'EUR11D E'
     A                                      COLOR(BLU)
     A                                  2 61'Vise'
     A                                      COLOR(WHT)
     A                                  4  2'Ordrenr/Dato/Trp.kode. :'
     A            EUROOH6       10A  O  4 29
     A            EUROOH7        8A  O  4 40
     A            EUROOH8        3A  O  4 49
     A                                  5  4'Lev.bet kode/sted. . :'
     A            EUROOH9        3A  O  5 29
     A            EUROOH10      20A  O  5 33
     A                                  6  4'Fra land-sted/Til  . :'
     A            EUROOH11       2A  O  6 29
     A            EUROOH13       5A  O  6 32
     A            EUROOH12       2A  O  6 40
     A            EUROOH14       5A  O  6 43
     A                                  7  4'Facility . . . . . . :'
     A            EUROOH15       3A  O  7 29
     A                                  8  4'Leverandørsreferanse :'
     A            EUROOH16      30A  O  8 29
     A            EUROOH26      36A  O  8 60
     A                                  9  6'Leverandør navn/nr :'
     A            EUROOH18      30A  O  9 29
     A            EUROOH17      17A  O  9 60
     A                                 10  8'Adresse 1 / 2  . :'
     A            EUROOH19      30A  O 10 29
     A            EUROOH20      30A  O 10 60
     A                                 11  8'Adresse 3 / 4  . :'
     A            EUROOH21      30A  O 11 29
     A            EUROOH22      30A  O 11 60
     A                                 12  4'Innkjøper / Navn . . :'
     A            EUROOH23      10A  O 12 29
     A            EUROOH24      36A  O 12 40
     A                                 13  4'Epost / Telefon / Fax:'
     A            EUROOH25      60A  O 13 29
     A            EUROOH27      16A  O 13 90
     A            EUROOH28      16A  O 13107
     A                                 15  4'Teknisk avsender . . :'
     A            EUROOH1       35A  O 15 29
     A                                 16  6'Mottaker . . . . . :'
     A            EUROOH2       35A  O 16 29
     A                                 17  6'Dato/Tid . . . . . :'
     A            EUROOH3        8A  O 17 29
     A            EUROOH4        6A  O 17 38
     A                                 18  6'Referanse  . . . . :'
     A            EUROOH5       35A  O 18 29
     A                                 19  6'Besvart  . . . . . :'
     A            EUROOH5B      10A  O 19 29
     A                                 26  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 26 15'F7=Se varelinjer'
     A                                      COLOR(BLU)
     A                                 26 34'F8=Arbeide med svar'
     A                                      COLOR(BLU)
     A                                 26 56'F9=Send svar'
     A                                      COLOR(BLU)
     A                                 26 71'F12=Forrige'
     A                                      COLOR(BLU)
     A          R EUR11DØ
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79   O 27  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
