     A*%%TS  SD  20120702  130530  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      CF03(03 'Gå ut')
     A                                      CF05(05 'FRISK OPP')
     A                                      CF12(12 'Forrige')
     A          R EUR14DA
     A*%%TS  SD  20120702  130530  CB          REL-V7R1M0  5770-WDS
     A                                      CF07(07 'VARELINJER')
     A                                      CF08(08 'ARBEIDE MED SVAR')
     A                                  1  2'Europris'
     A                                      COLOR(BLU)
     A                                  1 56'Arbeide med svar'
     A                                      COLOR(WHT)
     A                                  1125'EUR14D A'
     A                                      COLOR(BLU)
     A                                  2 61'Hode'
     A                                      COLOR(WHT)
     A                                  4  2'Ordrenummer  . . . . . :'
     A            EURORH6       10A  O  4 29
     A                                  5  4'Teknisk avsender . . :'
     A            EURORH1       35A  O  5 29
     A                                  6  6'Mottaker . . . . . :'
     A            EURORH2       35A  O  6 29
     A                                  7  6'Dato/Tid . . . . . :'
     A            EURORH3        8A  O  7 29
     A            EURORH4        6A  O  7 38
     A                                  8  6'Referanse  . . . . :'
     A            EURORH5       35A  O  8 29
     A                                  9  6'Besvart  . . . . . :'
     A            EURORH5B      10A  O  9 29
     A                                 26  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 26 15'F12=Forrige'
     A                                      COLOR(BLU)
     A                                 10  6'Funksjonsreferanse :'
     A            EURORH6B       2A  B 10 29
     A                                 10 41'40=Leverandørsadvisering'
     A                                 11 41'45=Transportøradvisering'
     A                                 12 41'50=Bekreftet ankomst'
     A                                  2  2'Trykk Enter for å fortsette til va-
     A                                      relinjer.'
     A                                      COLOR(BLU)
     A          R EUR14DØ
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79   O 27  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
