     A          R EURORLR                   PFILE(EURORL)
     A          K EURORL2
     A          K EURORL1
     A          K EURORL3
     A          K EURORL4
