     A          R EURORHR
     A            EURORH1       35A         COLHDG('TEKN.AVSENDER')
     A            EURORH2       35A         COLHDG('TEKN.MOTTAGER')
     A            EURORH3        8A         COLHDG('TEKN.DATO')
     A            EURORH4        6A         COLHDG('TEKN.KLOKKESL')
     A            EURORH5       35A         COLHDG('TEKN.REFERANSE')
     A            EURORH5B      10A         COLHDG('TEKN.BESVART')
     A            EURORH6       10A         COLHDG('ORDRENUMMER')
     A            EURORH6B       2A         COLHDG('FUNKSJONSREF')
     A*                                             40=LEVERANDØRSADVISERING
     A*                                             45=TRANSPORTØRADVISERING
     A*                                             50=BEKREFTET ANKOMST
     A          K EURORH6
     A          K EURORH5
