     A          R EXRSTCR
     A            EXTAG          4A         COLHDG('TAG')
     A            EXKODI         6A         COLHDG('Intern kode')
     A            EXKNR          8S 0       COLHDG('Kundenr')
     A            EXKODE         6A         COLHDG('Extern kode')
     A            EXTX          60A         COLHDG('Extern text')
     A          K EXTAG
     A          K EXKODI
     A          K EXKNR
     A          K EXKODE
