     A*_______________________________________
     A* SYSPED / Fakturainformasjon, Avd+Faknr  (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""
     A          R FAINRCMP                  PFILE(FAINCMP)
     A                                      TEXT('Avd+Faknr')
     A          K FIAVD
     A          K FIFN
