     A*_______________________________________
     A* SYSPED / Fakturainformasjon,
     A*"""""""""""""""""""""""""""""""""""""""
     A          R FAINR                     PFILE(FAIN)
     A                                      TEXT('Faknr+AVD+OPDNR')
     A          K FIFN
     A          K FIAVD
     A          K FIOPD
