     A*____________________________
     A* SYSPED / Fakturainformasjon
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FAINR
     A            FIFN      R               REFFLD(FN)
     A            FIAVD     R               REFFLD(AVD)
     A            FIOPD     R               REFFLD(OPD)
     A          K FIFN
