     A*____________________________
     A* SYSPED / Fakturainformasjon  (KOMPLIMERT)
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R FAINRCMP
     A            FIFN           7P 0
     A            FIAVD          4P 0
     A            FIOPD          7P 0
     A          K FIFN
