     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A          K FAOPKO
     A          K FAAVD
     A          K FAOPD
     A          K FAFAKT
     A          K FAKUNR
