     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,  Avd+Opd+K/S (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTRCMP                  PFILE(FAKTCMP)
     A                                      TEXT('Avd+Opd+K/S')
     A          K FAAVD
     A          K FAOPD
     A          K FASK
