     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,  Avd+Opd+K/S
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A                                      TEXT('Avd+Opd+K/S')
     A          K FAOPKO
     A          K FAFAKT
     A          K FAKUNR
     A          K FAAVD
     A          K FAOPD
