     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,  Avd+Opd+K/S
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A                                      TEXT('Avd+Opd+K/S')
     A          K FAAVD
     A          K FAOPD
     A          K FASK
     A          S FAOPKO                    RANGE(' ' 'C')
