     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,  OPDKOD  K/S
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A          K FAOPKO
     A          K FASK
     A          K FAAVD
     A          K FAOPD
