     A*_________________________________________
     A* SYSPED / Faktura
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A          K FAAVD
     A          K FAOPD
     A          S FASK                      COMP(EQ 'I')
     A            FALI                      COMP(EQ 99)
