     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A                                      TEXT('FAFAKT/FAVK/FAKDM')
     A          K FAFAKT
     A          K FAVK
     A          K FAKDM
