     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A          K FAAVD
     A          K FACC
     A          K FAÅR
     A          K FAMND
     A          K FAOPD
     A          K FAVK
