     A*%%TS  SD  20150421  161356  JOVO        REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R SUBFIL                    SFL
     A*%%TS  SD  20150331  182025  JOVO        REL-V7R1M0  5770-WDS
     A            WSNR           1A  B  6  4VALUES(' ' '2' '4' '9')
     A            FTKUND         8Y 0O  6  6TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            KNA14         14A  O  6 15TEXT('NAVN')
     A            FTNIV     R        O  6 30REFFLD(FAKTILR/FTNIV *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A            FTTYPE    R        O  6 33REFFLD(FAKTILR/FTTYPE *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A            FTKODE    R        O  6 44REFFLD(FAKTILR/FTKODE *LIBL/FAKTIL)
     A            FTMAX     R        O  6 47REFFLD(FAKTILR/FTMAX *LIBL/FAKTIL)
     A                                      EDTCDE(Z)
     A            FTLVK     R        O  6 55REFFLD(FAKTILR/FTLVK *LIBL/FAKTIL)
     A            FTLFK     R        O  6 59REFFLD(FAKTILR/FTLFK *LIBL/FAKTIL)
     A            FTLPRO    R        O  6 70REFFLD(FAKTILR/FTLPRO *LIBL/FAKTIL)
     A                                      EDTCDE(Z)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20150421  154730  JOVO        REL-V7R1M0  5770-WDS
     A  *DS3                                SFLSIZ(0015)
     A  *DS4                                SFLSIZ(0015)
     A  *DS3                                SFLPAG(0014)
     A  *DS4                                SFLPAG(0014)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/FAKTIL '
     A                                      COLOR(BLU)
     A                                  1 19'Vedl. FakturaTillegg på firma/kund-
     A                                      e              '
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2'Type=LENGDE.. /BREDDE.. /HØYDE.. A-
     A                                      DR..     O/L=Oppdr/Linjenivå.    '
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  3  2'O=Autoutfyll tillegskoder på oppdr-
     A                                      ag. L=Beregn ADR mm, % av Linje-fra-
     A                                      kt.'
     A            ZRECNO         4S 0O  3 75SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  4  2MSGCON(025 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 28MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2' Op KundeNr. Navn          O/L Typ-
     A                                      e       Ko MaxCm   Geb FareKlasse P-
     A                                      ros     '
     A                                      COLOR(WHT)
     A                                  4 59'9=Kopier alle'
     A                                      COLOR(BLU)
     A          R BUNN
     A*%%TS  SD  20150421  161356  JOVO        REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98                              4  2MSGCON(078 DIV0012 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N98                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                  3 62MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R VARELI
     A*%%TS  SD  20150331  182025  JOVO        REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'SØK')
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'    KundeNr. Navn          O/L Typ-
     A                                      e       Ko MaxCm   Geb FareKlasse P-
     A                                      ros       '
     A                                      COLOR(WHT)
     A            WSKUND         8Y 0B  2  6TEXT('KUNDENR')
     A  90N40                               DSPATR(RI)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A            KNA14         14A  O  2 15TEXT('NAVN')
     A            WSNIV     R        B  2 30REFFLD(FAKTILR/FTNIV *LIBL/FAKTIL)
     A  89N40                               DSPATR(RI)
     A  40                                  DSPATR(PR)
     A  40                                  DSPATR(HI)
     A            WSTYPE    R        B  2 33REFFLD(FAKTILR/FTTYPE *LIBL/FAKTIL)
     A  88N40                               DSPATR(RI)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A            WSKODE    R        B  2 44REFFLD(FAKTILR/FTKODE *LIBL/FAKTIL)
     A  87                                  DSPATR(RI)
     A            WSMAX     R        B  2 47REFFLD(FAKTILR/FTMAX *LIBL/FAKTIL)
     A                                      EDTCDE(Z)
     A  86                                  DSPATR(RI)
     A            WSLVK     R        B  2 55REFFLD(FAKTILR/FTLVK *LIBL/FAKTIL)
     A  85                                  DSPATR(RI)
     A            WSLFK     R        B  2 59REFFLD(FAKTILR/FTLFK *LIBL/FAKTIL)
     A  84                                  DSPATR(RI)
     A            WSLPRO    R        B  2 70REFFLD(FAKTILR/FTLPRO *LIBL/FAKTIL)
     A  83                                  DSPATR(RI)
     A                                      EDTCDE(Z)
     A N40                              3  4'F4=Søk'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  1  2'    KundeNr. Navn          O/L Typ-
     A                                      e       Ko MaxCm   Geb FareKlasse P-
     A                                      ros       '
     A                                      COLOR(WHT)
     A            FTKUND         8Y 0O  2  6TEXT('KUNDENR')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            KNA14         14A  O  2 15TEXT('NAVN')
     A                                      COLOR(WHT)
     A            FTNIV     R        O  2 30REFFLD(FAKTILR/FTNIV *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A            FTTYPE    R        O  2 33REFFLD(FAKTILR/FTTYPE *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A            FTKODE    R        B  2 44REFFLD(FAKTILR/FTKODE *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A            FTMAX     R        B  2 47REFFLD(FAKTILR/FTMAX *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Z)
     A            FTLVK     R        B  2 55REFFLD(FAKTILR/FTLVK *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A            FTLFK     R        B  2 59REFFLD(FAKTILR/FTLFK *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A            FTLPRO    R        B  2 70REFFLD(FAKTILR/FTLPRO *LIBL/FAKTIL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Z)
     A                                  3 21'Tast Enter for å slette eller F12 -
     A                                      for å avbryte'
     A                                      COLOR(WHT)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R NYWRK
     A*%%TS  SD  20150421  161356  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                  1  2'SYSPED/FAKTIL '
     A                                      COLOR(BLU)
     A                                  1 19'Vedl. FakturaTillegg på firma/kund-
     A                                      e              '
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2'Type=LENGDE.. /BREDDE.. /HØYDE.. A-
     A                                      DR..     O/L=Oppdr/Linjenivå.    '
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  3  2'O=Autoutfyll tillegskoder på oppdr-
     A                                      ag. L=Beregn ADR mm, % av Linje-fra-
     A                                      kt.'
     A                                      DSPATR(ND)
     A                                  4  2MSGCON(025 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 28MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2' Op KundeNr. Navn          O/L Typ-
     A                                      e       Ko MaxCm   Geb FareKlasse P-
     A                                      ros     '
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 23 62MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R SOKFRA
     A*%%TS  SD  20150331  182025  JOVO        REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'SØK')
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'    KundeNr.  SØK FRA...'
     A                                      COLOR(WHT)
     A            WSKUND         8Y 0B  2  6TEXT('KUNDENR')
     A                                      EDTCDE(4)
     A                                  3  4'F4=Søk'
     A                                      COLOR(BLU)
     A          R CPYWND
     A*%%TS  SD  20150421  152813  JOVO        REL-V7R1M0  5770-WDS
     A  *DS3                                WINDOW(*DFT 7 57 *NOMSGLIN)
     A  *DS4                                WINDOW(*DFT 7 57 *NOMSGLIN)
     A                                      CF12(12 'AVBRYT')
     A                                      CF04(04 'SØK')
     A                                  1  2'FAKTIL'
     A                                      COLOR(BLU)
     A            WSFRAKN        8Y 0B  3 23EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A            WSTILKN        8Y 0B  4 23EDTCDE(4)
     A  79                                  DSPATR(RI)
     A                                  6  2'Enter=Utfør valg'
     A                                      COLOR(BLU)
     A                                  6 34MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 13'Kopier alle tillegg til gitt kunde-
     A                                      nr'
     A                                      COLOR(WHT)
     A                                  3  2'Kopier fra kundenr'
     A                                  4  2'Kopier til kundenr'
