     A*_________________________________________
     A* SYSPED / Fakturavarelinjer,  Avd+Opd+K/S
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FAKTR                     PFILE(FAKT)
     A          K FAVT
     A          K FAFAKT
     A          K FALEVN
     A          S FALEVN                    VALUES(0)
