     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR FAX021PNL)
     A                                      HLPTITLE('SENDING AV MANUELL FAX')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE01
     A                                      CF03(03 'AVSLUTT')
     A N40                                  CF04(04 'SØK')
     A N40                                  CF10(10 'SEND')
     A N40                                  CF05(05 'søk salgssystem')
     A N40                                  CF09(09 'Søk bilregister')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(25)
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/FAX021'
     A                                      COLOR(BLU)
     A                                  1 21'SYSPED   FAX-UTILITY'
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  2 21MSGCON(040 SHU0203 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  3MSGCON(025 SHU0166 *LIBL/SYMSGF)
     A            KUNDNR         8Y 0B  3 30EDTCDE(4)
     A                                      DSPATR(UL)
     A  40                                  DSPATR(PR)
     A            KNAVN         30A  B  3 40
     A  40                                  DSPATR(PR)
     A                                  4  3MSGCON(025 SHU0167 *LIBL/SYMSGF)
     A            FAXNR         15A  B  4 30
     A  71                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A  40                                  DSPATR(PR)
     A                                  4 46MSGCON(012 SHU0261 *LIBL/SYMSGF)
     A            WSLAND         2A  B  4 59
     A  40                                  DSPATR(PR)
     A                                  4 62'='
     A            FAXRET         6A  O  4 64
     A                                  5  3MSGCON(006 SHU0536 *LIBL/SYMSGF)
     A            EPOST         70A  B  5 11CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                  6 41MSGCON(022 SHU0407 *LIBL/SYMSGF)
     A            WSSKRI         1A  B  6 64VALUES(' ' 'Y' 'N')
     A                                  7  3MSGCON(025 SHU0173 *LIBL/SYMSGF)
     A            WSTIME         6Y 0B  7 30DSPATR(UL)
     A                                      EDTCDE(4)
     A  40                                  DSPATR(PR)
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                  7 41MSGCON(025 SHU0174 *LIBL/SYMSGF)
     A            WSDATE         6Y 0B  7 68DSPATR(UL)
     A                                      EDTCDE(4)
     A  40                                  DSPATR(PR)
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A                                  8  3MSGCON(010 SHU0345 *LIBL/SYMSGF)
     A            EMNE          40A  B  8 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                  9  3MSGCON(010 SHU0347 *LIBL/SYMSGF)
     A            FRA           40A  B  9 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                 10  3MSGCON(010 SHU0346 *LIBL/SYMSGF)
     A            TIL           30A  B 10 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                 11  3MSGCON(010 SHU0348 *LIBL/SYMSGF)
     A            LI01          60A  B 11 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI02          60A  B 12 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI03          60A  B 13 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI04          60A  B 14 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI05          60A  B 15 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI06          60A  B 16 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI07          60A  B 17 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI08          60A  B 18 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI09          60A  B 19 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI10          60A  B 20 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI11          60A  B 21 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                 22  2'Roll up/down'
     A                                      COLOR(BLU)
     A            LI12          60A  B 22 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N40                             23 21MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 41MSGCON(018 SHU0351 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N40                             23 62MSGCON(018 SHU0168 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30 60                          24 41MSGCON(018 JOV0789 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R BSKRIV
     A                                      CF12(12 'Forrige')
     A                                      OVERLAY
     A                                      WINDOW(*DFT 8 55 *NOMSGLIN)
     A                                  1  2'FAXSOKFM'
     A                                      COLOR(BLU)
     A            DEV           10A  I  5 23DSPATR(UL)
     A                                      CHECK(ME)
     A            HOLD           1A  I  6 23DSPATR(UL)
     A                                      VALUES('J' 'N' ' ')
     A                                  5  3MSGCON(013 SHU0400 *LIBL/SYMSGF)
     A                                  6  3MSGCON(013 SHU0401 *LIBL/SYMSGF)
     A                                  8  3MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R BILDE02
     A                                      CF03(03 'AVSLUTT')
     A N40                                  CF04(04 'SØK')
     A N40                                  CF10(10 'SEND')
     A N40                                  CF05(05 'søk salgssystem')
     A N40                                  CF09(09 'Søk bilregister')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(25)
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/FAX021'
     A                                      COLOR(BLU)
     A                                  1 21'SYSPED   FAX-UTILITY'
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  2  3MSGCON(010 SHU0542 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                      DSPATR(UL)
     A                                  2 21MSGCON(040 SHU0203 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  3MSGCON(025 SHU0166 *LIBL/SYMSGF)
     A            KUNDNR         8Y 0B  3 30EDTCDE(4)
     A                                      DSPATR(UL)
     A  40                                  DSPATR(PR)
     A            KNAVN         30A  B  3 40
     A  40                                  DSPATR(PR)
     A                                  4  3MSGCON(025 SHU0167 *LIBL/SYMSGF)
     A            FAXNR         15A  B  4 30
     A  71                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A  40                                  DSPATR(PR)
     A                                  4 46MSGCON(012 SHU0261 *LIBL/SYMSGF)
     A            WSLAND         2A  B  4 59
     A  40                                  DSPATR(PR)
     A                                  4 62'='
     A            FAXRET         6A  O  4 64
     A                                  5  3MSGCON(006 SHU0536 *LIBL/SYMSGF)
     A            EPOST         70A  B  5 11CHECK(LC)
     A                                  6 41MSGCON(022 SHU0407 *LIBL/SYMSGF)
     A            WSSKRI         1A  B  6 64VALUES(' ' 'Y' 'N')
     A                                  7  3MSGCON(025 SHU0173 *LIBL/SYMSGF)
     A            WSTIME         6Y 0B  7 30DSPATR(UL)
     A                                      EDTCDE(4)
     A  40                                  DSPATR(PR)
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                  7 41MSGCON(025 SHU0174 *LIBL/SYMSGF)
     A            WSDATE         6Y 0B  7 68DSPATR(UL)
     A                                      EDTCDE(4)
     A  40                                  DSPATR(PR)
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A                                  8  3MSGCON(010 SHU0345 *LIBL/SYMSGF)
     A            EMNE          40A  B  8 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                  9  3MSGCON(010 SHU0347 *LIBL/SYMSGF)
     A            FRA           40A  B  9 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                 10  3MSGCON(010 SHU0346 *LIBL/SYMSGF)
     A            TIL           30A  B 10 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                 11  3MSGCON(010 SHU0348 *LIBL/SYMSGF)
     A            LI13          60A  B 11 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI14          60A  B 12 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI15          60A  B 13 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI16          60A  B 14 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI17          60A  B 15 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI18          60A  B 16 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI19          60A  B 17 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI20          60A  B 18 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI21          60A  B 19 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI22          60A  B 20 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A            LI23          60A  B 21 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                 22  2'Roll up/down'
     A                                      COLOR(BLU)
     A            LI24          60A  B 22 18CHECK(LC)
     A  40                                  DSPATR(PR)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N40                             23 21MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 41MSGCON(018 SHU0351 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N40                             23 62MSGCON(018 SHU0168 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30 60                          24 41MSGCON(018 JOV0789 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
