     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('VEDLHEA1' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                  1  2'SYSPED/FAX063'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(055 DIV1472 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2 66DATE
     A                                      EDTCDE(Y)
     A                                  3 66TIME
     A                                  9  2MSGCON(012 DIV1473 *LIBL/SYMSGF)
     A            WSNET          1A  I  9 24DSPATR(UL)
     A                                      VALUES(' ' 'E' 'T')
     A                                  9 31MSGCON(040 DIV1475 *LIBL/SYMSGF)
     A                                 11  2MSGCON(012 DIV0050 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B 11 24DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A                                 13  2MSGCON(020 DIV1474 *LIBL/SYMSGF)
     A            WSAVDK         4Y 0B 13 24DSPATR(UL)
     A                                      EDTCDE(4)
     A  98                                  DSPATR(RI)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R BILDE02
     A                                      CF12(12 'Avbryt vedlikehold')
     A                                  1  2'SYSPED/FAX063'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(055 DIV1472 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2 66DATE
     A                                      EDTCDE(Y)
     A                                  3 66TIME
     A            WSHT1         79A  B  5  2DSPATR(UL)
     A                                      CHECK(LC)
     A            WSHT2         79A  B  6  2DSPATR(UL)
     A                                      CHECK(LC)
     A            WSHT3         79A  B  7  2DSPATR(UL)
     A                                      CHECK(LC)
     A            WSHT4         79A  B  8  2DSPATR(UL)
     A                                      CHECK(LC)
     A            WSHT5         79A  B  9  2DSPATR(UL)
     A                                      CHECK(LC)
     A            WSHT6         79A  B 10  2DSPATR(UL)
     A                                      CHECK(LC)
     A            WSHT7         79A  B 11  2DSPATR(UL)
     A                                      CHECK(LC)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
