     A*****************************************************************
     A*             F R A K T A V T A L E R   L I S T E               *
     A* ANTALL LINJE=72,  ANTALL TEGN PR. LINJE=80,  OVERFLOW=72      *
     A*****************************************************************
     A          R HEADER
     A            HOHT1         80      4  1
     A            HOHT2         80      5  1
     A            HOHT3         80      6  1
     A            HOHT4         80      7  1
     A            HOHT5         80      8  1
     A            HOHT6         80      9  1
     A            HOHT7         80     10  1
     A                                 13  2MSGCON(25 SHU0190 SYMSGF)
     A            ATTN          30     13 30
     A            KNAVN         30A    15 30
     A            ADR1          30A    16 30
     A            ADR2          30A    17 30
     A            SYADR3        30A    18 30
     A            WSLIN1        80     20  1
     A            WSLIN2        80     21  1
     A            WSLIN3        80     22  1
     A            WSLIN4        80     23  1
     A            WSLIN5        80     24  1
     A            WSLIN6        80     25  1
     A            WSLIN7        80     26  1
     A            WSLIN8        80     27  1
     A            WSLIN9        80     28  1
     A            HOBT1         80     31  1
     A            HOBT2         80     32  1
     A            HOBT3         80     33  1
