     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                  1  3'SYFAX400/FAX016'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 SHU0289 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  7  3MSGCON(025 SHU0292 *LIBL/SYMSGF)
     A            WSXSYS         1A  O  7 30DSPATR(UL)
     A                                  7 38'F = Faksimile support/400'
     A                                  9  3MSGCON(025 SHU0290 *LIBL/SYMSGF)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A            WSXNRS         2A  B  9 30DSPATR(UL)
     A                                 11  3MSGCON(025 SHU0291 *LIBL/SYMSGF)
     A            WSXVEN         1A  B 11 30VALUES('=' '+' '/' '?' ' ')
     A                                      DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A                                 11 38'='
     A                                 11 43'0,5'
     A                                 11 47'SEC'
     A                                 12 38'+    1,0 SEC'
     A                                 13 38'/    2,0 SEC'
     A                                 14 38'?    4,0 SEC'
     A                                 15  3'Benyttes modem direkte'
     A            WSMODE         1A  B 15 30VALUES(' ' 'Y' 'N')
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  99                             24  2'Du må oppgi utkø.'
     A                                      COLOR(WHT)
     A  98                             24  2'Du må oppgi bibliotek.'
     A                                      COLOR(WHT)
     A                                 15 38'Y = ja'
      *
     A          R BILDE00
     A                                      CF03(03 'Avslutt program')
     A                                  1  3'SYFAX400/FAX016'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 SHU0289 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  7  3MSGCON(025 SHU0292 *LIBL/SYMSGF)
     A            WSXSYS         1A  B  7 30DSPATR(UL)
     A                                  7 38'F = Faksimile support/400'
     A                                      COLOR(WHT)
     A                                  8 38'B = Bluefax'
     A                                      COLOR(WHT)
     A                                  6 38'X = FAX400/TELEX LØSNING'
     A                                      COLOR(WHT)
      *
     A          R BILDE02
     A                                      CF03(03 'Avslutt program')
     A                                  1  3'SYFAX400/FAX016'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 SHU0289 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  7  3MSGCON(025 SHU0292 *LIBL/SYMSGF)
     A            WSXSYS         1A  O  7 30DSPATR(UL)
     A                                  9  3'Utkø for FAX400'
     A            WSUTK         10A  B  9 30DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                 11  3'Bibliotek for utkø'
     A                                      DSPATR(UL)
     A            WSLIB         10A  B 11 30DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A                                 13  3'Forsidenummer     '
     A            WSCPN          2A  B 13 30DSPATR(UL)
     A                                 15  3'Benyttes modem direkte'
     A            WSMODE         1A  B 15 30VALUES(' ' 'Y' 'N')
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  99                             24  2'Du må oppgi utkø.'
     A                                      COLOR(WHT)
     A  98                             24  2'Du må oppgi bibliotek.'
     A                                      COLOR(WHT)
     A                                 15 38'Y = ja'
     A                                  7 38'X = FAX400/TELEX LØSNING'
      *
     A          R BILDE03
     A                                      CF03(03 'Avslutt program')
     A                                  1  3'SYFAX400/FAX016'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 SHU0289 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  7  3MSGCON(025 SHU0292 *LIBL/SYMSGF)
     A            WSXSYS         1A  O  7 30DSPATR(UL)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  99                             24  2'Du må oppgi utkø.'
     A                                      COLOR(WHT)
     A  98                             24  2'Du må oppgi bibliotek.'
     A                                      COLOR(WHT)
     A                                  7 38'B = BLUEFAX             '
