     A          R CVRPAC
     A N88                             01 10'T E L E F A X'
     A N88                             01 30'CONFIRMED DATE AND TIME:'
     A N88        QFDATE         6   O 01 55
     A N88        QFTIME         6   O 01 65
     A  88                             01 10'M A I L      '
     A  88                             01 30'SENDT DATE AND TIME:'
     A  88        LODATE         8   O 01 51
     A  88        LOTIME         8   O 01 61
     A            HOHT1         80   O 03  1
     A            HOHT2         80   O 05  1
     A            HOHT3         80   O 06  1
     A            HOHT4         80   O 07  1
     A            HOHT5         80   O 08  1
     A            HOHT6         80   O 09  1
     A            HOHT7         80   O 10  1
     A                                 11  1'__________________________________-
     A                                      ___________________________________-
     A                                      __________'
     A                                 13 10'REFNO'
     A            UNIK           9  0O 13 20
     A                                 15 10'Ref: '
     A            EMNE          40   O 15 20
     A                                 18 10'To:     '
     A            KNAVN         30   O 18 20
     A  88        LONAVN        30   O 19 20
     A                                 20 10'Att:    '
     A            TIL           30   O 20 20
     A                                 22 10'Faxno:  '
     A            FAXNRP        21   O 22 20
     A                                 26 10'From:   '
     A            FINAVN        40   O 26 20
     A            FRA           40   O 28 20
     A                                 32 10'Date:   '
     A            DATO           6  0O 32 20
     A                                 34 10'pages:  '
     A                                 34 20'Just this one. '
     A                                 38 10'MESSAGE:      '
     A            LI01          60   O 41 10
     A            LI02          60   O 42 10
     A            LI03          60   O 43 10
     A            LI04          60   O 44 10
     A            LI05          60   O 45 10
     A            LI06          60   O 46 10
     A            LI07          60   O 47 10
     A            LI08          60   O 48 10
     A            LI09          60   O 49 10
     A            LI10          60   O 50 10
     A            LI11          60   O 51 10
     A            LI12          60   O 52 10
     A            LI13          60   O 53 10
     A            LI14          60   O 54 10
     A            LI15          60   O 55 10
     A            LI16          60   O 56 10
     A            LI17          60   O 57 10
     A            LI18          60   O 58 10
     A            LI19          60   O 59 10
     A            LI20          60   O 60 10
     A            LI21          60   O 61 10
     A            LI22          60   O 62 10
     A            LI23          60   O 63 10
     A            LI24          60   O 64 10
