     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('VEDLSTED' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  5  3VALUES(' ' '2' '4')
     A            SFXAVD    R        O  5  6REFFLD(FAXAVTR/FAXAVD *LIBL/FAXAVT)
     A            SFXOPD    R        O  5 12REFFLD(FAXAVTR/FAXOPD *LIBL/FAXAVT)
     A            SFXTYP         1   B  5 17
     A            SFXDOC    R        O  5 21REFFLD(FAXAVTR/FAXDOC *LIBL/FAXAVT)
     A            SFXMAP    R        O  5 35REFFLD(FAXAVTR/FAXMAP *LIBL/FAXAVT)
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/FAX014'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0237 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A            W1KNR          8  0O  2  5EDTCDE(4)
     A                                      COLOR(WHT)
     A            W1NAVN        30   O  2 15COLOR(WHT)
     A            ZRECNO         4S 0O  2 64SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2 70TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(078 SHU0238 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORIGE BILDE')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(010 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 15MSGCON(010 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 30MSGCON(010 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 45MSGCON(010 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 60MSGCON(012 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              2 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VARELI
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2MSGCON(078 SHU0238 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSXAVD    R        B  2  6REFFLD(FAXAVTR/FAXAVD *LIBL/FAXAVT)
     A                                      EDTCDE(4)
     A  40                                  DSPATR(PR)
     A            WSXOPD    R        B  2 12REFFLD(FAXAVTR/FAXOPD *LIBL/FAXAVT)
     A  40                                  DSPATR(PR)
     A            WSXTYP         1A  B  2 17VALUES('S' 'K' 'A' 'T' 'O')
     A            WSXDOC    R        B  2 21REFFLD(FAXAVTR/FAXDOC *LIBL/FAXAVT)
     A            WSXMAP    R        B  2 35REFFLD(FAXAVTR/FAXMAP *LIBL/FAXAVT)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
      *
     A          R VAREL2
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1 17MSGCON(060 SHU0238 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(015 DIV1147 *LIBL/SYMSGF)
     A            WSXAVD    R        I  2 21REFFLD(FAXAVTR/FAXAVD *LIBL/FAXAVT)
     A            WSXOPD    R        I  2 27REFFLD(FAXAVTR/FAXOPD *LIBL/FAXAVT)
     A            WSXTYP         1   I  2 31
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  1  6MSGCON(078 SHU0238 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            SFXAVD    R        O  2 10REFFLD(FAXAVTR/FAXAVD *LIBL/FAXAVT)
     A            SFXOPD    R        O  2 16REFFLD(FAXAVTR/FAXOPD *LIBL/FAXAVT)
     A            SFXTYP         1   O  2 21
     A            SFXDOC    R        O  2 25REFFLD(FAXAVTR/FAXDOC *LIBL/FAXAVT)
     A            SFXMAP    R        O  2 39REFFLD(FAXAVTR/FAXMAP *LIBL/FAXAVT)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
      *
     A          R NYKUNDE
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORIGE BILDE')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/FAX014'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0237 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A            W1KNR          8Y 0O  2  5EDTCDE(4)
     A                                      COLOR(WHT)
     A            W1NAVN        30A  O  2 15COLOR(WHT)
     A                                  2 70TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(078 SHU0238 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R BILDE1
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF04(04 'Søk kunde')
     A                                      CF12(03)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/FAX014'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0237 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                 11  2MSGCON(012 DIV0199 *LIBL/SYMSGF)
     A            W1KNR          8Y 0B 11 17DSPATR(UL)
     A                                      EDTCDE(4)
     A  70                                  DSPATR(RI)
     A                                 11 28MSGCON(040 SHU0240 *LIBL/SYMSGF)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1992  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
