     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                  1  3'SYFAX400/FAX018'
     A                                      COLOR(BLU)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  1 24MSGCON(035 TBR0214 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  6  1MSGCON(100 TBR0215 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                  9  9MSGCON(062 TBR0218 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A            WSDATO         6Y 0B 12 36EDTCDE(Y)
     A                                 12 21MSGCON(014 TBR0216 *LIBL/SYMSGF)
     A                                 12 47MSGCON(008 TBR0217 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
