     A*__________________________
     A* SYSPED400 FAX.STANDARDS
     A*""""""""""""""""""""""""""
     A          R FAXAVTR
     A            FAXKNR         8S 0       COLHDG('KUNDENR')
     A            FAXAVD         4S 0       COLHDG('AVDELING')
     A            FAXOPD         2          COLHDG('OPD.TYPE')
     A            FAXDOC        12          COLHDG('DOKUMENT')
     A            FAXMAP        20          COLHDG('MAPPE')
     A            FAXTYP         1          COLHDG('PART.TYPE')
     A          K FAXKNR
     A          K FAXAVD
     A          K FAXOPD
     A          K FAXTYP
