     A*____________________________
     A* SYSPED / fax coverpage
     A*""""""""""""""""""""""""""""
     A          R FAXCOVPR
     A            TEAVD          4S 0       TEXT('Avdeling')
     A            TEPRTF         8          TEXT('printfil')
     A            TELIB         10          TEXT('bibliotek')
     A          K TEAVD
