     A*__________________________
     A* SYSPED400 REGISTER FOR Å OVERFØRE UTSKRIFT TIL TEKSTMAPPE
     A*""""""""""""""""""""""""""
     A          R PRTDOCBR
     A            PBTXT        120          COLHDG('EN LINJE UTSKR.')
