     A*____________________________
     A* SYSPED / RETNINGSNR LAND
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FAXLKR
     A            KLKLK          2          COLHDG('LANDKODE')
     A            KLKNVN        30          COLHDG('NAVN TIL LAND')
     A            FAXRET         6          COLHDG('RETN. NR.')
     A          K KLKLK
