     A*____________________________
     A* SYSPED / FAX MANUELL
     A*""""""""""""""""""""""""""""
     A          R FAXMANTR
     A            FIFIRM         2          TEXT('FIRMA')
     A            UNIK           9S 0       TEXT('UNIK NR')
     A          K FIFIRM
