     A*____________________________
     A* SYSPED / FAX MANUELL
     A*""""""""""""""""""""""""""""
     A          R FAXMANR
     A            UNIK           9S 0       TEXT('UNIK NR')
     A            FAXNRP        21          TEXT('FAXNR')
     A            PTIME          8          TEXT('TID')
     A            PDATE          8          TEXT('DATO')
     A            KUNDNR         8S 0       TEXT('KUNDENR')
     A            KNAVN         30          TEXT('TILNAVN')
     A            FINAVN        40          TEXT('FRA')
     A            TIL           30          TEXT('ATT')
     A            FRA           40          TEXT('FRA')
     A            EMNE          40          TEXT('EMNE')
     A            LI01          60          TEXT('LINJE 01')
     A            LI02          60          TEXT('LINJE 02')
     A            LI03          60          TEXT('LINJE 03')
     A            LI04          60          TEXT('LINJE 04')
     A            LI05          60          TEXT('LINJE 05')
     A            LI06          60          TEXT('LINJE 06')
     A            LI07          60          TEXT('LINJE 07')
     A            LI08          60          TEXT('LINJE 08')
     A            LI09          60          TEXT('LINJE 09')
     A            LI10          60          TEXT('LINJE 10')
     A            LI11          60          TEXT('LINJE 11')
     A            LI12          60          TEXT('LINJE 12')
     A            LI13          60          TEXT('LINJE 12')
     A            LI14          60          TEXT('LINJE 12')
     A            LI15          60          TEXT('LINJE 12')
     A            LI16          60          TEXT('LINJE 12')
     A            LI17          60          TEXT('LINJE 12')
     A            LI18          60          TEXT('LINJE 12')
     A            LI19          60          TEXT('LINJE 12')
     A            LI20          60          TEXT('LINJE 12')
     A            LI21          60          TEXT('LINJE 12')
     A            LI22          60          TEXT('LINJE 12')
     A            LI23          60          TEXT('LINJE 12')
     A            LI24          60          TEXT('LINJE 12')
     A            JOBNR          6          TEXT('JOBNR')
     A            FSU            1          TEXT('FSU')
     A            PUDATE         8S 0       TEXT('U-DATO')
     A          K UNIK
