     A          R LOGR                      PFILE(QAFFTLOG)
     A                                      TEXT('PEKER PÅ QAFFTLOG')
     A            QFDATE         6
     A            QFTIME         6
     A            QFTYPE         2
     A            QFDEST        75
     A            QFORIG        40
     A            QFUSER        10
     A            QFPAGS         5
     A            QFDESC        12
     A            QFSU           1
     A            QFMSG          7
     A            QFRSV1       250
     A            QFRSV2       250
     A            QFRSV3       250
     A            QFRSV4       250
     A            QFRSV5       250
     A            QFRSV6       250
     A            QFRSV7       250
     A            JOBNUM             I      SST(QFORIG 21 6)
     A          K JOBNUM
     A          K QFTYPE
