     A*___________________________
     A* SYSPED / Firmaopplysninger
     A*"""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FAXTELLR
     A            FIRMA          2          TEXT('FIRM')
     A            COUNTN         7P 0       TEXT('COUNTER')
     A          K FIRMA
