     A*__________________________
     A* SYSPED / FAXUSERS
     A*""""""""""""""""""""""""""
     A                                      UNIQUE
     A          R FAXREC
     A            FUSERI         8          TEXT('USER ID')
     A            FFAXNB        32          TEXT('PHONE NUMBER')
     A            FTO           40          TEXT('TO LINE - ADDRESS')
     A            FTITLE        40          TEXT('TITLE')
     A            FCOMME        40          TEXT('COMMENT')
     A            FTO1          40          TEXT('TO LINE - ADDRESS-1')
     A            FTO2          40          TEXT('TO LINE - ADDRESS-2')
     A            FTO3          40          TEXT('TO LINE - ADDRESS-3')
     A            FFI            2          TEXT('COMPANY')
     A            FKNU           8          TEXT('CUSTOMER NUMBER')
     A            FALFA         10          TEXT('SEARCH NAME')
     A            FTELE         32          TEXT('PHONE NUMBER')
     A          K FUSERI
