     A          R FAXREC                    PFILE(FAXUSRS)
     A                                      TEXT('Faxusers - cust. no.')
     A          K FFI
     A          K FKNU
