     A*_______________________________________
     A* SYSPED / Fakturainformasjon, Avd+Faknr
     A*"""""""""""""""""""""""""""""""""""""""
     A          R FERDR                     PFILE(FERDF)
     A                                      TEXT('Avd+Opdnr+Kunde')
     A          K FEAVD
     A          K FEOPD
     A          K FEKN
