     A*__________________________
     A* OMRWEGNING UTENLANDSK FAKT
     A*""""""""""""""""""""""""""
     A          R FERFAKTR
     A            FERFAK         7S 0       COLHDG('Fakt.nr')
     A            FERVAL         3          COLHDG('VALUTAKODE')
     A            FEROMR         3S 0       COLHDG('OMREGNING')
     A            FERKUR         7S 4       COLHDG('VAL KURS')
     A          K FERFAK
