     A*__________________________________
     A* SYSPED / FERJESTREKNINGER FRA TIL
     A*""""""""""""""""""""""""""""""""""
     A          R FERRR                     PFILE(FERR)
     A          K FEFROM
     A          K FETO
     A          K FEFIRM
     A          K FELENG
     A          K FEDATE
