     A*__________________________
     A* SYSPED / Oppdragsregister
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R HEADFR
     A            HEFAX         15          COLHDG('TIL FAXNR')
     A            FAXNA         30          COLHDG('TIL FAX NAVN')
     A            FAXAD1        30          COLHDG('TIL FAX ADR1')
     A            FAXAD2        30          COLHDG('TIL FAX ADR2')
     A            FAXAD3        30          COLHDG('TIL FAX ADR3')
     A            FAXKON        30          COLHDG('TIL KONTAKTPERSON')
     A            AGNAVN        30          COLHDG('AGENTNAVN')
     A            AGADR1        30          COLHDG('AGENT ADR 1')
     A            AGADR2        30          COLHDG('AGENT ADR 2')
     A            AGADR3        30          COLHDG('AGENT ADR 3')
     A            AGTLF         15          COLHDG('AGENT TLF')
     A            AGFAX         15          COLHDG('AGENT FAX')
     A            FRI001        70          COLHDG('FRILINJE 01')
     A            FRI002        70          COLHDG('FRILINJE 02')
     A            FRI003        70          COLHDG('FRILINJE 03')
     A            FRI004        70          COLHDG('FRILINJE 04')
     A            FRI005        70          COLHDG('FRILINJE 05')
     A            FRI006        70          COLHDG('FRILINJE 06')
     A            FRI007        70          COLHDG('FRILINJE 07')
     A            FRI008        70          COLHDG('FRILINJE 08')
     A            FRI009        70          COLHDG('FRILINJE 09')
     A            HEST      R               REFFLD(ST)
     A                                      COLHDG('Statuskode')
     A            HEAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            HEOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            HESDFF    R               REFFLD(SD)
     A                                      COLHDG('Forfrakt kode')
     A            XESDFF        30          COLHDG('Forfrakt sted')
     A            HEUR      R               REFFLD(UR)
     A                                      COLHDG('Oppr.kode')
     A            HESG      R               REFFLD(SG)
     A                                      COLHDG('Signaturkode')
     A            XESG          16          COLHDG('Signaturnavn')
     A            HESTD     R               REFFLD(STD)
     A                                      COLHDG('Bærer')
     A            HENTVS    R               REFFLD(NTVS)
     A                                      COLHDG('Vareposter SAD')
     A            HE01           1          COLHDG('OPDAT STAT')
     A            HEPRO     R               REFFLD(PRO)
     A                                      COLHDG('Prosjektnr')
     A            HESDVT    R               REFFLD(SD)
     A                                      COLHDG('Viderefraktkode')
     A            XESDVT        30          COLHDG('Viderefraktsted')
     A            HEDTOP    R               REFFLD(DT)
     A                                      COLHDG('Oppdragsdato')
     A            HEGN      R               REFFLD(GN)
     A                                      COLHDG('Godsnr')
     A            HESDF     R               REFFLD(SD)
     A                                      COLHDG('Frakt fra kode')
     A            XESDF         30          COLHDG('Frakt fra sted')
     A            HESDT     R               REFFLD(SD)
     A                                      COLHDG('Frakt til kode')
     A            XESDT         30          COLHDG('Frakt til sted')
     A            HEKNA     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Agent')
     A            HENAA     R               REFFLD(NA)
     A                                      COLHDG('Navn Agent')
     A            HEKNS     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Selger')
     A            HEKDFS    R               REFFLD(KDF)
     A                                      COLHDG('Fakturakode Selger')
     A            HEVALS    R               REFFLD(VAL)
     A                                      COLHDG('Valutakode Selger')
     A            HENAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            HEADS1    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Selger')
     A            HEADS2    R               REFFLD(AD)
     A                                      COLHDG('Adresse-2 Selger')
     A            HEADS3    R               REFFLD(AD)
     A                                      COLHDG('Adresse-3 Selger')
     A            SETLF         15          COLHDG('AGENT TLF')
     A            SEFAX         15          COLHDG('AGENT FAX')
     A            HEKNSF    R               REFFLD(KN)
     A                                      COLHDG('Kundenr Selg.fakm')
     A            HEANS     R               REFFLD(AN)
     A                                      COLHDG('Avtalenr Selger')
     A            HENASF    R               REFFLD(NA)
     A                                      COLHDG('Navn Selg.fakm')
     A            HEKNK     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Kjøper')
     A            HEKDFK    R               REFFLD(KDF)
     A                                      COLHDG('Fakturakode Kjøper')
     A            HEVALK    R               REFFLD(VAL)
     A                                      COLHDG('Valutakode Kjøper')
     A            HENAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            HEADK1    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Kjøper')
     A            HEADK2    R               REFFLD(AD)
     A                                      COLHDG('Adresse-2 Kjøper')
     A            HEADK3    R               REFFLD(AD)
     A                                      COLHDG('Adresse-3 Kjøper')
     A            KJTLF         15          COLHDG('AGENT TLF')
     A            KJFAX         15          COLHDG('AGENT FAX')
     A            HEKNKF    R               REFFLD(KN)
     A                                      COLHDG('Kundenr Kjøp.fakm')
     A            HEANK     R               REFFLD(AN)
     A                                      COLHDG('Avtalenr Kjøper')
     A            HENAKF    R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøp.fakm')
     A            HEOT      R               REFFLD(OT)
     A                                      COLHDG('Oppdragstype')
     A            HEPOS1         7A         COLHDG('Posisjon-1')
     A            HEFR      R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            HENT      R               REFFLD(NTS)
     A                                      COLHDG('Antall kolli')
     A            HEVS1     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-1')
     A            HEVKT     R               REFFLD(VKT9)
     A                                      COLHDG('Bruttovekt')
     A            HELM      R               REFFLD(LM)
     A                                      COLHDG('Lastemeter')
     A            HEM3           7P 3       COLHDG('KUBIKKMETER')
     A            HEKF      R               REFFLD(KF)
     A                                      COLHDG('Fritekstkode')
     A            HEKFT1    R               REFFLD(KFT)
     A                                      COLHDG('Fritekst-1 S/K')
     A            HEFT1     R               REFFLD(FT)
     A                                      COLHDG('Fritekst-1')
     A            HEKFT2    R               REFFLD(KFT)
     A                                      COLHDG('Fritekst-2 S/K')
     A            HEFT2     R               REFFLD(FT)
     A                                      COLHDG('Fritekst-2')
     A            HEKFT3    R               REFFLD(KFT)
     A                                      COLHDG('Fritekst-3 S/K')
     A            HEFT3     R               REFFLD(FT)
     A                                      COLHDG('Fritekst-3')
     A            HEKFT4    R               REFFLD(KFT)
     A                                      COLHDG('Fritekst-4 S/K')
     A            HEFT4     R               REFFLD(FT)
     A                                      COLHDG('Fritekst-4')
     A            HEDTMP    R               REFFLD(DTM)
     A                                      COLHDG('Regnskapsperiode')
     A            HEDTÅP    R               REFFLD(DTÅ)
     A                                      COLHDG('Regnskapsår')
     A            HEDTCP    R               REFFLD(DTC)
     A                                      COLHDG('Regnskapsårhundre')
     A            HEFNK     R               REFFLD(FN)
     A                                      COLHDG('Fakturanr Kjøper')
     A            HEFNS     R               REFFLD(FN)
     A                                      COLHDG('Fakturanr Selger')
     A            HEDTK     R               REFFLD(DT)
     A                                      COLHDG('Fak.dato Kjøper')
     A            HEDTKF    R               REFFLD(DT)
     A                                      COLHDG('FF.dato Kjøper')
     A            HEDTSF    R               REFFLD(DT)
     A                                      COLHDG('FF.dato Selger')
     A            HESLK     R               REFFLD(SL)
     A                                      COLHDG('Slettekode Kjøper')
     A            HESLS     R               REFFLD(SL)
     A                                      COLHDG('Slettekode Selger')
     A            HEPK1     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-1')
     A            HEPK2     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-2')
     A            HEPK3     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-3')
     A            HEPK4     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-4')
     A            HEKNT     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Transportør')
     A            HELKA     R               REFFLD(LKA)
     A                                      COLHDG('Landkode')
     A            HEPLAN    R               REFFLD(PLAN)
     A                                      COLHDG('Plankode')
     A            HEBELT    R               REFFLD(BEL9)
     A                                      COLHDG('Beløp Toll')
     A            HEBELM    R               REFFLD(BEL9)
     A                                      COLHDG('Beløp MVA')
     A            HEKDTM    R               REFFLD(KDTM)
     A                                      COLHDG('Tr.måte')
     A            HEVN      R               REFFLD(VN)
     A                                      COLHDG('Varenr SAD')
     A            HEHAWB    R               REFFLD(HAWB)
     A                                      COLHDG('Bil/HAWBnr')
     A            HETRM     R               REFFLD(TRM)
     A            HETRI     R               REFFLD(LKA)
     A                                      COLHDG('Lankode Transport')
     A            HETRC     R               REFFLD(TRC)
     A                                      COLHDG('Container')
     A            HETRCN    R               REFFLD(TRCN)
     A                                      COLHDG('Container')
     A            HEFBV     R               REFFLD(VKT9)
     A                                      COLHDG('Fraktb.vekt')
     A            HEPK5     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-5')
     A            HEDTR     R               REFFLD(DT)
     A                                      COLHDG('Registreringsdato')
     A            HEFBK     R               REFFLD(BEL7S)
     A                                      COLHDG('Fraktbeløp Kjøper')
     A            HEKDKK    R               REFFLD(KDK)
     A                                      COLHDG('Kreditkode Kjøper')
     A            HEFNGK    R               REFFLD(FN)
     A                                      COLHDG('Gml. Faknr Kjøper')
     A            HEFNGS    R               REFFLD(FN)
     A                                      COLHDG('Gml. Faknr Selger')
     A*           HERFA     R               REFFLD(RF)
     A*                                     COLHDG('Agent referanse')
N01  A            HERFA         35          COLHDG('Agent referanse')
     A            HESDL     R               REFFLD(SDL)
     A                                      COLHDG('Lossested')
     A            HEPOS2    R               REFFLD(POS)
     A                                      COLHDG('Posisjon-2')
     A            HEVALT    R               REFFLD(VK)
     A                                      COLHDG('Varekode tillegg')
     A            HEVALP    R               REFFLD(VALP)
     A                                      COLHDG('Valutatillegg %')
     A            HEGM1     R               REFFLD(GM)
     A                                      COLHDG('Godsmerking-1')
     A            HEGM2     R               REFFLD(GM)
     A                                      COLHDG('Godsmerking-2')
     A            HEVS2     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-2')
     A            HETLE     R               REFFLD(TLE)
     A                                      COLHDG('Eksp.sted SAD')
     A            HETLKU    R               REFFLD(TLKU)
     A                                      COLHDG('Kan utføres')
     A            HETLL     R               REFFLD(TLL)
     A                                      COLHDG('Løpenr toll')
     A            HEKDPL    R               REFFLD(KDPL)
     A                                      COLHDG('Plankode')
     A            HEPK6     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-6')
     A            HEKDL     R               REFFLD(KDL)
     A                                      COLHDG('lagerpos')
     A            HENTF     R               REFFLD(NTF)
     A                                      COLHDG('Ant linjer SAD')
     A            HESGM     R               REFFLD(SGM)
     A                                      COLHDG('Signatur mottatt')
     A            HEDTMO    R               REFFLD(DTMO)
     A                                      COLHDG('Dato mottatt')
     A            HEKLMO         4S 0       COLHDG('Klokkeslett mottatt')
     A            HEPK7     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-7')
     A            HEPK8     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-8')
     A            HEPK9     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-9')
     A            HEDTS     R               REFFLD(DT)
     A                                      COLHDG('Fak.dato Selger')
     A            HEGNN     R               REFFLD(GN)
     A                                      COLHDG('Godsnummer Nytt')
     A            HEVST     R               REFFLD(VST)
     A                                      COLHDG('Varelinjestat')
     A            HELKS     R               REFFLD(LKA)
     A                                      COLHDG('Landkode selger')
     A            HELKK     R               REFFLD(LKA)
     A                                      COLHDG('Landkode kjøper')
     A            HELB           5          COLHDG('LOKALBÅT')
     A            TRAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A                                      EDTCDE(Z)
     A            TROPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A                                      EDTCDE(Z)
      * AKTUELT OPPDRAG er av type: HO=hovedoppdrag
      *                           : FF=Forfrakt (DUP-oppd. innhenting)
      *                           : VF=Viderefrakt (DUP-oppd. utkjør.)
     A            TRSLAG         2          COLHDG('TYPE OPPDRAG')
      * Henvisning til oppdrag OPPOVER i hierarkiet
      * (Aktuelt oppdrag er "dup-oppdrag"innh./utkjøring FOR .....:)
     A            TRAVD0    R               REFFLD(AVD)
     A                                      COLHDG('Avdeling opphav')
     A                                      EDTCDE(Z)
     A            TROPD0    R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr opphav')
     A                                      EDTCDE(Z)
      * Henvisning til oppdrag NEDOVER i hierarkiet
      * (Aktuelt oppdrag har følgende "dup-oppdrag" under seg.....:)
     A            TRAVD1    R               REFFLD(AVD)
     A                                      COLHDG('Avdeling forfrakt')
     A                                      EDTCDE(Z)
     A            TROPD1    R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr forfrakt')
     A                                      EDTCDE(Z)
     A            TRAVD2    R               REFFLD(AVD)
     A                                      COLHDG('Avdeling Etterfrakt')
     A                                      EDTCDE(Z)
     A            TROPD2    R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr Etterfra')
     A                                      EDTCDE(Z)
     A            TRRUND    R               REFFLD(PRO)
     A                                      EDTCDE(Z)
     A                                      COLHDG('Rundturnr')
     A            TRSDFD         8S 0       COLHDG('FRA DATO')
     A            TRSDFK         4S 0       COLHDG('Fra klokka')
     A            TRSDTD         8S 0       COLHDG('TIL DATO')
     A            TRSDTK         4S 0       COLHDG('Til klokka')
     A            TRSFFD         8S 0       COLHDG('FORFRAKT DATO')
     A            TRSFFK         4S 0       COLHDG('Forfrakt klokka')
     A            TRSVTD         8S 0       COLHDG('VIDEREF. DATO')
     A            TRSVTK         4S 0       COLHDG('Videre klokka')
     A            TRKDAK         1          COLHDG('Oppdragsg.kode')
     A            TRKDFF         1          COLHDG('Fakturere S/K')
     A            TRVERV         3          COLHDG('Valkod vareverdi')
     A            TRVERB        13P 2       COLHDG('Vareverdi')
     A            TRETTV         3          COLHDG('Valkod etterkrav')
     A            TRETTB        13P 2       COLHDG('Etterkrav')
     A            TRFRAK         1          COLHDG('Kode frakt')
     A            TRFRAV         3          COLHDG('Valkod frakt')
     A            TRFRAB        13P 2       COLHDG('Fraktbeløp')
     A            TRMVA          1A         COLHDG('Mvakode')
     A            TRFA11         7A         COLHDG('Farlig gods 11')
     A            TRFA12         4A         COLHDG('Farlig gods 12')
     A            TRFLP1         3P 0       COLHDG('FLashpoint 1')
     A            TRFA21         7A         COLHDG('Farlig gods 21')
     A            TRFA22         4A         COLHDG('Farlig gods 22')
     A            TRFLP2         3P 0       COLHDG('Flashpoint 2')
     A            TRTSTA         1A         COLHDG('T-papirstatus')
      *(HEKNA i headf er brukt til Oppdragsgiver i transportmodulen -
      * på et tidspunkt med mye ledig tid burde alle prog som refererer
      * til TRKNFA gjøres om til å bruke HEKNA mens oppdragsgiver
      * (som er unikt for transp.modulen) bør være definert her.)
     A            TRKNFA    R               REFFLD(KN)
     A                                      COLHDG('K.nr agent tr.fort.')
     A                                      EDTCDE(Z)
     A            TRSTAF         1          COLHDG('DISPSTAT FORFRAKT')
     A            TRSTAE         1          COLHDG('DISPSTAT ETTERFRAKT')
     A            TRSTA1         1          COLHDG('LEDIG')
     A            TRSTA2         1          COLHDG('LEDIG')
     A            TRSTA3         1          COLHDG('LEDIG')
     A            TRSTA4         1          COLHDG('LEDIG')
      *(Opprinnelig lagd fordi HEM3 i HEADF var bare 2,2 lang-Nå gjort
      * om.  Med tiden bør alle prog referere til HEM3 (+konvprog))
     A            TRM3           5P 2       COLHDG('KUBIKK')
     A            TRKM           5P 0       COLHDG('Kjørte Kilometer')
     A            DFROA1    R               REFFLD(ROA)
     A            DFROB1    R               REFFLD(ROB)
     A            DFROC1    R               REFFLD(ROC)
     A            DFROA2    R               REFFLD(ROA)
     A            DFROB2    R               REFFLD(ROB)
     A            DFROC2    R               REFFLD(ROC)
     A            DFROA3    R               REFFLD(ROA)
     A            DFROB3    R               REFFLD(ROB)
     A            DFROC3    R               REFFLD(ROC)
     A            DFINFA    R               REFFLD(FT71)
     A            DFINFB    R               REFFLD(FT71)
     A            DFINFC    R               REFFLD(FT71)
     A          K HEAVD
     A          K HEOPD
