     A*____________________________
     A* TELLEVERK MM FOR TILDELING AV SENDINGSNR FR.BREV/TOLLP.
     A* OBS!!!! BØR MERGES MED FIRM I VERSJON 5
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FIRFBR
     A            FIFIRM    R               REFFLD(FI)
     A            FIFBNR         1          COLHDG('TILDEL SEND.NR FR.BR')
     A                                      VALUES('J' 'N')
     A            FITPNR         1          COLHDG('TILDEL SEND.NR TOLLP')
     A                                      VALUES('J' 'N')
     A            FIRECN         9S 0       COLHDG('SIST BRUKTE SEND.NR')
     A            FIRECM         9S 0       COLHDG('MAX.SENDNR')
     A            FISNLA         2  0       TEXT('Landkode i sendingsnr')
     A            FISNLE         5  0       TEXT('Leverandørnr i sendingsnr')
     A            FIIDLA         2  0       TEXT('Landkode i KOLLIID')
     A            FIIDLE         5  0       TEXT('Leverandørnr i KOLLIID')
     A            FIIDNR         9S 0       COLHDG('SIST BRUKTE KOLLIID')
     A            FIIDMX         9S 0       COLHDG('MAX.KOLLI-ID')
     A          K FIFIRM
