     A*____________________________
     A* TELLER FOR ADRESSEKUNDER
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FIRKUR
     A            FIFIRM    R               REFFLD(FI)
     A            FIKUFR         8S 0       COLHDG('FRA KUNDENUMMER')
     A            FIKUTI         8S 0       COLHDG('TIL KUNDENUMMER')
     A            FIKUNE         8S 0       COLHDG('NESTE KUNDENR')
     A          K FIFIRM
