     A*___________________________
     A* SYSPED / Firmaopplysninger
     A*"""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FIRMR
     A            FIFIRM    R               REFFLD(FI)
     A            FIFT      R               REFFLD(FT45)
     A            FIKDUL    R               REFFLD(KDUL)
     A                                      VALUES(' ' 'J' 'N')
     A            FILTB     R               REFFLD(KDA)
     A                                      COLHDG('Linjegods toll.f.br.')
     A                                      VALUES(' ' 'J' 'N')
     A            FILFB     R               REFFLD(KDA)
     A                                      COLHDG('Linjegods fraktbrev')
     A                                      VALUES(' ' 'J' 'N')
     A            FIUPS     R               REFFLD(UPS)
     A            FIUPM     R               REFFLD(UPM)
     A            FIKDT     R               REFFLD(KDT)
     A            FIATK     R               REFFLD(ATK)
     A            FIURLI    R               REFFLD(UR)
     A                                      COLHDG('Land / import')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURLE    R               REFFLD(UR)
     A                                      COLHDG('Land / eksport')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURFI    R               REFFLD(UR)
     A                                      COLHDG('Fly / import')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURFE    R               REFFLD(UR)
     A                                      COLHDG('Fly / eksport')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURFL    R               REFFLD(UR)
     A                                      COLHDG('Fly / innland')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURBI    R               REFFLD(UR)
     A                                      COLHDG('Båt / import')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURBE    R               REFFLD(UR)
     A                                      COLHDG('Båt / eksport')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURBL    R               REFFLD(UR)
     A                                      COLHDG('TRACK/TRACING')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURSI    R               REFFLD(UR)
     A                                      COLHDG('SAD / import')
     A                                      VALUES(' ' 'J' 'N')
     A            FIURSE    R               REFFLD(UR)
     A                                      COLHDG('SAD / eksport')
     A                                      VALUES(' ' 'J' 'N')
     A            FIMVAS         3S 2       TEXT('MOMS SATS')
     A            FIVALK    R               REFFLD(VALV)
     A                                      COLHDG('Valuta-vedlikeh.')
     A                                      VALUES('S' 'Ø')
     A            FICURR    R               REFFLD(VAL)
     A                                      COLHDG('Curr.code')
     A            FITAX          4S 4       TEXT('Tax code')
     A                                      COLHDG('Tax.code')
     A            FIDTFM         1S 0       TEXT('Date fmt')
     A                                      COLHDG('date.fmt')
     A            FIDECI         1S 0       TEXT('DECIMALS')
     A                                      COLHDG('DECIMALS')
     A            FIECON         1A         TEXT('ECONOMY SYSTEM')
     A                                      COLHDG('ECONOMY SYSTEM')
     A            FIAVTE         1A         TEXT('RATE AGREEMENT OWNER')
     A                                      COLHDG('RATE AGREEMENT OWNER')
     A            FIKONT         1A         TEXT('CONTINIOUS UPDATE')
     A                                      COLHDG('CONTINIOUS UPDATE')
     A            FILAND         2A         TEXT('Firmaets landkode')
     A                                      COLHDG('Firmaets landkode')
     A            FITDVI         1A         TEXT('Tdv IS installert ?')
     A                                      COLHDG('Tdv IS installert ?')
     A            FISTFN         2A         TEXT('Std. faktura fritxt')
     A                                      COLHDG('Std. fakt.fritxt.')
     A            FISTFE         2A         TEXT('Std. fakt.frit. eng.')
     A                                      COLHDG('Std. fakt.fri. eng.')
     A            FISTFT         2A         TEXT('Std. fakt.frit.tysk')
     A                                      COLHDG('Std. fakt.fri. tysk')
     A            FILE12         2A         TEXT('Ledig kode-1 2 lang')
     A            FILE22         2A         TEXT('Ledig kode-2 2 lang')
     A            FILE11         1A         TEXT('Aut.overf.faktura (J/N)')
     A            FILE21         1A         TEXT('Aut.overf.kostnadsbilag')
     A            FILE31         1A         TEXT('Utskr. om manuell beh. TVINN')
     A            FILE41         1A         TEXT('SWITCH MVA-K. ETTER KTO-TYPE')
     A            FITRAN         1A         TEXT('Transportmudul ?')
     A                                      VALUES(' ' 'J' 'N')
     A            FIKRTN        20A         TEXT('Label kortnavn')
     A            FITAX2         4S 4       TEXT('Old Tax %')
     A                                      COLHDG('Old Tax %')
     A            FITAXD         8S 0       TEXT('Date for new tax')
     A            FISADK         1A         TEXT('Sammenslå innt/kost')
     A            FILIBF        10A         COLHDG('LIB Prod.Files')
     A            FILIBO        10A         COLHDG('LIB Hist.Files')
     A            INNUTL         1A         TEXT('benyttes utl.fraktbrev innla')
     A            ZIPCOD         1A         TEXT('Zipkode i stedsregister')
     A          K FIFIRM
