     A*___________________________
     A* SYSPED / Firmaopplysninger
     A*"""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FIRMTR
     A            FIFIRM         2          TEXT('firmakode')
     A            FIJOUR         7S 0       TEXT('Journalnr innt')
     A            FIJOU2         7S 0       TEXT('Journalnr kost')
     A            FIJOU3         7S 0       TEXT('Journalnr interno')
     A            FIJOU4         7S 0       TEXT('Journalnr transpav')
     A          K FIFIRM
