     A          R FIRMKOSR
     A            FIFIRM         2          TEXT('FIRMA')
     A            TILLAT         1          TEXT('TILLAT')
     A            INTERR         5S 0       TEXT('INT KONTO')
     A          K FIFIRM
