********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 SH  PTF10 ARKIVERT DOKUMENTTYPE FOR LISTER
********************************************************************
     A          R FIRMTPR
     A            TPFIRM         2          COLHDG('FIRMA')
     A            TPLEVN         8S 0       COLHDG('LEVERANDØR')
     A            TPGEB1         3          COLHDG('GEBYR 1.SIDE')
     A            TPGEB2         3          COLHDG('GEBYR DETALJ')
     A            TPGEB3         3          COLHDG('FAKT GEBYR')
     A            TPGEB4         3          COLHDG('MOMS GEBYR')
     A            TPSERI         1          COLHDG('BILAGSSERIE')
     A            TPMVAF         1          COLHDG('MOMS EGEN LINJE')
     A            TPTEXT        25          COLHDG('BILAGSTEXT')
     A            TPPRIN        10          COLHDG('UTKØ')
N01  A            TPDTDO         2          COLHDG('DOK.TYPE FAKTURA')
N01  A            TPDTKL         2          COLHDG('DOK.TYPE KONTROLLIST')
     A          K TPFIRM
