********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 ARKIVERT DOKUMENTTYPE FOR LISTER
10XXX * 02 SH  PTF10 ATTESTASJONSKODE
********************************************************************
     A          R FIRMDAGR
     A            DGFIRM         2          COLHDG('FIRMA')
     A            DGLEVN         8S 0       COLHDG('LEVERANDØR')
     A            DGGEB1         3          COLHDG('GEBYR 1.SIDE')
     A            DGGEB2         3          COLHDG('GEBYR TOLL  ')
     A            DGGEB3         3          COLHDG('GEBYR MVA')
     A            DGSERI         1          COLHDG('BILAGSSERIE')
     A            DGTEXT        25          COLHDG('BILAGSTEXT')
     A            DGFAKD         1          COLHDG('FAKTURERE DIFF')
     A            DGPRIN        10          COLHDG('UTKØ')
N01  A            DGDTDO         2          COLHDG('DOK.TYPE DAGSOPPGJØR')
N01  A            DGDTKL         2          COLHDG('DOK.TYPE KONTROLLIST')
N02  A            DGATT          3          COLHDG('ATTESTASJONSKODE')
N02  A            DGPER          1          COLHDG('PERIODE FRA OPPDRAG')
     A          K DGFIRM
