     A*____________________________
     A* SYSPED / FIRMAETS PROFIL I TRANSPORTMODULEN
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FIRTRR
     A            FIFIRM    R               REFFLD(FI)
     A            FAVREG         1          COLHDG('Avreg, via resk.')
     A                                      VALUES(' ' 'K' 'L')
     A            FIBISE         1          COLHDG('Bilagsser. avregn')
     A            FFERK          1          COLHDG('Ferjekostnader')
     A                                      VALUES(' ' 'J' 'N')
     A            FOPPDR         1          COLHDG('Oppdragsdetaljer')
     A                                      VALUES(' ' 'J' 'N')
     A            FIKONV         1          COLHDG('Turkonv.type')
     A                                      VALUES(' ' 'G' 'N')
     A            FIBRUT         1          COLHDG('Brutto internprising')
     A                                      VALUES(' ' 'J' 'N')
     A          K FIFIRM
