     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R BILDE
     A                                      CF03(03 'Avslutt program')
     A                                  1  2'SYSPED/FIXFRAT'
     A                                      COLOR(BLU)
     A                                  1 21'FIKSE KUNDEAVTALEREGISTER'
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                 11 21MSGCON(12 DIV0050 SYMSGF)
     A            WSAVD          4Y 0B 11 36DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13  2'OBS !  Dada"ene i den oppgitte avd-
     A                                      elingen blir brukt for alle avtalen-
     A                                      e'
     A                                      COLOR(RED)
     A                                 23 21MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  99                             24  2MSGCON(78 SPA0001 SYMSGF)
     A                                      COLOR(WHT)
