     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      HLPDOC('STATUS' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt program.')
     A                                  4 23MSGCON(30 DIV1337 SYMSGF)
     A                                      COLOR(WHT)
     A                                  8 23MSGCON(12 DIV1338 SYMSGF)
     A            WSAVD          4Y 0B  8 40DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  99                                  ERRMSG('Tastet avdeling/oppdragsnr.-
     A                                       finnes ikke.' 99)
     A                                 10 23MSGCON(12 DIV1339 SYMSGF)
     A            WSSG           3A  B 10 40TEXT('Signatur')
     A                                      DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 12 23MSGCON(12 DIV1340 SYMSGF)
     A            WSOPD          7Y 0B 12 40TEXT('OPPDRAGSNUMMER')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 15 23MSGCON(12 DIV1341 SYMSGF)
     A            WSST           1A  B 15 40TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 23 23MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A*
     A          R BILDEFA
     A                                      CF05(05 'Bekreft om endring')
     A                                      CF12(12 'Til forrige')
     A                                  1  2MSGCON(018 DIV0586 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 21MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 26TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 31'/'
     A                                      COLOR(WHT)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 59MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEPLAN         1A  O  2 17TEXT('PLANLEGGINSKODE')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 19'P'
     A            HEPOS1         7A  O  2 21TEXT('Posisjon-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPOS2         4Y 0O  2 29TEXT('Posisjon-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 34'D'
     A            WSDT           6Y 0O  2 36DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 43MSGCON(005 DIV0587 *LIBL/SYMSGF)
     A            WSGN          11A  O  2 49TEXT('Godsnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
     A            HERFA15       15A  O  2 66TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVALT         3A  O  3 23TEXT('V.KODE TILLEGG')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVALP         3Y 1O  3 28TEXT('PROSENT TILLEGG')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3 34MSGCON(003 DIV0590 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  3 38TEXT('House Airway Billno')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HELM           4Y 2O 14 67TEXT('LASTEMETER')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            HEM3           7Y 3O 13 70TEXT('KUBIKK')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('FORFRAKT FRA')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('VIDEREFRAKT FRA')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16  2MSGCON(012 DIV0595 *LIBL/SYMSGF)
     A            HEPK1          1A  O 17  2TEXT('Printerkode-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK2          1A  O 17  6TEXT('Printerkode-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK3          1A  O 17  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK4          1A  O 17 12TEXT('Printerkode-4')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            W2TOLL         2Y 0O 18  2TEXT('Tollsted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 18 20TEXT('Merkelapp  /X')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 18 40TEXT('Etterkrav  /X')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 18 56TEXT('Antall varepos SAD')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(012 DIV1343 *LIBL/SYMSGF)
     A            HEST           1A  O 20 15TEXT('Status GML')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 21  2MSGCON(012 DIV1341 *LIBL/SYMSGF)
     A            WSST           1A  O 21 15TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A*
     A          R BILDEEX
     A                                      CF05(05 'Bekreft om endring')
     A                                      CF12(12 'Til forrige')
     A                                  1  2MSGCON(018 YBC1954 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 21MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 26TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 31'/'
     A                                      COLOR(WHT)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 59MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 17MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2 20DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 37MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A            HETLE          6A  O  2 43DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 51MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLL         10A  O  2 58DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 71MSGCON(008 DIV0620 *LIBL/SYMSGF)
     A            HETLKU         1A  O  2 80DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
     A            HERFA15       15A  O  4 66TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 23MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  3 32TEXT('V.kode tillegg')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVALP         3Y 1O  3 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 57MSGCON(003 DIV0786 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HELM           4Y 2O 14 67TEXT('Lastemeter')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('Forfrakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('Viderefrakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16  2MSGCON(048 DIV0621 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  6TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK6          1A  O 17 16TEXT('Printerkode-6')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK7          1A  O 17 41TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 20  2MSGCON(012 DIV1343 *LIBL/SYMSGF)
     A            HEST           1A  O 20 15TEXT('Status GML')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 21  2MSGCON(012 DIV1341 *LIBL/SYMSGF)
     A            WSST           1A  O 21 15TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                 22 24MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 34DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R BILDEFI
     A                                      CF05(05 'Bekreft om endring')
     A                                      CF12(12 'Til forrige')
     A                                  1  2MSGCON(018 DIV0070 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 21MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 26TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 31'/'
     A                                      COLOR(WHT)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 59MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 17'P'
     A            HEPOS1         7A  O  2 19TEXT('Posisjon-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPOS2         4Y 0O  2 27TEXT('Posisjon-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 32MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 42MSGCON(006 DIV0077 *LIBL/SYMSGF)
     A            WSGN          11A  O  2 49TEXT('Godsnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            HERFA15       15A  O  2 66TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 18MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 23TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 34MSGCON(003 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  3 38TEXT('House Airway Billno')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(075 DIV0098 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEFBV          9Y 0O 13 70TEXT('Fraktberegn.vekt')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16  2MSGCON(015 DIV0101 *LIBL/SYMSGF)
     A            HEPK1          1A  O 17  2TEXT('Printerkode-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK2          1A  O 17  6TEXT('Printerkode-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK3          1A  O 17  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK4          1A  O 17 12TEXT('Printerkode-4')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK5          1A  O 17 15TEXT('Printerkode-5')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            W2TOLL         2Y 0O 18  2TEXT('Tollsted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 18 20TEXT('Merkelapp  /X')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 18 40TEXT('Etterkrav  /X')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 18 56TEXT('Antall varepos SAD')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(012 DIV1343 *LIBL/SYMSGF)
     A            HEST           1A  O 20 15TEXT('Status GML')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 21  2MSGCON(012 DIV1341 *LIBL/SYMSGF)
     A            WSST           1A  O 21 15TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R BILDEEF
     A                                      CF05(05 'Bekreft om endring')
     A                                      CF12(12 'Til forrige')
     A                                  1  2MSGCON(018 YBC1955 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 21MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 26TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 31'/'
     A                                      COLOR(WHT)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 59MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  2  2MSGCON(005 DIV0062 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 61MSGCON(004 DIV0117 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2 66TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 14MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 19TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 25MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 30TEXT('Landkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 33MSGCON(006 DIV0124 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 40TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            WSGN          11A  O  3 66COLOR(WHT)
     A                                  4  2MSGCON(004 DIV0118 *LIBL/SYMSGF)
     A            HEKNF          3Y 0O  4  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            KFSNAV        30A  O  4 17COLOR(WHT)
     A                                  4 61MSGCON(004 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  4 66TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0119 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 61MSGCON(004 DIV0120 *LIBL/SYMSGF)
     A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(075 DIV0125 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  7TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEFR           3A  O 13 18TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16  2MSGCON(017 DIV0122 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  5TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK6          1A  O 17 10TEXT('Printerkode-4')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK9          1A  O 17 15TEXT('Printerkode-5')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 20  2MSGCON(012 DIV1343 *LIBL/SYMSGF)
     A            HEST           1A  O 20 15TEXT('Status GML')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 21  2MSGCON(012 DIV1341 *LIBL/SYMSGF)
     A            WSST           1A  O 21 15TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                 22 24MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 34DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R BILDEIN
     A                                      CF05(05 'Bekreft om endring')
     A                                      CF12(12 'Til forrige')
     A                                  1  2MSGCON(018 DIV0115 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 21MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 26TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 31'/'
     A                                      COLOR(WHT)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 59MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  2  2MSGCON(005 DIV0062 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 21MSGCON(009 DIV0116 *LIBL/SYMSGF)
     A            HEPK9          1A  O  2 31TEXT('Printerkode-9')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 61MSGCON(004 DIV0117 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2 66TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 14MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 19TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 25MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 30TEXT('Landkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 33MSGCON(006 DIV0613 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 40TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            WSGN          11A  O  3 66COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0118 *LIBL/SYMSGF)
     A            HEKNF          3Y 0O  4  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            KFSNAV        30A  O  4 17COLOR(WHT)
     A                                  4 61MSGCON(004 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  4 66TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0119 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 61MSGCON(004 DIV0120 *LIBL/SYMSGF)
     A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A N99                                  COLOR(WHT)
     A  99                                  COLOR(RED)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A N98                                  COLOR(WHT)
     A  98                                  COLOR(RED)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(075 DIV0121 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16  2MSGCON(017 DIV5101 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  5TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            HEPK5          1A  O 17 15TEXT('Printerkode-5')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 20  2MSGCON(012 DIV1343 *LIBL/SYMSGF)
     A            HEST           1A  O 20 15TEXT('Status GML')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 21  2MSGCON(012 DIV1341 *LIBL/SYMSGF)
     A            WSST           1A  O 21 15TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R BILDESJ
     A                                      CF05(05 'Bekreft om endring')
     A                                      CF12(12 'Til forrige')
     A                                  1  2MSGCON(018 DIV3285 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 21MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 26TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 31'/'
     A                                      COLOR(WHT)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 59MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEPLAN         1A  O  2 17TEXT('Planleggingskode')
     A                                      COLOR(YLW)
     A                                  2 19'P'
     A            HEPOS1         7A  O  2 21TEXT('Posisjon-1')
     A                                      COLOR(YLW)
     A            HEPOS2         4Y 0O  2 29TEXT('Posisjon-2')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 34'D'
     A            WSDT           6Y 0O  2 36COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 43MSGCON(005 DIV0587 *LIBL/SYMSGF)
     A            WSGN          11A  O  2 49TEXT('Godsnummer')
     A                                      COLOR(YLW)
     A                                  2 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
     A            HERFA15       15A  O  2 66TEXT('Referanse Agent')
     A                                      COLOR(YLW)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(YLW)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(YLW)
     A            HEVALT         3A  O  3 23TEXT('V.kode tillegg')
     A                                      COLOR(YLW)
     A            WSVALP         3Y 1O  3 28COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3 34MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            HELB           5A  O  3 40TEXT('LOKAL BÅT')
     A                                      COLOR(YLW)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(YLW)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(005 DIV3284 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(YLW)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            KFSNA2        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(YLW)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(YLW)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(YLW)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(YLW)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A N99                                  COLOR(WHT)
     A  99                                  COLOR(RED)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(YLW)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(YLW)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(YLW)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(YLW)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(YLW)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A N98                                  COLOR(WHT)
     A  98                                  COLOR(RED)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(YLW)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(YLW)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(YLW)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(078 DIV3282 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(YLW)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(YLW)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(YLW)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(YLW)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(YLW)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('Forfrakt fra')
     A                                      COLOR(YLW)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('Viderefrakt til')
     A                                      COLOR(YLW)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      COLOR(YLW)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      COLOR(YLW)
     A                                 16  2MSGCON(012 DIV0595 *LIBL/SYMSGF)
     A            HEPK1          1A  O 17  2TEXT('Printerkode-1')
     A                                      COLOR(YLW)
     A            HEPK2          1A  O 17  6TEXT('Printerkode-2')
     A                                      COLOR(YLW)
     A            HEPK3          1A  O 17  9TEXT('Printerkode-3')
     A                                      COLOR(YLW)
     A            HEPK4          1A  O 17 12TEXT('Printerkode-4')
     A                                      COLOR(YLW)
     A                                 17 27MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 17 38TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 17 49MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 17 60TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            W2TOLL         2Y 0O 18  2TEXT('Tollsted')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 18 20TEXT('Merkelapp  /X')
     A                                      COLOR(YLW)
     A                                 18 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 18 40TEXT('Etterkrav  /X')
     A                                      COLOR(YLW)
     A                                 18 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 18 56TEXT('Antall varepos SAD')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 20  2MSGCON(012 DIV1343 *LIBL/SYMSGF)
     A            HEST           1A  O 20 15TEXT('Status GML')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 21  2MSGCON(012 DIV1341 *LIBL/SYMSGF)
     A            WSST           1A  O 21 15TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A*
     A          R BILDESE
     A                                      CF05(05 'Bekreft om endring')
     A                                      CF12(12 'Til forrige')
     A                                  1  2MSGCON(018 DIV3286 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2  8TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 13'/'
     A                                      COLOR(WHT)
     A            HEOPD          7Y 0O  2 15TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 24MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 28TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 35MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 40TEXT('Kostnadssted')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  3  8TEXT('Prosjektnummer')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3 17MSGCON(002 DIV0076 *LIBL/SYMSGF)
EV5  A            HEDT           8Y 0H
NV5  A            WSDT           6Y 0O  3 20COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3 36MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A            HETLE          6A  O  3 42COLOR(YLW)
     A                                  3 50MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLL         10A  O  3 57COLOR(YLW)
     A                                  3 70MSGCON(008 DIV0620 *LIBL/SYMSGF)
     A            HETLKU         1A  O  3 79COLOR(YLW)
     A                                  6 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
     A            HERFA15       15A  O  6 66TEXT('Referanse Agent')
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  4  8TEXT('Frakt fra')
     A                                      COLOR(YLW)
     A                                  4 14'-'
     A            HESDT          5A  O  4 16TEXT('Frakt til')
     A                                      COLOR(YLW)
     A                                  4 23MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  4 32TEXT('V.kode tillegg')
     A                                      COLOR(YLW)
     A            WSVALP         3Y 1O  4 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  4 46MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  4 51TEXT('Landkode')
     A                                      COLOR(YLW)
     A                                  4 57MSGCON(003 DIV0786 *LIBL/SYMSGF)
     A            HESDL         20A  O  4 61TEXT('Lossested')
     A                                      COLOR(YLW)
     A                                  5  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(YLW)
     A                                  5 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  5 54TEXT('Kundenr Transportør')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            KFSNA2        18A  O  5 63COLOR(WHT)
     A                                  6  2MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            HELB           5A  O  6  8TEXT('LOKAL BÅT')
     A                                      COLOR(YLW)
     A                                  8  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  8  8TEXT('Kundenr Selger')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  8 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  8 22TEXT('Avtalenr Selger')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  8 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  8 27TEXT('Fakturakode Selger')
     A                                      COLOR(YLW)
     A                                  8 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  8 33TEXT('Valutakode Selger')
     A                                      COLOR(YLW)
     A                                  8 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  8 42TEXT('Kundenr Selg.fakm')
     A N99                                  COLOR(WHT)
     A  99                                  COLOR(RED)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  8 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  9  8TEXT('Navn Selger')
     A                                      COLOR(YLW)
     A            HEADS1        30A  O  9 42TEXT('Adresse-1 Selger')
     A                                      COLOR(YLW)
     A            HEADS2        30A  O 10  8TEXT('Adresse-3 Selger')
     A                                      COLOR(YLW)
     A            HEADS3        30A  O 10 42TEXT('Adresse-2 Selger')
     A                                      COLOR(YLW)
     A                                 11  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O 11  8TEXT('Kundenr Kjøper')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 11 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O 11 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 11 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O 11 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(YLW)
     A                                 11 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O 11 33TEXT('Valutakode Kjøper')
     A                                      COLOR(YLW)
     A                                 11 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O 11 42TEXT('Kundenr Kjøp.fakm')
     A N98                                  COLOR(WHT)
     A  98                                  COLOR(RED)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O 11 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 12  8TEXT('Navn Kjøper')
     A                                      COLOR(YLW)
     A            HEADK1        30A  O 12 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(YLW)
     A            HEADK2        30A  O 13  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(YLW)
     A            HEADK3        30A  O 13 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(078 DIV3282 *LIBL/SYMSGF)
     A            HEOT           2A  O 16  2TEXT('Oppdragstype')
     A                                      COLOR(YLW)
     A            HEFR           3A  O 16  5TEXT('Frankatur')
     A                                      COLOR(YLW)
     A            HEGM1         15A  O 16  9TEXT('Godsmerking-1')
     A                                      COLOR(YLW)
     A            HENT           7Y 0O 16 25TEXT('Antall')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 16 33TEXT('Vareslag-1')
     A                                      COLOR(YLW)
     A            HEVKT          9Y 0O 16 60TEXT('Vekt')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 16 70TEXT('Kubikk')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 17  9TEXT('Godsmerking-2')
     A                                      COLOR(YLW)
     A            HEVS2         25A  O 17 33TEXT('Vareslag-2')
     A                                      COLOR(YLW)
     A                                 18  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 18 15TEXT('Forfrakt fra')
     A                                      COLOR(YLW)
     A                                 18 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 18 38TEXT('Viderefrakt til')
     A                                      COLOR(YLW)
     A                                 18 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 18 54TEXT('Planleggingskode')
     A                                      COLOR(YLW)
     A                                 18 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 18 63TEXT('Lagerkode')
     A                                      COLOR(YLW)
     A                                 19 42MSGCON(021 DIV3812 *LIBL/SYMSGF)
     A            HEPK3          1A  O 20 46TEXT('Printerkode-3')
     A                                      COLOR(YLW)
     A            HEPK6          1A  O 20 54TEXT('Printerkode-6')
     A                                      COLOR(YLW)
     A            HEPK7          1A  O 20 60TEXT('Printerkode-7')
     A                                      COLOR(YLW)
     A                                 20  2MSGCON(012 DIV1343 *LIBL/SYMSGF)
     A            HEST           1A  O 20 15TEXT('Status GML')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 21  2MSGCON(012 DIV1341 *LIBL/SYMSGF)
     A            WSST           1A  O 21 15TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A*
     A          R BILDETR
     A                                      CF05(05 'Bekreft om slett')
     A                                      CF12(12 'Til forrige')
     A                                  1  2'SYSPED/SYFM21A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(039 DIV4082 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 69TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2  8TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            HEOPD          7Y 0O  2 13TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                  2 21MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 25TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 29MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 34TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 39'Tur'
     A            HEPRO          8Y 0O  2 43TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 52'Rundt'
     A            TRRUND         8Y 0O  2 58TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 67MSGCON(003 JOV0169 *LIBL/SYMSGF)
     A            HEHAWB    R        O  2 71REFFLD(HEADFR/HEHAWB *LIBL/HEADF)
     A                                      COLOR(WHT)
     A                                  3  2'Dato'
     A                                  3  2'Opdgi'
     A            TRKDAK         1A  O  3  8COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRKNFA         8Y 0O  3 10TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  3 19TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEADA         30A  O  3 50COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  2'Fmott'
     A            TRKDFF         1A  O  4  8COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEKNSF         8Y 0O  4 10TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HENASF        30A  O  4 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADSF        30A  O  4 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2'Søref'
     A            HERFA15       15A  O  5  8TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 24'LS'
     A            WSSDL         15A  O  5 27TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 43MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  5 47TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 49MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  5 52TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 54MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  5 58TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 62'T.'
     A            HEVALT         3A  O  5 65TEXT('V.kode tillegg')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  5 69DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 74'T-st'
     A            TRTSTA         1A  O  5 79COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  6  2'Fra'
     A            HESDF          5A  O  6  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSDFD         6Y 0O  6 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSDFK         4Y 0O  6 21EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSLANF         2A  O  6 28COLOR(WHT)
     A            WSSONF         3A  O  6 31COLOR(WHT)
     A            WSPNRF         5Y 0O  6 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 44'Til'
     A            HESDT          5A  O  6 48TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSDTD         6Y 0O  6 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSDTK         4Y 0O  6 61EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSLANT         2A  O  6 68COLOR(WHT)
     A            WSSONT         3A  O  6 71COLOR(WHT)
     A            WSPNRT         5Y 0O  6 75COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7  2'Forf'
     A            HESDFF         5A  O  7  8TEXT('Forfrakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSFFD         6Y 0O  7 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSFFK         4Y 0O  7 21EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRSTAF         1A  O  7 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLAN1         2A  O  7 28COLOR(WHT)
     A            WSSON1         3A  O  7 31COLOR(WHT)
     A            WSPNR1         5Y 0O  7 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7 44'Vid'
     A            HESDVT         5A  O  7 48TEXT('Viderefrakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSVTD         6Y 0O  7 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSVTK         4Y 0O  7 61EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRSTAE         1A  O  7 66DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLAN2         2A  O  7 68COLOR(WHT)
     A            WSSON2         3A  O  7 71COLOR(WHT)
     A            WSPNR2         5Y 0O  7 75COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8  2MSGCON(005 DIV2299 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  8  8COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSNAFA        30A  O  8 19COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSADFA        30A  O  8 50COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  9  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMS        30A  O  9 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRS        30A  O  9 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2'Henteadresse'
     A            HENAS         30A  O 10 19TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS1        30A  O 10 50TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS2        30A  O 11 19TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS3        30A  O 11 50TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O 12  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMK        30A  O 12 19TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRK        30A  O 12 50TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 13  2'Leveringsadr'
     A            HENAK         30A  O 13 19TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 13 50TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 14 19TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 14 50TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A            HEOT           2A  O 16  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEFR           3A  O 16  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 16  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 16 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 16 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 16 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 16 73TEXT('KUBIKK')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            HEGM2         15A  O 17  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 17 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 17 68TEXT('Lastemeter')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 18  9COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEKFT1         1A  O 18 12COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEFT1A        30A  O 18 15COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEFT1B        15A  O 18 46COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSUSR         10A  O 18 62COLOR(PNK)
     A                                 19  2'Verdi.'
     A            TRVERV         3A  O 19  9COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRVERB        13Y 2O 19 13EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 19 28'E'
     A            TRETTV         3A  O 19 30COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRETTB        13Y 2O 19 34EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 19 49'Frakt'
     A            TRFRAK         1A  O 19 55COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFRAV         3A  O 19 57COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFRAB        13Y 2O 19 61COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 19 76'M'
     A            TRMVA          1A  O 19 78COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20  2'Far(I)'
     A            TRFA11         7A  O 20  9COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 17'-'
     A            TRFA12         4A  O 20 19COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 24'Fl.p'
     A            TRFLP1         3Y 0O 20 29COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 20 33'Far(A)'
     A            TRFA21         7A  O 20 40COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFA22         4A  O 20 48COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 53'Fl.p'
     A            TRFLP2         3Y 0O 20 58COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 20 62MSGCON(006 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 69REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 74REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2'Godsn'
     A            HEGN          15A  O 21  9COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 21 25'P'
     A            HEPOS1         7A  O 21 27COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEPOS2         4Y 0O 21 35EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 21 40MSGCON(012 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(012 DIV1343 *LIBL/SYMSGF)
     A            HEST           1A  O 22 15TEXT('Status GML')
     A                                      DSPATR(UL)
     A                                      COLOR(RED)
     A                                 22 22MSGCON(012 DIV1341 *LIBL/SYMSGF)
     A            WSST           1A  O 22 35TEXT('Status ny')
     A                                      DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                 22 43MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                 23  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 23 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A  29                             23 22MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 25MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 23 35TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 23 44'/'
     A            HEKLMO         4Y 0O 23 46COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 24  2MSGCON(040 DIV1342 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
