      *...............................................................
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     A*___________________________
     A* SYSPED / FLYPRISREGISTER
     A*"""""""""""""""""""""""""""
     A          R FLYPRISR
     A*
     A            FPKATE         2          COLHDG('KATEGORI')
     A*
     A            FPINTE         6          COLHDG('INTERN')
     A*
     A            FPFRFL         3          COLHDG('FRA FLYPLASS')
     A*
     A            FPFRLK         2          COLHDG('FRA LAND')
     A*
     A            FPTIFL         3          COLHDG('TIL FLYPLASS')
     A*
     A            FPTILK         2          COLHDG('TIL LAND')
     A*
     A            FPUNIK         4          COLHDG('UNIK')
     A*
     A            FPFLYS         3          COLHDG('FLYSELSKAP')
     A*
     A            FPITEM         8          COLHDG('ITEM')
     A*
     A            FPRATK         4          COLHDG('RATEKODE')
     A*
     A            FPCHAR         1          COLHDG('CHARGEKODE')
     A*
     A            FPVEKT         6          COLHDG('VEKT BRK')
     A*
     A            FPVALK         3          COLHDG('VALUTAKODE')
     A*
     A            FPDECI         1          COLHDG('DECIMALPLASS')
     A*
     A            FPRATE         9          COLHDG('RATE')
     A*
     A            FPDATF         8          COLHDG('DATO FRA')
     A*
     A            FPDATU         8          COLHDG('DATO TIL')
     A*
     A            FPSOUR         5          COLHDG('SOURCE')
     A*
     A            FPINT2         2          COLHDG('INTER 2')
