      *____________________________________________
     A* SYSPED / FLYPRISREGISTER
      *""""""""""""""""""""""""""""""""""""""""""""
     A          R FLYPRIOR                  PFILE(FLYPRISO)
     A          K FOFRFL
     A          K FOTIFL
