      *...............................................................
      *"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     A*___________________________
     A* SYSPED / FLYPRISREGISTER
     A*"""""""""""""""""""""""""""
     A          R FLYPRIOR
     A            FOFRFL         3          COLHDG('FRA FLYPLASS')
     A            FOFRLK         2          COLHDG('FRA LAND')
     A            FOTIFL         3          COLHDG('TIL FLYPLASS')
     A            FOTILK         2          COLHDG('TIL LAND')
     A            FOGRN          9S 0       COLHDG('GRUNNPRIS')
     A            FOVEKT         5S 0       COLHDG('VEKT BRK')
     A            FOVALK         3          COLHDG('VALUTAKODE')
     A            FORATE         9S 2       COLHDG('RATE')
