     A                                      REF(SR)
     A          R FORDR
     A            FOSTAT         1          COLHDG('Status')
     A            FOAVD          4S 0       COLHDG('Avdeling')
     A            FOOPD          7S 0       COLHDG('Oppdragsnummer')
     A            FOLOP          5S 0       COLHDG('Løpenummer')
     A            FOLEK         17          COLHDG('Lev. kundenr.')
     A            FOKNR          8S 0       COLHDG('Kundenummer')
     A            FOADRN         5S 0       COLHDG('Lev.adr. nr.')
     A            FOKLL          4S 0       COLHDG('Antall kolli')
     A            FOVSL         25          COLHDG('Enhet/vareslag')
     A            FOVKT          5S 0       COLHDG('Vekt')
     A            FOM3           5S 3       COLHDG('Kubikk')
     A            FOMRK         12          COLHDG('Merke')
     A            FOUTL          2          COLHDG('Utleveringsforbehold')
     A            FOSJN          1          COLHDG('Sammenslåes J/N')
     A            FOTJN          1          COLHDG('Fortolles J/N')
     A            FOAVDI         4S 0       COLHDG('Avd. importoppdrag')
     A            FOOPDI         7S 0       COLHDG('Oppdr. importoppdrag')
     A            FOAVDV         4S 0       COLHDG('Avd. innlandsoppdrag')
     A            FOOPDV         7S 0       COLHDG('Oppdr. innl.oppdr.')
     A            FOMJN          1          COLHDG('Merkelapp J/N')
     A            FO1004    R               REFFLD(N1004)
     A                                      COLHDG('Sendningsnr')
     A            FONAK         30          COLHDG('Lev.adr. navn')
     A            FOADK1        30          COLHDG('Lev.adr. 1')
     A            FOADK2        30          COLHDG('Lev.adr. 2')
     A            FOADK3        30          COLHDG('Lev.adr. 3')
     A            FOPALL         2S 0       COLHDG('Ant byttepaller')
     A            FOZML          2S 0       COLHDG('Ant Zebra merkel.')
     A          K FOAVD
     A          K FOOPD
     A          K FOLOP
