     A          R FORDR                     PFILE(FORDEL)
     A          K FOAVD
     A          K FOOPD
     A          K FOKNR
     A          K FOSJN
     A          K FOLOP
