     A          R FP0004FR
     A            DEKL           8          COLHDG('Deklarant')
     A            ORGNR          9          COLHDG('Org.nr')
     A            FR15          15          COLHDG('Unikt nr')
     A            SIAVD          4S 0       COLHDG('Avdeling')
     A            SITDN          7S 0       COLHDG('Oppdragsnr')
     A            SIDTG         10          COLHDG('Dekl. godkj.dato')
     A            SITLL         10          COLHDG('Tollnr Løpenr')
     A            SITLE          6          COLHDG('Tollnr Ekspsted')
     A            HEDTOP         8S 0       COLHDG('Ank.dato')
     A            UTLS          30          COLHDG('Utlev.sted')
     A            SINAK         30          COLHDG('Mottagers navn')
     A            SIADK1        30          COLHDG('Mottagers adresse 1')
     A            SIADK2        30          COLHDG('Mottagers adresse 2')
     A            SIADK3        30          COLHDG('Mottagers adresse 3')
     A            SINAS         30          COLHDG('Avsenders navn')
     A            SIADS1        30          COLHDG('Avsenders adresse 1')
     A            SIADS2        30          COLHDG('Avsenders adresse 2')
     A            SIADS3        30          COLHDG('Avsenders adresse 3')
     A            SILKA          2          COLHDG('Avsender land')
     A            VABE          25          COLHDG('Varebeskrivelse')
     A            HSNR           8          COLHDG('Hs-nummer')
     A            SIVAL3         3          COLHDG('Valutakode')
     A            VALSUM        13S 2       COLHDG('Verdi i valuta')
     A            NOKSUM        13S 2       COLHDG('Tollverdi NOK')
     A            SINTK          7S 0       COLHDG('Antall kolli')
     A            BRUVKT        12S 2       COLHDG('Bruttovekt')
