     A          R FPSTDR
     A            FPSTDA         4S 0       COLHDG('AVD')
     A            FPSTDO         7S 0       COLHDG('OPD')
     A          K FPSTDA
