     A*__________________________________
     A* SYSPED / FORENKLET PROSEDYRE
     A*""""""""""""""""""""""""""""""""""
     A          R FPXREFR                   PFILE(FPXREF)
     A                                      TEXT('KUREF')
     A          K FPTLL
