     A*__________________________________
     A* SYSPED / FORENKLET PROSEDYRE
     A*""""""""""""""""""""""""""""""""""
     A          R FPXREFR                   PFILE(FPXREF)
     A                                      TEXT('Status')
     A          K FPSTAT
     A          K FPAVDH
     A          K FPOPDH
     A          K FPAVD
     A          K FPOPD
