     A          R FPXREFR
     A            FPSTAT         1          COLHDG('STATUS')
     A            FPAVD          4S 0       COLHDG('AVD')
     A            FPOPD          7S 0       COLHDG('OPD')
     A            FPKURE        17          COLHDG('KUNDEREF')
     A            FPAVDH         4S 0       COLHDG('KOBLET TIL AVD')
     A            FPOPDH         7S 0       COLHDG('KOBLET TIL OPD')
     A            FPTLE          6S 0       COLHDG('EKSP STED')
     A            FPTLL         10S 0       COLHDG('LØPENR')
     A            FPTDT          8S 0       COLHDG('FORT. DATO')
     A          K FPAVD
     A          K FPOPD
