     A*____________________________
     A* SYSPED / FRAKTTABELL
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R FRATR
     A            FTKNR          8S 0       TEXT('KUNDENR.')
     A            FTFRAN         3          TEXT('FRANKATUR')
     A            FTOPDT         2          TEXT('OPPDRAGSTYPE')
     A            FTSK           1          TEXT('SELGER/KJØPER')
     A            FTFRA          5          TEXT('DESTINASJON FRA')
     A            FTTIL          5          TEXT('DESTINASJON TIL')
     A            FTAVTN         1S 0       TEXT('AVTALENR')
     A            FTBFT         36          TEXT('BRUTTO FRAKTTABELL 12*5.0')
     A            FTKODE         1          TEXT('KODE')
     A            FTMIN          5S 0       TEXT('MINIMUM PRIS')
     A            FTMAX1         5S 0       TEXT('MAXIMUM PRIS-1')
     A            FTKOLL         1          TEXT('KOLLI')
     A            FTPRPR         5P 0       TEXT('PR. ANTALL KG')
     A            FTMFT         36          TEXT('MAX FRAKTTABELL 12*5.0')
     A            FTMAX2         5P 0       TEXT('MAXIMUM PRIS-2')
     A            FTMAX3         5P 0       TEXT('MAXIMUM PRIS-3')
     A            FTFAST         2S 0       TEXT('FASTPRIS T.O.M VEKTGRUPPE')
     A            FTDT           8S 0       TEXT('UTDAT')
     A            FTMM           1S 0       TEXT('MINIMUM/MAKSIMUN')
     A            FTVAL          3          TEXT('VALUTA KODE')
     A            FTLMOM         5S 0       TEXT('OMREGNING LASTEMETER')
     A            FTM3OM         5S 0       TEXT('OMREGNING KUBIKKMETER')
     A            FRVK1          5P 0       TEXT('VEKTGRUPPE - 1')
     A            FRVK2          5P 0       TEXT('VEKTGRUPPE - 2')
     A            FRVK3          5P 0       TEXT('VEKTGRUPPE - 3')
     A            FRVK4          5P 0       TEXT('VEKTGRUPPE - 4')
     A            FRVK5          5P 0       TEXT('VEKTGRUPPE - 5')
     A            FRVK6          5P 0       TEXT('VEKTGRUPPE - 6')
     A            FRVK7          5P 0       TEXT('VEKTGRUPPE - 7')
     A            FRVK8          5P 0       TEXT('VEKTGRUPPE - 8')
     A            FRVK9          5P 0       TEXT('VEKTGRUPPE - 9')
     A            FRVK10         5P 0       TEXT('VEKTGRUPPE - 10')
     A            FRVK11         5P 0       TEXT('VEKTGRUPPE - 11')
     A          K FTKNR
     A          K FTFRAN
     A          K FTOPDT
     A          K FTSK
     A          K FTFRA
     A          K FTTIL
     A          K FTAVTN
