     A*____________________________
     A* SYSPED / FRAKTTABELL
     A*""""""""""""""""""""""""""""
     A          R FRATR                     PFILE(FRATNWRK)
     A          K FTKNR
     A          K FTFRA
     A          K FTFRAN
     A          K FTOPDT
     A          K FTSK
     A          K FTTIL
