     A*____________________________
     A* SYSPED / FRAKTAVTALEr  'V'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R FRAVR
     A            FRVKNR         8S 0       TEXT('KUNDENR.')
     A            FRVFRN         3          TEXT('FRANKATUR')
     A            FRVOPT         2          TEXT('OPPDRAGSTYPE')
     A            FRVSK          1          TEXT('SELGER/KJØPER')
     A            FRVFRA         5          TEXT('DESTINASJON FRA')
     A            FRVTIL         5          TEXT('DESTINASJON TIL')
     A            FRVAVN         1S 0       TEXT('AVTALENR')
     A            FRVLKG         5S 0       TEXT('OMR.FAKTOR LASTMETER->KG')
     A            FRVKKG         5S 0       TEXT('OMR.FAKTOR KUBIKKMETER->KG')
     A            FRVK1          5P 0       TEXT('VEKTGRUPPE - 1')
     A            FRVK2          5P 0       TEXT('VEKTGRUPPE - 2')
     A            FRVK3          5P 0       TEXT('VEKTGRUPPE - 3')
     A            FRVK4          5P 0       TEXT('VEKTGRUPPE - 4')
     A            FRVK5          5P 0       TEXT('VEKTGRUPPE - 5')
     A            FRVK6          5P 0       TEXT('VEKTGRUPPE - 6')
     A            FRVK7          5P 0       TEXT('VEKTGRUPPE - 7')
     A            FRVK8          5P 0       TEXT('VEKTGRUPPE - 8')
     A            FRVK9          5P 0       TEXT('VEKTGRUPPE - 9')
     A            FRVK10         5P 0       TEXT('VEKTGRUPPE - 10')
     A            FRVK11         5P 0       TEXT('VEKTGRUPPE - 11')
     A          K FRVKNR
     A          K FRVFRN
     A          K FRVOPT
     A          K FRVSK
     A          K FRVFRA
     A          K FRVTIL
     A          K FRVAVN
