     A*____________________________
     A* SYSPED / FRI TEKST TIL OPPDRAG
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R FREETXTR
     A            FRTAVD         4S 0       COLHDG('AVDELING')
     A            FRTOPD         7S 0       COLHDG('OPPDRAGSNR.')
EV5  A            FRTDT          8S 0       COLHDG('DATO')
     A            FRTLI          2S 0       COLHDG('LINJENR.')
     A            FRTTXT        70A         COLHDG('FRI TEKST')
      * FØLGENDE KODER ER BRUKT:
      *   = ARBEIDSORDRE
      * A =
      * B = FAKTURA
      * C = CMR-FR.BREV, FR.BREV
      * F = FAKTURA
      * G = GODSLISTE
      * I = FAKTURA
      * K = FØLGEBREV, FAKTURA, KJ.KVITTERING, OPPD.FORMULAR, ARB.ORDRE
      * L = LASTELISTE, LOSSELISTE
      * N = TET-IMPORT: ÅRSAK TIL AVSLUTT TET
      * O = BOOKING BEKREFTELSE
      * S = ORDREBEKREFTELSE, FAKTURA, ARBEIDSORDRE
      * T =
      * X = FAKTURA
     A            FRTKOD         1A         COLHDG('KODE')
F7   A            FRTFAK         7S 0       COLHDG('FAKTNR')
     A            FRTLES         1A         COLHDG('X=LEST')
     A          K FRTAVD
     A          K FRTOPD
     A          K FRTDT
     A          K FRTKOD
     A          K FRTLI
