     A*____________________________
     A* SYSPED / FRI TEKST TIL TURER
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R FREETURR
     A            FRTAVD         4P 0       COLHDG('AVDELING')
     A            FRTTUR         8P 0       COLHDG('TURNUMMER.')
     A            FRTDT          8P 0       COLHDG('DATO')
     A            FRTLI          2S 0       COLHDG('LINJENR.')
     A            FRTTXT        70A         COLHDG('FRI TEKST')
     A            FRTKOD         1A         COLHDG('KODE')
     A            FRTLES         1A         COLHDG('X=LEST')
     A          K FRTAVD
     A          K FRTTUR
     A          K FRTDT
     A          K FRTKOD
     A          K FRTLI
