     A*__________________________________
     A* SYSPED /
     A*""""""""""""""""""""""""""""""""""
     A          R FREETURR                  PFILE(FREETUR)
     A          K FRTAVD
     A          K FRTTUR
     A          K FRTKOD
     A          K FRTLES
