     A*__________________________________
     A* SYSPED / FREETXT
     A*""""""""""""""""""""""""""""""""""
     A          R FREETXTR                  PFILE(FREETXT)
     A          K FRTAVD
     A          K FRTOPD
     A          K FRTKOD
     A          K FRTLES
