     A*_________________________________________
     A* SYSPED / FRI SØKEVEI
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FRISKKR                   PFILE(FRISKK)
     A          K FSKODE
     A          K FSSOK
     A          K FSDATO
