     A*_________________________________________
     A* SYSPED / FRI SØKEVEI
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FRISOKR                   PFILE(FRISOK)
     A          K FSKODE
     A          K FSSOK
     A          K FSDTOP
