     A*_________________________________________
     A* SYSPED / FRI SØKEVEI
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FRISOKR                   PFILE(FRISOK)
     A          K FSAVD
     A          K FSOPD
     A          K FSSOK
     A          K FSKODE
