     A*_________________________________________________
     A* SYSPED / REGISTER FOR FREIGHT MANIFEST DETAILJ-2
     A*"""""""""""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R FRMDOC2R
     A            FMAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            FMOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            FMLN           2S 0       COLHDG('LINE NO.')
     A            FMKU2          7  4       COLHDG('CURRENCY RATE')
     A            FMVA2          3          COLHDG('CURRENCY CODE')
     A            FMPR2A        13  2       COLHDG('PREPAID')
     A            FMPR2B        13  2       COLHDG('PREPAID')
     A          K FMAVD
     A          K FMOPD
     A          K FMLN
