     A*_________________________________________
     A* INTERSPED / STYRINGSREGISTER POSTNUMMER - AVVIK FRA TOLLPOST
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R STIR                      PFILE(FRSTIS)
     A          K STIFRA
     A          K STIPNT
