     A*__________________________
     A* STEDSREGISTER TOLLPOST
     A*""""""""""""""""""""""""""
     A          R FRTABTGR
     A            TGSONE         3          COLHDG('SONENUMMER')
     A            TGPR1        240          COLHDG('PRISTABELL')
     A            TGPR2        240          COLHDG('PRISTABELL')
     A          K TGSONE
