     A*__________________________
     A* SYSPED / PRISTABELL
     A*""""""""""""""""""""""""""
     A          R FRTABR
     A            FPKNT          8S 0       COLHDG('TRANSPORTØR')
     A            FPPNF          4S 0       COLHDG('POSTNR. FRA')
     A            FPPNT          4S 0       COLHDG('POSTNR. TIL')
     A            FPPNTT         4S 0       COLHDG('POSTNR. TIL 2')
     A            FPMIN          5P 0       COLHDG('MIN. PRIS')
     A            FPINT         60          COLHDG('INTERVALER')
     A            FPPR          80          COLHDG('PRIS')
     A            FPMÅTE        60          COLHDG('BEREGNINGSMÅTE')
     A            FPRAB         40          COLHDG('RABATT')
     A            FPENDR        40          COLHDG('ENDRING I KR.')
     A          K FPKNT
     A          K FPPNF
     A          K FPPNT
