     A*__________________________________
     A* SYSPED / Oppdragsregister, Status
     A*""""""""""""""""""""""""""""""""""
     A          R FREETURR                  PFILE(FREETUR)
     A          K FRTAVD
     A          K FRTTUR
     A          K FRTDT
     A          K FRTLI
     A          K FRTTXT
     A          K FRTKOD
