     A*__________________________________
     A* SYSPED / Oppdragsregister, Status
     A*""""""""""""""""""""""""""""""""""
     A          R FREETXTR                  PFILE(FREETXT)
     A          K FRTAVD
     A          K FRTOPD
     A          K FRTDT
     A          K FRTLI
     A          K FRTKOD
