     A*___________________________
     A* SYSPED / Kunders oppdragstyper
     A*"""""""""""""""""""""""""""
     A          R FRTILR
     A            FRTDEL         1          COLHDG('Delsystem')
     A            FRTAVD         4S 0       COLHDG('Avdeling')
     A            FRTKUN         8S 0       COLHDG('Kunde')
     A            FRTGEB         3          COLHDG('Geb.kode')
     A            FRTSAT         3S 1       COLHDG('Pros.sats')
     A          K FRTDEL
     A          K FRTAVD
     A          K FRTKUN
