     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
      *
     A          R BILDE01
     A                                      CF12(12 'Gå til forrige bilde')
     A                                      CF23(23 'OVER TIL VEDLIKEHOLD')
     A                                  1  2'SYSPED/FRITXTSK'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(040 DIV1631 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 66DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A            UKUNR          8Y 0O  2  1COLOR(WHT)
     A                                      EDTCDE(4)
     A            KNAVN         30A  O  2 10TEXT('Kundenavn')
     A                                      COLOR(WHT)
     A                                  2 41MSGCON(010 SHU0432 *LIBL/SYMSGF)
     A            DELSYS         1A  O  2 52COLOR(RED)
     A            ALLE           4A  O  2 54COLOR(RED)
     A                                  2 66TIME
     A                                      COLOR(BLU)
     A            WST1          79A  B  3  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST2          79A  B  4  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST3          79A  B  5  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST4          79A  B  6  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST5          79A  B  7  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST6          79A  B  8  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST7          79A  B  9  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST8          79A  B 10  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST9          79A  B 11  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST10         79A  B 12  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST11         79A  B 13  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST12         79A  B 14  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST13         79A  B 15  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST14         79A  B 16  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST15         79A  B 17  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST16         79A  B 18  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST17         79A  B 19  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST18         79A  B 20  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST19         79A  B 21  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A            WST20         79A  B 22  1DSPATR(UL)
     A N27                                  DSPATR(PR)
     A                                 23  1MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 24MSGCON(018 SHU0789 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R BILDE00
     A                                      CF12(12 'Gå til forrige bilde')
     A                                      CF04(04 'SØK               de')
     A                                  1  2'SYSPED/FRITXTSK'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(040 DIV1631 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A            UKUNR          8Y 0O  2  1COLOR(WHT)
     A                                      EDTCDE(4)
     A            KNAVN         30A  O  2 10TEXT('Kundenavn')
     A                                      COLOR(WHT)
     A                                  2 64TIME
     A                                  8  2MSGCON(024 SHU0427 *LIBL/SYMSGF)
     A            WDELSY         1A  B  8 29
     A                                  8 34MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                  9 34MSGCON(024 SHU0428 *LIBL/SYMSGF)
     A                                 11  2MSGCON(024 SHU0430 *LIBL/SYMSGF)
     A            HAR           20   B 11 29
     A                                 11 42MSGCON(020 SHU0431 *LIBL/SYMSGF)
     A                                 23  1MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 40'(C) COPYRIGHT  SYSTEMA A/S  1990'
     A                                      COLOR(WHT)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
