     A          R G1WRR
     A            G1AVD          4  0       COLHDG('Avdeling')
     A            G1OPD          7  0       COLHDG('Oppdragsnr.')
     A            G1AVK          3          COLHDG('Varekode')
     A            G1BELN        11  2       COLHDG('Beløp')
     A            G1MVA          1          COLHDG('Momskode')
     A            G1KDA          1          COLHDG('Linjetype')
     A          K G1AVD
     A          K G1OPD
     A          K G1AVK
