     A          R GBREGR
     A            ATEKST         3          COLHDG('Tekstkode')
     A            AAVD           4  0       COLHDG('Avdeling')
     A            AAVIK          2  0       COLHDG('Tillatt avvik')
     A            ARED           2  0       COLHDG('Reduksjon i %')
     A            AKF            1          COLHDG('Kodefelt')
     A          K ATEKST
