     A*____________________________
     A* SYSPED / Koderegister  'SF'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOSFR
     A            KOSFSI         3          TEXT('GEBYR')
     A          K KOSFSI
