     A*__________________________
     A* SYSPED / Godsjournal
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R GODSFIR                   TEXT('Godsjournal FIMADEF')
     A            GFLBKO         5          COLHDG('Bevillings kode')
     A            GFENH          1          COLHDG('Std. enhkode')
     A            GFLBS1        30          COLHDG('Lagerholdssted 1')
     A            GFLBS2        30          COLHDG('Lagerholdssted 2')
     A            GFLBS3        30          COLHDG('Lagerholdssted 3')
     A            GFLBS4        30          COLHDG('Lagerholdssted 4')
     A            GFPRT         10          COLHDG('Printer')
     A            GFFAX         15          COLHDG('Faxnr tollvesen')
     A          K GFLBKO
     A          K GFENH
