     A*__________________________
     A* SYSPED / Godsjournal
     A*""""""""""""""""""""""""""
     A          R GODSJR                    PFILE(GODSJF)
     A                                      TEXT('Godsjournal')
     A          K GOBILN
