     A          R GODSGFSER
     A            GSEGN1         7          COLHDG('GODSNR DEL1')
     A            GSEGN2         5          COLHDG('GODSNR DEL2')
     A          K GSEGN1
