     A          R GODSGFR
     A            GGGN1         13          COLHDG('GODSNR DEL1')
     A            GGGN2          2          COLHDG('GODSNR DEL2')
     A          K GGGN1
