     A*__________________________
     A* SYSPED / Godsjournal
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R GODSHR                    TEXT('HISTORY')
     A            GOGN      R               REFFLD(GN)
     A                                      COLHDG('Gods.nr')
     A            GOTRNR        20          COLHDG('Transitt. nr')
     A            GOHPGM         8          COLHDG('Program')
     A            GOHDAT    R               REFFLD(DT)
     A                                      COLHDG('Dato')
     A            GOHTIM    R               REFFLD(TM)
     A                                      COLHDG('Klokka')
     A            GOHUSR        10          COLHDG('Bruker')
     A            GOHKOD         1          COLHDG('Endringskode')
     A          K GOGN
     A          K GOTRNR
     A          K GOHDAT
     A          K GOHTIM
