     A*%%TS  SD  20140519  182350  TROND       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A*
     A          R GSS021DA
     A*%%TS  SD  20140519  182350  TROND       REL-V7R1M0  5770-WDS
     A N29                                  CF04(04 'Søking')
     A N29                                  CF06(06 'Hent oppdragsnr')
     A N29                                  CF10(10 'Print')
     A N29                                  CF23(23 'Bekrefte')
     A                                      CF12(12 'Avbryt')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SHIPSYS/GSS021D'
     A                                      COLOR(BLU)
     A                                  1 21'Work with trip'
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  3  2'Trip No.  . . . .:'
     A            HEAVD          4Y 0B  3 22DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  28
     AO 29                                  DSPATR(PR)
     A  28
     AO 29                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0B  3 27DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  28
     AO 29                                  DSPATR(PR)
     A  28
     AO 29                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  3 36'Status'
     A            WSST           1A  O  3 43DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 50'Date packinglist'
     A            WSDTP          6Y 0O  3 67DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  4  2'RETURN(R)STRAT(S):'
     A            WSRTNG         1A  B  4 22DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                      VALUES(' ' 'R' 'S')
     A                                  4 50'Date proforma'
     A            WSDTI          6Y 0O  4 67DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  5  2'Vessel  . . . . .:'
     A            WSBCD          5A  B  5 22DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSBNM         30A  O  5 34DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6  2'Clients No. . . .:'
     A            WSCNO          8Y 0B  6 22DSPATR(UL)
     A  97                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A            WSCNM         30A  O  6 34DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2'Company . . . . .:'
     A            WSFC           3A  B  7 22DSPATR(UL)
     A  96                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSFNM         30A  O  7 34DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  8  2'Recievers adr.  .:'
     A            WSAD1         30A  B  8 22DSPATR(UL)
     A  95                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSAD2         30A  B  9 22DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSAD3         30A  B 10 22DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSAD4         30A  B 11 22DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSAD5         30A  B 12 22DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSAD6         30A  B 13 22DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                 14  2'Date delivered  .:'
     A            WSDTL          6Y 0B 14 22DSPATR(UL)
     A  94                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A                                 14 35'(DD/MM/YY)'
     A                                 14 52'Time delivered  .:'
     A            WSTML          4Y 0B 14 72DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                      EDTWRD('0  :  ')
     A                                 15 35'(DD/MM/YY)'
     A                                 15  2'Date dispatch . .:'
     A            WSDTS          6Y 0B 15 22DSPATR(UL)
     A  93                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A                                 15 35'(DD/MM/YY)'
     A                                 16  2'Way of delivery .:'
     A            WSDW          15A  B 16 22DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                 17  2'Locations from/to:'
     A            WSLCF          5A  B 17 22DSPATR(UL)
     A  91                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSLCT          5A  B 17 29DSPATR(UL)
     A  90                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                 17 37'Order type:'
     A            WSOT           2A  B 17 51DSPATR(UL)
     A  89                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                 17 55'Code of delivery:'
     A            WSFR           3A  B 17 73DSPATR(UL)
     A  88                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                 18  2'Free text . . . .:'
     A            WSFTCD         2A  B 18 22DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                 18 25'Pick.Note/Pack.List/Inv./Inv.Basis'
     A            WSKDL1         2A  B 18 60DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                      VALUES('  ' 'PN' 'PL' 'PI' 'IB')
     A            WSKDL2         2A  B 18 63DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                      VALUES('  ' 'PN' 'PL' 'PI' 'IB')
     A            WSKDL3         2A  B 18 66DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A                                      VALUES('  ' 'PN' 'PL' 'PI' 'IB')
     A                                 18 70'PN/PL/PI/IB'
     A            WSFT1         70A  B 19 10DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSFT2         70A  B 20 10DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSFT3         70A  B 21 10DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A            WSFT4         70A  B 22 10DSPATR(UL)
     A  29                                  DSPATR(PR)
     A  29                                  DSPATR(HI)
     A N29                             23  2'F4=Query   F6=Get trip No.   F10=P-
     A                                      rint   F12=Cancel   F23=Confirm'
     A                                      COLOR(BLU)
     A  29                             23  2'F12=Cancel'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R GSS021DX
     A                                      WINDOW(*DFT 7 30 *NOMSGLIN)
     A                                      CF12(12 'Avbryt')
     A                                      OVERLAY
     A                                  1  2'Print packinglist'
     A                                      COLOR(WHT)
     A                                  3  2'Printer name:'
     A            WSPRT         10A  B  3 17DSPATR(UL)
     A                                      DSPATR(PC)
     A                                  4  2'No. of copies:'
     A            WSCPY          1  0B  4 17DSPATR(UL)
     A                                  5  2'Send fax ?    '
     A            WSFAX          1A  B  5 17DSPATR(UL)
     A                                      VALUES('Y' 'N')
     A                                  5 20'Y/N'
     A                                  6  2'F12=Cancel'
     A                                      COLOR(BLU)
     A  99        WSMSGN        25A     7  2MSGID(GSS0042 SYMSGF)
     A                                      COLOR(WHT)
