     A*
     A          R GSS041PA
     A N77        STRI01        70      9  1
     A N77        KFMT1         75      9  1
     A N77        KFMT2         75      9  1
     A            FINM          30A    10  2
     A                                 10 34'INVOICEBASIS'
     A  77                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A                                      HIGHLIGHT
     A            TRTNO         11  0  10 60EDTCDE(Z)
     A                                      HIGHLIGHT
     A                                 10 81'DATE'
     A                                 10 86DATE EDTCDE(Y)
     A                                 10 95'TIME'
     A            XTID4          4  0  10100EDTWRD('  .  ')
     A                                 10107'PAGE'
     A                                 10112PAGNBR
     A  50                             11107'C O P Y'
     A                                      HIGHLIGHT
     A                                 12  2'CLIENT'
     A            TRCNO          8  0  12  9EDTCDE(Z)
     A            KNAVN         30A    12 19
     A                                 12 51'RCV'
     A            TRBCD          5A    12 55
     A            CBNAB         30A    12 61
     A                                 12 95'DELIVERY DATE'
SV5  A*           TRDTL          6  0  12110EDTCDE(Y)
NV5  A            XTDTL          6  0  12110EDTCDE(Y)
     A                                 13  2'DELIVERY PLACE'
     A            TRAD1         30A    13 19
     A                                 13 95'SENT'
SV5  A*           TRDTS          6  0  13110EDTCDE(Y)
NV5  A            XTDTS          6  0  13110EDTCDE(Y)
     A            TRAD2         30A    14 19
     A                                 14 51'SENT BY'
     A            TRDW          15A    14 59
     A            TRAD3         30A    15 19
     A            TRAD4         30A    16 19
     A            TRAD5         30A    17 19
     A            TRAD6         30A    18 19
     A                                 20  2'NATURE  /VENDOR'
     A                                 20 33'CLIENTS P.O.NO.'
     A                                 20 53'NO.PCS/DATE GROS/VOLUME'
     A                                 20 78'FEE NATUR'
     A                                 20104'AMOUNT'
     A                                 20116'VAT'
     A                                 21  2' '
      *
     A          R GSS041PB                  SPACEB(1)
     A            ORDSC         30A        2
     A            XCONO1        20A       33
     A            ORCLI          5  0     55EDTCDE(Z)
     A            ORWT           7  1     65EDTCDE(4)
     A            XFEEC1         3A       78
     A            XFT1          16A       82
     A            XVAL1          3A      100
     A            XAMT1         11  2    104EDTCDE(M)
     A            XVAT1          1A      118SPACEA(1)
     A            SFNM          30A        2
     A            XCONO2        20A       33
SV5  A*           ORDTL          6  0     55EDTCDE(Y)
NV5  A            XODTL          6  0     55EDTCDE(Y)
     A            ORVOL          5  2     67EDTCDE(4)
     A            XFEEC2         3A       78
     A            XFT2          16A       82
     A            XVAL2          3A      100
     A            XAMT2         11  2    104EDTCDE(M)
     A            XVAT2          1A      118SPACEA(1)
     A            ORONO          7  0      2EDTCDE(Z)
     A  40        XTNO          11  0     11EDTCDE(Z)
     A  40        XLC            5A       23
     A            XCONO3        20A       33
     A            XFEEC3         3A       78
     A            XFT3          16A       82
     A            XVAL3          3A      100
     A            XAMT3         11  2    104EDTCDE(M)
     A            XVAT3          1A      118SPACEA(1)
      *
     A          R GSS041PC
     A  40        XTNO          11  0     11EDTCDE(Z)
     A  40        XLC            5A       23
     A            XCONX         20A       33
     A            XFEECO         3A       78
     A            XFTO          16A       82
     A            XVALO          3A      100
     A            XAMTO         11  2    104EDTCDE(M)
     A            XVATO          1A      118SPACEA(1)
      *
     A          R GSS041PD
     A                                    41'*   TOTAL ORDER'
     A            XVAL           3A      100
     A            XTAMTO        11  2    104EDTCDE(M)
     A                                      SPACEA(1)
      *
     A          R GSS041PE                  SPACEB(1)
     A N51                                41'**  TOTAL NATURE'
     A            XTFEEN         3A       78
     A            XTFTN         16A       82
     A            XVAL           3A      100
     A            XTAMTN        11  2    104EDTCDE(M)
      *
     A          R GSS041PF                  SPACEB(2)
     A                                    41'*** TOTAL TRIP'
     A            XVAL           3A      100
     A            XTAMTT        11  2    104EDTCDE(M)
      *
     A          R GSS041PG                  SPACEB(1)
     A                                   110'CONTIUOUS'
      *
S03  A*         R GSS041PH
N03  A          R GSS041PH                  SPACEB(1)
     A N77        KFMT3         75         1
     A                                   110'CONTIUOUS'
     A                                      SPACEA(2)
