********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 FRITEKST BESTEMMES AV KODE
10172 * 02 SH  PTF10 HØYDE FOR UTENLANDSK ADRESSE
********************************************************************
     A          R GSS031C2
     A            STRICO        70      1  1
     A          R GSS031L1
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A            STRI04        70      2  1
     A                                  2 46'    MANIFEST'
     A                                  3 46'PROFORMA INVOICE'
     A  50                              3 63'(COPY)'
     A            TRMFT1        70      5  2
     A            TRMFT2        70      6  2
     A                                  7  2'HAWBNO.:'
     A            XHAWB         15      7 11
     A            FINM          30      7 82
     A                                  8  2'ARRIVAL DATE/TIME:'
     A            XDTL           6  0   8 21EDTWRD('  .  .  ')
     A                                  8 29'/'
     A            TRTML          4  0   8 30EDTWRD('  :  ')
     A            FIAD1         30      8 82
     A                                  9  2'DEPARTURE DATE   :'
     A            XDTS           6  0   9 21EDTWRD('  .  .  ')
     A                                  9 38'C/O AGENT:'
     A            TRAD1         30      9 49
     A            FIAD2         30      9 82
     A                                 10  2'FINAL DESTINATION:'
     A            XSTDT         30     10 21
     A            TRAD2         30     10 49
     A            FIAD3         30     10 82
     A                                 11  2'MASTER OF:'
     A            CBNAB         30     11 13
     A            TRAD3         30     11 49
     A                                 12  2'IN TRANSIT'
     A            TRAD4         30     12 49
     A                                 12 82'PAGE:'
     A            XSIDE          3  0  12 88
     A            TRAD5         30     13 49
     A                                 13 82'REF.:'
     A            TRTNO         11  0  13 88EDTWRD('0    /       ')
     A                                 13100'/'
     A            HESG           3     13101
     A            TRAD6         30     14 49
     A                                 14 82'ORIGIN:'
     A            XSTDF         20     14 90
     A                                 15  2'-------------------------'
     A                                 15 27'-------------------------'
     A                                 15 52'-------------------------'
     A                                 15 77'-------------------------'
     A                                 15102'-------------'
     A                                 16  2'SUPPLIER'
     A                                 16 28'|P. ORDER NO.'
     A                                 16 49'|COL NO.'
     A                                 16 57'|CONTENTS'
     A                                 16 83'|PCS'
     A                                 16 89'|WEIGHT'
     A                                 16 98'|CUSTOMS VALUE'
     A                                 17  2'-------------------------'
     A                                 17 27'-------------------------'
     A                                 17 52'-------------------------'
     A                                 17 77'-------------------------'
     A                                 17102'-------------'
     A                                 18  2' '
      *
     A          R GSS031LÆ
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A N28        STRI06        70      2  2
     A                                  2 36'COMMERCIAL INVOICE NO:'
     A                                      HIGHLIGHT
     A            TRTNO         11  0   2 64EDTWRD('0    /       ')
     A                                      HIGHLIGHT
      *
     A          R GSS031LØ
     A N28        STRI05        70      4  2
     A            TRMFT1        70      5  2
     A            TRMFT2        70      6  2
     A            XXNA          30      6 82
     A                                  7  2'HAWBNO.:'
     A            XHAWB         15      7 11
     A            XXAD1         30      7 82
     A                                  8  2'ARRIVAL DATE/TIME:'
     A            XDTL           6  0   8 21EDTWRD('  .  .  ')
     A                                  8 29'/'
     A            TRTML          4  0   8 30EDTWRD('  :  ')
     A            XXAD2         30      8 82
     A                                  9  2'DEPARTURE DATE   :'
     A            XDTS           6  0   9 21EDTWRD('  .  .  ')
     A                                  9 38'C/O AGENT:'
     A            TRAD1         30      9 49
     A            XXAD3         30      9 82
     A                                 10  2'FINAL DESTINATION:'
     A            XSTDT         30     10 21
     A            TRAD2         30     10 49
     A                                 10 82'PHONE:'
     A            XXTLF         15     10 89
     A                                 11  2'MASTER OF:'
     A            CBNAB         30     11 13
     A            TRAD3         30     11 49
     A                                 11 82'FAX:'
     A            XXFAX         15     11 89
     A                                 12  2'IN TRANSIT'
     A            TRAD4         30     12 49
     A                                 12 82'PAGE:'
     A            XSIDE          3  0  12 88
     A            TRAD5         30     13 49
     A                                 13 82'REF.:'
     A            TRTNO         11  0  13 88EDTWRD('0    /       ')
     A                                 13 98'/'
     A            HESG           3     13 99
     A            TRAD6         30     14 49
     A                                 14 82'ORIGIN:'
     A            XSTDF         20     14 90
     A                                 15  2'-------------------------'
     A                                 15 27'-------------------------'
     A                                 15 52'-------------------------'
     A                                 15 77'-------------------------'
     A                                 15102'-------------'
     A                                 16  2'SUPPLIER'
     A                                 16 28'|P. ORDER NO.'
     A                                 16 49'|COL NO.'
     A                                 16 57'|CONTENTS'
     A                                 16 83'|PCS'
     A                                 16 89'|WEIGHT'
     A                                 16 98'|CUSTOMS VALUE'
     A                                 17  2'-------------------------'
     A                                 17 27'-------------------------'
     A                                 17 52'-------------------------'
     A                                 17 77'-------------------------'
     A                                 17102'-------------'
     A                                 18  2' '
      *
     A          R GSS031L2                  SPACEB(1)
     A            XSNM          24         2
     A            POCONO        20        29
     A            XCLNF          3  0     50EDTCDE(Z)
     A N32        XCLNT          3  0     54EDTCDE(Z)
     A            XDSC          25        58
     A            ORCLI          5  0     84EDTCDE(Z)
     A            ORWT           7  1     90EDTCDE(4)
     A            ORAMT         11  2     98EDTCDE(3)
     A            ORCURC         3       111
      *
     A          R GSS031L3                  SPACEB(1)
     A            POCONO        20        29
     A            GDDSC         55        58
      *
     A          R GSS031L4                  SPACEB(2)
     A                                    63'TOTAL FOR THIS COLLI:'
     A            XCLTD          5  0     84EDTCDE(Z)
     A            XVKTD          7  1     90EDTCDE(4)
     A            XBLTD         11  2     98EDTCDE(4)
     A            UCUR           3       111SPACEA(1)
      *
     A          R GSS031L5
     A* FLYTETT TO LINJER OPP FRA HER
S01  A*           TRFT1         70     37  2
N01  A            XTRFT1        70     37  2
     A                                 38  2'-------------------------+
     A                                      -------------------------+
     A                                      -------------------------+
     A                                      -------------------------+
     A                                      ------------'
     A                                 39  2'TOTAL WEIGHT:'
     A            XVKTOT         7  1  39 16EDTCDE(4)
     A                                 39 39'TOTAL COLLI:'
     A            XCLTOT         5  0  39 52EDTCDE(Z)
     A                                 39 70'TOTAL VALUE:'
     A            XBLTOT        11  2  39 83EDTCDE(4)
     A            UCUR           3     39 97
     A                                 40  2'-------------------------+
     A                                      -------------------------+
     A                                      -------------------------+
     A                                      -------------------------+
     A                                      ------------'
     A            KNAVN         30     41  2
     A            XIDAGP        11     41 88
     A            ADR1          30     42  2
     A            ADR2          30     43  2
     A            KOSFNV        16     43 88
S02  A*           POSTNR         4  0  44  2
S02  A*           ADR3          24     44  7
N02  A            ADR3NY        30     44  2
      *
     A          R GSS031L6                  SPACEB(1)
     A                                   102'CONTINOUS'
      *
     A          R GSS031L7
     A                                   100'CONTINOUS'
     A                                      SPACEA(2)
      *
     A          R GSS031L8                  SPACEB(1)
     A                                     2'SHIP:'
     A            ORBCD          5         8
     A            CBNAB         30        14
      *
     A          R GSS031L9                  SPACEB(1)
     A            GDDSC         55        58
      *
     A          R GSS031LA                  SPACEB(1)
     A            XXFT          30        58
