     A          R GSS0522R
     A            G52USE        10A         COLHDG('BRUKER-ID')
     A            G52LN          1S 0       COLHDG('LINJENR')
     A            G52LK          2A         COLHDG('LANDKODE')
     A            G52LOK         5A         COLHDG('LOKASJON')
     A            G52VK          3A         COLHDG('FEE' 'CDE')
     A            G52VT         20A         COLHDG('FREETEXT')
     A            G52VAL         3A         COLHDG('CURR' 'CDE')
     A            G52BLV        13S 2       COLHDG('AMOUNT')
     A            G52KDM         1A         COLHDG('VAT' 'CDE')
     A            G52BLN        13S 2       COLHDG('AMOUNT LOCAL' 'CURRENCY')
     A            G52KDA         1A         COLHDG('LINE' 'STATUS')
     A            G52KN          8S 0       COLHDG('DEBITOR' 'NBR')
     A            WSCLI          5S 0       COLHDG('ANTALL KOLLI')
     A            WSWT           9S 1       COLHDG('VEKT - KG')
     A            WSVOL          7S 2       COLHDG('VOLUM - M3')
     A          K G52USE
     A          K G52LN
