     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      *
     A          R GSS004DA                  SFL
     A            WSNR           1A  I  5  2VALUES(' ' '1' '2' '4')
     A            FICD           3A  O  5 11
     A            FINM          30A  O  5 18
     A            FIAD1         30A  O  5 49
     A            FIAD2         30A  O  6 18
     A            FIAD3         30A  O  6 49
      *
     A          R GSS004DB                  SFLCTL(GSS004DA)
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0007)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SHIPSYS/GSS004D'
     A                                      COLOR(BLU)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A N27                              1 21'Work with company information'
     A                                      DSPATR(HI)
     A  27                              1 21'Inquiry company information'
     A                                      DSPATR(HI)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  3  2'Choose option, press ENTER:'
     A                                      COLOR(BLU)
     A N27                              3 32'2=Change  4=Delete'
     A                                      COLOR(BLU)
     A  27                              3 32'1=Pick    2=Change'
     A                                      COLOR(BLU)
     A                                  4  2'Option  Company Comp.name/Adress'
     A                                      DSPATR(HI)
      *
     A          R GSS004DC
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A N27                                  CF03(03 'End')
     A                                      CF05(05 'Refresh')
     A                                      CF06(06 'New entry')
     A                                      CF08(08 'Search')
     A  27                                  CF12(12 'Previous')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A N27                              1  2'F3=End F5=Refresh F6=New entry F8=-
     A                                      Search'
     A                                      COLOR(BLU)
     A  27                              1  2'F5=Refresh F6=New entry F8=Search -
     A                                      F12=Previous'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R GSS004DD
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Previous')
     A                                      SLNO(20)
     A                                      CLRL(05)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1 11'Company Comp.name/adress'
     A                                      DSPATR(HI)
     A            WSCD           3A  B  2 11DSPATR(UL)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A  90                                  DSPATR(RI)
     A            WSNM          30A  B  2 18DSPATR(UL)
     A  89                                  DSPATR(RI)
     A            WSAD1         30A  B  2 49DSPATR(UL)
     A            WSAD2         30A  B  3 18DSPATR(UL)
     A            WSAD3         30A  B  3 49DSPATR(UL)
     A                                  4  2'F12=Prevous'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  5  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R GSS004DE
     A                                      CF12(12 'Previous')
     A                                      SLNO(20)
     A                                      CLRL(05)
     A                                      OVERLAY
     A                                  3  2'Search from->'
     A            W2CD           3A  I  3 16DSPATR(UL)
     A                                      DSPATR(PC)
     A                                  4  2'F12=Previous'
     A                                      COLOR(BLU)
     A          R GSS004DF
     A                                      CF12(12 'Previous')
     A                                      SLNO(20)
     A                                      CLRL(05)
     A                                      OVERLAY
     A                                  1 11'Company Comp.name/adress'
     A                                      DSPATR(HI)
     A            FICD           3A  O  2 11DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A            FINM          30A  O  2 18DSPATR(UL)
     A                                      DSPATR(HI)
     A            FIAD1         30A  O  2 49DSPATR(UL)
     A                                      DSPATR(HI)
     A            FIAD2         30A  O  3 18DSPATR(UL)
     A                                      DSPATR(HI)
     A            FIAD3         30A  O  3 49DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  4  2'F12=Forrige'
     A                                      COLOR(BLU)
      *
     A          R GSS004DG
     A                                      CSRLOC(LINNBR     POSNBR)
     A N27                                  CF03(03 'End')
     A                                      CF05(05 'Refresh')
     A                                      CF06(06 'New entry')
     A                                      CF08(08 'Search')
     A  27                                  CF12(12 'Previous')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SHIPSYS/GSS004D'
     A                                      COLOR(BLU)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A N27                              1 21'Work with company information'
     A                                      DSPATR(HI)
     A  27                              1 21'Inquiry company information'
     A                                      DSPATR(HI)
     A                                  3  2'Choose option, Press ENTER:'
     A                                      COLOR(BLU)
     A N27                              3 32'2=Change  4=Delete'
     A                                      COLOR(BLU)
     A  27                              3 32'1=Pick   2=Change'
     A                                      COLOR(BLU)
     A                                  4  2'Option  Company Comp.name/adress'
     A                                      DSPATR(HI)
     A                                  6  6'Code not found'
     A                                      COLOR(RED)
     A N27                             23  2'F3=End F5=Refresh F6=New entry F8=-
     A                                      Search'
     A                                      COLOR(BLU)
     A  27                             23  2'F5=Refresh F6=New entry F8=Search -
     A                                      F12=Previous'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
