     A          R GSS35WR2
     A            W32TNO        11S 0       TEXT('TRIPNO.')
     A            W32CLN         3S 0       TEXT('COLLINO')
     A          K W32TNO
     A          K W32CLN
