     A          R GSS026WR
     A            GWCONT        17A         COLHDG('CONTAINERNR')
     A            GWBOXN         3S 0       COLHDG('BOKSNR')
     A            GWVKT          7S 1       COLHDG('VEKT')
     A            GWLEND         4S 0       COLHDG('LENGDE')
     A            GWBRED         4S 0       COLHDG('BREDDE')
     A            GWHØYD         4S 0       COLHDG('HØYDE')
     A            GWM3           5S 2       COLHDG('KUBIKK')
     A            GWBOXF         1A         COLHDG('BOX F')
     A            GWM32          6S 3       COLHDG('KUBIKK')
     A            GWLM           4S 2       COLHDG('LASTEMETER')
     A          K GWCONT
     A          K GWBOXN
