     A          R GSS011PA
     A                                 12  2'Client:'
     A            KNAVN         30A    13  2
     A            ADR1          30A    14  2
     A            ADR2          30A    15  2
     A            POSTNR         4  0  16  2
     A            ADR3          24A    16  8
     A                                 19  2'Supplier:'
     A            SFNM          30A    20  2
     A            SFAD1         30A    21  2
     A            SFAD2         30A    22  2
     A            SFAD3         30A    23  2
     A                                 24  2'Telefon:'
     A            SFTEL         15A    24 12
     A                                 25  2'Telefax:'
     A            SFFAX         15A    25 12
     A                                 29  2'P. O. No.'
     A            WSCON1        20A    30  2
     A            WSCON4        20A    30 23
     A            WSCON2        20A    31  2
     A            WSCON5        20A    31 23
     A            WSCON3        20A    32  2
     A            WSCON6        20A    32 23
     A                                 36  2'Goods description:'
     A            ORDSC         30A    37  2
     A                                 39  2'Colli:'
     A            XSIDE          5  0  39 12EDTCDE(Z)
     A                                 39 17'/'
     A            ORCLI          5  0  39 18EDTCDE(Z)
     A                                 41  2'Weight:'
     A            ORWT           7  1  41 12EDTCDE(4)
     A                                 43  2'Volume:'
     A            ORVOL          5  2  43 12EDTCDE(4)
     A                                 46  2'Date delivered:'
     A            WSDTL          6  0  46 18EDTCDE(Y)
