     A          R GSSAKFR
     A            AKEDI          1A         COLHDG('EDI-MOTTATT')
     A            AKONO          7S 0       COLHDG('ORDRENR.')
     A            AKLNO          3S 0       COLHDG('LINJENR')
     A            AKANR         15A         COLHDG('ARTIKKELNR')
     A            AKCONO        20A         COLHDG('P.O.NR')
     A            AKSTK          5S 0       COLHDG('FORVENTED ANTALL')
     A            AKSTKM         5S 0       COLHDG('MOTATT ANTALL')
N11  A            AKVAL          3A         COLHDG('VALUTAKODE')
     A            AKPR          11S 2       COLHDG('PRIS')
     A            AKTXT         30A         COLHDG('FRITEKST')
     A            AKONOR         7S 0       COLHDG('RESTORDRENR.')
     A            AKTXT2        30A         COLHDG('FRITEKST 2')
     A            AKTXT3        30A         COLHDG('FRITEKST 3')
     A            AKTXT4        30A         COLHDG('FRITEKST 4')
     A            AKTXT5        30A         COLHDG('FRITEKST 5')
     A            AKLK           2A         COLHDG('LANDKODE')
     A          K AKONO
     A          K AKLNO
