     A          R GSSDGFR
     A            DGST           1A         COLHDG('STATUS')
     A            DGONO          7S 0       COLHDG('ORDERNO.')
     A            DGLOP          3S 0       COLHDG('LOPNO')
     A            DGUNNR         4S 0       COLHDG('UN-NR')
     A            DGPSN         60A         COLHDG('PROPER SHIPPING NAME')
     A            DGPSN2        60A         COLHDG('PROPER SHIPPING NAME')
     A            DGCOG          8A         COLHDG('CLASS OF GOODS')
     A            DGPG           4A         COLHDG('PACKING GROUP')
     A            DGTR           4A         COLHDG('TUNNEL REGIME')
     A            DGNOP          3S 0       COLHDG('NUMBER OF PACKAGES')
     A            DGKOP         20A         COLHDG('KIND OF PACKAGES')
     A            DGGWK          9S 2       COLHDG('GROSS WEIGHT')
     A            DGNW           9S 2       COLHDG('NET WEIGHT')
     A            DGNWT          1A         COLHDG('NET WEIGHT TYPE K/L')
     A            DGADD         40A         COLHDG('ADDITIONAL INFO')
     A            DGPFRT         5S 0       COLHDG('POINTS ROAD TRANSPO')
     A            DGLC          20A         COLHDG('LOCATION')
     A            DGCLC          3A         COLHDG('CLASSIFICATION CODE')
     A          K DGONO
     A          K DGLOP
