     A          R GSSDGAR
     A            DAUNNR         4S 0       COLHDG('UN-NR')
     A            DAPSN         60A         COLHDG('PROPER SHIPPING NAME')
     A            DAPSN2        60A         COLHDG('PROPER SHIPPING NAME')
     A            DACOG          8A         COLHDG('CLASS OF GOODS')
     A            DALOPN         3S 0       COLHDG('LOOPNO')
     A          K DAUNNR
