     A*__________________________
     A* GSS / FIRMA
     A*""""""""""""""""""""""""""
     A          R GSSFIFR
     A            FICD           3A         COLHDG('FIRMAKODE')
     A            FINM          30A         COLHDG('NAVN')
     A            FIAD1         30A         COLHDG('ADRESSE 1')
     A            FIAD2         30A         COLHDG('ADRESSE 2')
     A            FIAD3         30A         COLHDG('ADRESSE 3')
     A          K FICD
