     A          R GSSGDFR
     A            GDONO          7P 0       COLHDG('ORDRENR')
     A            GDLNO          3P 0       COLHDG('LINJENR')
     A            GDDSC         55A         COLHDG('GODSBESKRIVELSE')
     A          K GDONO
     A          K GDLNO
