********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 NUMMERISKE VERDIER ER ØKT TIL 17.5
********************************************************************
     A          R GSSLGFR
     A            LGUSER        10A         COLHDG('USER-ID')
     A            LGDT           8S 0       COLHDG('DATO')
     A            LGTID          6S 0       COLHDG('TID')
     A            LGLN           3S 0       COLHDG('LINJENR')
     A            LGPGM         10A         COLHDG('PROGRAM')
     A            LGNIVÅ         1S 0       COLHDG('LOGG NIVÅ')
     A            LGHDT          8S 0       COLHDG('DATO FOR HENDELSE')
     A            LGHTID         6S 0       COLHDG('TID FOR HENDELSE')
      * ALLE LOGGENE ER DEFINERT MED NIVÅ. BRUKER ER OGSÅ DEFINERT PÅ
      * NIVÅ. BRUKER KAN SE PÅ EGET OG UNDERORDNET NIVÅ.
     A            LGFTYP         5A         COLHDG('TYPE AV FELT')
      * MAIN  = ORDRENIVÅ
      * ART   = ARTIKKELNIVÅ
      * REF   = REFERANSENIVÅ
      * CLLM  = KOLLIMERKING NIVÅ
      * CLLA  = KOLLI-ARTIKKEL NIVÅ
      * OTHER = ANDRE
     A            LGONO          7S 0       COLHDG('ORDRENR')
     A            LGLNO          3S 0       COLHDG('LINJENR')
     A            LGTXT         30A         COLHDG('BESKRIVELSE')
     A            LGAGM         35A         COLHDG('GAMMEL ALFA VERDI')
     A            LGANY         35A         COLHDG('NY ALFA VERDI')
S01  A*           LGNGM         15S 5       COLHDG('GAMMEL NUM. VERDI')
S01  A*           LGNNY         15S 5       COLHDG('NY NUM. VERDI')
N01  A            LGNGM         17S 5       COLHDG('GAMMEL NUM. VERDI')
N01  A            LGNNY         17S 5       COLHDG('NY NUM. VERDI')
