     A          R GSSLGTFR
     A            TLUSER        10A         COLHDG('USER-ID')
     A            TLDT           8S 0       COLHDG('DATO')
     A            TLTID          6S 0       COLHDG('TID')
     A            TLLN           3S 0       COLHDG('LINJENR')
     A            TLPGM         10A         COLHDG('PROGRAM')
     A            TLLEV          1S 0       COLHDG('LOGG NIV$')
     A            TLHDT          8S 0       COLHDG('DATO FOR HENDELSE')
     A            TLHTID         6S 0       COLHDG('TID FOR HENDELSE')
      * ALLE LOGGENE ER DEFINERT MED NIVÅ. BRUKER ER OGSÅ DEFINERT PÅ
      * NIV$. BRUKER KAN SE PÅ EGET OG UNDERORDNET NIVÅ.
     A            TLFTYP         5A         COLHDG('TYPE AV FELT')
      * *CHG  = ENDRING AV TRIP
      * *PINV = UTSKRIFT AV PROFORMA INVOICE
     A            TLTNO         11S 0       COLHDG('TRIP-NR')
     A            TLTXT         30A         COLHDG('BESKRIVELSE')
     A            TLAGM         35A         COLHDG('GAMMEL ALFA VERDI')
     A            TLANY         35A         COLHDG('NY ALFA VERDI')
     A            TLNGM         17S 5       COLHDG('GAMMEL NUM. VERDI')
     A            TLNNY         17S 5       COLHDG('NY NUM. VERDI')
