     A          R GSSORFR                   PFILE(GSSORF)
     A          K ORLC2
     A          K ORDTL2
     A          O ORLC2                     COMP(EQ '     ')
     A          S ORLC3                     VALUES('     ')
