     A          R GSSOLFR
     A            OLST           1A         COLHDG('STATUS')
     A            OLONO          7S 0       COLHDG('ORDRENR.')
     A            OLLNO          2S 0       COLHDG('LINJENR')
     A            OLTNO         11S 0       COLHDG('TURNR. AVD/OPD')
     A            OLSTD          5A         COLHDG('LAGERSTED')
     A            OLLC          20A         COLHDG('LOKASJON')
     A            OLBOX          3S 0       COLHDG('BOXNR')
     A            OLMN          35A         COLHDG('EKSTERN MERKING')
     A          K OLONO
     A          K OLLNO
