     A          R GSSORFR                   PFILE(GSSORF)
     A          K ORTNO
     A          K ORBCD
     A          K ORCLNF
     A          K ORCLNT
