     A          R GSSORFR                   PFILE(GSSORF)
     A          K ORPORT
     A          K ORPORD
     A          K ORBCD
     A          K ORLC
     A          K ORONO
