     A          R GSSOWFR
     A            ORONO          7S 0       COLHDG('ORDRENR.')
     A            ORST           1A         COLHDG('STATUS')
     A            ORUSER        10A         COLHDG('BRUKER-ID')
     A            ORDTE          8S 0       COLHDG('ENDRINGSDATO')
     A            ORTME          6S 0       COLHDG('ENDRINGSTID')
     A            ORUSRP        10A         COLHDG('BRUKER-ID')
     A            ORDTP          8S 0       COLHDG('PLUKKDATO')
     A            ORTMP          6S 0       COLHDG('PLUKKTID')
     A          K ORST
     A          K ORUSER
     A          K ORONO
