     A          R GSSORFR                   PFILE(GSSORF)
     A          K ORST
     A          K ORCNO
     A          K ORBCD
     A          K ORLC
