     A          R GSSORFR                   PFILE(GSSORF)
     A          K ORLC
     A          K ORST2
     A          O ORST                      VALUES('D')
