     A          R GSSORFR                   PFILE(GSSORF)
     A          K ORCNO
     A          K ORBCD
     A          O ORST2                     VALUES('     ' 'POD')
     A          O ORST                      VALUES('D' '4' '5' '6')
