     A          R GSSORFR                   PFILE(GSSORF)
     A          K ORCNO
     A          K ORBCD
     A          S ORST2                     VALUES('POD')
