     A*__________________________
     A* GSS / PURCHA-SHIP
     A*""""""""""""""""""""""""""
     A          R GSSPCFR
     A            PCNO           5S 0       COLHDG('REKORDNR')
     A            PCPNO          8S 0       COLHDG('PURCHA NO.')
     A            PCNM          30A         COLHDG('NAVN')
     A            PCBCD          5A         COLHDG('SHIP CODE')
     A            PCCG           2A         COLHDG('KUNDEGRUPPE')
     A            PCTEL         15A         COLHDG('TELEFONNR')
     A            PCFAX         15A         COLHDG('TELEFAXNR')
E01  A            PCEM          70A         COLHDG('E-MAIL')
     A            PCAUTO         1A         COLHDG('AUTO SENDNING')
     A            PCTR           1A         COLHDG('INKL. TRANSITT')
     A            PCPEND         1A         COLHDG('PENDING ORDRE')
     A            PCFIR          3A         COLHDG('FIRMAKODE')
     A            PCUSER        10A         COLHDG('BRUKER')
     A            PCLK           2A         COLHDG('LANDKODE')
     A            PCCP           1A         COLHDG('COVERPAGE')
     A            PCUD1          1A         COLHDG('SENDING MANDAG')
     A            PCUD2          1A         COLHDG('SENDING TIRSDAG')
     A            PCUD3          1A         COLHDG('SENDING ONSDAG')
     A            PCUD4          1A         COLHDG('SENDING TORSDAG')
     A            PCUD5          1A         COLHDG('SENDING FREDAG')
     A            PCUD6          1A         COLHDG('SENDING LØRDAG')
     A            PCUD7          1A         COLHDG('SENDING SØNDAG')
     A            PCTD           4S 0       COLHDG('SENDINGSTID')
     A          K PCNO
