     A*__________________________
     A* GSS / ORDRE
     A*""""""""""""""""""""""""""
     A          R GSSPOFR
     A            POONO          7S 0       COLHDG('ORDRENR.')
     A            POLNO          2S 0       COLHDG('LINJENR.')
     A            POCONO        20A         COLHDG('KUNDERS ORDRENR.')
     A            POCON2        20A         COLHDG('KUNDERS ORDRENR 2.')
     A          K POONO
     A          K POLNO
