     A*____________________________
     A* STRINGKODER PRINTERE
     A*""""""""""""""""""""""""""""
     A          R GSSSTKR
     A            STRPRT        10          TEXT('PRINTER')
     A            STRESC         5          TEXT('ESCAPE')
     A            STRF01         5          TEXT('STRING 01')
     A            STRF02         5          TEXT('STRING 02')
     A            STRF03         5          TEXT('STRING 03')
     A            STRF04         5          TEXT('STRING 04')
     A            STRF05         5          TEXT('STRING 05')
     A            STRF06         5          TEXT('STRING 06')
     A            STRF07         5          TEXT('STRING 07')
     A            STRF08         5          TEXT('STRING 08')
     A            STRF09         5          TEXT('STRING 09')
     A          K STRPRT
