     A          R GSSTRFR                   PFILE(GSSTRF)
     A          K TRCG
     A          K TRBCD
     A          K TRTNO
     A          S TRST                      VALUES(' ' '1')
