     A          R GSSTWFR
     A            TWST           1A         COLHDG('STATUS')
     A            TWTYP          1A         COLHDG('G=GRØNNSKJERM W=WEB')
     A            TWTNO         11S 0       COLHDG('TURNR. AVD/OPD')
     A            TWLC           5A         COLHDG('LOKAL')
     A            TWDTR          8S 0       COLHDG('REGISTRERINGSDATO')
     A            TWUSR         10A         COLHDG('BRUKER')
     A            TWCURC         3A         COLHDG('VALUTAKODE')
     A            TWFT1         70A         COLHDG('FRITEKST')
     A            TWFT2         70A         COLHDG('FRITEKST')
     A            TWFN11         3A         COLHDG('FLIGHT NO 11')
     A            TWFN12         7A         COLHDG('FLIGHT NO 12')
     A            TWFN13         2S 0       COLHDG('FLIGHT NO 13')
     A            TWFN21         3A         COLHDG('FLIGHT NO 21')
     A            TWFN22         7A         COLHDG('FLIGHT NO 22')
     A            TWFN23         2S 0       COLHDG('FLIGHT NO 23')
     A            TWFN31         3A         COLHDG('FLIGHT NO 31')
     A            TWFN32         7A         COLHDG('FLIGHT NO 32')
     A            TWFN33         2S 0       COLHDG('FLIGHT NO 33')
     A            TWVAL          3A         COLHDG('VALUTAKODE')
     A            TWBLF         11S 2       COLHDG('FLYFRAKT')
     A            TWBLC         11S 2       COLHDG('SURCHARGE')
     A            TWBLI         11S 2       COLHDG('FORSIKRING')
     A            TWWT           7S 1       COLHDG('VEKT')
     A            TWM3           7S 3       COLHDG('KUBIKK')
