     A          R GSSTWFR                   PFILE(GSSTWF)
     A          K TWLC
     A          K TWTNO
     A          O TWST                      VALUES('D' '4' '5' '6')
