     A          R GSSTRFR                   PFILE(GSSTRF)
     A          K TRCNO
     A          K TRTNO
     A          S TRST                      VALUES(' ' '1')
