     A          R GSSTRFR                   PFILE(GSSTRF)
     A          K TRCG
     A          K TRTNO
     A          S TRST                      VALUES('6' 'D')
