     A*__________________________________
     A* SYSPED / Oppdragsregister, Status
     A*""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Status')
     A          K HEAVD
     A          K HEST
