N01   * TA MED GN/POS for å få Ufortollet-liste(SAD105) etter GN/pos(innen dato)
     A*_____________________________________________________
     A* SYSPED / Oppdragsregister, FORTOLLINGS-KODE IMP
     A*"""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEPK4
     A          K HEDTOP
N01  A          K HEGN
N01  A          K HEPOS1
N01  A          K HEPOS2
