     A*________________________________________
     A* SYSPED / Oppdragsregister, Oppdragstype
     A*""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEOT
     A          K HEDTOP
     A          K HEAVD
