     A*_____________________________________
     A* SYSPED / Oppdragsregister, Kjøper
     A*"""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Kjøper')
     A          K HEAVD
     A          K HEKNK
     A          K HEDTOP
