     A*__________________________________________________________
     A* SYSPED / Oppdragsregister, Kjøp.fakm for eksterne brukere
     A*""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Kjøp.fakm, ekstern')
     A          K HEKNK
     A          K HEDTOP
