     A*__________________________________________
     A* SYSPED / Oppdragsregister, Agentreferanse   (KOMRIMERT)
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFRCMP                 PFILE(HEADFCMP)
     A                                      TEXT('Agentreferanse')
     A          K HEAVD
     A          K HERFA
