     A*__________________________
     A* SYSPED / Oppdragsregister
     A*""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEOT
     A          K HEDTOP
