     A*_____________________________________________________
     A* SYSPED / Oppdragsregister, GODSMERKE
     A*"""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEGM1
