     A*__________________________________________________________
     A* SYSPED / Oppdragsregister, Selg.fakm for eksterne brukere
     A*""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Selg.fakm, ekstern')
     A          K HEKNS
     A          K HEDTOP
