     A*_____________________________________
     A* SYSPED / Oppdragsregister, Selger  (KOMPRIMERT)
     A*"""""""""""""""""""""""""""""""""""""
     A          R HEADFRCMP                 PFILE(HEADFCMP)
     A                                      TEXT('Selger')
     A          K HEAVD
     A          K HEKNS
     A          K HEDTOP
