     A*_____________________________________________________
     A* SYSPED / Oppdragsregister, AVDELING GODSMERKE
     A*"""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEAVD
     A          K HEGM1
