     A*__________________________________________
     A* SYSPED / Oppdragsregister, Prosjekt/Pos-1
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Prosjekt/Pos-1')
     A          K HEPRO
     A          K HEPOS1
