     A*______________________________________
     A* SYSPED / Oppdragsregister, SEND-NR INNLAND
     A*""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('SENDNR INNLAND')
     A          K HXSNDN
