     A*__________________________________________
     A* SYSPED / Oppdragsregister, HAWB/BILNUMMER
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEHAWB
     A          K HEDTOP
     A          K HEAVD
