     A*_____________________________________________________
     A* SYSPED / Oppdragsregister, AVDELING DATO
     A*"""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEAVD
     A          K HEDTOP
     A          K HEOPD
