     A*__________________________________
     A* SYSPED / Oppdragsregister, REG.DATO   (KOMPRIMERT)
     A*""""""""""""""""""""""""""""""""""
     A          R HEADFRCMP                 PFILE(HEADFCMP)
     A          K HEDTR
