     A*____________________________________
     A* SYSPED / Oppdragsregister, Signatur
     A*""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEOPD
     A          K HEAVD
