     A*_____________________________________________________
     A* SYSPED / Oppdragsregister, FORTOLLINGS-KODE IMP
     A*"""""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEPK6
     A          K HEDTOP
