     A*__________________________
     A* SYSPED / Oppdragsregister (KOMPLIMERT)
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R HEADFRCMP
     A            HEST      R               REFFLD(ST)
     A            HEAVD          4P 0       COLHDG('Avdeling')
     A            HEOPD          7P 0       COLHDG('Oppdragsnr')
     A            HEUR      R               REFFLD(UR)
     A                                      COLHDG('Oppr.kode')
     A            HESG      R               REFFLD(SG)
     A                                      COLHDG('Signatur')
     A            HEPRO          8P 0       COLHDG('Prosjektnr')
     A            HEDTOP    R               REFFLD(DT)
     A                                      COLHDG('Oppdragsdato')
     A            HEGN      R               REFFLD(GN)
     A                                      COLHDG('Godsnr')
     A            HESDF     R               REFFLD(SD)
     A                                      COLHDG('Frakt fra')
     A            HESDT     R               REFFLD(SD)
     A                                      COLHDG('Frakt til')
     A            HEKNA          8P 0       COLHDG('Kundenr Agent')
     A            HEKNS          8P 0       COLHDG('Kundenr Selger')
     A            HENAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            HEKNSF         8P 0       COLHDG('Kundenr Selg.fakm')
     A            HEKNK          8P 0       COLHDG('Kundenr Kjøper')
     A            HENAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            HEKNKF         8P 0       COLHDG('Kundenr Kjøp.fakm')
     A            HEOT      R               REFFLD(OT)
     A                                      COLHDG('Oppdragstype')
     A            HEPOS1         7A         COLHDG('Posisjon-1')
     A            HEFR      R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            HENT           7P 0       COLHDG('Antall kolli')
     A            HEVS1     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-1')
     A            HEVKT          9P 0       COLHDG('Bruttovekt')
     A            HELM           4P 2       COLHDG('Lastemeter')
     A            HEM3           7P 3       COLHDG('Kubikkmeter')
     A            HEPK1     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-1')
     A            HEPK2     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-2')
     A            HEPK3     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-3')
     A            HEPK4     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-4')
     A            HEKNT          8P 0       COLHDG('Kundenr Transportør')
     A            HELKA     R               REFFLD(LKA)
     A                                      COLHDG('Landkode')
     A            HEHAWB    R               REFFLD(HAWB)
     A                                      COLHDG('Bil/HAWBnr')
     A            HEFBV          9P 0       COLHDG('Fraktb.vekt')
     A            HEPK5     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-5')
     A            HEDTR     R               REFFLD(DT)
     A                                      COLHDG('Registreringsdato')
S01  A*           HERFA     R               REFFLD(RF)
S01  A*                                     COLHDG('Referanse Agent')
N01  A            HERFA         35          COLHDG('Agent referanse')
     A            HEPOS2         4P 0       COLHDG('Posisjon-2')
     A            HEVS2     R               REFFLD(VS)
     A                                      COLHDG('Vareslag-2')
     A            HETLE     R               REFFLD(TLE)
     A                                      COLHDG('Eksp.sted SAD')
     A            HETLKU    R               REFFLD(TLKU)
     A                                      COLHDG('Kan utføres')
     A            HETLL     R               REFFLD(TLL)
     A                                      COLHDG('Løpenr toll')
     A            HEPK6     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-6')
     A            HESGM     R               REFFLD(SGM)
     A                                      COLHDG('Signatur mottatt')
     A            HEDTMO    R               REFFLD(DTMO)
     A                                      COLHDG('Dato mottatt')
     A            HEPK7     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-7')
     A            HEPK8     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-8')
     A            HEPK9     R               REFFLD(PK)
     A                                      COLHDG('Printerkode-9')
     A            HEGNN     R               REFFLD(GN)
     A                                      COLHDG('Godsnummer Nytt')
     A            HELB           5          COLHDG('LOKALBÅT')
     A          K HEAVD
     A          K HEOPD
