     A*______________________________________
     A* SYSPED / Oppdragsregister, Godsnummer
     A*""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Godsnummer')
     A          K HEAVD
     A          K HEGN
