     A*__________________________________________
     A* SYSPED / Oppdragsregister, MODUL/OPPDR.DATO
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('MODUL/DATO')
     A          K HEUR
     A          K HEDTOP
