     A*_____________________________________
     A* SYSPED / Oppdragsregister, Kjøper  (KOMPRIMERT)
     A*"""""""""""""""""""""""""""""""""""""
     A          R HEADFRCMP                 PFILE(HEADFCMP)
     A                                      TEXT('Kjøper')
     A          K HEAVD
     A          K HEKNK
     A          K HEDTOP
