     A*_____________________________________
     A* SYSPED / Oppdragsregister, Kjøp.fakm
     A*"""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEKNKF
     A          K HEDTOP
     A          K HEAVD
