     A*__________________________________________
     A* SYSPED / Oppdragsregister, Prosjekt/Agent   (KOMPRIMERT)
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFRCMP                 PFILE(HEADFCMP)
     A                                      TEXT('Prosjekt/Agent')
     A          K HEAVD
     A          K HEPRO
     A          K HEKNA
