     A*______________________________________
     A* SYSPED / Oppdragsregister, Godsnummer (KOMPRIMERT)
     A*""""""""""""""""""""""""""""""""""""""
     A          R HEADFRCMP                 PFILE(HEADFCMP)
     A                                      TEXT('Godsnummer')
     A          K HEAVD
     A          K HEGN
