     A*__________________________________________
     A* SYSPED / Oppdragsregister, Agentreferanse
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Agentreferanse')
     A          K HERFA
     A          K HEDTOP
