     A*________________________________________
     A* SYSPED / Oppdragsregister, Oppdragstype  (KOMPRIMERT)
     A*""""""""""""""""""""""""""""""""""""""""
     A          R HEADFRCMP                 PFILE(HEADFCMP)
     A                                      TEXT('Oppdragstype')
     A          K HEAVD
     A          K HEOT
     A          K HEDTOP
