     A*___________________________________
     A* SYSPED / Oppdragsregister, SAMLAST
     A*"""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Godsnummer')
     A          K HESAML
