     A*____________________________________
     A* SYSPED / Oppdragsregister, Signatur (KOMPRIMERT)
     A*""""""""""""""""""""""""""""""""""""
     A          R HEADFRCMP                 PFILE(HEADFCMP)
     A                                      TEXT('Signatur')
     A          K HEAVD
     A          K HESG
     A          K HEDTOP
