     A*__________________________________________
     A* SYSPED / Oppdragsregister, HAWB/BILNUMMER
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('CONTAINERNR')
     A          K HEAVD
     A          K HETRCN
     A          K HEDTOP
