     A*________________________________________
     A* SYSPED / Oppdragsregister, AGENTNUMMER
     A*""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('AGENTNUMMER')
     A          K HEAVD
     A          K HEKNA
     A          K HEDTOP
