     A*__________________________________________
     A* SYSPED / Oppdragsregister, HAWB/BILNUMMER
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('HAWB/BILNUMMER')
     A          K HEAVD
     A          K HEHAWB
     A          K HEDTOP
