     A*__________________________________________
     A* SYSPED / Oppdragsregister, Prosjekt/Agent
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A                                      TEXT('Prosjekt/Agent')
     A          K HEPRO
     A          K HEKNA
     A          K HEPOS1
