     A*_____________________________________
     A* SYSPED / Oppdragsregister, Selger
     A*"""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEKNS
     A          K HEDTOP
     A          K HEAVD
