     A*______________________________________
     A* SYSPED / Oppdragsregister, KVITTERT MOTTATT
     A*""""""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HESGM
     A          K HEPRO
