     A                                      REF(SR)
     A          R HEBRELER
     A            TRAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            TROPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            TRHBRE         8S 6       COLHDG('HENTING, BREDDEGRAD')
     A            TRHLEN         9S 6       COLHDG('HENTING, LENGDEGRAD')
     A            TRHBLK         1          COLHDG('HENT. BRE/LEN-KODE')
     A            TRLBRE         8S 6       COLHDG('LEVERING, BREDDEGRAD')
     A            TRLLEN         9S 6       COLHDG('LEVERING, LENGDEGRAD')
     A            TRLBLK         1          COLHDG('LEVE. BRE/LEN-KODE')
     A          K TRAVD
     A          K TROPD
