     A          R HENOTWR
     A            HTUSER        10A         COLHDG('BRUKER-ID')
     A            HTID          20A         COLHDG('KOLLI-ID')
     A            HTDT           8S 0       COLHDG('Ank.dato')
     A            HTDTT          4S 0       COLHDG('Ank.tid')
     A            HTPALL         1A         COLHDG('PÅ PALL')
      *
     A            HTSNDN        20A         COLHDG('Sendingsnr')
     A            HTRFA         15A         COLHDG('Senders ref')
     A            HTKNK          8P 0       COLHDG('Kundenr Mottaker')
     A            HTNAK         30A         COLHDG('Navn Mottaker')
     A            HTADK1        30A         COLHDG('Adr 1 Mottaker')
     A            HTPNRK         4P 0       COLHDG('Postnr Mottaker')
     A            HTSTDK        25A         COLHDG('Sted Mottaker')
     A            HTKNA          8P 0       COLHDG('Kundenr ANNEN betal')
     A            HTPNRT         4P 0       COLHDG('Postnr VIA(Terminal)')
     A            HTAGTR         8P 0       COLHDG('Agent(transp) VIA')
     A            HTANTP         3P 0       COLHDG('Ant. paller')
     A            HTANT          5P 0       COLHDG('Antall')
     A            HTVB          25A         COLHDG('Varebeskrivelse')
      *
     A            HTBILN        10          COLHDG('BILNR')
     A            HTKNS          8P 0       COLHDG('Kundenr selger')
     A            HTNAS         30A         COLHDG('Navn Selger')
     A            HTADS1        30A         COLHDG('Adr 1 Selger')
     A            HTPNRS         4P 0       COLHDG('Postnr Selger')
     A          K HTID
