      *  TIL BRUK FOR Å FINNE FRITEKSTER KNYTTET TIL SENDINGER SOM KUN
      *  ER KOMMET INN SOM FORHÅNDSADVISERING. (IFTMIN - WEBSPØRRING)
      *  DA "HENGER" ALLE SEND. FOR EN KUNDE UNDER EN FELLES HEADER
      *  (MED "MINUS KUNDENR" SOM NØKKEL(HSLNR) OG 0 I HSLNR2 )
      *
     A          R HENOFR                    PFILE(HENOF)
     A          K HFLNR
     A          K HFSNDN
