     A          R HENOKWR                   PFILE(HENOKW)
     A          K HKUSER
     A          K HKLNR
     A          K HKLNR2
     A          K HKLNR3
