     A*__________________________
     A* SYSPED / Oppdragsregister -> INNH/UTKJ.OPPDRAG
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R HETRIUR
     A* AKTUELT OPPDRAG.....
     A            TIAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A                                      EDTCDE(Z)
     A            TIOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A                                      EDTCDE(Z)
     A* TYPE UNDERPOST....
     A*      : FF=Forfrakt    (DUP-oppd. EL REKV. innhenting)
     A*      : VF=Viderefrakt (DUP-oppd. EL REKV. utkjør.)
     A*      : SF=SPREDNfrakt (DUP-oppd. SPREDNING.)
     A            TISLAG         2          COLHDG('TYPE U-POST')
     A* AVD/OPD FOR DUPOPPDRAG IKKE I BRUK ENNÅ
     A            TIAVDD    R               REFFLD(AVD)
     A                                      COLHDG('Avdeling DUP')
     A                                      EDTCDE(Z)
     A            TIOPDD    R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr DUP')
     A                                      EDTCDE(Z)
     A            TIBURF         7P 0       COLHDG('REFNR BUDSJETT')
     A          K TIAVD
     A          K TIOPD
     A          K TISLAG
