     A          R HEURFILR
      * Key
     A            PREFCA        10          TEXT('PREFERRED CARRIER')
     A            CUSTCL        10          TEXT('IMPORT/EKSPORT')
     A            HEUR           1          TEXT('DELSYSTEM')
     A            HEAVD          4S 0       TEXT('AVDELING')
     A            BRUKER1       10          COLHDG('USER 1')
     A            BRUKER2       10          COLHDG('USER 2')
     A            BRUKER3       10          COLHDG('USER 3')
     A            BRUKER4       10          COLHDG('USER 4')
     A            BRUKER5       10          COLHDG('USER 5')
     A          K PREFCA
     A          K CUSTCL
