     A*__________________________________
     A* SYSPED / HAWB EGEN LOGO FRAKTBREV
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R HLOGOR
     A            HLST      R               REFFLD(ST)
     A            HLTABH         1          TEXT('ALT TAB AWB/HAWB')
     A            HLT1          22          COLHDG('TXT-1 UTHEVET')
     A            HLT2          22          COLHDG('TXT-1 UTHEVET')
     A            HLT3          35          COLHDG('TXT-1 UTHEVET')
     A            HLT4          35          COLHDG('TXT-1 UTHEVET')
     A            HLT5          35          COLHDG('TXT-1 UTHEVET')
     A            HLT6          35          COLHDG('TXT-1 UTHEVET')
     A            HLTXXX         8          COLHDG('LEDIGE')
     A          K HLTABH
