     A*____________________________
     A* SYSPED / FAKTURAHODEREGISTER
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R HODER
     A            HONET          1          TEXT('TYPE NORSK,ENGELSK,TYSK')
     A            HOAVD          4S 0       TEXT('AVDELINGSNR')
     A            HOHT1         80          TEXT('HODE LINJE-1')
     A            HOHT2         80          TEXT('HODE LINJE-2')
     A            HOHT3         80          TEXT('HODE LINJE-3')
     A            HOHT4         80          TEXT('HODE LINJE-4')
     A            HOHT5         80          TEXT('HODE LINJE-5')
     A            HOHT6         80          TEXT('HODE LINJE-6')
     A            HOHT7         80          TEXT('HODE LINJE-7')
     A            HOBT1         80          TEXT('BUNN LINJE-1')
     A            HOBT2         80          TEXT('BUNN LINJE-2')
     A            HOBT3         80          TEXT('BUNN LINJE-3')
     A            HOSTFR         2          TEXT('STANDARD FRITXTKODE')
     A          K HONET
     A          K HOAVD
