     A*%%TS  SD  20140128  132509  SVEIN       REL-V7R1M0  5770-WDS
     A*            12:36:51    LOG         REL-R00M05  5728-PW1
     A*****************************************************************
     A*   (c) COPYRIGHT: LogIT Gruppen AS    1988 - 2011              *
     A*****************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      REF(*LIBL/L1FRF)
     A                                      MSGLOC(28)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A                                      HLPTITLE('Hjelpetekst for HR900P01')
     A                                      HLPPNLGRP(HR90001 HR900P01)
     A                                      HLPFULL
     A*            12:36:51    LOG         REL-R00M05  5728-PW1
     A          R BILDE01
     A*%%TS  SD  20140128  132509  SVEIN       REL-V7R1M0  5770-WDS
     A                                      TEXT('Funsjonstaster')
     A                                      OVERLAY
     A          H                           HLPPNLGRP(HR90099 HR900P01)
     A                                      HLPARA(22 001 24 080)
     A                                  5  2'DET FINNES IKKE AVSLUTTETDE POSTER-
     A                                      INGER I LØSNING 1 PÅ SAMME BRUKERID-
     A                                      :'
     A                                      COLOR(RED)
     A            ZUSER         10   O  5 74COLOR(WHT)
     A                                  9  2'DU MÅ OVER I LØSNING 1 OG OPPDATER-
     A                                      E  BUNKEN FØR DU FÅR OVERFØRT FAR S-
     A                                      YSPED  '
     A                                      COLOR(RED)
