     A*_____________________________________
     A* SYSPED / HURTIGBOOKING / NOTISBLOKK
     A*"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R HUBOR
      * FELTENE SOM LIGGER NEDENFOR DENNE MERKING MÅ LIGGE SLIK
      * OGSÅ VED FILENDRINGER. BRUKER MOVEL AV RECORDFORMAT I PGM.
     A            HUOPDG        10A         COLHDG('Oppdragsgiver')
     A            HUAM           1A         COLHDG('Avsender/Mottaker')
     A            HUFRA          8A         COLHDG('Fra sted')
     A            HUFDAT         8S 0       COLHDG('Fra sted dato')
     A            HUTIL          8A         COLHDG('Til sted')
     A            HUTDAT         8S 0       COLHDG('Til sted dato')
     A            HUANT          4S 0       COLHDG('Antall')
     A            HUVARE        25A         COLHDG('Varebeskrivelse')
     A            HUM3           7S 3       COLHDG('Kubikkmeter')
     A            HULM           4S 2       COLHDG('Lastemeter')
     A            HUVEKT         7S 1       COLHDG('Vekt')
     A            HUFRI1        30A         COLHDG('Fritekst / Avs/mott')
     A            HUFRI2        30A         COLHDG('Fritekst / Avs/mott')
     A            HUFRI3        30A         COLHDG('Fritekst / Avs/mott')
     A            HUFRI4        30A         COLHDG('Fritekst / Avs/mott')
     A            HUDATE         8S 0       COLHDG('Dato registrert')
     A            HUTIME         6S 0       COLHDG('Tid registrert')
      * FELTENE SOM LIGGER OVENFOR DENNE MERKING MÅ LIGGE SLIK
      * OGSÅ VED FILENDRINGER. BRUKER MOVEL AV RECORDFORMAT I PGM.
     A            HUSTAT    R               REFFLD(ST)
     A            HUAVD     R               REFFLD(AVD)
     A            HUOPD     R               REFFLD(OPD)
     A            HUSIGN    R               REFFLD(SG)
     A            HUUSER        10A         COLHDG('User')
