     A*_____________________________________
     A* SYSPED / HURTIGBOOKING / NOTISBLOKK
     A*"""""""""""""""""""""""""""""""""""""
     A          R HUBOR                     PFILE(HUBOF)
     A          K HUUSER
