     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
      *
     A          R BILDE01
     A                                      CF03(03 'Avslutt')
     A                                  1  2'SYSPED/LØSNING 1 '
     A                                      COLOR(BLU)
     A                                  1 21'REGENERER OMSETNING'
     A                                      COLOR(WHT)
     A                                  9  2'Firmakode for kjøring...:'
     A            WSFIRM         2A  B  9 29
     A                                 11  2'Inneværende aar er......:'
     A            IAAR           4Y 0B 11 29EDTCDE(4)
     A                                 23  2'F3 = avbryt denne kjøring'
     A                                      COLOR(BLU)
