     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
      *
     A          R IFAXV1
     A                                  1 13'Vedlikehold av Inng.Telefax(Facsim-
     A                                      ile/400)'
     A                                      COLOR(WHT)
     A                                  5 13'Telefaxs'
     A                                  5 22'utskiftsenhet'
     A            FLD003        10A  B  5 38COLOR(BLU)
     A                                  6 13'Polletid'
     A                                  6 22'i'
     A                                  6 24'sekunder'
     A            FLD004         4A  B  6 38COLOR(BLU)
     A                                 22  5'F3 = Avslutt'
     A                                      COLOR(BLU)
