     A*__________________________
     A* SYSPED / INFOR.register
     A*""""""""""""""""""""""""""
     A          R INFOR                     PFILE(INFO)
     A          K INAVD
     A          K INKNR
     A          K INTR
     A          K INKD
     A          K INLK
     A          K INDT
