      * IDENTISK LAYOUT BRUKES VED MOTTAK-
      * CRTDUPOBJ -> INTFAM  V/ENDRINGER
     A          R INTFASR
      *HEADER-NIVÅ
     A            INTYPE         4          COLHDG('TYPE-ID FOR EDI')
     A            INST           1          COLHDG('STATUS')
     A            INSEID        35          COLHDG('ID,FAKT-SENDER')
     A            INMOID        35          COLHDG('ID,FAKT-MOTTAKER')
F7   A            INFANR         7S 0       COLHDG('FAKT.NR')
     A            INDATO         8S 0       COLHDG('FAKT.DATO')
     A            INDAFF         8S 0       COLHDG('FORF.DATO')
     A            INAAR          2S 0       COLHDG('PER.ÅR')
     A            INMND          2S 0       COLHDG('PER.MND')
     A            INKUNR         8S 0       COLHDG('KUNDENR')
     A            INKID         20          COLHDG('KID')
     A            INUDAT         8S 0       COLHDG('DATO SKAPT')
     A            INUTID         4S 0       COLHDG('TID SKAPT')
      *DETALJ-NIVÅ
     A            INAVD          4S 0       COLHDG('AVD')
     A            INOPD          7S 0       COLHDG('OPPDRAG')
     A            INANNE        20          COLHDG('ANNEN REF')
     A            INANN2        20          COLHDG('ANNEN REF 2')
     A            INVK           3          COLHDG('VARE-KODE')
     A            INBELN        13S 2       COLHDG('BELØP NETTO I NOK')
     A            INMVA          1          COLHDG('MVA J/N')
     A            INUAVD         4S 0       COLHDG('UTSTEDERS AVD')
     A            INUOPD         7S 0       COLHDG('UTSTEDERS OPPDRAG')
     A            INBELV        13S 2       COLHDG('BELØP NETTO I VALUTA')
     A            INVAL          3          COLHDG('VALUTAKODE')
N01  A            INTXT         20          COLHDG('FRITEKST')
     A          K INST
     A          K INSEID
     A          K INMOID
     A          K INFANR
