********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
      *__________________________________________
      * KOBLINGFIL MELDINGSNUMMER/FAKTURANUMMER
      *""""""""""""""""""""""""""""""""""""""""""
     A          R INV921FR
S01  A*           DSMNA          7
N01  A            DSMNA          9
     A            X1004         17
     A            KABNR          7S 0
     A          K X1004
