     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
      *
     A          R TAP
     A                                  7 15'Format'
     A                                  7 22'another'
     A            IN01           1A  B  7 35DSPATR(PC)
     A                                      COLOR(WHT)
     A                                  7 30'?'
     A                                  7 39'Y/N'
