     A          R ISOFR                     PFILE(ISOF)
     A          K ISSAKN
     A          K ISUSRS
     A          S ISSLUT                    VALUES(' ')
