     A          R ISOFR                     PFILE(ISOF)
     A          K ISFRDA
     A          K ISFAVD
     A          K ISFOPD
     A          K ISFLOP
