     A          R ISOINFFR
     A            IFST           1A         COLHDG('STATUS')
     A            IFSAKN         7S 0       COLHDG('Saksnr')
     A            IFMOTT        50A         COLHDG('MOTTAKER')
     A            IFCC01        50A         COLHDG('CC 1')
     A            IFCC02        50A         COLHDG('CC 2')
     A            IFCC03        50A         COLHDG('CC 3')
     A            IFSTD         20A         COLHDG('STED UTSKRIFT')
     A            IFDTR          8S 0       COLHDG('REG. DATO')
     A            IFDTS          8S 0       COLHDG('DATO UTSKRIFT')
     A            IFTMS          6S 0       COLHDG('TID UTSKRIFT')
     A            IFDREF        35A         COLHDG('DERES REF')
     A            IFHD01        70A         COLHDG('HEADING1')
     A            IFHD02        70A         COLHDG('HEADING2')
     A            IFHD03        70A         COLHDG('HEADING3')
     A            IFHD04        70A         COLHDG('HEADING4')
     A            IFTXT01       70A         COLHDG('TEKST 01')
     A            IFTXT02       70A         COLHDG('TEKST 02')
     A            IFTXT03       70A         COLHDG('TEKST 03')
     A            IFTXT04       70A         COLHDG('TEKST 04')
     A            IFTXT05       70A         COLHDG('TEKST 05')
     A            IFTXT06       70A         COLHDG('TEKST 06')
     A            IFTXT07       70A         COLHDG('TEKST 07')
     A            IFTXT08       70A         COLHDG('TEKST 08')
     A            IFTXT09       70A         COLHDG('TEKST 09')
     A            IFTXT10       70A         COLHDG('TEKST 10')
     A            IFTXT11       70A         COLHDG('TEKST 11')
     A            IFTXT12       70A         COLHDG('TEKST 12')
     A            IFTXT13       70A         COLHDG('TEKST 13')
     A            IFTXT14       70A         COLHDG('TEKST 14')
     A            IFTXT15       70A         COLHDG('TEKST 15')
     A            IFBT01        70A         COLHDG('BUNNTEKST 1')
     A            IFBT02        70A         COLHDG('BUNNTEKST 2')
     A            IFBT03        70A         COLHDG('BUNNTEKST 3')
     A          K IFSAKN
