     A          R ISKDPR
     A            PKODE          5          COLHDG('Ansvarlig part')
     A            PTEXT         35          COLHDG('Tekstbeskrivelse')
     A            PFARGE        10          COLHDG('FARGE')
     A          K PKODE
