     A          R ISKDSR
     A            SKODE          1          COLHDG('Posteringstype')
     A            STEXT         35          COLHDG('Tekstbeskrivelse')
     A            SSLUTT         1          COLHDG('Status for slutt')
     A          K SKODE
