********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 ILTXT ER ØKT FRA 50A TIL 75A
********************************************************************
     A          R ISOLOGFR
     A            ILSAKN         7S 0       COLHDG('Saksnr')
     A            ILDTL          8S 0       COLHDG('Loggdato')
     A            ILTML          6S 0       COLHDG('Loggtid')
     A            ILUSR         10A         COLHDG('Bruker')
     A            ILMOD          1A         COLHDG('W=Web')
     A            ILFPFO1        5A         COLHDG('Posttype før')
     A            ILFPFO2        5A         COLHDG('Posttype etter')
     A            ILFAVA1        5A         COLHDG('Avvikets art før')
     A            ILFAVA2        5A         COLHDG('Avvikets art etter')
     A            ILFANS1        5A         COLHDG('Ansvarlig part før')
     A            ILFANS2        5A         COLHDG('Ansvarlig part etter')
     A            ILRTYP1        2A         COLHDG('Rekl.type før')
     A            ILRTYP2        2A         COLHDG('Rekl.type etter')
     A            ILST1          1A         COLHDG('Status før')
     A            ILST2          1A         COLHDG('Status etter')
     A            ILSDT1         8S 0       COLHDG('Saksdato før')
     A            ILSDT2         8S 0       COLHDG('Saksdato etter')
     A            ILUSR1        10A         COLHDG('Bruker-id før')
     A            ILUSR2        10A         COLHDG('Bruker-id etter')
S01  A*           ILTXT         50A         COLHDG('Fritekst')
N01  A            ILTXT         75A         COLHDG('Fritekst')
