     A          R ISOSAKFR
     A            ISAVD          4S 0       COLHDG('Avdeling')
     A            ISOPD          7S 0       COLHDG('Oppdrag')
     A            ISLOP          3S 0       COLHDG('Løpenummer')
     A            ISSNR          2S 0       COLHDG('Sekvensnr.')
EV5  A            ISSDA          8S 0       COLHDG('Saksbeh. dato')
     A            ISSSI         10          COLHDG('Saksbeh. sign.')
     A          K ISAVD
     A          K ISOPD
     A          K ISLOP
     A          K ISSNR
