     A*____________________________
     A* TRANSREGISTER FOR KID-FELTET
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R KIDTRANR
     A            TRKI08         8          COLHDG('TILDELT KID')
     A            TRKI20        20          COLHDG('KORREKT KID')
     A          K TRKI20
