     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP(CA01)
      *
     A          R KLOKKE
     A                                  7 13'Trykk på link for å se tiden'
     A                                      COLOR(WHT)
     A                                 10 13'http://www.systema.no/klokke.swf'
     A                                      COLOR(BLU)
     A                                      DSPATR(UL)
