     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt program')
     A                                  4 15'Dette programmet skal konvertere t-
     A                                      ransportørsnr.'
     A                                      COLOR(WHT)
     A                                  5 15'og lage transportører i transportø-
     A                                      rsregister (TRAN).'
     A                                      COLOR(WHT)
     A                                  8 15'Velg konverteringsmåter:'
     A                                      COLOR(GRN)
     A            WSSVAR         1   B  8 50DSPATR(UL)
     A  30                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 10 15'J = Lage transportør med samme nr.-
     A                                       som kundenr.'
     A                                      COLOR(BLU)
     A                                 11 15'N = Nummere transportørsnr. fra og-
     A                                       med 1.'
     A                                      COLOR(BLU)
     A                                 23 15MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30                             24  2'Du må velge J for å beholde samme -
     A                                      nummer eller N for å nummere på nyt-
     A                                      t.'
     A                                      COLOR(WHT)
