     A*__________________________________
     A* SYSPED / Oppdragsregister, TRANSPORØRSNR
     A*""""""""""""""""""""""""""""""""""
     A          R HEADFR                    PFILE(HEADF)
     A          K HEKNT
