     A*____________________________
     A* SYSPED / Koderegister FRIE SØKEVEIER
     A*""""""""""""""""""""""""""""
     A          R KODFRIR
     A            KFSOKO         3          TEXT('CODE')
     A            KFSOTX        30          TEXT('TEXT')
     A            KFSODK        10          TEXT('DOKUM.KODE')
     A            KFSTTU         5          TEXT('TRACK&TR.URL-KODE')
     A          K KFSOKO
