     A*____________________________
     A* SYSPED / Koderegister  POSTNR -> AVD/KONTOR
     A*""""""""""""""""""""""""""""
     A          R KODKTRR
     A            KKLK           2          COLHDG('LAND')
     A            KKPNRF         5          COLHDG('Postnr. fra')
     A            KKPNRT         5          COLHDG('Postnr. til')
     A            KKAVD          4  0       COLHDG('AVD/KONTOR')
     A          K KKLK
     A          K KKPNRF
