     A          R KODSAMR
     A            SAKODE         1          TEXT('KODE')
     A            SANORS        20          TEXT('NORSK TEKST')
     A            SAENGE        20          TEXT('ENGELSK TEKST')
     A            SATYSK        20          TEXT('TYSK TEKST')
     A          K SAKODE
