     A*____________________________
     A* SYSPED / Koderegister  'FC'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KODTFCR
     A            KFCSTA         1          TEXT('STATUS')
     A            KFCUNI         2          TEXT('UNIK KODE')
     A            KFCFNR         3S 0       TEXT('FLYSELSKAP')
     A            KFCAVG         4S 2       TEXT('AVGIFT')
     A            KFCVKT         1          TEXT('VEKT FOR BEREGNING')
     A            KFCIO1         1          TEXT('INCLUDE/OMIT')
     A            KFCLK1         2          TEXT('LANDKODE')
     A            KFCLK2         2          TEXT('LANDKODE')
     A            KFCLK3         2          TEXT('LANDKODE')
     A            KFCLK4         2          TEXT('LANDKODE')
     A            KFCLK5         2          TEXT('LANDKODE')
     A            KFCFRA         8S 0       TEXT('FRA DATO')
     A            KFCTIL         8S 0       TEXT('TIL DATO')
     A            KFCMIN         5S 0       TEXT('MINIMUM')
     A            KFCFTX        17          TEXT('FRITEKST')
     A            KFCOTH         2          TEXT('OTH IATA CODE')
     A          K KFCUNI
     A          K KFCFNR
     A          K KFCFRA
