     A*_______________________
     A* SYSPED / Koderegister
     A*"""""""""""""""""""""""
     A          R KODTFTR                   PFILE(KODTFT)
     A          K KFTFTX
     A          S KFTLN                     COMP(EQ 1)
