     A*____________________________
     A* SYSPED / Koderegister  KOSTNAD BILAGSKOMMENTAR
     A*""""""""""""""""""""""""""""
     A          R KOKSBR                    PFILE(KODTKSB)
     A          K KOKSTX
