     A*____________________________
     A* SYSPED / Koderegister KOSTNAD BILAGSKOMMENTAR
     A*""""""""""""""""""""""""""""
     A          R KOKSBR
     A            KOKSKO         3          TEXT('KODE')
     A            KOKSTX        35          TEXT('BILAGSKOMMENTAR')
     A          K KOKSKO
