     A*____________________________
     A* SYSPED / Koderegister  'INNPR'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KODTINPR
     A            KIPSTA         1          TEXT('STATUS')
     A            KIPUNI         5          TEXT('UNIK KODE')
     A            KIPB1          5P 2       TEXT('BELØP-1')
     A            KIPB2          5P 2       TEXT('BELØP-2')
     A            KIPB3          5P 2       TEXT('BELØP-3')
     A            KIPB4          5P 2       TEXT('BELØP-4')
     A            KIPB5          5P 2       TEXT('BELØP-5')
     A            KIPB6          5P 2       TEXT('BELØP-6')
     A            KIPB7          5P 2       TEXT('BELØP-7')
     A            KIPB8          5P 2       TEXT('BELØP-8')
     A            KIPB9          5P 2       TEXT('BELØP-9')
     A            KIPB10         5P 2       TEXT('BELØP-10')
     A            KIPB11         5P 2       TEXT('BELØP-11')
     A            KIPB12         5P 2       TEXT('BELØP-12')
     A            KIPB13         5P 2       TEXT('BELØP-13')
     A            KIPB14         5P 2       TEXT('BELØP-14')
     A            KIPB15         5P 2       TEXT('BELØP-15')
     A            KIPB16         5P 2       TEXT('BELØP-16')
     A            KIPBVI         5P 0       TEXT('WIDERØ-MIN.PRIS')
     A            KIPXX1         5P 0       TEXT('KILOTILLEGG')
     A            KIPXX2         5P 0       TEXT('KILOGRENSE TILLEGG')
     A            KIPXXX        16          TEXT('LEDIGE-PLASSER')
     A          K KIPUNI
