     A*____________________________
     A* SYSPED / Koderegister  'S8'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOS8R
     A            KS8STA         1          TEXT('STATUS')
     A            KS8AVG         2          TEXT('AVGIFTKODE')
     A            KS8SKV         3          TEXT('AVG.SEKVENS')
     A            KS8FTX        52          TEXT('FRITEKST')
     A            KS8SAT         7S 2       TEXT('AVGIFTSATS')
     A            KS8STY         1          TEXT('TYPE AV AVGIFTSATS')
     A          K KS8AVG
     A          K KS8SKV
