     A*____________________________
     A* SYSPED / Koderegister  'SC'
     A*""""""""""""""""""""""""""""
     A          R KODTSCR                   PFILE(KODTSC)
     A          K KSCFT
