     A*____________________________
     A* SYSPED / Koderegister  'FS'
     A*""""""""""""""""""""""""""""
     A          R KODTFSR                   PFILE(KODTFS)
     A          K KFSNAV
