     A*____________________________
     A* SYSPED / Koderegister  'S1'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOS1R
     A            KS1STA         1          TEXT('STATUS')
     A            KS1UNI         3          TEXT('UNIK KODE')
     A            KS1TYP         2S 0       TEXT('EKSPEDISJONSTYPE IMPORT')
     A            KS1FTX        58          TEXT('FRITEKST')
     A          K KS1UNI
     A          K KS1TYP
