     A*____________________________
     A* SYSPED / Koderegister  'G2'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOG2R
     A            KG2STA         1          TEXT('STATUS')
     A            KG2UNI         2          TEXT('UNIK KODE')
     A            KG2KOD         3          TEXT('GEBYRKODE')
     A            KG2TYT        20          TEXT('TYSKTEKST')
     A            KG2SRT         3S 0       TEXT('SPRTERING')
     A            KG2KRT         7          TEXT('FORKORTELSE')
     A            KG2UTG         5S 0       TEXT('UTG.M/MVA')
     A            KG2MOT         5S 0       TEXT('UTG.U/MVA')
     A            KG2HBO         5S 0       TEXT('UTG.MOTKTO')
     A            KG2AVD         4S 0       TEXT('AVDELING')
     A            KG2KON         5S 0       TEXT('KONTO-2')
     A            KG2LEV         8S 0       TEXT('LEV.')
     A* KG2LEV ER SPLITTET TIL KG2PRO OG KG2BÆR
     A            KG2XXX         1          TEXT('LEDIG')
     A          K KG2UNI
     A          K KG2KOD
