      *____________________________
      * SYSPED / FIL FOR AUTO-TILDELINGA AV FORT.OPPDRAG TIL SAKSBEHANDLER
      *""""""""""""""""""""""""""""
     A          R KODTSIAR                  PFILE(KODTSIA)
     A          K SIAKN
     A          K SIAAVD
