     A*____________________________
     A* SYSPED / Koderegister  'LK'
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R KODTPIR
     A            PIST      R               REFFLD(ST)
     A            PIUNI          3          COLHDG('Unik kode')
     A            PIPNRF         4  0       COLHDG('Postnr. fra')
     A            PIPNRT         4  0       COLHDG('Postnr. til')
     A            PIAVD          4  0       COLHDG('Innlandsavd.')
     A          K PIUNI
     A          K PIPNRF
