     A*____________________________
     A* SYSPED / Koderegister  'VA'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOVAR
     A            KVASTA         1          TEXT('STATUS')
     A            KVAUNI         2          TEXT('UNIK KODE')
     A            KVAKOD         3          TEXT('VALUTAKODE')
     A            KVAKRS        11S 3       TEXT('VALUTAKURS')
     A            KVAOMR         3S 0       TEXT('OMREGNINGSFAKTOR')
     A            KVADT          8S 0       TEXT('OPPDATERINGSDATO')
     A            KVAGKR        11S 3       TEXT('GAMMELT VALUTAKURS')
     A            KVAXXX        27          TEXT('BESKRIVELSE')
     A            KVAGV         11S 0       TEXT('GRENSEVERDI')
     A          K KVAUNI
     A          K KVAKOD
