     A                                      REF(SR)
     A          R KODTCAR
     A            KODTCALN  R               REFFLD(LEVN)
     A            KODTCASG  R               REFFLD(SG)
     A            KODTCAFE  R               REFFLD(VK)
     A                                      COLHDG('Export Fee code')
     A            KODTCAFN  R               REFFLD(VK)
     A                                      COLHDG('Domestic Fee code')
     A            KODTCAMV  R               REFFLD(VK)
     A                                      COLHDG('Tax Fee code')
     A            KODTCAOV  R               REFFLD(VK)
     A                                      COLHDG('Surplus Fee code')
     A            KODTCAP1      10          COLHDG('Outq name')
     A            KODTCAP2      10          COLHDG('Outq library')
     A            KODTCAP3       1          COLHDG('Hold')
     A            KODTCAP4       1          COLHDG('Save')
