     A*____________________________
     A* SYSPED / Koderegister  'SF'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOSFR
     A            KOSFST         1          TEXT('STATUS')
     A            KOSFUN         2          TEXT('UNIK KODE')
     A            KOSFSI         3          TEXT('SIGNATUR')
     A            KOSFNV        16          TEXT('NAVN PÅ SIGNATUR')
     A            KOSFXX        42          TEXT('LEDIGE PLASSER')
     A          K KOSFUN
     A          K KOSFSI
