     A*____________________________
     A* SYSPED / HVILKE BRUKERE VARSLES VED OVERFØRING AV DUP
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KODR
     A            KODAVD         4S 0       TEXT('AVDELINGSNR')
     A            KODUS1        10          TEXT('USER 1')
     A            KODUS2        10          TEXT('USER 2')
     A            KODUS3        10          TEXT('USER 3')
     A            KODUS4        10          TEXT('USER 4')
     A            KODUS5        10          TEXT('USER 5')
     A            KODUS6        10          TEXT('USER 6')
     A          K KODAVD
