     A*____________________________
     A* SYSPED / Koderegister  'GE'
     A*""""""""""""""""""""""""""""
     A          R KOGER                     PFILE(KODTGE)
     A          K KGENOT
