     A*____________________________
     A* SYSPED / Koderegister  'SI'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOSIR
     A            KSISTA         1          TEXT('STATUS')
     A            KSIUNI         2          TEXT('UNIK KODE')
     A            KSISIG         3          TEXT('SIGNATUR')
     A            KSINAV        16          TEXT('NAVN PÅ SIGNATUR')
     A            KSIXXX        42          TEXT('LEDIGE PLASSER')
      * KSIXXX ER BRUKT TIL EPOSTADRESSE FOR MOTTAK AV TVINN-MELDING
     A            KSOVL          8          TEXT('OVERLAY')
     A            KSUSER        10          TEXT('PÅLOGGET BRUKER')
     A          K KSIUNI
     A          K KSISIG
