     A*____________________________
     A* SYSPED / Koderegister  'A'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOASIDR
     A            KSAVD          4S 0       TEXT('AVDELINGSNR')
     A            KSIDNR        20          TEXT('ID NR. MAWB')
     A          K KSAVD
