      *____________________________
      * SYSPED / Koderegister  'SO'
      *""""""""""""""""""""""""""""
     A          R KODTSOR                   PFILE(KODTSO)
     A          K KSOFT
