     A*____________________________
     A* SYSPED / Koderegister  'PV'-UNIK KODE I S-36
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KODTPVR
     A            KPVSTA         1          TEXT('STATUS')
     A            KPVFRA         3          TEXT('STED FRA')
     A            KPVTIL         3          TEXT('STED TIL')
     A            KPVSON         2S 0       TEXT('SAS-SONE')
     A            KPVPRI         5S 2       TEXT('KG-PRIS')
     A            KPVXXX        19          TEXT('LEDIGE PLASSER')
     A          K KPVFRA
     A          K KPVTIL
