     A*____________________________
     A* SYSPED / Koderegister  'O2Y'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOOT2R
     A            KO2STA         1          TEXT('STATUS')
     A            KO2UNI         3          TEXT('UNIK KODE')
     A            KO2KOD         2          TEXT('OPPDRAGTYPE')
     A            KO2NTX        20          TEXT('NORSK TEKST')
     A            KO2ETX        20          TEXT('ENGELSK TEKST')
     A            KO2FB          1          TEXT('FRAKTBREV')
     A            KO2FPS         1          TEXT('FORPASSING SAD')
     A            KO2KK          1          TEXT('KJØREKVITTERING')
     A            KO2TI          1          TEXT('TOLLDEK. IMPORT')
     A            KO2FI          1          TEXT('FRAKTBREV')
     A            KO2TE          1          TEXT('TOLLDEK. EKSPORT')
     A            KO2BI          1          TEXT('BILL OF LANDING')
     A            KO2CM          1          TEXT('CMR')
     A            KO2FF          1          TEXT('FLYFRAKTBREV')
     A            KO2MVK         1          TEXT('MOMS KJØPER')
     A            KO2MVS         1          TEXT('MOMS SELGER')
     A            KO2ST          1          TEXT('STATISTIKK')
     A            KO2KON         1          TEXT('KONTANT')
     A            KO2UTL         1          TEXT('UTLEGGSPROVISJON')
     A            KO2XX1         1          TEXT('LEDIG')
     A            KO2PST         1          TEXT('KOPSTA')
     A            KO2XX2         2          TEXT('LEDIGE PLASSER')
     A          K KO2UNI
     A          K KO2KOD
