     A*____________________________
     A* SYSPED / Koderegister  POSTNR -> INNLANDSAVD.
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R KODTRIR
     A            RITERM         4  0       COLHDG('BASE/TERMINAL')
     A            RIPNRF         4  0       COLHDG('Postnr. fra')
     A            RIPNRT         4  0       COLHDG('Postnr. til')
     A            RIAVDU         4  0       COLHDG('Innl.avd. UTGÅENDE')
     A            RIAVDI         4  0       COLHDG('Innl.avd. INNGÅENDE')
     A            RIAVDH         4  0       COLHDG('Innl.avd. HENTE-OPD')
     A          K RITERM
     A          K RIPNRF
