      *____________________________
      * SYSPED / Koderegister  'SO'
      *""""""""""""""""""""""""""""
     A          R KODTSOR
     A            KSOKD          4A         TEXT('TYPETILFELLE')
     A            KSOFT         60A         TEXT('FRITEKST')
     A          K KSOKD
