     A*____________________________
     A* SYSPED / Koderegister  'S5'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOS5R
     A            KS5STA         1          TEXT('STATUS')
     A            KS5UNI         4          TEXT('UNIK KODE')
     A            KS5TLN         1          TEXT('TOLLNEDSETTELSE')
     A            KS5FTX        58          TEXT('FRITEKST')
     A          K KS5UNI
     A          K KS5TLN
