     A*____________________________
     A* SYSPED / Koderegister  'PB'
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R KODTPBR
     A            KPBST     R               REFFLD(ST)
     A            KPBUNI         2          COLHDG('UNIK KODE')
     A            KPBSD     R               REFFLD(SD3)
     A            KPBBPR         5P 0       COLHDG('BASISPRIS')
     A            KPBRPR         5P 2       COLHDG('RATE-PRIS')
     A            KPBBAN         5P 0       COLHDG('BASIS ANDRE')
     A            KPBRAN         5P 2       COLHDG('RATE ANDRE')
     A            KPBXXX        46          COLHDG('LEDIGE')
     A          K KPBUNI
     A          K KPBSD
