     A*____________________________
     A* SYSPED / Koderegister  'A'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOAR
     A            KOASTA         1          TEXT('STATUS')
     A            KOAUNI         1          TEXT('UNIK KODE')
     A            KOAAVD         4S 0       TEXT('AVDELINGSNR')
     A            KOANVN        33          TEXT('AVDELINGSNAVN')
     A            KOAIAT         7S 0       TEXT('IATA KODE')
     A                                      EDTWRD('  & &    ')
     A            KOAIA2         4S 0       TEXT('IATA KODE DEL2')
     A            KOAKNR         8S 0       TEXT('KUNDENR')
     A            KOAFIR         2          TEXT('FIRMAKODE')
     A            KOABÆR         4S 0       TEXT('BÆRE')
     A            KOAKON         4S 0       TEXT('KONTO')
     A            KOAPOS         1          TEXT('POSTNUMMER FRAKTBER.')
     A            KOAIE          1          TEXT('KUN IMP./EKSP.')
     A            KOALK          2          TEXT('KUN LANDKODE')
     A          K KOAUNI
     A          K KOAAVD
