     A*____________________________
     A* SYSPED / Koderegister  'TERM'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOTMR
     A            KOTMUN         4          TEXT('STATUS')
     A            KOTMKO         1          TEXT('UNIK KODE')
     A            KOTMNV        20          TEXT('LOSSESTEDSNAVN')
     A            KOTMXX        39          TEXT('LEDIGE PLASSER')
     A          K KOTMUN
     A          K KOTMKO
