     A*____________________________
     A* SYSPED / Koderegister  'TST'
     A*""""""""""""""""""""""""""""
     A          R KOTSTR                    PFILE(KODTTST)
     A          K KTSNAV
