     A*__________________________________
     A* SYSPED / INTERNKONTERING GEB.KODE/BYTT
     A*""""""""""""""""""""""""""""""""""
     A          R KODTGIR                   PFILE(KODTGI)
     A          K KGIKOD
     A          K KGIBYT
