     A*____________________________
     A* SYSPED / Koderegister
     A*""""""""""""""""""""""""""""
     A          R KOVAR                     PFILE(KODTVA)
     A          K KVAXXX
