     A*____________________________
     A* SYSPED / Koderegister  'LK'
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R KODTLKR
     A            KLKST     R               REFFLD(ST)
     A            KLKUNI         3          COLHDG('UNIK KODE')
     A            KLKLK     R               REFFLD(LKA)
     A            KLKNVN        30          COLHDG('NAVN TIL LAND')
     A            KLKALF    R               REFFLD(LKA)
     A            KLKXX1         1          COLHDG('LEDIG')
     A            KLKMIN         4S 0       COLHDG('MIN.')
     A            KLKDIS         1          COLHDG('DIS.')
     A            KLKPRO         3S 0       COLHDG('PROST.')
     A            KLKLK2    R               REFFLD(LKA)
     A            KLKXX2        15          COLHDG('LEDIGE')
     A            KLKNVE        30          COLHDG('NAVN TIL LAND ENGE')
     A            KLKNVT        30          COLHDG('NAVN TIL LAND TYSK')
     A          K KLKUNI
     A          K KLKLK
