      *____________________________
      * SYSPED / FIL FOR AUTO-TILDELINGA AV FORT.OPPDRAG TIL SAKSBEHANDLER
      *""""""""""""""""""""""""""""
     A          R KODTSIAR
     A            SIASIG         3          COLHDG('FORTOLLER')
     A            SIAKN          8S 0       COLHDG('KUNDENR')
     A            SIAAVD         4S 0       COLHDG('AVDELING')
     A          K SIASIG
     A          K SIAKN
     A          K SIAAVD
