     A*____________________________
     A* SYSPED / Koderegister  'SA'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KODTSAR
     A            KSAKD          2          TEXT('ENHETSKODE')
     A            KSAFT         30          TEXT('FRITEKST')
     A          K KSAKD
