     A*____________________________
     A* SYSPED / Koderegister  'SB'
     A*""""""""""""""""""""""""""""
     A          R KODTSBR                   PFILE(KODTSB)
     A          K KSBFT
