     A*____________________________
     A* SYSPED / Koderegister  'FR'
     A*""""""""""""""""""""""""""""
     A          R KOFRR                     PFILE(KODTFR)
     A          K KFRNTX
