     A*____________________________
     A* SYSPED / Koderegister  'OTY'
     A*""""""""""""""""""""""""""""
     A          R KOOTYR                    PFILE(KODTOTY)
     A          K KO1NTX
