     A*____________________________
     A* SYSPED / Koderegister  'S2'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOS2R
     A            KS2STA         1          TEXT('STATUS')
     A            KS2UNI         3          TEXT('UNIK KODE')
     A            KS2LK          2          TEXT('LANDKODE')
     A            KS2FTX        55          TEXT('FRITEKST')
     A            KS2NAS         2          TEXT('NASJONNALITET')
     A            KS2PRE         1          TEXT('PREFERANSE')
     A            KS2MO          1          TEXT('MUL/OUL')
     A          K KS2UNI
     A          K KS2LK
