     A*____________________________
     A* SYSPED / Koderegister  DOKUMENTTYPE
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KODTSBR
     A            KSBKD          3          TEXT('DOKUMENTTYPE')
     A            KSBFT         60          TEXT('FRITEKST')
     A          K KSBKD
