     A*____________________________
     A* SYSPED / Koderegister  'J04'
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOJ4R
     A            KJ4STA         1          TEXT('STATUS')
     A            KJ4UNI         3          TEXT('UNIK KODE')
     A            KJ4TYP         2          TEXT('TYPE PÅ FRITEKST')
     A            KJ4SK          1          TEXT('SELGER/KJØPER')
     A            KJ4FTX        51          TEXT('FRITEKST')
     A            KJ4XXX         6          TEXT('LEDIGE PLASSER')
     A          K KJ4UNI
     A          K KJ4TYP
