     A*____________________________
     A* SYSPED / Koderegister  'SE'
     A*""""""""""""""""""""""""""""
     A          R KOSER
     A            KSEFYL         2          TEXT('FYLKEKODE')
     A            KSETXT        30          TEXT('FRITEKST')
     A          K KSEFYL
