     A*____________________________
     A* SYSPED400 FASTE KODER
     A*""""""""""""""""""""""""""""
     A          R KOFASTR                   PFILE(KOFAST)
     A          K KFTYP
     A          K KFTXT
