     A          R KOSAR                     PFILE(KOSAF)
     A                                      TEXT('Posteringsregister heading')
     A          K FIRMA
     A          K BILNR
