     A*_________________________________________
     A* SYSPED / BUDSJETTERTE KOSTNADER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSBUR                    PFILE(KOSBU)
     A                                      TEXT('STATUS+LEV.NR/TEKST')
     A          K BUST
     A          K BULNR
     A          K BUTXT
