     A*_________________________________________
     A* SYSPED / BUDSJETTERTE KOSTNADER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSBUR                    PFILE(KOSBU)
     A                                      TEXT('STAT/AVD/OPPD.NR')
     A          K BUST
     A          K BUOAVD
     A          K BUOPD
