     A*____________________________
     A* SYSPED / PLUKKEDE BUDSJETTPOSTER (WORKFILE)
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R KOSBPR
     A            BPWS          10
     A            BPBNR          7S 0       COLHDG('BILAGSNUMMER')
     A            BPPCC          2S 0       COLHDG('PERIODE-ÅRHUNDRE')
     A            BPPÅR          2S 0       COLHDG('PERIODE-ÅR')
     A            BPPMN          2S 0       COLHDG('PERIODE-MÅNED')
     A            BPLNR          8P 0       COLHDG('LEVERANDØRSNR.')
     A            BPVK           3          COLHDG('VAREKODE')
     A            BPVAL          3          COLHDG('VALUTAKODE')
     A            BPBL           9P 2       COLHDG('BELØP')
     A          K BPWS
