     A*_________________________________________
     A* SYSPED / TRANSPORTØRUTLEGG SOM ENNÅ IKKE ER TATT IGJEN
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSBUR                    PFILE(KOSBU)
     A                                      TEXT('TRANS.NR')
     A          K BUTNR
     A          K BUPCC
     A          K BUPÅR
     A          K BUPMN
     A          O BUOPD                     COMP(NE 0)
     A          O BUTUNR                    COMP(NE 0)
     A          O BUBLST                    COMP(NE 'T')
