     A*_________________________________________
     A* SYSPED / BUDSJETTERTE KOSTNADER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSBUR                    PFILE(KOSBU)
     A                                      TEXT('STATUS/BILNR/FERGEDATO')
     A          K BUST
     A          K BUBILN
     A          K BUFEDT
