     A*_________________________________________
     A* SYSPED / BUDSJETTERTE KOSTNADER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSBUR                    PFILE(KOSBU)
     A                                      TEXT('AVD/OPPD.NR')
     A          K BUOAVD
     A          K BUOPD
     A          K BUTXT
