     A*_________________________________________
     A* SYSPED / BUDSJETTERTE KOSTNADER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSBUR                    PFILE(KOSBU)
     A                                      TEXT('BILAGSNR I KOSTA')
     A          K BUBNR2
