     A          R KOSBR                     PFILE(KOSBF)
     A                                      TEXT('Posteringslinjer')
     A          K BILNR
     A          K PERAAR
     A          K PERNR
     A          K KONTO
     A          K KSTED
     A          K KBARER
     A          K MOMSK
     A          K PROSNR
     A          K BILNR
