     A* FÅTT MED ÅR I KEYEN
     A*_________________________________________
     A* SYSPED / KOSTNADER HOVEDBILAG (KREDITOR)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTAR                    PFILE(KOSTA)
     A                                      TEXT('LEV.NR/LEV.S FAKTNR')
     A          K KALNR
     A          K KAFNR
     A          K KAPÅR
