     A*_________________________________________
     A* SYSPED / KOSTNADER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTAR                    PFILE(KOSTA)
     A                                      TEXT('STATUS+ENDEL.BIL.NR')
     A          K KAST
     A          K KABNR2
