     A*_________________________________________
     A* SYSPED / KOSTNADER (DETALJLINJE)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTBR                    PFILE(KOSTB)
     A          K KBAVD
     A          K KBOPD
     A          K KBBNR
