     A*_________________________________________
     A* SYSPED / KOSTNADER HOVEDBILAG (KREDITOR)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTAR                    PFILE(KOSTA)
     A                                      TEXT('TEKST+DATO')
     A          K KATXT
     A          K KABDT
