     A*____________________________
     A* SYSPED / TELLER FOR BILAGSNUMMER (KOSTNADER FØRING)
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R KOSTTR
     A            KTTYP          1          COLHDG('BILAGSSERIE')
     A            KTNR           7S 0       COLHDG('BILAGSNUMMER')
     A            KTNA          30          COLHDG('SERIE BESKRIVELSE')
     A          K KTTYP
