     A*_________________________________________
     A* SYSPED / KOSTNADER HOVEDBILAG (KREDITOR)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTAR                    PFILE(KOSTA)
     A                                      TEXT('ATT.K.+ST.+B.DATO')
     A          K KASG
     A          K KAST
     A          K KABDT
