     A*_________________________________________
     A* SYSPED / KOSTNADER HOVEDBILAG (KREDITOR)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTAR                    PFILE(KOSTA)
     A                                      TEXT('STATUS+TEKST+DATO')
     A          K KATXT
     A          K KAST
     A          K KABDT
