     A*_________________________________________
     A* SYSPED / KOSTNADER HOVEDBILAG (KREDITOR)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTAR                    PFILE(KOSTA)
     A                                      TEXT('LEV.FAKTURANR')
     A          K KAFNR
