     A*_________________________________________
     A* SYSPED / KOSTNADER (DETALJLINJE)
     A* ORDRE MED KODE 4 ER INTERIMSFØRT
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTBR                    PFILE(KOSTB)
     A          K KBNØKK
