     A*_________________________________________
     A* SYSPED / KOSTNADER (DETALJLINJE)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTBR                    PFILE(KOSTB)
     A          K KBBNR
     A          K KBPCC
     A          K KBPÅR
     A          K KBPMN
