     A*_________________________________________
     A* SYSPED / KOSTNADER (DETALJLINJE)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R KOSTBR                    PFILE(KOSTB)
     A          K KBBNR
     A          K KBAVD
     A          K KBOPD
     A          K KBKN
     A          K KBVK
     A          K KBKDPF
     A          K KBKDM
