     A*__________________________________________
     A* SYSPED / KUNDER SOM IKKE SKAL PRISFORHØYES
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R KUIPRR                    PFILE(KUIPR)
     A                                      TEXT('IKKE PRISFORHØYES')
     A          K KUFIRM
     A          K KUKUND
