     A*_____________________________________
     A* SYSPED / KUNDER SOM IKKE SKAL PRISFORHØYES
     A*"""""""""""""""""""""""""""""""""""""
     A          R KUIPRR
     A            KUFIRM         2          COLHDG('FIRMAKODE')
     A            KUKUND         8S 0       COLHDG('KUNDENR')
