     A          R KUNDR                     PFILE(KUNDF)
     A                                      TEXT('Kunderegister Telefonnr.')
     A          K FIRMA
     A          K TLF
