     A                                      UNIQUE
     A          R KUNDR                     PFILE(KUNDF)
     A                                      TEXT('Kunderigister Kundenr.')
     A          K FIRMA
     A          K KUNDNR
