     A          R KUNDR                     PFILE(KUNDF)
     A                                      TEXT('Kunderigister Leverandørnr.')
     A          K FIRMA
     A          K LEVNR
