     A                                      ALTSEQ(IBMALPHA)
     A          R KUNDR                     PFILE(KUNDF)
     A                                      TEXT('Kunderegister Alfasøk')
     A          K FIRMA
     A          K SONAVN
