     A                                      REF(IBMFRF)
     A          R KUNDR
     A            AKTKOD    R
     A            JOURNR    R
     A            FIRMA     R
     A            KUNDNR    R
     A            DKUND     R
     A            KNAVN     R
     A            ADR1      R
     A            ADR2      R
     A            POSTNR    R
     A            ADR3      R
     A            KPERS     R
     A            TLF       R
     A            SONAVN    R
     A            LAND      R
     A            VALKOD    R
     A            SPRAAK    R
     A            HEAD      R
     A            BANKG     R
     A            POSTG     R
     A            LEVNR     R
     A            FMOT      R
     A            FACT      R
     A            BETBET    R
     A            BETMAT    R
     A            PRISK     R
     A            RABAT1    R
     A            RABAT2    R
     A            RABAT3    R
     A            RABAT4    R
     A            MOMS      R
     A            AVG1      R
     A            AVG2      R
     A            AVG3      R
     A            REST      R
     A            KVANT     R
     A            BONUS     R
     A            ORDRAB    R
     A            SFAKT     R
     A            SORD      R
     A            KUNDGR    R
     A            DISTR     R
     A            SELGER    R
     A            LAGNR     R
     A            RUTENR    R
     A            SEKVNR    R
     A            FEKS      R
     A            RKOD      R
     A            PKOD      R
     A            KUTDR     R
     A            GNOTAK    R
     A            GNOTKD    R
     A            AKONT     R
     A            KGRENS    R
     A            KVERD     R
     A            KHENV     R
     A            LEVBET    R
     A            LEVMAT    R
     A            AUTKOD    R
     A            FRSONE    R
     A            SPEDNR    R
     A            FBKOD     R
     A            MRKKOD    R
     A            ADRKOD    R
     A            KRTID     R
     A            INNAAR    R
     A            INNMND    R
     A            INNDAG    R
     A            SISAAR    R
     A            SISMND    R
     A            SISDAG    R
     A            KSALDO    R
     A            KUTSK     R
     A            FAIAAR    R
     A            FAIFJ     R
     A            KJIAAR    R
     A            KJIFJ     R
     A            FOIAAR    R
     A            FOIFJ     R
     A            REIAAR    R
     A            REIFJ     R
     A            RAIAAR    R
     A            RAIFJ     R
     A            BONGRL    R
     A            BONOPT    R
     A            AOIAAR    R
     A            AOIFJ     R
     A            DAOAAR    R
     A            DAOMND    R
     A            DAODAG    R
     A            RESTK     R
     A            KUTSKF    R
     A            TFAXNR    R
     A            OFKPOS    R
     A            ENDPOS    R
     A            TILBKD    R
     A            ORDVRD    R
     A            PGEBYR    R
