     A*__________________________________________
     A* SYSPED / KUNDER SOM IKKE SKAL PRISFORHØYES
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R KUPRR                     PFILE(KUPR)
     A                                      TEXT('PRISJUSTERTE')
     A          K FIRMA
     A          K SONAVN
