     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      *
     A          R BILDE
     A                                      CA03(03 'AVSLUTT')
     A                                  1  2'SYSPED/KVIE45R'
     A                                      COLOR(BLU)
     A                                  1 20'KONVERTER IE45'
     A                                      DSPATR(HI)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  5  4'FRA OG MED DATO:'
     A            WSDTF          6Y 0B  5 21DSPATR(UL)
     A  99
     AO 98                                  DSPATR(RI)
     A  99
     AO 98                                  DSPATR(PC)
     A                                  7  4'TIL OG MED DATO:'
     A            WSDTT          6Y 0B  7 21DSPATR(UL)
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                 23  2'F3=AVSLUTT'
     A                                      COLOR(BLU)
     A  99                             24  2'FRA OG MED DATO ER UGYLDIG.'
     A                                      COLOR(WHT)
     A  98                             24  2'TIL OG MED DATO KAN IKKE VÆRE TIDL-
     A                                      IGERE ENN FRA OG MED DATO.'
     A                                      COLOR(WHT)
     A  97                             24  2'TIL OG MED DATO ER UGYLDIG.'
     A                                      COLOR(WHT)
