     A*__________________________
     A* APF LETTER
     A*""""""""""""""""""""""""""
     A          R LETTR
     A            FILETT         8S 0
     A            FILINE         3S 0
     A            FI0001         4S 2
     A            FI0002         4S 2
     A            FI0003         4S 2
     A            FI0004         4S 2
     A            FITEXT        40
     A          K FILETT
     A          K FILINE
