     A*__________________________
     A* LEVERANDØRER
     A*""""""""""""""""""""""""""
     A          R LEVEBUR
     A            LEVNR          8S 0
     A          K LEVNR
