     A          R LEVTIDR
     A            LTKNR          8  0       COLHDG('KUNDE')
     A            LTPROD         1          COLHDG('PRODUCT')
     A            LTFLK          2          COLHDG('FraLK')
     A            LTFPN1         5          COLHDG('FraPostnr-start')
     A            LTFPN2         5          COLHDG('FraPostnr-slutt')
     A            LTTLK          2          COLHDG('TilLK')
     A            LTTPN1         5          COLHDG('TilPostnr-start')
     A            LTTPN2         5          COLHDG('TilPostnr-slutt')
     A            LTAVGD         7          COLHDG('Avg.dgr 1=ma,2=ti,..')
     A            LTFRFT         2  0       COLHDG('Framføringstid i dgr')
     A            LTFRTT         3  0       COLHDG('Framføringstid timer')
     A            LTSTMK         5          COLHDG('Kode for Start-tid')
     A            LTBOTI         4  0       COLHDG('Seneste BOOKTid')
     A            LTINTI         4  0       COLHDG('Seneste INNtid TERM')
     A            LTAVTI         4  0       COLHDG('Seneste AVGtid')
     A            LTLETI         4  0       COLHDG('Seneste LEVtid')
      *
     A          K LTKNR
     A          K LTPROD
     A          K LTFLK
     A          K LTFPN1
     A          K LTFPN2
     A          K LTTLK
     A          K LTTPN1
     A          K LTTPN2
