     A          R LHRATERR
     A            F1            20          COLHDG('DESTINATION')
     A            F2             8          COLHDG('CODE')
     A            F9             3          COLHDG('CY')
     A            F3            10          COLHDG('SERVICE')
     A            F4A            3S 0       COLHDG('M')
     A            F4B            2S 0       COLHDG('M')
     A            F5A            3S 0       COLHDG('M')
     A            F5B            2S 0       COLHDG('M')
     A            F6A            3S 0       COLHDG('M')
     A            F6B            2S 0       COLHDG('M')
     A            F7A            3S 0       COLHDG('M')
     A            F7B            2S 0       COLHDG('M')
     A            F8A            3S 0       COLHDG('M')
     A            F8B            2S 0       COLHDG('M')
     A          K F1
