     A          R LHRATERR
     A            F1            20          COLHDG('DESTINATION')
     A            F2             8          COLHDG('CODE')
     A            F9             3          COLHDG('CY')
     A            F3            10          COLHDG('SERVICE')
     A            FXX            1          COLHDG('BLANK')
     A            F4A            3S 0       COLHDG('M')
     A            F4X01          1          COLHDG('KOMMA1')
     A            F4B            2S 0       COLHDG('M')
     A            F4X02          1          COLHDG('KOMMA1')
     A            F5A            3S 0       COLHDG('M')
     A            F5X01          1          COLHDG('KOMMA1')
     A            F5B            2S 0       COLHDG('M')
     A            F5X02          1          COLHDG('KOMMA1')
     A            F6A            3S 0       COLHDG('M')
     A            F6X01          1          COLHDG('KOMMA1')
     A            F6B            2S 0       COLHDG('M')
     A            F6X02          1          COLHDG('KOMMA1')
     A            F7A            3S 0       COLHDG('M')
     A            F7X01          1          COLHDG('KOMMA1')
     A            F7B            2S 0       COLHDG('M')
     A            F7X02          1          COLHDG('KOMMA1')
     A            F8A            3S 0       COLHDG('M')
     A            F8X01          1          COLHDG('KOMMA1')
     A            F8B            2S 0       COLHDG('M')
     A          K F1
