     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 10 45 *NOMSGLIN)
     A                                      OVERLAY
      *
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  5  2VALUES(' ' '1' '9')
     A            GKPNR          8Y 0O  5  5EDTCDE(4)
     A            GKPSOK        10A  O  5 14
     A            GKGRP          8Y 0O  5 25EDTCDE(4)
     A            GKGSOK        10A  O  5 34
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0006)
     A                                      SFLPAG(0005)
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A                                      CA03(03 'Forrige')
     A                                      CA05(05 'Frisk')
     A                                      CA06(06 'LAGE NY')
     A                                      CA12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            ZRECNO         4S 0O  2 28SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'LL004R'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(30 YBC0949 SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(40 YBC0950 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(42 YBC0951 SYMSGF)
     A                                      COLOR(WHT)
     A            W2GRP          8Y 0B  4 25DSPATR(UL)
     A                                      EDTCDE(4)
     A            W2GSOK        10A  B  4 34DSPATR(UL)
     A            W2PSOK        10A  B  4 14DSPATR(UL)
      *
     A          R BUNN
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(10)
     A                                      CLRL(01)
     A                                      OVERLAY
     A N30                              1  2MSGCON(40 YBC0952 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        43A  O  1  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R NYWRK
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      CA03(03 'Forrige')
     A                                      CA05(05 'Frisk')
     A                                      CA06(06 'LAGE NY')
     A                                      CA12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'LL004R'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(30 YBC0949 SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(42 YBC0951 SYMSGF)
     A                                      COLOR(WHT)
     A            W2GRP          8Y 0B  4 25DSPATR(UL)
     A                                      EDTCDE(4)
     A            W2GSOK        10A  B  4 34DSPATR(UL)
     A            W2PSOK        10A  B  4 14DSPATR(UL)
     A                                 10  2MSGCON(40 YBC0952 SYMSGF)
     A                                      COLOR(BLU)
