     A          R LL018WR
     A            LHMN           7S 0       COLHDG('RECORDNR')
     A            LHOPR          1          COLHDG('MANUELT=M EDI=E')
     A            LHSTA          1          COLHDG('PLUKK-STATUS')
     A            LHPNR          8S 0       COLHDG('EDI-PARTS KUNDENR')
     A            VFHHK          3          COLHDG('KRT/HPL-KODE')
     A            LHTDT          8S 0       COLHDG('TRANSP.DATO')
     A            VFHSEK         3S 0       COLHDG('SEKVENS')
     A            VFHCNR        17          COLHDG('CONTAINER NR')
     A            VFHANR        15          COLHDG('ARTIKKELNR')
     A            VFHAN2        15          COLHDG('ALIASARTIKKELNR')
     A            VFHVB1        70          COLHDG('VAREBESKRIVELSE 1')
     A            VFHFAR        10          COLHDG('FARGE')
     A            VFHSIZ         5          COLHDG('SIZE')
     A            VFHPRI        13S 2       COLHDG('PRIS PR ART.')
      *
     A            VFHILA         1          COLHDG('FRA INTERSP.LAGER')
     A            VFHKLL         5S 0       COLHDG('ANT. KLL/BUNTER')
     A            VFHANT         5S 0       COLHDG('ANT. STK')
     A            VFHVEK         5S 0       COLHDG('VEKT.')
     A            VFHKUB         6S 3       COLHDG('KUB.METER')
     A            LHST1          1          COLHDG('KONTROLL-STATUS 1')
     A            LHST2          1          COLHDG('KONTROLL-STATUS 2')
     A            LHFLN         10          COLHDG('FORD.LISTE NR')
     A            LHALN          5S 0       COLHDG('ARB.LISTE NR')
     A            LHALG          5S 0       COLHDG('GML. ARB.LISTE NR')
     A            VFHZUN         9  0       COLHDG('ZEADF RECORDNR')
     A            LHAVD          4S 0       COLHDG('AVDELING')
     A            LHOPD          5S 0       COLHDG('OPPDR.NR')
      *
     A            VFVMON         7S 0       COLHDG('MOVEXORDRENR')
     A            VFVMOI         3S 0       COLHDG('MOVEXORDRE INDEX')
     A            VFVMDI         6S 0       COLHDG('MDI-FRAKT REF.')
     A            VFVOPR         1          COLHDG('MANUELT=M EDI=E')
     A            VFVALN         5S 0       COLHDG('ARB.LISTE NR')
     A            VFVBNC         8S 0       COLHDG('BUTIKKNR INTERSP')
     A            VFVBNR         5          COLHDG('BUTIKKNR')
     A            VFVBNA        30          COLHDG('BUTIKK-NAVN')
     A            VFVBA1        30          COLHDG('BUTIKK-ADR1')
     A            VFVBA2        30          COLHDG('BUTIKK-ADR2')
     A            VFVBA3        30          COLHDG('BUTIKK-ADR3')
     A            VFVKLL         5  0       COLHDG('ANT. KLL/BUNTER')
     A            VFVEKL         5  0       COLHDG('ANT. I "ENDE-KOLLI"')
     A            VFVANT         5  0       COLHDG('EDI  ANT. STK')
     A            VFWANT         5  0       COLHDG('BRUKT ANT STK')
     A            VFVVEK         6  1       COLHDG('EDI   VEKT.')
     A            VFWVEK         6  1       COLHDG('BRUKT VEKT.')
     A            VFVKUB         6  3       COLHDG('EDI   KUB.METER')
     A            VFWKUB         6  3       COLHDG('BRUKT KUB.METER')
     A            VFVPAK        10          COLHDG('PAKKSEDDELNR')
     A            LLFBN          3S 0       COLHDG('FRAKTBR.NR')
     A          K VFVMON
     A          K VFVMOI
     A          K VFVMDI
     A          K VFHSEK
     A          K VFHANR
     A          K LHTDT
