     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 10 60 *NOMSGLIN)
     A                                      OVERLAY
      *
     A          R SUBFIL                    SFL
     A            WSNR           1A  B  5  2VALUES(' ' '1')
     A            VAANR         15A  O  5  4
     A            LVVB          35A  O  5 20
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      WINDOW(WINDOWSZ)
     A                                      SFLSIZ(0006)
     A                                      SFLPAG(0005)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                      CA03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CA12(12 'Avslutt program')
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/LL024R'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(30 YBC1303 SYMSGF)
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  1 40SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2  2MSGCON(08 YBC1304 SYMSGF)
     A            USENR         25A  O  2 11DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(40 YBC1305 SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(58 YBC1306 SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                 10  2MSGCON(58 YBC1307 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        45A  O 10  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
