     A          R LL025FR
     A            L25GN         15A         COLHDG('GODS.NR')
     A            L25DTI         8S 0       COLHDG('INNL.DATUM')
     A            L25NTI         7S 0       COLHDG('INN KOLLI')
     A            L25MRN        18A         COLHDG('INKOMMANDE HANDLING')
     A            L25VKI        11S 3       COLHDG('INN VIKT')
     A            L25VB         35A         COLHDG('VARUBESKRIVNING')
     A            L25NA         35A         COLHDG('KUND')
     A            L25LC          3A         COLHDG('GODSLOKALKOD')
     A            L25DTU         8S 0       COLHDG('UT DATUM')
     A            L25PR          4A         COLHDG('FØRFARANDE KOD')
     A            L25TLL        18A         COLHDG('TULLID')
     A            L25NTU         7S 0       COLHDG('UT KOLLI')
     A            L25VKU        11S 3       COLHDG('UT VIKT')
     A            L25SALD        7S 0       COLHDG('SALDO')
     A            L25SNR1     1000A         COLHDG('SERIENR')
     A            L25SNR2     1000A         COLHDG('SERIENR')
     A            L25SNR3     1000A         COLHDG('SERIENR')
