     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      *
     A          R BILDE01
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CA03(03 'Avslutt program')
     A                                      CF04(04 'søking')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/LL034R'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(35 YBC1783 SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  5  2MSGCON(27 YBC1374 SYMSGF)
     A            WSGRUP         8Y 0B  5 30DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A                                  5 41MSGCON(35 YBC1375 SYMSGF)
     A                                  7  2MSGCON(27 YBC1376 SYMSGF)
     A            WSPNR          8Y 0B  7 30DSPATR(UL)
     A                                      EDTCDE(4)
     A  98                                  DSPATR(RI)
     A                                 10  2MSGCON(27 YBC1784 SYMSGF)
     A            WSDTF          6Y 0B 10 30DSPATR(UL)
     A                                      EDTCDE(4)
     A  97                                  DSPATR(RI)
     A                                 10 41MSGCON(10 YBC1786 SYMSGF)
     A                                 12  2MSGCON(27 YBC1785 SYMSGF)
     A            WSDTT          6Y 0B 12 30DSPATR(UL)
     A                                      EDTCDE(4)
     A  96                                  DSPATR(RI)
     A                                 12 41MSGCON(10 YBC1786 SYMSGF)
     A                                 17  2MSGCON(27 YBC1377 SYMSGF)
     A            WSPRT         10A  B 17 30DSPATR(UL)
     A                                 23  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(18 DIV0032 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A  30                                  COLOR(WHT)
     A            MSGNR          7A  P
