     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(5 2 13 72 *NOMSGLIN)
     A                                      OVERLAY
      *
     A          R BILDE01
     A                                      WINDOW(WINDOWSZ)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF12(12 'FORRIGE')
     A                                      OVERLAY
     A                                  1  2'SYSPED/LL035R'
     A                                      COLOR(BLU)
     A N27                              1 19'Vedlikehold av fritekst'
     A                                      DSPATR(HI)
     A  27                              1 19'Spørring på fritekst'
     A                                      DSPATR(HI)
     A                                  1 51DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 61TIME
     A                                      COLOR(BLU)
     A                                  2  2'Meldingsnr:'
     A            UMN            7Y 0O  2 14DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A            WSTX01        70A  B  3  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX02        70A  B  4  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX03        70A  B  5  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX04        70A  B  6  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX05        70A  B  7  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX06        70A  B  8  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX07        70A  B  9  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX08        70A  B 10  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX09        70A  B 11  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A            WSTX10        70A  B 12  2DSPATR(UL)
     A  27                                  DSPATR(PR)
     A                                 13  2'F3/F12=Avbryt'
     A                                      COLOR(BLU)
