     A          R LL044P1
     A                                  2  2MSGCON(45 YBC1507 SYMSGF)
     A                                  2 51MSGCON(16 YBC1508 SYMSGF)
     A            XIDAG          8  0   2 68EDTWRD('    .  .  ')
     A                                  3 51MSGCON(16 YBC1509 SYMSGF)
     A            XTID           4  0   3 68EDTWRD('  :  ')
     A                                  4 51MSGCON(16 YBC1510 SYMSGF)
     A            UDT            8  0   4 68EDTWRD('    .  .  ')
     A N41                              5  2MSGCON(11 YBC1511 SYMSGF)
     A N41        UGRUP          8  0   5 14EDTCDE(Z)
     A N41        XGNA          30A     5 23
     A                                  5 62MSGCON(05 YBC1512 SYMSGF)
     A                                  5 68PAGNBR
     A                                  6  2MSGCON(11 YBC1513 SYMSGF)
     A            UKJED          8  0   6 14EDTCDE(Z)
     A            KNAVN         30A     6 23
     A            ADR1          30A     7 23
     A            ADR2          30A     8 23
     A            POSTNR         4  0   9 23
     A            ADR3          24A     9 29
     A  55                             10  2MSGCON(15 YBC1806 SYMSGF)
     A  55        WSAG01         5A    10 18
     A  55        WSAG02         5A    10 24
     A  55        WSAG03         5A    10 30
     A  55        WSAG04         5A    10 36
     A  55        WSAG05         5A    10 42
     A  55                             10 52MSGCON(15 YBC1807 SYMSGF)
     A  55        WSEIER         5A    10 68
     A                                 11  2'-------------------------'
     A                                 11 27'-------------------------'
     A                                 11 52'-------------------------'
     A                                 11 77'---'
     A                                 12  2MSGCON(15 YBC1514 SYMSGF)
     A                                 12 22MSGCON(20 YBC1515 SYMSGF)
     A                                 13  2'-------------------------'
     A                                 13 27'-------------------------'
     A                                 13 52'-------------------------'
     A                                 13 77'---'
     A                                 14  2' '
      *
     A          R LL044P2
     A N42        L43L1          5A        2
     A            L43L2         20A       22SPACEA(1)
      *
     A          R LL044P3
     A                                     2'-------------------------'
     A                                    27'-------------------------'
     A                                    52'-------------------------'
     A                                    77'---'
     A                                      SPACEA(1)
     A                                     2MSGCON(38 YBC1516 SYMSGF)
     A                                    40'('
     A            X43L1          5A       41
     A                                    46'):'
     A            XTPOS          7  0     49EDTCDE(Z)
     A                                      SPACEA(1)
     A                                     2'========================='
     A                                    27'========================='
     A                                    52'========================='
     A                                    77'==='
     A                                      SPACEA(2)
      *
     A          R LL044P4
     A                                     2'-------------------------'
     A                                    27'-------------------------'
     A                                    52'-------------------------'
     A                                    77'---'
     A                                      SPACEA(1)
     A                                     2MSGCON(40 YBC1517 SYMSGF)
     A            XTPOSL         7  0     49EDTCDE(Z)
      *
     A          R LL044P5                   SPACEB(1)
     A N34                                 2'-------------------------'
     A N34                                27'-------------------------'
     A N34                                52'-------------------------'
     A N34                                77'---'
     A                                      SPACEA(1)
     A            XANTLT         7  0      2EDTCDE(Z)
     A            TKLLT          3A       12
     A            TKTXT         50A       16
     A            XANTEU         9  2     58EDTCDE(3)
     A                                    70'Euro-pall'
