********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr *Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
PXXXX * 01 YBC PTF7 VAREGRUPPE OG VAREERIER
PXXXX * 02 YBC PTF7 FLERE VALGMULIGHETER
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
      *
     A          R BILDE01
     A                                      CA03(03 'Exit')
     A                                      CF04(04 'Søk')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/LL043R'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(50 YBC1501 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2 72TIME
     A                                  5  3MSGCON(15 YBC1502 SYMSGF)
     A            WSGRUP         8Y 0B  5 20DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            NVNGRU        30   O  5 29COLOR(WHT)
     A                                  7  3MSGCON(15 YBC1503 SYMSGF)
     A            WSKJED         8Y 0B  7 20DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            NVNKJE        30   O  7 29COLOR(WHT)
     A                                  9  3MSGCON(15 YBC1504 SYMSGF)
     A            WSDT           8Y 0B  9 20DSPATR(UL)
     A  97                                  DSPATR(RI)
     A                                      EDTWRD('    .  .  ')
     A                                  9 32MSGCON(12 YBC1505 SYMSGF)
     A                                 11  3MSGCON(15 YBC1506 SYMSGF)
     A            WSPRT         10A  B 11 20DSPATR(UL)
     A  96                                  DSPATR(RI)
N02  A                                 14  3'Kun lagersted:'
N02  A            WSSD01         5A  B 14 20
N02  A            WSSD02         5A  B 14 26
N02  A            WSSD03         5A  B 14 32
N02  A            WSSD04         5A  B 14 38
N02  A            WSSD05         5A  B 14 44
N02  A                                 15  3'Kun lok.type:'
N02  A            WSLT01         3A  B 15 20
N02  A            WSLT02         3A  B 15 26
N02  A            WSLT03         3A  B 15 32
N02  A            WSLT04         3A  B 15 38
N02  A            WSLT05         3A  B 15 44
E02  A                                 16  3MSGCON(015 YBC1806 *LIBL/SYMSGF)
E02  A            WSAG01         5A  B 16 20
E02  A            WSAG02         5A  B 16 26
E02  A            WSAG03         5A  B 16 32
E02  A            WSAG04         5A  B 16 38
E02  A            WSAG05         5A  B 16 44
N01  A                                 17  3MSGCON(015 YBC1807 *LIBL/SYMSGF)
N01  A            WSEIER         5A  B 17 20
N02  A                                 18  3'Med pallfaktor:'
N02  A            WSOMRF         1A  B 18 20
N02  A                                 18 32'(J/N/B)'
     A                                 23  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(18 DIV0032 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
