     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 17 40 *NOMSGLIN)
     A                                      OVERLAY
      *
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  6  2VALUES(' ' '4')
     A            LULLOK        20A  O  6  5
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      SFLSIZ(0010)
     A                                      SFLPAG(0009)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A                                      CA03(03 'AVSLUTT')
     A                                      CA05(05 'Frisk')
     A                                      CA12(12 'FORRIGE')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A N50                              1  2MSGCON(38 YBC1715 SYMSGF)
     A                                      DSPATR(HI)
     A  50                              1  2MSGCON(38 JOV1347 SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(12 YBC1716 SYMSGF)
     A            UKD            5A  O  2 15DSPATR(UL)
     A                                      DSPATR(HI)
     A            WSTXT         18A  O  2 21DSPATR(UL)
     A                                  3  2MSGCON(30 YBC1717 SYMSGF)
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  3 36SFLRCDNBR
     A                                      DSPATR(ND)
     A N50                              4  2MSGCON(30 YBC1718 SYMSGF)
     A                                      DSPATR(HI)
     A  50                              4  2MSGCON(30 JOV1348 SYMSGF)
     A                                      DSPATR(HI)
     A            W2NR           1A  B  5  2VALUES(' ' '1')
     A            W2LLOK        20A  B  5  5DSPATR(UL)
      *
     A          R BUNN
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(16)
     A                                      CLRL(02)
     A                                      OVERLAY
     A                                  1  2MSGCON(38 YBC1719 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        38A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              2  2'(C) COPYRIGHT  SYSTEMA A/S  2001'
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R NYVARE
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      CA03(03 'AVSLUTT')
     A                                      CA12(12 'AVSLUTT')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A N50                              1  2MSGCON(38 YBC1715 SYMSGF)
     A                                      DSPATR(HI)
     A  50                              1  2MSGCON(38 JOV1347 SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(12 YBC1716 SYMSGF)
     A            UKD            5A  O  2 15DSPATR(UL)
     A                                      DSPATR(HI)
     A            WSTXT         18A  O  2 21DSPATR(UL)
     A                                  3  2MSGCON(30 YBC1717 SYMSGF)
     A                                      COLOR(BLU)
     A N50                              4  2MSGCON(30 YBC1718 SYMSGF)
     A                                      DSPATR(HI)
     A  50                              4  2MSGCON(30 JOV1348 SYMSGF)
     A            W2NR           1A  B  5  2VALUES(' ' '1')
     A            W2LLOK        20A  B  5  5DSPATR(UL)
     A                                 16  2MSGCON(38 YBC1719 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        38A  O 17  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             17  2'(C) COPYRIGHT  SYSTEMA A/S  2001'
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
