     A          R LL054P1
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
     A N46                              2  2MSGCON(40 YBC1606 SYMSGF)
     A  46                              2  2MSGCON(40 YBC1607 SYMSGF)
     A                                  2 65MSGCON(05 YBC1608 SYMSGF)
     A            XIDAG          6  0   2 71EDTWRD('  .  .  ')
     A                                  3 65MSGCON(05 YBC1609 SYMSGF)
     A                                  3 71PAGNBR
     A                                  4  2MSGCON(09 YBC1610 SYMSGF)
     A            GS≈≈           4  0   4 12
     A N45                              4 18MSGCON(06 YBC1611 SYMSGF)
     A N45        GSMM           2  0   4 25
     A  45                              4 18MSGCON(05 YBC1612 SYMSGF)
     A  45        GSUU           2  0   4 24
     A                                  5  2MSGCON(12 YBC1613 SYMSGF)
     A            UAVD           4      5 15
     A                                  5 21MSGCON(12 YBC1614 SYMSGF)
     A            UOPD           7      5 34
     A                                  5 43MSGCON(12 YBC1615 SYMSGF)
     A            UFN            7      5 56
     A                                  7  2'-------------------------'
     A                                  7 27'-------------------------'
     A                                  7 52'-------------------------'
     A                                  7 77'-'
     A                                  8  2MSGCON(45 YBC1616 SYMSGF)
     A                                  8 48MSGCON(10 YBC1617 SYMSGF)
     A                                  8 59MSGCON(08 YBC1618 SYMSGF)
     A                                  8 68MSGCON(10 YBC1619 SYMSGF)
     A                                  9  2'-------------------------'
     A                                  9 27'-------------------------'
     A                                  9 52'-------------------------'
     A                                  9 77'-'
     A                                 10  2' '
      *
     A          R LL054P2                   SPACEB(1)
     A            XKTXT         45A        2
     A            GSANT          9  2     48EDTCDE(3)
     A            GSPR           7  2     59EDTCDE(3)
     A            GSBL           9  2     68EDTCDE(3)
     A                                      SPACEA(1)
     A            KFTXT         50A        2
      *
     A          R LL054P3                   SPACEB(2)
     A                                     2'-------------------------'
     A                                    27'-------------------------'
     A                                    52'-------------------------'
     A                                    77'-'
     A                                      SPACEA(1)
     A                                     2MSGCON(10 YBC1620 SYMSGF)
     A            XTBL           9  2     68EDTCDE(3)
