     A          R LL062P1
     A            KFMT1         75      1  1
     A  88                              1 76'¤&l'
     A  88        COPY           2  0   1 79
     A  88                              1 81'X¤(s10H¤&l1O¤&a-3R'
     A            KFMT2         75      2  1
     A  88                              2 76'¤(12U¤(s0p10h0s3b4099T'
     A                                  3  2MSGCON(40 YBC1666 SYMSGF)
     A                                  3 85MSGCON(05 YBC1667 SYMSGF)
     A            XIDAG          6  0   3 91EDTCDE(Y)
     A                                  3101MSGCON(04 YBC1668 SYMSGF)
     A            XTID           4  0   3107EDTWRD('  :  ')
     A                                  4101MSGCON(05 YBC1669 SYMSGF)
     A                                  4108PAGNBR
     A                                  5  2MSGCON(11 YBC1670 SYMSGF)
     A            LHPNR          8  0   5 14EDTCDE(Z)
     A            KNAVN         30A     5 23
     A                                  5 61MSGCON(12 YBC1671 SYMSGF)
     A            XXDTF          6  0   5 74EDTCDE(Y)
     A                                  5 84MSGCON(12 YBC1672 SYMSGF)
     A            XXDTT          6  0   5 97EDTCDE(Y)
     A                                  6  2'-------------------------'
     A                                  6 27'-------------------------'
     A                                  6 52'-------------------------'
     A                                  6 77'-------------------------'
     A                                  6102'-------------'
     A                                  7  2MSGCON(08 YBC1673 SYMSGF)
     A                                  7 11MSGCON(10 YBC1674 SYMSGF)
     A                                  7 22MSGCON(30 YBC1675 SYMSGF)
     A                                  7 53MSGCON(04 YBC1676 SYMSGF)
     A                                  7 58MSGCON(08 YBC1677 SYMSGF)
     A                                  7 67MSGCON(08 YBC1678 SYMSGF)
     A                                  7 76MSGCON(08 YBC1679 SYMSGF)
     A                                  7 85MSGCON(30 YBC1680 SYMSGF)
     A                                  8  2'-------------------------'
     A                                  8 27'-------------------------'
     A                                  8 52'-------------------------'
     A                                  8 77'-------------------------'
     A                                  8102'-------------'
     A                                  9  2' '
      *
     A          R LL062P2                   SPACEB(1)
     A            XHMDT          6  0      2EDTCDE(Y)
     A            XHPAK         10A       11
     A            LHBNA         30A       22
     A            LHBPN          4  0     53
     A            LHWKUB         7  4     58EDTCDE(3)
     A            XHODT          6  0     67EDTCDE(Y)
     A            XHTDT          6  0     76EDTCDE(Y)
     A            LHMN01        30A       85
      *
     A          R LL062P3                   SPACEB(2)
     A                                     2'-------------------------'
     A                                    27'-------------------------'
     A                                    52'-------------------------'
     A                                    77'-------------------------'
     A                                   102'-------------'
     A                                      SPACEA(1)
     A                                     2MSGCON(10 YBC1681 SYMSGF)
     A            THWKUB         9  4     56EDTCDE(3)
