     A          R LL066P1
     A                                  2  2MSGCON(40 YBC1724 SYMSGF)
     A                                  2 50MSGCON(05 YBC1667 SYMSGF)
     A            XIDAG          6  0   2 56EDTCDE(Y)
     A                                  2 66MSGCON(04 YBC1668 SYMSGF)
     A            XTID           4  0   2 72EDTWRD('  :  ')
     A                                  3 66MSGCON(05 YBC1669 SYMSGF)
     A                                  3 73PAGNBR
     A                                  4  2MSGCON(11 YBC1670 SYMSGF)
     A            KUNDNR         8  0   4 14EDTCDE(Z)
     A            KNAVN         30A     4 23
     A                                  5  2MSGCON(11 YBC1725 SYMSGF)
     A            XTYP01         5A     5 14
     A            XTYP02         5A     5 20
     A            XTYP03         5A     5 26
     A            XTYP04         5A     5 32
     A            XTYP05         5A     5 38
     A            XTYP06         5A     5 44
     A            XTYP07         5A     5 50
     A            XTYP08         5A     5 56
     A            XTYP09         5A     5 62
     A            XTYP10         5A     5 68
     A                                  6  2'-------------------------'
     A                                  6 27'-------------------------'
     A                                  6 52'-------------------------'
     A                                  6 77'---'
     A                                  7  2MSGCON(15 YBC1727 SYMSGF)
     A                                  7 18MSGCON(25 YBC1728 SYMSGF)
     A                                  7 44MSGCON(08 YBC1729 SYMSGF)
     A                                  7 53MSGCON(08 YBC1730 SYMSGF)
     A                                  7 62MSGCON(08 YBC1731 SYMSGF)
     A                                  7 71MSGCON(10 YBC1732 SYMSGF)
     A                                  8  2'-------------------------'
     A                                  8 27'-------------------------'
     A                                  8 52'-------------------------'
     A                                  8 77'---'
     A                                 12  2' '
      *
     A          R LL066P2                   SPACEB(1)
     A            KFKOD          5A        2
     A            KFTXT         50A        8HIGHLIGHT
      *
     A          R LL066P3                   SPACEB(1)
     A            VAANR         15A        2
     A            VALLOK        25A       18
     A            XADATO         6  0     44EDTCDE(Y)
     A            XDLDAT         6  0     53EDTCDE(Y)
     A            VDLANT         7  0     62EDTCDE(L)
     A            VDBUSE        10        71
      *
     A          R LL066P4                   SPACEB(1)
     A                                     2'-------------------------'
     A                                    27'--------   S L U T T   --'
     A                                    52'-------------------------'
     A                                    77'---'
