      *
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      *
     A          R BILDE01
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CA03(03 'Avslutt program')
     A                                      CF04(04 'søking')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/LL065R'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(40 YBC1722 SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  5  2MSGCON(27 YBC1648 SYMSGF)
     A            WSGRUP         8Y 0B  5 30DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A                                  5 41MSGCON(35 YBC1649 SYMSGF)
     A                                  7  2MSGCON(27 YBC1650 SYMSGF)
     A            WSPNR          8Y 0B  7 30DSPATR(UL)
     A                                      EDTCDE(4)
     A  98                                  DSPATR(RI)
     A                                 10  2MSGCON(27 YBC1726 SYMSGF)
     A            WSTYP1         5A  B 10 30DSPATR(UL)
     A  97                                  DSPATR(RI)
     A            WSTYP2         5A  B 10 37DSPATR(UL)
     A  96                                  DSPATR(RI)
     A            WSTYP3         5A  B 10 44DSPATR(UL)
     A  95                                  DSPATR(RI)
     A            WSTYP4         5A  B 10 51DSPATR(UL)
     A  94                                  DSPATR(RI)
     A            WSTYP5         5A  B 10 58DSPATR(UL)
     A  93                                  DSPATR(RI)
     A            WSTYP6         5A  B 11 30DSPATR(UL)
     A  92                                  DSPATR(RI)
     A            WSTYP7         5A  B 11 37DSPATR(UL)
     A  91                                  DSPATR(RI)
     A            WSTYP8         5A  B 11 44DSPATR(UL)
     A  90                                  DSPATR(RI)
     A            WSTYP9         5A  B 11 51DSPATR(UL)
     A  89                                  DSPATR(RI)
     A            WSTYPA         5A  B 11 58DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                 18  2MSGCON(27 YBC1665 SYMSGF)
     A            WSPRT         10A  B 18 30DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                 23  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(18 DIV0032 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A  30                                  COLOR(WHT)
     A            MSGNR          7A  P
