     A          R LL080FR
     A            LHGRP          8S 0       COLHDG('Kundenr GRUPPE (VA)')
     A            LHPNR          8S 0       COLHDG('Kundenr VA-KJEDE')
     A            LHMN           7S 0       COLHDG('POSTNR')
     A            LLVN           3S 0       COLHDG('LINJENR')
     A          K LHGRP
     A          K LHPNR
     A          K LHMN
     A          K LLVN
