     A*%%TS  SD  20140702  221738  JOVO        REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A          R BILDE01
     A*%%TS  SD  20140702  221738  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(03)
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/LL081R'
     A                                      COLOR(BLU)
     A                                  1 21'Oppdatering av Tollreferanse(DK) e-
     A                                      ller '
     A                                      COLOR(WHT)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 21'Eksp./Løpenr(NO) v/uttak fra tolla-
     A                                      ger.'
     A                                      COLOR(WHT)
     A                                  2 61TIME
     A                                      COLOR(BLU)
     A                                  7  3'Faktura-nummer...........'
     A            WSFAKT        17A  B  7 30COLOR(YLW)
     A  51                                  DSPATR(RI)
     A  51                                  DSPATR(PC)
     A                                  9  3'Toldref. + procesure (DK):'
     A            WSTEKST       30A  B  9 30COLOR(YLW)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                 10 15'Eksempel'
     A                                 10 24'(DK)'
     A                                 10 30'2014212231978 P:3171000 '
     A                                 12  3'Eksp.enhet/Løpenummer(NO):'
     A            WSEKSP         6A  B 12 30COLOR(YLW)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A            WSLNR         10A  B 12 38COLOR(YLW)
     A  53                                  DSPATR(RI)
     A  53                                  DSPATR(PC)
     A                                 14  3'Overskriv evt gml løpenr.'
     A            WSOVER         1A  B 14 30COLOR(YLW)
     A                                 14 33'(J=JA, overskriv/retting)'
     A  50                             15  3'Eks/Lnr:'
     A                                      COLOR(WHT)
     A  50        GMEKSP         6A  O 15 12COLOR(YLW)
     A  50        GMLNR         10A  O 15 19COLOR(YLW)
     A  50                             15 30'er oppdatert på alle'
     A                                      COLOR(WHT)
     A  50        GMTSTA         2A  O 15 51COLOR(YLW)
     A  50                             15 54'-uttak'
     A                                      COLOR(WHT)
     A  50                             16  3'i faktura'
     A                                      COLOR(WHT)
     A  50        GMFAKT        17A  O 16 13COLOR(YLW)
     A  50                             18  3'Antall utaksposter oppdatert i den-
     A                                      ne runden:'
     A                                      COLOR(WHT)
     A  50        ANTLIN         9Y 0O 18 48COLOR(YLW)
     A                                      EDTCDE(3)
     A  50                             20  3'Tast inn ny oppdatering eller F3 f-
     A                                      or Avslutt....'
     A                                      COLOR(WHT)
     A                                 23  3MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                 11  5'eller..'
