     A*__________________________
     A* LAGER-journal DETALJ - AUTOMATISKE MOTLINJER
     A*""""""""""""""""""""""""""
     A          R LLADAUTR                   TEXT('LAGER-UTTAK')
     A            VDGRUP         8  0       COLHDG('Kundenr GRUPPE (VA)')
     A            VDKJED         8  0       COLHDG('Kundenr VA-KJEDE')
     A            VDHK           3          COLHDG('KRT/HPL')
     A            VDANR         15          COLHDG('Art.nr')
     A            VDFAR         10          COLHDG('FARGE')
     A            VDSIZ          5          COLHDG('SIZE')
     A            VDLENT         5  0       COLHDG('LEVERES ANTALL')
     A            VDLDAT         8  0       COLHDG('LEVERES DATO')
     A            VDREST         5  0       COLHDG('REST AV LEV.ANT.')
     A            VDAVD          4  0       COLHDG('AVD')
     A            VDOPD          7  0       COLHDG('OPPDR.NR')
     A            VDFBNR         3  0       COLHDG('FRAKTBR.NR')
     A            VDBUSE        10          COLHDG('BRUKER')
