     A          R LLADAUTR                  PFILE(LLADAUT)
     A                                      TEXT('LAGERJOUR')
     A          K VDGRUP
     A          K VDKJED
     A          O VDREST                    COMP(EQ 0)
