     A          R LLAGJR                    PFILE(LLAGJF)
     A                                      TEXT('LAGERJOUR')
     A          K VAGRUP
     A          K VAKJED
     A          K VAANR
     A          K VAULDT
     A          K VAHK
     A          K VAFAR
     A          K VASIZ
     A          O VASALD                    COMP(EQ 0)
