     A          R LLAGJDR                   PFILE(LLAGJD)
     A          K VDGRUP
     A          K VDKJED
     A          K VDMNL
     A          K VDVNL
