     A          R LLAGJR                    PFILE(LLAGJF)
     A                                      TEXT('LAGERJOUR')
     A          K VAGRUP
     A          K VAKJED
     A          K VAANR
     A          K VAHK
     A          K VADATO
     A          O VASALD                    COMP(EQ 0)
