     A          R LLAGJDR                   PFILE(LLAGJD)
     A          K VDGRUP
     A          K VDKJED
     A          K VDLDAT
     A          O VDLTYP                    VALUES('     ' 'PLIST')
