     A          R LLAGJER                   PFILE(LLAGJFE)
      *
     A          K VAGRUP
     A          K VAKJED
     A          K VAMN
     A          K EVTYPE
