     A          R LLAGJR                    PFILE(LLAGJF)
     A                                      TEXT('LAGERJOUR')
     A          K VAGRUP
     A          K VAKJED
     A          K VALLOK
     A          K VAANR
     A          K VADATO
