     A          R LLAGJER
     A            VAGRUP         8S 0       COLHDG('Kundenr GRUPPE (VA)')
     A            VAKJED         8S 0       COLHDG('Kundenr VA-Kjede')
     A            VAMN           7S 0       COLHDG('REC.NO (UNDER GR/KJ)')
     A            VAANR         15          COLHDG('Art.nr')
     A            VAVARE        35          COLHDG('Varebeskr')
     A            VAOPLK         2          COLHDG('Opprinnelses Landko.')
     A            VAFAR         10          COLHDG('FARGE')
     A            VAVERD         9S 2       COLHDG('Verdi pr enhet')
     A            VAVKT0         7S 2       COLHDG('VEKT NIVÅ-0')
     A            VAVKF0         7S 2       COLHDG('FRAKT-VEKT NIVÅ-0')
     A            VAKUB0         7S 4       COLHDG('KUBIKK NIVÅ-0')
     A            VABUSE        10          COLHDG('Behandlet userID')
     A            VABDAT         8S 0       COLHDG('Behandlet dato')
     A            VABKL          6S 0       COLHDG('Behandlet kl.')
      *
     A            FAKTXT        35A         COLHDG('TEKST')
     A            TARTXT        35A         COLHDG('TEKST')
     A            ITETXT        35A         COLHDG('TEKST')
      *
     A            EVSN           9S 0       COLHDG('SENDINGSNR')
     A            EVTYPE         1          COLHDG('DETALJE/TOTAL')
     A            EVBOND         1          COLHDG('TOLLAGER J/N')
     A            EVOANT         7S 0       COLHDG('Opplagt antall')
      *
