     A          R LLAGJEUR                  TEXT('TILLEGG EU')
     A            VAGRUP         8S 0       COLHDG('Kundenr GRUPPE (VA)')
     A            VAKJED         8S 0       COLHDG('Kundenr VA-Kjede')
     A            VAMN           7S 0       COLHDG('REC.NO (UNDER GR/KJ)')
      *
     A            VAOPLK         2          COLHDG('Opprinnelses Landko.')
     A            VAFVUE         3          COLHDG('Val Frakt utenf/EU')
     A            VAFRUE         9S 4       COLHDG('Frakt utenf EU/enhet')
     A            VAFVIE         3          COLHDG('Val Frakt innen/EU')
     A            VAFRIE         9S 4       COLHDG('Frakt innen EU/enhet')
      *
     A          K VAGRUP
     A          K VAKJED
     A          K VAMN
