     A          R LLAGJR                    PFILE(LLAGJF)
     A          K VAGRUP
     A          K VAKJED
     A          K VAANRL
     A          K VADATO
     A          K VAHK
     A          K VAFAR
     A          K VASIZ
     A          O VASALD                    COMP(EQ 0)
