     A          R LLAGJDR                   PFILE(LLAGJD)
     A          K VDGRUP
     A          K VDKJED
     A          K VDMN
     A          K VDVN
