     A          R LLAGJR                    PFILE(LLAGJF)
     A                                      TEXT('LAGERJOUR')
     A          K VAGRUP
     A          K VAKJED
     A          K VAMRNR
     A          O VASALD                    COMP(EQ 0)
