     A          R LLAGJER                   PFILE(LLAGJFE)
      *
     A          K VAGRUP
     A          K VAKJED
     A          K FAKTXT
     A          K VAANR
     A          K VAFAR
     A          K VAVERD
     A          K EVTYPE
