      *_________________________________
      * LAGER-journal DETALJ - MOTLINJER
      *"""""""""""""""""""""""""""""""""
     A          R LLAGJDR                   TEXT('LAGER-UTTAK')
     A            VDGRUP         8  0       COLHDG('Kundenr GRUPPE (VA)')
     A            VDKJED         8  0       COLHDG('Kundenr VA-Kjede')
     A            VDMN           7S 0       COLHDG('REC.NO I VALAJF')
     A            VDVN           3S 0       COLHDG('LINJENR INNEN REC')
     A            VDMNL          7S 0       COLHDG('REC.NO I LLLINE')
     A            VDVNL          3S 0       COLHDG('LINJENR I LLLINE')
     A            VDLANT         7S 0       COLHDG('LEVERT')
     A            VDSAE0         7S 0       COLHDG('Sal Aeh.0 (løse stk)')
     A            VDSAE1         5S 0       COLHDG('Saldo Alt. enh. 1')
     A            VDSAE2         5S 0       COLHDG('Saldo Alt. enh. 2')
     A            VDSAE3         5S 0       COLHDG('Saldo Alt. enh. 3')
     A            VDLDAT         8S 0       COLHDG('LEVERT dato')
     A            VDDAGE         5S 0       COLHDG('ANT LIGGEDAGER')
     A            VDAVD          4S 0       COLHDG('AVD')
     A            VDOPD          7S 0       COLHDG('OPPDR.NR')
     A            VDFBNR         3S 0       COLHDG('FRAKTBR.NR')
     A            VDTEXT        30          COLHDG('Fri tekst')
     A            VDBUSE        10          COLHDG('Behandlet userID')
     A            VDBDAT         8S 0       COLHDG('Behandlet dato')
     A            VDBKL          6S 0       COLHDG('Behandlet kl.')
     A            VDLTYP         5          COLHDG('LINJE TYPE')
     A            VDST           1          COLHDG('LINJE STATUS')
