     A          R LLAGJR                    PFILE(LLAGJF)
     A          K VAGRUP
     A          K VAKJED
     A          K VAEON
     A          K VAELN
     A          O VASALD                    COMP(EQ 0)
