     A          R LLBL1FR
     A            BLMRNR         5S 0       COLHDG('MOTTAKSRAP.NR')
     A            BLFIRM         2A         COLHDG('FIRMA')
     A            BLAAR          4S 0       COLHDG('ÅR')
     A            BLJN           5S 0       COLHDG('JOURNALNR')
     A            BLLN           8S 0       COLHDG('LEAVERANDØRSNR')
     A            BLAARB         4S 0       COLHDG('BEST.ÅR')
     A            BLBN           7S 0       COLHDG('BESTILLINGSNR')
      *
     A          K BLMRNR
