     A*__________________________
     A* LAGERKUNDEAVTALE
     A*""""""""""""""""""""""""""
     A          R LLGSFR
     A            GSST           1A         COLHDG('PRISTYPE')
     A            GSAVD          4S 0       COLHDG('AVDELING')
     A            GSOPD          7S 0       COLHDG('OPPDRAGSNR')
     A            GSLI           5S 0       COLHDG('LINJENR')
     A            GSFALI         5S 0       COLHDG('LINJENR TIL FAKTURA')
     A            GSMN           7S 0       COLHDG('REC.NO INNLEGGING')
     A            GSÅÅMU         6S 0       COLHDG('ÅR OG MÅNED/UKE')
     A            GSMMUU         1A         COLHDG('M=MÅNED, U=UKE')
     A            GSLLT          3A         COLHDG('LOKASJONSTYPE')
     A            GSLPT          3A         COLHDG('PRISTYPE')
     A            GSGEB          3A         COLHDG('GEBYRKODE')
     A            GSANT          9S 2       COLHDG('ANTALL')
     A            GSPR           7S 2       COLHDG('PRIS')
     A            GSBL           9S 2       COLHDG('BELØP')
     A            GSMVA          1A         COLHDG('MOMSKODE')
     A                                      VALUES('J' 'N')
     A            GSVAL          3A         COLHDG('VALUTAKODE')
F7   A            GSFN           7S 0       COLHDG('FAKTURANR')
     A            GSFDT          8S 0       COLHDG('FAKTURADATO')
