     A          R LLGSFR                    PFILE(LLGSF)
     A          K GSAVD
     A          K GSOPD
     A          K GSLI
     A          S GSFN                      COMP(EQ 0)
