     A*_____________________________________________
     A* LOGISTIKK/LAGERSYSTEM,  PLUKKLISTE - HEADING
     A*"""""""""""""""""""""""""""""""""""""""""""""
     A          R LLHEADR                   PFILE(LLHEAD)
     A          K LHGRP
     A          K LHPNR
     A          K LHODT
     A          K LHBPN
     A          O LHSTA                     VALUES('D')
