     A*_____________________________________________
     A* LOGISTIKK/LAGERSYSTEM,  PLUKKLISTE - HEADING
     A*"""""""""""""""""""""""""""""""""""""""""""""
     A          R LLHEADR                   PFILE(LLHEAD)
     A          K LHGRP
     A          K LHPNR
     A          K LHBNR
     A          K LHTDT
     A          K LHFLN
