     A*_____________________________________________
     A* LOGISTIKK/LAGERSYSTEM,  PLUKKLISTE - HEADING
     A*"""""""""""""""""""""""""""""""""""""""""""""
     A          R LLHEADR                   PFILE(LLHEAD)
     A          K LHAVD
     A          K LHOPD
