     A*_________________________________________________
     A* LOGISTIKK/LAGERSYSTEM,  PLUKKLISTE - TEKSTLINJER
     A*"""""""""""""""""""""""""""""""""""""""""""""""""
     A          R LLHTXTR
     A            LTMN           7S 0       COLHDG('REC.NO I LLHEAD')
     A            LTVN           3S 0       COLHDG('LINJENR INNEN REC')
     A            LTTXT         70          COLHDG('TEKSTLINJE')
     A          K LTMN
     A          K LTVN
