     A          R LLJUSDR
     A            LJMN           7S 0       COLHDG('REC.NO I LLAGJF')
     A            LJLN           3S 0       COLHDG('ENDRINGS-NR')
     A            LJEON         10A         COLHDG('EDI-ORDRENR')
     A            LJEOL          7S 0       COLHDG('EDI-ORDRENR')
     A            LJGINV        20A         COLHDG('GML INV.NR')
     A            LJGVAL         3A         COLHDG('GML VALUTA')
     A            LJGVRD         9S 2       COLHDG('GML ENH.VERDI')
     A            LJNINV        20A         COLHDG('NYTT INV.NR')
     A            LJNVAL         3A         COLHDG('NY VALUTA')
     A            LJNVRD         9S 2       COLHDG('NY ENH.VERDI')
     A            LJSTA1         1A         COLHDG('STATUS 1')
     A            LJS1DT         8S 0       COLHDG('DATO VED STAT1')
     A            LJSTA2         1A         COLHDG('STATUS 2')
     A            LJS2DT         8S 0       COLHDG('DATO VED STAT2')
      *
     A            LJDLNR         3S 0       COLHDG('LINJENR LLAGJD')
     A            LJDAVD         4S 0       COLHDG('AVD-SAD IMP')
     A            LJDOPD         7S 0       COLHDG('OPD SAD IMP')
     A            LJDDTG        10A         COLHDG('DATO GODKJENT')
     A            LJDTLE         6A         COLHDG('EKSP.STED')
     A            LJDTLL        10A         COLHDG('LØPENUMMER')
     A            LJDGN         15A         COLHDG('GODSNR')
     A            LJDART        15A         COLHDG('ART-NR')
     A            LJDANT         7S 0       COLHDG('LEVERT ANT')
     A            LJDVAL         3          COLHDG('VALUTA')
     A            LJDKUR         6S 3       COLHDG('KURS')
     A            LJDOMR         3S 0       COLHDG('OMR.FAKT')
     A            LJDLBG         9S 2       COLHDG('NOK LIN.BEL GM')
     A            LJDLBN         9S 2       COLHDG('NOK LIN.BEL NY')
      *
     A          K LJGINV
     A          K LJNINV
     A          K LJDAVD
     A          K LJDOPD
