     A          R LLKAFR                    PFILE(LLKAF)
     A          K KAGRUP
     A          K KAKJED
     A          K KATYPE
     A          K KALLT
     A          K KALPT
     A          K KADTUT
     A          S KATYPE                    COMP(EQ 'U')
