     A*__________________________
     A* LAGERKUNDEAVTALE
     A*""""""""""""""""""""""""""
     A          R LLKAFR
     A            KAGRUP         8S 0       COLHDG('Kundenr GRUPPE (VA)')
     A            KAKJED         8S 0       COLHDG('Kundenr VA-KJEDE')
     A            KATYPE         1A         COLHDG('INN/UT/LAGER')
     A                                      VALUES('I' 'U' 'A')
     A            KALLT          3A         COLHDG('LAGERLOKASJONSTYPE')
     A            KALPT          3A         COLHDG('PRISTYPE')
     A            KAGEB          3A         COLHDG('GEBYRKODE')
     A            KAPR           7S 2       COLHDG('PRIS')
     A            KAPRM          7S 2       COLHDG('MIN. PRIS')
     A            KAMDAG         2S 0       COLHDG('MIN. ANT. LIGGEDAGER')
     A            KADAG          2S 0       COLHDG('START DAGNR')
     A            KADTUT         8S 0       COLHDG('UTLØPSDATO')
     A            KAMVA          1A         COLHDG('MOMSKODE')
     A                                      VALUES('J' 'N')
     A            KAVAL          3A         COLHDG('VALUTAKODE')
