********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10028 * 01 YBC PTF10 RESTORDRE HÅNDTERING
********************************************************************
     A          R LLKUNFR
     A            KFKN           8S 0       COLHDG('Lagerkundenr')
      * FELLES
     A            KFFMVA         5S 0       COLHDG('VAREADR FOR MOTTAK')
     A            KFFAVA         5S 0       COLHDG('VAREADR FOR AVSENDER')
      * MOTTAKSRAPPORT
     A            KFMAVD         4S 0       COLHDG('DEFAULT AVDELING')
     A            KFMUR          1A         COLHDG('OPPDRAGSMODUL')
     A            KFMOT          2A         COLHDG('OPPDRAGSTYPE')
     A            KFMFR          3A         COLHDG('FRANKATUR')
     A            KFMVB          1A         COLHDG('STANDARD VAREBESKR.')
     A            KFMAFF         1A         COLHDG('AUTO FULLFØRE OPD')
     A            KFMFAK         1A         COLHDG('AUTOFAKTURA')
     A            KFMFKØ         1A         COLHDG('KØ I SAMLEFAKTURA')
     A            KFMMRS         1A         COLHDG('TVUNG MOT.RAP.ST.')
     A            KFMSO          1A         COLHDG('SORTERING')
N01  A            KFMRS1         1A         COLHDG('RESTORDRE')
N01  A            KFMRS2         1A         COLHDG('TILDEL RESTORDRE')
      * PLUKKLISTE
     A            KFPAVD         4S 0       COLHDG('DEFAULT AVDELING')
     A            KFPUR          1A         COLHDG('OPPDRAGSMODUL')
     A            KFPOT          2A         COLHDG('OPPDRAGSTYPE')
     A            KFPFR          3A         COLHDG('FRANKATUR')
     A            KFPVB          1A         COLHDG('STANDARD VAREBESKR.')
     A            KFPAFF         1A         COLHDG('AUTO FULLFØRE OPD')
     A            KFPFAK         1A         COLHDG('AUTOFAKTURA')
     A            KFPFKØ         1A         COLHDG('KØ I SAMLEFAKTURA')
     A            KFPFB          1A         COLHDG('FRAKTBREV')
     A            KFPML          1A         COLHDG('MERKELAPP')
     A            KFPPLS         1A         COLHDG('TVUNG PLUKKSTATUS')
     A            KFPRF          1A         COLHDG('PLUKK REKKEFLØLGE')
N01  A            KFPRES         1A         COLHDG('RESTORDRE')
      *
     A          K KFKN
