********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXX * 01 YBC PTF11 TO EKSTRA PARAMETRE FOR PRIS OG VALUTAKODE
********************************************************************
     A          R LLLINEER
     A            LLMN           7S 0       COLHDG('REC.NO I LLHEAD')
     A            LLVN           3S 0       COLHDG('LINJENR INNEN REC')
     A            LLANR         15          COLHDG('ARTIKKELNR')
     A            LLVB          35          COLHDG('VAREBESKRIVELSE')
      *
     A            ELPAK         17          COLHDG('FAKTURANR')
     A            ELTAR         17          COLHDG('TARIFFNR')
     A            ELITEM        35          COLHDG('ITEM-NR')
     A            ELSN           9S 0       COLHDG('SENDINGSNR')
     A            ELTYPE         1          COLHDG('DETALJE/TOTAL')
     A            ELBOND         1          COLHDG('TOLLAGER J/N')
     A            ELANT0         7S 0       COLHDG('Opplagt antall')
N01  A            ELEPR114      11S 4       COLHDG('Enhetspris')
N01  A            ELVAL          3A         COLHDG('Valutakode')
     A            ELBUSE        10          COLHDG('Behandlet userID')
     A            ELBDAT         8S 0       COLHDG('Behandlet dato')
     A            ELBKL          6S 0       COLHDG('Behandlet kl.')
