     A          R LLLISFR
     A            LIMN           7S 0       COLHDG('REC.NO (UNDER GR/KJ)')
     A            LILN           3S 0       COLHDG('LINJENR')
     A            LIKD           3A         COLHDG('KODE')
     A            LITXT         35A         COLHDG('TEKST')
     A            LIREFI         3A         COLHDG('TVINN REF.KODE')
     A            LIREFE         3A         COLHDG('TVINN REF.KODE')
     A            LIANT          5S 0       COLHDG('ANTALL')
      *
     A          K LIMN
     A          K LILN
