     A          R LLMRTR
     A            MTGRUP         8  0       COLHDG('Kundenr GRUPPE (VA)')
     A            MTKJED         8  0       COLHDG('Kundenr VA-Kjede')
     A            MTNR           5S 0       COLHDG('NESTE MOTTAKSRAPP.NR')
     A          K MTGRUP
     A          K MTKJED
