     A          R LLMRFR                    PFILE(LLMRF)
     A          K MRGRUP
     A          K MRKJED
     A          K MRMRNR
     A          S MRST                      COMP(NE ' ')
