     A          R LLMRFR
     A            MRST           1A         COLHDG('STATUS')
     A            MRGRUP         8  0       COLHDG('Kundenr GRUPPE (VA)')
     A            MRKJED         8  0       COLHDG('Kundenr VA-Kjede')
     A            MRMRNR         5  0       COLHDG('MOTTAKSRAPPORTNR')
     A            MRLNR         17A         COLHDG('LEVERANDØRSNR')
     A            MRLNA         30A         COLHDG('LEVERANDØRS NAVN')
     A            MRLAD1        30A         COLHDG('LEVERANDØRS ADR.1')
     A            MRLAD2        30A         COLHDG('LEVERANDØRS ADR.2')
     A            MRLPN          4S 0       COLHDG('LEVERANDØRS P.NR')
     A            MRLAD3        24A         COLHDG('LEVERANDØRS ADR.3')
     A            MRDT           8S 0       COLHDG('LEVERINGSDATO')
     A            MRTM           4S 0       COLHDG('LEVERINGSTID')
     A            MRLREF        25A         COLHDG('LEVERANDØRSREF.')
     A            MRKREF        25A         COLHDG('KUNDERSREF.')
     A            MRFT1         30A         COLHDG('FRITEKST 1')
     A            MRFT2         30A         COLHDG('FRITEKST 2')
     A            MRPTDF         4S 0       COLHDG('PÅBEGYNT TID')
     A            MRPTDT         4S 0       COLHDG('FERDIG TID')
     A            MRPSG         30A         COLHDG('SIGNATUR')
     A            MRGN          15A         COLHDG('GODSNR')
     A            MRTRNR        18A         COLHDG('MRN-NR')
     A            MRMOTT        15A         COLHDG('MOTTAKER')
     A          K MRGRUP
     A          K MRKJED
     A          K MRMRNR
