      *
      * LAGER-SYSTEM, SERIENR-FIL
      *
     A          R LLSERR
     A            SNST           1A         COLHDG('STATUS')
     A            SNGRP          8S 0       COLHDG('GRUPPES KUNDENR')
     A            SNPNR          8S 0       COLHDG('LAGERKUNDES K.NR')
     A            SNANR         15          COLHDG('ARTIKKELNR')
     A            SNSN          35A         COLHDG('SERIENR')
     A            SNTYPE         1A         COLHDG('LAGET UTTAK/INNLEGG')
     A            SNMNU          7S 0       COLHDG('REC.NR I LLHEAD')
     A            SNVNU          3S 0       COLHDG('LINJENR I LLLINE')
     A            SNMNI          7S 0       COLHDG('REC.NO I LLAGJF')
     A            SNVNI          3S 0       COLHDG('LINJENR I LLAGJD')
