     A                                      UNIQUE
     A          R LLSERR                    PFILE(LLSERF)
     A          K SNSN
     A          K SNANR
     A          S SNMNU                     VALUES(0)
