     A                                      UNIQUE
     A          R LLSERR                    PFILE(LLSERF)
     A          K SNGRP
     A          K SNPNR
     A          K SNANR
     A          K SNSN
     A          K SNMNU
