      *______________________
      * SYSPED / TOLLTARIFFNR
      *""""""""""""""""""""""
     A          R LLTARFR
     A            LTGRUP         8S 0       COLHDG('Kundenr GRUPPE (VA)')
     A            LTPNR          8S 0       COLHDG('Kundenr VA-KJEDE')
     A            LTANR         15A         COLHDG('ARTIKKELNR')
     A            LTLK           2A         COLHDG('LANDKODE')
     A            LTTANR        20A         COLHDG('TOLLTARIFFNR')
     A            LTFYL          2A         COLHDG('FYLKE')
     A            LTLKOP         2A         COLHDG('OPPR.LANDKODE')
     A            LTTO          17          COLHDG('TILLEGGSOPPLYSN.')
     A            LTCRI          3          COLHDG('KOMM.REF. IMPORT')
     A            LTCRE          3          COLHDG('KOMM.REF. EXPORT')
     A            LTMOT          1          COLHDG('MOTORVOGN FORTOLLING')
      *
     A          K LTGRUP
     A          K LTPNR
     A          K LTANR
     A          K LTLK
