     A*__________________________
     A* KODE FOR LOKASJONSTYPE
     A*""""""""""""""""""""""""""
     A          R LLTKFR
     A            TKLLT          3A         COLHDG('LAGERLOKASJONSTYPE')
     A            TKTXT         50A         COLHDG('BESKRIVELSE')
     A            TKOMRF         3S 2       COLHDG('FAKTOR')
     A          K TKLLT
