      *__________________________
      * UGYLDIGE LAGERLOKASJONER
      *""""""""""""""""""""""""""
     A          R LLULLFR
     A            LUKD           5A         COLHDG('LAGERKODE')
     A            LULLOK        20A         COLHDG('LAGERLOKASJON')
     A          K LUKD
     A          K LULLOK
