      *__________________________
      * VARE-REGISTER
      *""""""""""""""""""""""""""
     A          R LLVARER
     A            LVAKT          1A         COLHDG('AKTIV KODE')
     A            LVGRUP         8S 0       COLHDG('Kundenr GRUPPE (VA)')
     A            LVPNR          8S 0       COLHDG('Kundenr VA-KJEDE')
     A            LVLNR         17          COLHDG('Kundes leverandør')
     A            LVANR         15          COLHDG('ARTIKKELNR')
     A            LVANRL        15          COLHDG('LEVERANDØRSART.NR')
     A            LVVB          35          COLHDG('VAREBESKRIVELSE')
     A            LVAG01         5          COLHDG('ARTIKKEL GRUPPE 01')
     A            LVAG02         5          COLHDG('ARTIKKEL GRUPPE 02')
     A            LVAG03         5          COLHDG('ARTIKKEL GRUPPE 03')
     A            LVAG04         5          COLHDG('ARTIKKEL GRUPPE 04')
     A            LVAG05         5          COLHDG('ARTIKKEL GRUPPE 05')
     A            LVEIER         5          COLHDG('VAREEIER')
     A            LVANS         30          COLHDG('Ansvarlig innkjøper')
     A            LVEH0          3A         COLHDG('ENHETSKODE NIVÅ-0')
     A            LVEH0T        15A         COLHDG('BESKRIVELSE N.-0')
     A            LVVKT0         7S 2       COLHDG('VEKT NIVÅ-0')
     A            LVKUB0         7S 4       COLHDG('KUBIKK NIVÅ-0')
     A            LVVKF0         7S 2       COLHDG('FRAKT-VEKT NIVÅ-0')
     A            LVKUF0         7S 4       COLHDG('FRAKT-KUBIKK NIVÅ-0')
     A            LVEH1          3A         COLHDG('ENHETSKODE NIVÅ-1')
     A            LVEH1T        15A         COLHDG('BESKRIVELSE N.-1')
     A            LVVKT1         7S 2       COLHDG('VEKT NIVÅ-1')
     A            LVKUB1         7S 4       COLHDG('KUBIKK NIVÅ-1')
     A            LVVKF1         7S 2       COLHDG('FRAKT-VEKT NIVÅ-1')
     A            LVKUF1         7S 4       COLHDG('FRATK-KUBIKK NIVÅ-1')
     A            LVAN01         5S 0       COLHDG('ANT. I NIVÅ-0')
     A            LVEH2          3A         COLHDG('ENHETSKODE NIVÅ-2')
     A            LVEH2T        15A         COLHDG('BESKRIVELSE N.-2')
     A            LVVKT2         7S 2       COLHDG('VEKT NIVÅ-2')
     A            LVKUB2         7S 4       COLHDG('KUBIKK NIVÅ-2')
     A            LVVKF2         7S 2       COLHDG('FRAKT-VEKT NIVÅ-2')
     A            LVKUF2         7S 4       COLHDG('FRAKT-KUBIKK NIVÅ-2')
     A            LVAN02         5S 0       COLHDG('ANT. I NIVÅ-0')
     A            LVAN12         5S 0       COLHDG('ANT. I NIVÅ-1')
     A            LVEH3          3A         COLHDG('ENHETSKODE NIVÅ-3')
     A            LVEH3T        15A         COLHDG('BESKRIVELSE N.-3')
     A            LVVKT3         7S 2       COLHDG('VEKT NIVÅ-3')
     A            LVKUB3         7S 4       COLHDG('KUBIKK NIVÅ-3')
     A            LVVKF3         7S 2       COLHDG('FRAKT-VEKT NIVÅ-3')
     A            LVKUF3         7S 4       COLHDG('FRAKT-KUBIKK NIVÅ-3')
     A            LVAN03         5S 0       COLHDG('ANT. I NIVÅ-0')
     A            LVAN23         5S 0       COLHDG('ANT. I NIVÅ-2')
     A            LVMIN          5S 0       COLHDG('LAVESTE SALGSENH.')
     A            LVMEH          3A         COLHDG('ENHETSKODE')
     A            LVMSTK         5S 0       COLHDG('Minste verdi')
     A            LVBATC         1A         COLHDG('J/N ART.BATCHNR')
     A            LVDTU          1A         COLHDG('J/N UTLØPSDATO')
     A            LVTXT         40A         COLHDG('FRITEKST')
     A            LVSALD         7S 0       COLHDG('SALDO I STK.')
     A            LVLLOK        25          COLHDG('LAGERLOKASJON')
     A            LVBUSE        10          COLHDG('Behandlet userID')
     A            LVBDAT         8S 0       COLHDG('Behandlet dato')
     A            LVBKL          6S 0       COLHDG('Behandlet kl.')
     A            LVSN           1A         COLHDG('Krav på serienr')
     A            LVKTLI         1A         COLHDG('KONTROL INNLEGGING')
     A            LVDTP          1A         COLHDG('J/N PRODUKSJONSDATO')
     A            LVPLS          1A         COLHDG('PL ETTER INNL./UTLDT')
     A            LVPRI          9S 2       COLHDG('PRIS pr enhet')
     A            LVSPRI         9S 2       COLHDG('SALGSPRIS pr enhet')
     A            LVNTSN         2S 0       COLHDG('LENGDE PÅ SERIENR')
     A            LVPLOK        25          COLHDG('PLUKKLOKASJON')
     A            LVPMIN         5S 0       COLHDG('MIN. SALDO LOKASJON')
     A            LVPNTS         5S 0       COLHDG('ANTALL SUPPLERING')
