      *__________________________
      * VARE-REGISTER
      *""""""""""""""""""""""""""
     A          R LLVARER                   PFILE(LLVARE)
     A          K LVGRUP
     A          K LVPNR
     A          K LVANR
