      *_________________________
      * SYSPED / VAREBESKRIVELSE
      *"""""""""""""""""""""""""
     A          R LLVBFR
     A            VBGRUP         8S 0       COLHDG('Kundenr GRUPPE (VA)')
     A            VBPNR          8S 0       COLHDG('Kundenr VA-KJEDE')
     A            VBANR         15A         COLHDG('ARTIKKELNR')
     A            VBSK           2A         COLHDG('SPRÅKKODE')
     A            VBVB          35A         COLHDG('VAREBESKRIVELSE')
     A            VBHB1         35A         COLHDG('HOVEDBEST.')
     A            VBHB2         35A         COLHDG('HOVEDBEST.')
     A            VBUSER        10A         COLHDG('BRUKER')
     A            VBDT           8S 0       COLHDG('DATO SISTE ENRING')
     A            VBTD           6S 0       COLHDG('TID SISTE ENRING')
      *
     A          K VBGRUP
     A          K VBPNR
     A          K VBANR
     A          K VBSK
