     A          R LLW032R
     A            LHMN           7S 0       COLHDG('RECORDNR')
     A            LHOPR          1          COLHDG('MANUELT=M EDI=E')
     A            LHSTA          1          COLHDG('PLUKK-STATUS')
     A            LHST1          1          COLHDG('KONTROLL-STATUS 1')
     A            LHST2          1          COLHDG('KONTROLL-STATUS 2')
      * KUNDE/MOTTAKER-IDENTIFIKASJON
     A            LHGRP          8S 0       COLHDG('GRUPPES KUNDENR')
     A            LHPNR          8S 0       COLHDG('LAGERKUNDES K.NR')
     A            LHBNR         17          COLHDG('BUT.NR/INT. K.NR')
     A            LHBNA         30          COLHDG('BUTIKK-NAVN')
     A            LHBA1         30          COLHDG('BUTIKK-ADR1')
     A            LHBA2         30          COLHDG('BUTIKK-ADR2')
     A            LHBPN          4S 0       COLHDG('POSTNR NORGE')
     A            LHBA3         24          COLHDG('BUTIKK-ADR3')
     A            LHBLK          2          COLHDG('BUTIKK-LANDKODE')
     A            LHBPU          9          COLHDG('POSTNR UTLAND')
      * REFERANSER
     A            LHTDT          8S 0       COLHDG('TRANSP.DATO')
     A            LHFLN         17          COLHDG('LISTE NR(SAMLE-REF)')
     A            LHORDR        17          COLHDG('KUNDES ORDRENR')
     A            LHPAK         17          COLHDG('PAKKSEDDELNR')
     A            LHTN           8S 0       COLHDG('TRANSPORTØRSNR')
     A            LHPRKD         5A         COLHDG('PRODUKTKODE')
     A            LHALN          7S 0       COLHDG('INTERNT PLUKKLISTENR')
     A            LHALG          7S 0       COLHDG('GML. PL.LISTENR(INT)')
      *
     A            LHAVD          4S 0       COLHDG('AVDELING')
     A            LHOPD          7S 0       COLHDG('OPPDR.NR')
     A            LHFBN          3S 0       COLHDG('FR.BR.NR')
      * SUM.VERDIER FOR HELE ORDREN/PLUKKSEDDELEN
      * BASISENHET ER ALLTID STK.
     A            LHANT0         7  0       COLHDG('ANT. NIVÅ 0 (STK)')
      * LØSE STYKK
     A            LHANTL         7P 0       COLHDG('LØSE STYKK')
      * ALTERNATIV ENHET 1. - F.EKS.  ESKE
     A            LHANT1         5P 0       COLHDG('ANT. ALT. ENHET 1')
     A            LHAEH1         3          COLHDG('KODE ALT. ENHET 1')
      * ALTERNATIV ENHET 2. - F.EKS.  KARTONG
     A            LHANT2         5P 0       COLHDG('ANT. ALT. ENHET 2')
     A            LHAEH2         3          COLHDG('KODE ALT. ENHET 2')
      * ALTERNATIV ENHET 3. - F.EKS.  PALL
     A            LHANT3         5P 0       COLHDG('ANT. ALT. ENHET 3')
     A            LHAEH3         3          COLHDG('KODE ALT. ENHET 3')
      * SAMLET VEKT/KUBIKK
     A            LHVEK          7P 2       COLHDG('OPPGITT VEKT.')
     A            LHWVEK         7P 2       COLHDG('BENYTTET VEKT')
     A            LHKUB          7P 4       COLHDG('OPPGITT KUB.METER')
     A            LHWKUB         7P 4       COLHDG('BENYTTET KUB.METER')
     A            LLMN           7S 0       COLHDG('REC.NO I LLHEAD')
     A            LLVN           3S 0       COLHDG('LINJENR INNEN REC')
     A            LLANR         15          COLHDG('ARTIKKELNR')
     A            LLAN2         15          COLHDG('ALIASARTIKKELNR')
     A            LLVB          35          COLHDG('VAREBESKRIVELSE')
     A            LLHK           3          COLHDG('GODS/LAGERKODE')
     A            LLPRI         13P 2       COLHDG('PRIS PR ART.')
     A* HVIS SERIENR SKAL ANGIS MÅ ANTALL VÆRE 1
     A            LLSER         25          COLHDG('SERIENR')
     A            LLALLO         1          COLHDG('J=ALLOK. PÅ LAGER')
      * BASISENHET ER ALLTID STK.
     A            LLANT0         7P 0       COLHDG('ANT. STK BESTILT')
     A            LLWNT0         7P 0       COLHDG('ANT. STK LEVERT')
      * LØSE STYKK
     A            LLANTL         7P 0       COLHDG('LØSE STK BESTILT')
     A            LLWNTL         7P 0       COLHDG('LØSE STK LEVERT')
      * ALTERNATIV ENHET 1. - F.EKS.  ESKE
     A            LLANT1         5P 0       COLHDG('BES. ANT ALT. ENH 1')
     A            LLWNT1         5P 0       COLHDG('LEV. ANT ALT. ENH 1')
     A            LLAEH1         3          COLHDG('KODE ALT. ENHET 1')
     A            LLAEF1         5P 0       COLHDG('FAKTOR AEH1 ->STK')
      * ALTERNATIV ENHET 2. - F.EKS.  KARTONG
     A            LLANT2         5P 0       COLHDG('BES. ANT ALT. ENH 2')
     A            LLWNT2         5P 0       COLHDG('LEV. ANT ALT. ENH 2')
     A            LLAEH2         3          COLHDG('KODE ALT. ENHET 2')
     A            LLAEF2         5P 0       COLHDG('FAKTOR AEH2 ->STK')
      * ALTERNATIV ENHET 3. - F.EKS.  PALL
     A            LLANT3         5P 0       COLHDG('BES. ANT ALT. ENH 3')
     A            LLWNT3         5P 0       COLHDG('LEV. ANT ALT. ENH 3')
     A            LLAEH3         3          COLHDG('KODE ALT. ENHET 3')
     A            LLAEF3         5P 0       COLHDG('FAKTOR AEH3 ->STK')
      * SAMLET VEKT/KUBIKK FOR ARTIKKELEN
     A            LLVEK          7P 2       COLHDG('OPPGITT VEKT.')
     A            LLWVEK         7P 2       COLHDG('BENYTTET VEKT.')
     A            LLKUB          7P 4       COLHDG('OPPGITT KUB.METER')
     A            LLWKUB         7P 4       COLHDG('BENYTTET KUB.METER')
     A            LLLOK         25A         COLHDG('LAGERLOKASJON')
     A            LLNTLK         3P 0       COLHDG('ANTALL LOKASJONER')
     A            LLMKD          5A         COLHDG('KODE FOR MANKO')
     A            LLMTXT        35A         COLHDG('TEKST FOR MANKO')
      * PEKER TIL OPPDRAG/FRAKTBREV
     A            LLAVD          4S 0       COLHDG('AVDELING')
     A            LLOPD          7S 0       COLHDG('OPPDR.NR')
     A            LLFBN          3S 0       COLHDG('FR.BR.NR')
     A          K LHPNR
     A          K LHTDT
     A          K LHBNR
