     A          R VAFORWR
      *__________________
      * HODE OPPLYSNINGER
      *""""""""""""""""""
     A            V1004         35          COLHDG('Distr.l.nr')
     A            V1004A        10          COLHDG('Ordrenr+index')
     A            V0068         35          COLHDG('MDIfrakt-ref')
     A            V2782          8          COLHDG('Dokumentdato')
     A            V1153          3          COLHDG('Krt/Heng')
     A            V1154A        35          COLHDG('Distribusjonsrute')
     A            V1154B        35          COLHDG('Ordrenummer')
     A            V1154C        35          COLHDG('Krt/Heng Ref')
     A            V3039A        17          COLHDG('Avs. Kundenr.')
     A            V3036A        35          COLHDG('Avs. Navn')
     A            V3042A        35          COLHDG('Avs. Adresse')
     A            V3251A         9          COLHDG('Avs. Postnr.')
     A            V3164A        35          COLHDG('Avs. Poststed')
     A            V3207A         3          COLHDG('Avs. Land')
      *___________________
      * LINJE OPPLYSNINGER
      *"""""""""""""""""""
     A            V7722         35          COLHDG('Artikkelnr.')
     A            V7140         35          COLHDG('AliasArtikkelnr.')
     A            V7224          5S 0       COLHDG('Ant. kolli')
     A            V6314         18S 0       COLHDG('Ant. artikler')
     A            V7065          2          COLHDG('Godstype')
     A            V5004         18S 2       COLHDG('Pris')
     A            V4440A        10          COLHDG('Farge')
     A            V4440B        10          COLHDG('Størrelse')
     A            V4440C        70          COLHDG('Varebesk-1')
     A            V4440D        70          COLHDG('Varebesk-2')
     A            V4440E        70          COLHDG('Varebesk-3')
     A            V4440F        70          COLHDG('Varebesk-4')
     A            V4440G        70          COLHDG('Varebesk-5')
     A            V3039B        17          COLHDG('Mot. Kundenr.')
     A            V3036B        35          COLHDG('Mot. Navn')
     A            V3042B        35          COLHDG('Mot. Adresse')
     A            V3042C        35          COLHDG('Mot. Postadresse')
     A            V3251B         9          COLHDG('Mot. Postnr.')
     A            V3164B        35          COLHDG('Mot. Poststed')
     A            V3207B         3          COLHDG('Mot. Land')
     A            V1154D        35          COLHDG('Pakkseddel')
     A            V1154E        35          COLHDG('Lagerlokasjon')
     A            VFWHK          5          COLHDG('KRT/HPL-KODE')
     A            VFWILA         1          COLHDG('FRA INTERSP.LAGER')
     A            VVEKT          6S 1       COLHDG('VEKT')
     A            VKUBIK         6S 3       COLHDG('KUBIKK')
     A            VWMN           7S 0       COLHDG('MSG.NR')
      *_______
      * NØKKEL
      *"""""""
     A          K V3039A
     A          K VFWHK
     A          K VFWILA
     A          K V7722
     A          K V4440A
     A          K V4440B
     A          K V1004
