     A          R LLWW01R
     A            LWWGRU         8S 0       COLHDG('GRUPPE')
     A            LWWKN          8S 0       COLHDG('LAGERKUNDE')
     A            LWWART        15A         COLHDG('ARTIKKEL.')
     A            LWWDAT         8S 0       COLHDG('DATO')
     A            LWWTYP         1A         COLHDG('I=INNL/U=UTTAK')
     A            LWWANT         7S 0       COLHDG('ANTALL')
     A            LWWSAL         7S 0       COLHDG('RESTSALDO')
     A            LWWMN          7S 0       COLHDG('REC.NO I LLAGJF')
     A            LWWVN          3S 0       COLHDG('LIN. INNEN REC(V.U)')
     A            LWWLNR         5S 0       COLHDG('LØPENR')
     A          K LWWGRU
     A          K LWWKN
     A          K LWWART
     A          K LWWDAT
     A          K LWWLNR
