     A          R LLWW161R
     A            LW1GRP         8S 0       COLHDG('GRUPPE')
     A            LW1PNR         8S 0       COLHDG('LAGERKUNDE')
     A            LW1ALN         7S 0       COLHDG('PLUKKLISTENR')
     A            LW1ANR        15A         COLHDG('ARTIKKEL.')
     A            LW1MNU         7S 0       COLHDG('RECORDNR I LLHEAD')
     A            LW1VNU         3S 0       COLHDG('LINJENR I LLLINE')
     A            LW1WNT         7S 0       COLHDG('ANTALL')
     A            LW1PNT         7S 0       COLHDG('ANTALL PLUKKET')
     A            LW1MNI         7S 0       COLHDG('RECORDNR I LLAGJF')
     A            LW1VNI         3S 0       COLHDG('LINJENR I LLAGJD')
     A            LW1LC         25A         COLHDG('LOKASJON')
     A          K LW1MNU
     A          K LW1VNU
     A          K LW1ANR
     A          K LW1LC
