     A          R LLWW162R
     A            LW2MNU         7S 0       COLHDG('RECORDNR I LLHEAD')
     A            LW2VNU         3S 0       COLHDG('LINJENR I LLLINE')
     A            LW2MNI         7S 0       COLHDG('RECORDNR I LLAGJF')
     A            LW2VNI         3S 0       COLHDG('LINJENR I LLAGJD')
     A            LW2LC         25A         COLHDG('LOKASJON')
     A            LW2SN         35A         COLHDG('SERIENR')
     A          K LW2MNU
     A          K LW2VNU
     A          K LW2MNI
     A          K LW2VNI
