                R LOGUSRFR                  TEXT('LOGGFIL')
     A            USER          10          TEXT('BRUKER')
     A            PGM           10          TEXT('PROGRAM')
     A            DATO           8S 0       TEXT('DATO')
     A            DATOO          8S 0       TEXT('DATO OPPRETTET')
     A            ANTALL        11S 0       TEXT('ANTALL GANGER')
     A          K USER
     A          K PGM
