     A          R MAILPRTFR
     A            ARTXT         10          COLHDG('SKRFIL')
     A            ARTXT2        30          COLHDG('SKRTEXT')
     A          K ARTXT
