     A          R MAILWORKR
     A            SYAKOD         4          COLHDG('PRTKOD')
     A            SYATXT       132          COLHDG('TEKST')
