     A          R MCAWR                     TEXT('MC, AWB Fee')
      *
     A            MCAVD          4  0       COLHDG('Avdeling')
     A            MCOPD          7  0       COLHDG('Oppdrag')
     A            MCMCFE         3  0       COLHDG('MC Fee')
     A            MCAWFE         5  0       COLHDG('AWB Fee')
      *
     A          K MCAVD
     A          K MCOPD
