     A          R MENYFR
     A            MFPKT          3S 0       TEXT('MENY PUNKT')
     A                                      COLHDG('MENY PUNKT')
     A            MFTXT         50A         TEXT('MENY TEKST')
     A                                      COLHDG('MENY TEKST')
     A                                      CCSID(65535)
     A            MFTXTE        50A         TEXT('MENY ENGELSK TEKST')
     A                                      COLHDG('MENY TEKST')
     A                                      CCSID(65535)
     A          K MFPKT
