     A*__________________________
     A* SYSPED / MERKNADSJOURNAL
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R MERKNFR                   TEXT('MERKNADSJOURNAL')
     A            GOGN          15          COLHDG('GODSNUMMER')
     A            GOPOS          4S 0       COLHDG('POSNO')
     A            GOANTK         5S 0       COLHDG('ANTALL')
     A            GOVSLA        18          COLHDG('VARESLAG')
     A            GOTRNR        20          COLHDG('Transitt. nr')
     A            GOPOS2         4S 0       COLHDG('POS LAST')
     A            GOSTED        18          COLHDG('STED')
     A            GOMOTM        28          COLHDG('MOTTAGER')
     A            GOMERK        20          COLHDG('MERKNAD')
     A            GOMERB        20          COLHDG('MERKNAD')
     A            GOMERC        20          COLHDG('MERKNAD')
     A            GOMERD        20          COLHDG('MERKNAD')
     A            GOMER1         9          COLHDG('MERKNAD')
     A            GOMKOD         2          COLHDG('MERKNADSKODE')
     A          K GOGN
     A          K GOTRNR
     A          K GOPOS
