     A          R MINEAVDR
     A            MAUSER        10          COLHDG('USERID')
     A            MAAVD          4S 0       COLHDG('AVDELING')
      *
     A          K MAUSER
     A          K MAAVD
