     A          R MSGKR                     PFILE(MSGKP)
     A          K MSGKNR
     A          K MSGDKO
     A          K MSGDAT
     A          K MSGTID
