********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10005 * 01 YBC PTF10 TOLLSTEDSKODE ER ENDRE FRA 2.0 TIL 4.0
********************************************************************
     A* KODTAR RETTET ____________
     A*____________________________
     A* SYSPED / Koderegister  ALLE TYPER
     A*""""""""""""""""""""""""""""
     A*
     A***  KEY - 1    =   1 ALFA
     A***  KEY - 2    =   2 NUM
     A***  KEY - 3    =   2 NUM
     A***  KEY - 4    =   4 NUM
     A***  KEY - 5    =   2 ALFA
     A***  KEY - 6    =   3 ALFA
     A***  KEY - 7    =   5 ALFA
     A***  KEY - 8    =   4 ALFA
     A***  KEY - 9    =   1 ALFA
     A***  KEY - 10   =   3 NUM
     A***  KEY - 11   =   1 NUM
     A***  KEY - 12   =   2 ALFA
     A***  KEY - 13   =   3 ALFA
     A***  KEY - 14   =   3 NUM
     A***  KEY - 15   =   8 NUM
     A***  KEY - 16   =   8 NUM
     A***  KEY - 17   =   2 NUM
     A*
     A          R KO≈R                      PFILE(KODT≈)
     A          K KO≈UNI
     A          K KO≈CC
     A          K KO≈≈R
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KO≈MND
     A*
     A          R KOAR                      PFILE(KODTA)
     A          K KOAUNI
     A          K *NONE
     A          K *NONE
     A          K KOAAVD
     A*
     A          R KODTARR                   PFILE(KODTAR)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KARUNI
     A          K KARSDF
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KARSD
     A*
     A          R KODTDINR                  PFILE(KODTDIN)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KDIUNI
     A*
     A          R KODTDISR                  PFILE(KODTDIS)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KDSUNI
     A*
     A          R KOTMR                     PFILE(KODTERM)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KOTMUN
     A          K KOTMKO
     A*
     A          R KOFRR                     PFILE(KODTFR)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KFRUNI
     A          K KFRKOD
     A*
     A          R KODTFSR                   PFILE(KODTFS)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KFSUNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KFSFNR
     A*
     A          R KODTFTR                   PFILE(KODTFT)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KFTTYP
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KFTLN
     A*
     A          R KOGER                     PFILE(KODTGE)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KGEUNI
     A          K KGEKOD
     A*
     A          R KOG2R                     PFILE(KODTG2)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KG2UNI
     A          K KG2KOD
     A*
     A          R KOHR                      PFILE(KODTH)
     A          K KOHUNI
     A          K *NONE
     A          K *NONE
     A          K KOHAVD
     A*
     A          R KODTINPR                  PFILE(KODTINP)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KIPUNI
     A*
     A          R KOJ1R                     PFILE(KODTJ1)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KJ1UNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KJ1TYP
     A*
     A          R KOJ2R                     PFILE(KODTJ2)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KJ2UNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KJ2TYP
     A*
     A          R KOJ3R                     PFILE(KODTJ3)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KJ3UNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KJ3TYP
     A*
     A          R KOJ4R                     PFILE(KODTJ4)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KJ4UNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KJ4TYP
     A*
     A          R KOLBR                     PFILE(KODTLB)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KLBUNI
     A          K KLBKOD
     A*
     A          R KOLIKR                    PFILE(KODTLIK)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KLIUNI
     A          K KLIKOD
     A*
     A          R KODTLKR                   PFILE(KODTLK)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KLKUNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KLKLK
     A*
     A          R KOOTYR                    PFILE(KODTOTY)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KO1UNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KO1KOD
     A*
     A          R KOOT2R                    PFILE(KODTOT2)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KO2UNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KO2KOD
     A*
     A          R KOPR                      PFILE(KODTP)
     A          K KOPUNI
     A          K *NONE
     A          K *NONE
     A          K KOPAVD
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KOPLNR
     A*
     A          R KODTPBR                   PFILE(KODTPB)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KPBUNI
     A          K KPBSD
     A*
     A          R KODTPFR                   PFILE(KODTPF)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KPFUNI
     A          K KPFSDF
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KPFSD
     A          K KPFFNR
     A*
     A          R KODTPVR                   PFILE(KODTPV)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KPVFRA
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KPVTIL
     A*
     A          R KOSFR                     PFILE(KODTSF)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KOSFUN
     A          K KOSFSI
     A*
     A          R KODTTRR                   PFILE(KODTTR)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KTRAFI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KTRAK1
     A          K KTRAK2
     A*
     A          R KOTSTR                    PFILE(KODTTST)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KTSUNI
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
S01  A*         K KTSKOD
N01  A          K *NONE
N01  A          K KTSPNR
     A*
     A          R KOVR                      PFILE(KODTV)
     A          K KOVUNI
     A          K *NONE
     A          K *NONE
     A          K KOVAVD
     A*
     A          R KOVAR                     PFILE(KODTVA)
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K *NONE
     A          K KVAUNI
     A          K KVAKOD
     A*
     A          R KOWR                      PFILE(KODTW)
     A          K KOWUNI
     A          K *NONE
     A          K *NONE
     A          K KOWAVD
