     A          R NASSONR
     A            NASFRA         3          COLHDG('FRA')
     A            NASTIL         3          COLHDG('TIL')
     A            SONE           1S 0       COLHDG('SONE')
     A          K NASFRA
     A          K NASTIL
