********************************************************************
     A          R NAVAUTKR
     A            NAVKUNA        8S 0       COLHDG('KUNDNR AUTOFORT.')
     A            NAVLKA         1          COLHDG('LAND I ART.NR. J/N')
     A            NAVNTA         1          COLHDG('NORSK TARIFFNR J/N')
     A          K NAVKUNA
