********************************************************************
     A          R NAVAVDR
     A            KOAAVD         4S 0       TEXT('AVDELINGSNR')
     A            NAVSG          3          TEXT('ATT KODE')
     A          K KOAAVD
