     A*%%TS  SD  19990506  153839  JOVO        REL-V4R2M0  5769-PW1
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      HLPDOC('SYFA3101' 'SYFA31 ' 'SY400-
     A                                      LO/FELLES')
     A                                      HELP
     A                                      ALTHELP(CA01)
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  5  4VALUES(' ' '2' '4' '5')
N01  A  55                                  DSPATR(ND)
N01  A  55                                  DSPATR(PR)
     A            WSDT           6Y 0O  5  9EDTCDE(Y)
N01  A  55                                  DSPATR(ND)
     A            WSKODE         1A  O  5 18DSPATR(HI)
N01  A  55                                  DSPATR(ND)
     A            WSTXT         61A  O  5 20
     A            FRTLI          2Y 0H
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  19990506  153839  JOVO        REL-V4R2M0  5769-PW1
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SYFA31'
     A                                      COLOR(BLU)
     A N27                              1 19MSGCON(036 DIV2121 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  27                              1 19MSGCON(036 DIV2126 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 58DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 68TIME
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  1 75SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2 19MSGCON(009 DIV2122 *LIBL/SYMSGF)
     A            UAVD      R        O  2 29REFFLD(FREETXTR/FRTAVD SYSPEDF/FREE-
     A                                      TXT)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  2 34MSGCON(006 DIV1920 *LIBL/SYMSGF)
     A            UOPD      R        O  2 42REFFLD(FREETXTR/FRTOPD SYSPEDF/FREE-
     A                                      TXT)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A N27                              3  2MSGCON(033 DIV2123 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                              3  2MSGCON(030 DIV2124 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(078 JOV0876 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A* 27                                  CF03(03 'AVSLUTT')
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A N27N28                               CF06(06 'LAGE NY')
     A                                      CF12(12 'FORRIGE')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A* 27                              1  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                  1  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                           1 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              2 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R NYVARE
     A*%%TS  SD  19990506  153839  JOVO        REL-V4R2M0  5769-PW1
     A                                      CSRLOC(LINNBR     POSNBR)
     A  27                                  CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A N27                                  CF06(06 'LAGE NY')
     A                                      CF12(12 'FORRIGE')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYFA31'
     A                                      COLOR(BLU)
     A N27                              1 19MSGCON(036 DIV2121 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  27                              1 19MSGCON(036 DIV2126 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 58DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 68TIME
     A                                      COLOR(BLU)
     A                                  2 19MSGCON(009 DIV2122 *LIBL/SYMSGF)
     A            UAVD      R        O  2 29REFFLD(FREETXTR/FRTAVD SYSPEDF/FREE-
     A                                      TXT)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  2 34MSGCON(006 DIV1920 *LIBL/SYMSGF)
     A            UOPD      R        O  2 42REFFLD(FREETXTR/FRTOPD SYSPEDF/FREE-
     A                                      TXT)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A N27                              3  2MSGCON(033 DIV2123 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                              3  2MSGCON(030 DIV2124 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(078 JOV0876 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  27                             23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDE01
     A*%%TS  SD  19990506  110346  JOVO        REL-V4R2M0  5769-PW1
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF04(04 'SØK')
     A                                      CF10(10 'NESTE SIDE')
     A                                      CF12(12 'FORRIGE')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYFA31'
     A                                      COLOR(BLU)
     A N27                              1 19MSGCON(036 DIV2121 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  27                              1 19MSGCON(036 DIV2126 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 71TIME
     A                                      COLOR(BLU)
     A                                  2 19MSGCON(009 DIV2122 *LIBL/SYMSGF)
     A            UAVD      R        O  2 29REFFLD(FREETXTR/FRTAVD SYSPEDF/FREE-
     A                                      TXT)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  2 34MSGCON(006 DIV1920 *LIBL/SYMSGF)
     A            UOPD      R        O  2 42REFFLD(FREETXTR/FRTOPD SYSPEDF/FREE-
     A                                      TXT)
     A                                      DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  2 49MSGCON(005 DIV1296 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2 55EDTCDE(Y)
     A                                      DSPATR(HI)
     A            WKOD01         1A  B  3  2DSPATR(UL)
     A  51
     AO 27                                  DSPATR(PR)
     A            WKO001         2A  B  3  5
     A  51                                  DSPATR(PR)
     A N29        WSTX01        70A  B  3 10DSPATR(UL)
     A  51
     AO 27                                  DSPATR(PR)
     A  29        W2TX01        37A  B  3 10DSPATR(UL)
     A  51
     AO 27                                  DSPATR(PR)
     A  29        W3TX01        33A  B  3 48DSPATR(UL)
     A  51
     AO 27                                  DSPATR(PR)
     A            WKOD02         1A  B  4  2DSPATR(UL)
     A  52
     AO 27                                  DSPATR(PR)
     A            WKO002         2A  B  4  5
     A  52                                  DSPATR(PR)
     A N29        WSTX02        70A  B  4 10DSPATR(UL)
     A  52
     AO 27                                  DSPATR(PR)
     A  29        W2TX02        37A  B  4 10DSPATR(UL)
     A  52
     AO 27                                  DSPATR(PR)
     A  29        W3TX02        33A  B  4 48DSPATR(UL)
     A  52
     AO 27                                  DSPATR(PR)
     A            WKOD03         1A  B  5  2DSPATR(UL)
     A  53
     AO 27                                  DSPATR(PR)
     A            WKO003         2A  B  5  5
     A  53                                  DSPATR(PR)
     A N29        WSTX03        70A  B  5 10DSPATR(UL)
     A  53
     AO 27                                  DSPATR(PR)
     A  29        W2TX03        37A  B  5 10DSPATR(UL)
     A  53
     AO 27                                  DSPATR(PR)
     A  29        W3TX03        33A  B  5 48DSPATR(UL)
     A  53
     AO 27                                  DSPATR(PR)
     A            WKOD04         1A  B  6  2DSPATR(UL)
     A  54
     AO 27                                  DSPATR(PR)
     A            WKO004         2A  B  6  5
     A  54                                  DSPATR(PR)
     A N29        WSTX04        70A  B  6 10DSPATR(UL)
     A  54
     AO 27                                  DSPATR(PR)
     A  29        W2TX04        37A  B  6 10DSPATR(UL)
     A  54
     AO 27                                  DSPATR(PR)
     A  29        W3TX04        33A  B  6 48DSPATR(UL)
     A  54
     AO 27                                  DSPATR(PR)
     A            WKOD05         1A  B  7  2DSPATR(UL)
     A  55
     AO 27                                  DSPATR(PR)
     A            WKO005         2A  B  7  5
     A  55                                  DSPATR(PR)
     A N29        WSTX05        70A  B  7 10DSPATR(UL)
     A  55
     AO 27                                  DSPATR(PR)
     A  29        W2TX05        37A  B  7 10DSPATR(UL)
     A  55
     AO 27                                  DSPATR(PR)
     A  29        W3TX05        33A  B  7 48DSPATR(UL)
     A  55
     AO 27                                  DSPATR(PR)
     A            WKOD06         1A  B  8  2DSPATR(UL)
     A  56
     AO 27                                  DSPATR(PR)
     A            WKO006         2A  B  8  5
     A  56                                  DSPATR(PR)
     A N29        WSTX06        70A  B  8 10DSPATR(UL)
     A  56
     AO 27                                  DSPATR(PR)
     A  29        W2TX06        37A  B  8 10DSPATR(UL)
     A  56
     AO 27                                  DSPATR(PR)
     A  29        W3TX06        33A  B  8 48DSPATR(UL)
     A  56
     AO 27                                  DSPATR(PR)
     A            WKOD07         1A  B  9  2DSPATR(UL)
     A  57
     AO 27                                  DSPATR(PR)
     A            WKO007         2A  B  9  5
     A  57                                  DSPATR(PR)
     A N29        WSTX07        70A  B  9 10DSPATR(UL)
     A  57
     AO 27                                  DSPATR(PR)
     A  29        W2TX07        37A  B  9 10DSPATR(UL)
     A  57
     AO 27                                  DSPATR(PR)
     A  29        W3TX07        33A  B  9 48DSPATR(UL)
     A  57
     AO 27                                  DSPATR(PR)
     A            WKOD08         1A  B 10  2DSPATR(UL)
     A  58
     AO 27                                  DSPATR(PR)
     A            WKO008         2A  B 10  5
     A  58                                  DSPATR(PR)
     A N29        WSTX08        70A  B 10 10DSPATR(UL)
     A  58
     AO 27                                  DSPATR(PR)
     A  29        W2TX08        37A  B 10 10DSPATR(UL)
     A  58
     AO 27                                  DSPATR(PR)
     A  29        W3TX08        33A  B 10 48DSPATR(UL)
     A  58
     AO 27                                  DSPATR(PR)
     A            WKOD09         1A  B 11  2DSPATR(UL)
     A  59
     AO 27                                  DSPATR(PR)
     A            WKO009         2A  B 11  5
     A  59                                  DSPATR(PR)
     A N29        WSTX09        70A  B 11 10DSPATR(UL)
     A  59
     AO 27                                  DSPATR(PR)
     A  29        W2TX09        37A  B 11 10DSPATR(UL)
     A  59
     AO 27                                  DSPATR(PR)
     A  29        W3TX09        33A  B 11 48DSPATR(UL)
     A  59
     AO 27                                  DSPATR(PR)
     A            WKOD10         1A  B 12  2DSPATR(UL)
     A  60
     AO 27                                  DSPATR(PR)
     A            WKO010         2A  B 12  5
     A  60                                  DSPATR(PR)
     A N29        WSTX10        70A  B 12 10DSPATR(UL)
     A  60
     AO 27                                  DSPATR(PR)
     A  29        W2TX10        37A  B 12 10DSPATR(UL)
     A  60
     AO 27                                  DSPATR(PR)
     A  29        W3TX10        33A  B 12 48DSPATR(UL)
     A  60
     AO 27                                  DSPATR(PR)
     A            WKOD11         1A  B 13  2DSPATR(UL)
     A  61
     AO 27                                  DSPATR(PR)
     A            WKO011         2A  B 13  5
     A  61                                  DSPATR(PR)
     A N29        WSTX11        70A  B 13 10DSPATR(UL)
     A  61
     AO 27                                  DSPATR(PR)
     A  29        W2TX11        37A  B 13 10DSPATR(UL)
     A  61
     AO 27                                  DSPATR(PR)
     A  29        W3TX11        33A  B 13 48DSPATR(UL)
     A  61
     AO 27                                  DSPATR(PR)
     A            WKOD12         1A  B 14  2DSPATR(UL)
     A  62
     AO 27                                  DSPATR(PR)
     A            WKO012         2A  B 14  5
     A  62                                  DSPATR(PR)
     A N29        WSTX12        70A  B 14 10DSPATR(UL)
     A  62
     AO 27                                  DSPATR(PR)
     A  29        W2TX12        37A  B 14 10DSPATR(UL)
     A  62
     AO 27                                  DSPATR(PR)
     A  29        W3TX12        33A  B 14 48DSPATR(UL)
     A  62
     AO 27                                  DSPATR(PR)
     A            WKOD13         1A  B 15  2DSPATR(UL)
     A  63
     AO 27                                  DSPATR(PR)
     A            WKO013         2A  B 15  5
     A  63                                  DSPATR(PR)
     A N29        WSTX13        70A  B 15 10DSPATR(UL)
     A  63
     AO 27                                  DSPATR(PR)
     A  29        W2TX13        37A  B 15 10DSPATR(UL)
     A  63
     AO 27                                  DSPATR(PR)
     A  29        W3TX13        33A  B 15 48DSPATR(UL)
     A  63
     AO 27                                  DSPATR(PR)
     A            WKOD14         1A  B 16  2DSPATR(UL)
     A  64
     AO 27                                  DSPATR(PR)
     A            WKO014         2A  B 16  5
     A  64                                  DSPATR(PR)
     A N29        WSTX14        70A  B 16 10DSPATR(UL)
     A  64
     AO 27                                  DSPATR(PR)
     A  29        W2TX14        37A  B 16 10DSPATR(UL)
     A  64
     AO 27                                  DSPATR(PR)
     A  29        W3TX14        33A  B 16 48DSPATR(UL)
     A  64
     AO 27                                  DSPATR(PR)
     A            WKOD15         1A  B 17  2DSPATR(UL)
     A  65
     AO 27                                  DSPATR(PR)
     A            WKO015         2A  B 17  5
     A  65                                  DSPATR(PR)
     A N29        WSTX15        70A  B 17 10DSPATR(UL)
     A  65
     AO 27                                  DSPATR(PR)
     A  29        W2TX15        37A  B 17 10DSPATR(UL)
     A  65
     AO 27                                  DSPATR(PR)
     A  29        W3TX15        33A  B 17 48DSPATR(UL)
     A  65
     AO 27                                  DSPATR(PR)
     A            WKOD16         1A  B 18  2DSPATR(UL)
     A  66
     AO 27                                  DSPATR(PR)
     A            WKO016         2A  B 18  5
     A  66                                  DSPATR(PR)
     A N29        WSTX16        70A  B 18 10DSPATR(UL)
     A  66
     AO 27                                  DSPATR(PR)
     A  29        W2TX16        37A  B 18 10DSPATR(UL)
     A  66
     AO 27                                  DSPATR(PR)
     A  29        W3TX16        33A  B 18 48DSPATR(UL)
     A  66
     AO 27                                  DSPATR(PR)
     A            WKOD17         1A  B 19  2DSPATR(UL)
     A  67
     AO 27                                  DSPATR(PR)
     A            WKO017         2A  B 19  5
     A  67                                  DSPATR(PR)
     A N29        WSTX17        70A  B 19 10DSPATR(UL)
     A  67
     AO 27                                  DSPATR(PR)
     A  29        W2TX17        37A  B 19 10DSPATR(UL)
     A  67
     AO 27                                  DSPATR(PR)
     A  29        W3TX17        33A  B 19 48DSPATR(UL)
     A  67
     AO 27                                  DSPATR(PR)
     A            WKOD18         1A  B 20  2DSPATR(UL)
     A  68
     AO 27                                  DSPATR(PR)
     A            WKO018         2A  B 20  5
     A  68                                  DSPATR(PR)
     A N29        WSTX18        70A  B 20 10DSPATR(UL)
     A  68
     AO 27                                  DSPATR(PR)
     A  29        W2TX18        37A  B 20 10DSPATR(UL)
     A  68
     AO 27                                  DSPATR(PR)
     A  29        W3TX18        33A  B 20 48DSPATR(UL)
     A  68
     AO 27                                  DSPATR(PR)
     A            WKOD19         1A  B 21  2DSPATR(UL)
     A  69
     AO 27                                  DSPATR(PR)
     A            WKO019         2A  B 21  5
     A  69                                  DSPATR(PR)
     A N29        WSTX19        70A  B 21 10DSPATR(UL)
     A  69
     AO 27                                  DSPATR(PR)
     A  29        W2TX19        37A  B 21 10DSPATR(UL)
     A  69
     AO 27                                  DSPATR(PR)
     A  29        W3TX19        33A  B 21 48DSPATR(UL)
     A  69
     AO 27                                  DSPATR(PR)
     A            WKOD20         1A  B 22  2DSPATR(UL)
     A  70
     AO 27                                  DSPATR(PR)
     A            WKO020         2A  B 22  5
     A  70                                  DSPATR(PR)
     A N29        WSTX20        70A  B 22 10DSPATR(UL)
     A  70
     AO 27                                  DSPATR(PR)
     A  29        W2TX20        37A  B 22 10DSPATR(UL)
     A  70
     AO 27                                  DSPATR(PR)
     A  29        W3TX20        33A  B 22 48DSPATR(UL)
     A  70
     AO 27                                  DSPATR(PR)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV2127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 66MSGCON(005 DIV1297 *LIBL/SYMSGF)
     A            WSSIDE         1Y 0O 23 73DSPATR(HI)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N30                             24 42MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGNR          7A  P
     A                                  2  1MSGCON(017 JOV0875 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R BILDE00
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(03 'Avslutt program')
     A                                  1  2'SYSPED/SYFA31'
     A                                      COLOR(BLU)
     A N27                              1 19MSGCON(036 DIV2121 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  27                              1 19MSGCON(036 DIV2126 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 58DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                 11 15MSGCON(018 DIV0600 *LIBL/SYMSGF)
     A            UAVD      R        B 11 35REFFLD(FREETXTR/FRTAVD SYSPEDF/FREE-
     A                                      TXT)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A  30                                  DSPATR(PC)
     A  30                                  DSPATR(RI)
     A                                 13 15MSGCON(018 DIV0601 *LIBL/SYMSGF)
     A            UOPD      R        B 13 35REFFLD(FREETXTR/FRTOPD SYSPEDF/FREE-
     A                                      TXT)
     A                                      DSPATR(UL)
     A  30                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A N30                             23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30                             24  1MSGCON(078 SPO0002 *LIBL/SYMSGF)
