     A*___________________________
     A* SYSPED / AVGANGSFLYPLASSER FOR OPPDATERING
     A*"""""""""""""""""""""""""""
     A          R NOFLYPJR
     A*
     A            FLKODE         3          TEXT('STEDSKODE')
     A          K FLKODE
