     A          R NYEPR
     A            NPKODE         2          COLHDG('Kode')
      *                                     GV= Adressen er en gate/vei-adresse
      *                                     PB= Adressen er en postboksadresse
      *                                     PS= Adressen viser til et postkontor
      *                                     ST= Adressen er en stedsadresse
     A            NPGML          4          COLHDG('Postnr, gammelt')
     A            NPADRG        32          COLHDG('Adresse, fammel')
     A            NPADR2         4          COLHDG('Ekstra_adresse')
      *                                     GV=Husnummer
      *                                     PB=Postboks
      *                                     PS=Ikke utf
      *                                     ST=Ikke utf
     A            NPHUS          4          COLHDG('Husnummer')
     A            NPOPP          3          COLHDG('Oppgang')
     A            NPNY           4          COLHDG('Postnr, nytt')
     A            NPADRN        32          COLHDG('Adresse, ny')
