     A*__________________________
     A* SYSPED400 REGISTER FOR OMDISPONERING
     A*""""""""""""""""""""""""""
     A          R OMDIR
     A            OMAVD          4S 0       COLHDG('AVD')
     A            OMOPD          7S 0       COLHDG('OPPDRAGSNUMMER')
     A            OMTUAF         4S 0       COLHDG('FRA AVD. TURNUMMER')
     A            OMTURF         8S 0       COLHDG('FRA TURNUMMER')
     A            OMRUNF         8S 0       COLHDG('FRA RUNDTUR')
     A            OMTUAT         4S 0       COLHDG('TIL AVD. TURNUMMER')
     A            OMTURT         8S 0       COLHDG('TIL TUR')
     A            OMRUNT         8S 0       COLHDG('TIL RUNDTUR')
     A          K OMAVD
     A          K OMOPD
