     A*____________________________
     A* SYSPED / PALLEBYTTE-SYSTEM STANDARDVERDIER/TELLEVERK
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R PALFIRR
     A            PFLØNR         7S 0       TEXT('LØPENR DETALJPOSTER')
     A            PFPUNR         7S 0       TEXT('PURRENR')
     A            PFBUNR         7S 0       TEXT('BUNTNR')
     A            PFPKKR         1          TEXT('KRAV OM MAUELL PA.KV.NR')
     A            PFOAVD         4S 0       TEXT('AVD. AVR.OPPDRAG')
     A            PFOT           2          TEXT('*IKKE I BRUK***')
     A            PFFRAN         3          TEXT('*IKKE I BRUK***')
     A            PFVK           3          TEXT('VAREKODE  AVR.OPPDR')
     A            PFBTAB         1          TEXT('BR.TABELL PALLEPRIS')
     A            PFPRIN        10          TEXT('PRINTER/UTKØ')
     A            PFHT1         79          TEXT('HODE LINJE-1')
     A            PFHT2         79          TEXT('HODE LINJE-2')
     A            PFHT3         79          TEXT('HODE LINJE-3')
     A            PFHT4         79          TEXT('HODE LINJE-4')
     A            PFHT5         79          TEXT('HODE LINJE-5')
     A            PFHT6         79          TEXT('HODE LINJE-6')
     A            PFHT7         79          TEXT('HODE LINJE-7')
     A            PFPT1         79          TEXT('PURRETEKST LINJE-1')
     A            PFPT2         79          TEXT('PURRETEKST LINJE-2')
     A            PFPT3         79          TEXT('PURRETEKST LINJE-3')
     A            PFPT4         79          TEXT('PURRETEKST LINJE-4')
     A            PFPT5         79          TEXT('PURRETEKST LINJE-5')
     A            PFPT6         79          TEXT('PURRETEKST LINJE-6')
     A            PFPT7         79          TEXT('PURRETEKST LINJE-7')
