     A*____________________________
     A* SYSPED / PALLEBYTTE-SYSTEM,SORT: BUNTNR/KVITT.NR
     A*""""""""""""""""""""""""""""
     A          R PALLDR                    PFILE(PALLD)
     A          K PALØNR
