     A*____________________________
     A* SYSPED / PALLEBYTTE-SYSTEM,SORT: PART/KV.DT./KV.NR/LØNR
     A*""""""""""""""""""""""""""""
     A          R PALLDR                    PFILE(PALLD)
     A          K PAPPNR
     A          K PAKVDT
     A          K PAKVNR
     A          K PALØNR
