     A*____________________________
     A* SYSPED / PALLEBYTTE-SYSTEM,SORT: KVITT.NR
     A*""""""""""""""""""""""""""""
     A          R PALLDR                    PFILE(PALLD)
     A          K PASTAT
     A          K PAKVNR
