     A*____________________________
     A* SYSPED / PALLEBYTTE-SYSTEM DETALJPOSTER - SORT: AVD/OPPD
     A*""""""""""""""""""""""""""""
     A          R PALLDR                    PFILE(PALLD)
     A          K PAAVD
     A          K PAOPD
