     A*____________________________
     A* SYSPED / PALLEBYTTE-SYSTEM,SORT: KVITT.NR/LØNR
     A*""""""""""""""""""""""""""""
     A          R PALLDR                    PFILE(PALLD)
     A          K PAKVNR
