     A*____________________________
     A* SYSPED / PALLEBYTTE-SYSTEM,SORT: STATUS/USER/BUNTNR/KVITT.NR
     A*""""""""""""""""""""""""""""
     A          R PALLDR                    PFILE(PALLD)
     A          K PASTAT
     A          K PAUSER
     A          K PABUNR
     A          K PAKVNR
