     A*____________________________
     A* SYSPED / PALLEBYTTE-SYSTEM,
     A*""""""""""""""""""""""""""""
     A          R PALLDR                    PFILE(PALLD)
     A          K PAPPNR
     A          K PABILN
     A          K PAKVDT
     A          K PAKVNR
