     A*__________________________
     A* SYSPED400 PALLEBYTTESYSTEM - PARTS-REGISTER
     A*""""""""""""""""""""""""""
     A          R PAPAR                     PFILE(PAPA)
     A          K PPALFA
