     A*__________________________
     A* SYSPED400 PALLEBYTTESYSTEM - PARTS-REGISTER
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R PAPAR
     A            PPNR      R               REFFLD(KN)
     A                                      COLHDG('PALLEPARTS-NR')
     A            PPKUNR    R               REFFLD(KN)
     A                                      COLHDG('KUNDENR')
     A            PPNAVN        30          COLHDG('NAVN')
     A            PPALFA        10          COLHDG('SØKEFELT FRA KUNDF')
     A            PPKATE         1          COLHDG('BEHANDLINGSKETEGORI')
     A            PPSALP         7S 0       TEXT('SALDO SISTE KTO.UTD')
     A            PPSPDT         8S 0       TEXT('DATO SISTE KTO-UTD')
     A            PPSTDT         8S 0       TEXT('T.O.M DT SISTE KTO-UTD')
     A            PPSALT         7S 0       TEXT('PALLESALDO TOTALT')
     A            PPAVRE         7S 0       TEXT('PALLER AVREGNET')
     A            PPSADT         8S 0       TEXT('SIST AVREGNET ÅÅMMDD')
     A            PPTRNR    R               REFFLD(KN)
     A                                      COLHDG('TRANSP.NR')
     A          K PPNR
