     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(7  1 2 70 *NOMSGLIN)
     A                                      OVERLAY
      *
     A          R BILDE01
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(03 'Avslutt program')
     A                                  1  1'Tast på hyperkobling for å se på d-
     A                                      okumentet i pdfformat'
     A                                  1 61'F3=avslutt'
     A                                      COLOR(BLU)
     A            LINK          70A  O  2  1COLOR(BLU)
     A                                      DSPATR(UL)
