     A          R BRIDFR
     A            PLSTAT         1A         TEXT('STATUS')
     A            PLGRP          8S 0       TEXT('GRUPPE')
     A            PLKUN          8S 0       TEXT('KUNDE')
     A            PLKUKU        17A         TEXT('KUNDES-KUNDE')
     A            PLART         15A         TEXT('ART.NR')
     A            PLANT          5S 0       TEXT('ANTALL')
     A            PLDT           8S 0       TEXT('DATO PÅBEGYNT/SENDT')
     A            PLTID          6S 0       TEXT('TID PÅBEGYNT/SENDT')
     A            PLBRID        10A         TEXT('BRUKER-ID')
     A          K PLSTAT
     A          K PLGRP
     A          K PLKUN
     A          K PLKUKU
     A          K PLART
