     A          R PONRGAR
     A            GATE          30A         COLHDG('GATE/VEI')
     A            STED          30A         COLHDG('STED')
     A            PONR           4A         COLHDG('POSTNUMMER')
     A            STED2         30A         COLHDG('STED2')
     A          K GATE
