     A          R POSAR                     PFILE(POSAF)
     A                                      TEXT('Posteringsregister heading')
     A          K FIRMA
     A          K PERAAR
     A          K PERNR
