     A                                      REF(IBMFRF)
     A          R POSBR
     A            AKTKOD    R
     A            FIRMA     R
     A            BILNR     R
     A            POSNR     R
     A            BILAAR    R
     A            BILMND    R
     A            BILDAG    R
     A            PERAAR    R
     A            PERNR     R
     A            VALKOD    R
     A            VALKU1    R
     A            TYPE      R
     A            BILKOD    R
     A            BILTXT    R
     A            RESNR     R
     A            KONTO     R
     A            KSTED     R
     A            KBARER    R
     A            MOMSK     R
     A            BBELOP    R
     A            VALKOX    R
     A            BELOPV    R
     A            ANT       R
     A            ENHET     R
     A            PROSNR    R
     A            REFNR     R
     A            KRNR      R
     A            KRDAAR    R
     A            KRDMND    R
     A            KRDDAG    R
     A            FFDAAR    R
     A            FFDMND    R
     A            FFDDAG    R
     A            BETBET    R
     A            ATTEST    R
     A            KRYSS     R
     A            OPDKOD    R
     A            RECNR     R
     A            BILNRE    R
     A            NOKKEL    R
     A            AGIO      R
     A            DELKOD    R
     A            LKID      R
     A            FKUND     R
     A            GRKODE    R
     A            PRGRUP    R
     A            OPDMVA    R
     A            INTKOD    R
     A            KRNRDB    R
     A            POSLNR    R
     A            KRNOKD    R
