     A          R POSBR                     PFILE(POSTB0)
     A                                      TEXT('Posteringslinjer')
     A          K BILNR
     A          K KONTO
     A          K KSTED
     A          K KBARER
     A          K MOMSK
