     A                                      REF(IBMFRF)
     A          R POSBR
     A            AKTKOD    R
     A            FIRMA     R
     A            BILNR     R
     A            BILAAR    R
     A            BILMND    R
     A            BILDAG    R
     A            PERAAR    R
     A            PERNR     R
     A            VALKOD    R
     A            VALKU1    R
     A            BUNKE     R
     A            SUMDEB    R
     A            SUMKRE    R
     A            SBILAG    R
     A            STELL     R
     A            AVKRX     R
     A            SDBNR     R
     A            BRUKT     R
     A            INTKOD    R
     A            POSLNR    R
