     A          R POSBR                     PFILE(POSTB0)
     A                                      TEXT('Posteringslinjer')
     A          K PERNR
     A          K PERAAR
     A          K KONTO
     A          K KSTED
     A          K KBARER
     A          K MOMSK
     A          K PROSNR
