     A          R POSBR                     PFILE(POSTN0)
     A                                      TEXT('Posteringslinjer')
     A          K FIRMA
     A          K BILNR
     A          K TYPE
