     A                                      REF(L1FRF)
     A          R POSAR
     A            AKTKOD    R
     A            FIRMA     R
     A            BILNR     R
     A            BILAAR    R
     A            BILMND    R
     A            BILDAG    R
     A            PERAAR    R
     A            PERNR     R
     A            VALKOD    R
     A            VALKU1    R
     A            BUNKE     R
     A            SUMDEB    R
     A            SUMKRE    R
     A            SBILAG    R
     A            STELL     R
     A            AVKRX     R
     A            SDBNR     R
     A            BRUKT     R
     A            INTKOD    R
     A            POSLNR    R
N050  *****************************************************************
N050 A            MVAAPS    R               REFFLD(AR4)
N050 A                                      COLHDG('År mva.' 'dato')
N050 A            MVAMPS    R               REFFLD(MND)
N050 A                                      COLHDG('Mnd mva.' 'dato')
N050 A            MVADPS    R               REFFLD(DAG)
N050 A                                      COLHDG('Dag mva.' 'dato.')
N050 A            MVPRPS    R               REFFLD(MVA)
N050 A                                      COLHDG('Mva' 'prosent')
