     A          R PRESTARTR
     A            SYSBS         10          COLHDG('SBS')
     A            SYPGM         10          COLHDG('PROGRAM')
     A            SYLIB         10          COLHDG('BIBLIOTEK')
     A            SYJOB         10          COLHDG('JOBNAVN')
     A            SYJOBT         9          COLHDG('JOBTYPE')
     A            SYTXT         30          COLHDG('BESKRIVELSE')
     A            SYBRU          1          COLHDG('BRUKES')
     A            SYAKT          1          COLHDG('AKTIV')
     A          K SYSBS
     A          K SYJOB
