     A*___________________________
     A* PROSJEKTFIL FOR PROSJEKTER FO SYSTEMA A/S
     A*"""""""""""""""""""""""""""
     A          R PRFIR
     A            PRST           1          COLHDG('STATUS SLUTT J/N')
     A            PRNA           8          COLHDG('PROSJEKTNAVN')
     A            PRTX          70          COLHDG('PROSJEKTBESKRIV.')
     A            PRKU          30          COLHDG('FIRMA')
     A            PRDG           3S 0       COLHDG('ESTIMERT DAGER')
     A            PRFA           1          COLHDG('FASTPRIS J/N')
     A            PRBE           7S 0       COLHDG('ESTIMERT BELØP')
     A            PRKO           8S 0       COLHDG('KONS')
     A            PRDT           8S 0       COLHDG('ESTIMERT DATO')
     A            PRA1           3S 0       COLHDG('BENYTTET DAGER')
     A            PRA2           8S 0       COLHDG('FERDIG DATO')
     A          K PRKO
     A          K PRST
