     A*____________________________
     A* SYSPED / GEBYRERES PRISTABELLER KUNDE
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R PRGER
     A            APKKNR         8          TEXT('KUNDENR, 0 =BRUTTO')
     A            APKAVT         1          TEXT('AVTALESNR 0-9,S/K VED BRUTTO')
     A            APKLNR         4S 0       TEXT('LINJENR I AVTALEN')
     A* INC/OMI.URSPR./FRANKAT/OPPDRTYPE
     A*(PKUR01-5 LIGGER I AVTALEREGISTERET PRIK)
     A            PKUR06         1          TEXT('URSPRKODE IN/OM6 ')
     A            PKUR07         1          TEXT('URSPRKODE IN/OM7 ')
     A            PKUR08         1          TEXT('URSPRKODE IN/OM8 ')
     A            PKUR09         1          TEXT('URSPRKODE IN/OM9 ')
     A            PKUR10         1          TEXT('URSPRKODE IN/OM10')
     A*(PKFR01-2 LIGGER I AVTALEREGISTERET PRIK)
     A            PKFR03         3          TEXT('FRANKATUR IN/OM3 ')
     A            PKFR04         3          TEXT('FRANKATUR IN/OM4 ')
     A            PKFR05         3          TEXT('FRANKATUR IN/OM5 ')
     A            PKFR06         3          TEXT('FRANKATUR IN/OM6 ')
     A            PKFR07         3          TEXT('FRANKATUR IN/OM7 ')
     A            PKFR08         3          TEXT('FRANKATUR IN/OM8 ')
     A            PKFR09         3          TEXT('FRANKATUR IN/OM9 ')
     A            PKFR10         3          TEXT('FRANKATUR IN/OM10')
     A*(PKOT01-2 LIGGER I AVTALEREGISTERET PRIK)
     A            PKOT03         2          TEXT('OPPD.TYPE IN/OM3 ')
     A            PKOT04         2          TEXT('OPPD.TYPE IN/OM4 ')
     A            PKOT05         2          TEXT('OPPD.TYPE IN/OM5 ')
     A            PKOT06         2          TEXT('OPPD.TYPE IN/OM6 ')
     A            PKOT07         2          TEXT('OPPD.TYPE IN/OM7 ')
     A            PKOT08         2          TEXT('OPPD.TYPE IN/OM8 ')
     A            PKOT09         2          TEXT('OPPD.TYPE IN/OM9 ')
     A            PKOT10         2          TEXT('OPPD.TYPE IN/OM10')
     A          K APKKNR
     A          K APKAVT
     A          K APKLNR
