     A*__________________________________________
     A* SYSPED HVEM BELASTES HVA
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R PRIKRD                    PFILE(PRIKB)
     A            PKKNR
     A            PKAVTN
     A            PKFR01
     A            PKOT01
     A            PKGEBY
     A          K PKAVTN
     A          K PKFR01
     A          K PKOT01
     A          K PKGEBY
     A          S PKKNR                     CMP(EQ '    ALLE')
