     A*________________________________
     A* SYSPED / GEBYRAVTALER - BRUTTO
     A*""""""""""""""""""""""""""""""""
     A          R PRIKR                     PFILE(PRIKB)
     A          K PKKNR
     A          K PKAVTN
     A          K PKLNR
