     A*__________________________________________
     A* SYSPED / GEBYRAVTALER - BRUTTO (FRANKAT/OPPDT. I KEY)
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R PRIKR                     PFILE(PRIK)
     A          K PKKNR
     A          K PKFR01
     A          K PKOT01
     A          K PKAVTN
     A          K PKGEBY
     A          K PKLNR
