     A*____________________________
     A* SYSPED / GEBYRERES PRISTABELLER KUNDE
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R PRIKR
     A            PKST           1          TEXT('STATUS')
     A            PKKNR          8          TEXT('KUNDENR, 0 =BRUTTO')
     A            PKAVTN         1          TEXT('AVTALESNR 0-9,S/K VED BRUTTO')
     A            PKGEBY         3          TEXT('GEBYR KODE')
     A            PKAVTT         1          TEXT('AVTALTYPE')
     A            PKINT          5S 0       TEXT('INTERVAL TIL OG MED KG')
     A            PKBELØ        10P 3       TEXT('BELØP,%SATS VED P/X')
     A            PKPPR          5P 0       TEXT('PRIS PR KG,ELLER ANNEN ENHET')
     A            PKTEGN         1          TEXT('+/- FOR JUSTERING')
     A            PKJUST        10P 3       TEXT('JUSTERES MED KR')
     A            PKTNR          1          TEXT('BRUTTO-TAB.NR VED B,P,Y')
     A            PKMVA          1          TEXT('MOMS KODE')
     A            PKKOLL         1          TEXT('ANNEN ENHET')
     A            PKFVAL         3          TEXT('VALUTA KODE')
     A            PKDT           8S 0       TEXT('UTLØPSDATO')
     A            PKLNR          4S 0       TEXT('LINJENR I AVTALEN')
     A* Include/Omit ursprungskode
     A            PKURIO         1          TEXT('URSP. INC/OM. I/O')
     A            PKUR01         1          TEXT('URSPRKODE IN/OM1 ')
     A            PKUR02         1          TEXT('URSPRKODE IN/OM2 ')
     A            PKUR03         1          TEXT('URSPRKODE IN/OM3 ')
     A            PKUR04         1          TEXT('URSPRKODE IN/OM4 ')
     A            PKUR05         1          TEXT('URSPRKODE IN/OM5 ')
N01  A            PKUR06         1          TEXT('URSPRKODE IN/OM6 ')
N01  A            PKUR07         1          TEXT('URSPRKODE IN/OM7 ')
N01  A            PKUR08         1          TEXT('URSPRKODE IN/OM8 ')
N01  A            PKUR09         1          TEXT('URSPRKODE IN/OM9 ')
N01  A            PKUR10         1          TEXT('URSPRKODE IN/OM10')
     A* Include/Omit Frankatur
     A            PKFRIO         1          TEXT('FRAN. INC/OM. I/O')
     A            PKFR01         3          TEXT('FRANKATUR IN/OM1 ')
     A            PKFR02         3          TEXT('FRANKATUR IN/OM2 ')
N01  A            PKFR03         3          TEXT('FRANKATUR IN/OM3 ')
N01  A            PKFR04         3          TEXT('FRANKATUR IN/OM4 ')
N01  A            PKFR05         3          TEXT('FRANKATUR IN/OM5 ')
N01  A            PKFR06         3          TEXT('FRANKATUR IN/OM6 ')
N01  A            PKFR07         3          TEXT('FRANKATUR IN/OM7 ')
N01  A            PKFR08         3          TEXT('FRANKATUR IN/OM8 ')
N01  A            PKFR09         3          TEXT('FRANKATUR IN/OM9 ')
N01  A            PKFR10         3          TEXT('FRANKATUR IN/OM10')
     A* Include/Omit Oppdragstype
     A            PKOTIO         1          TEXT('OPDT. INC/OM. I/O')
     A            PKOT01         2          TEXT('OPPD.TYPE IN/OM1 ')
     A            PKOT02         2          TEXT('OPPD.TYPE IN/OM2 ')
N01  A            PKOT03         2          TEXT('OPPD.TYPE IN/OM3 ')
N01  A            PKOT04         2          TEXT('OPPD.TYPE IN/OM4 ')
N01  A            PKOT05         2          TEXT('OPPD.TYPE IN/OM5 ')
N01  A            PKOT06         2          TEXT('OPPD.TYPE IN/OM6 ')
N01  A            PKOT07         2          TEXT('OPPD.TYPE IN/OM7 ')
N01  A            PKOT08         2          TEXT('OPPD.TYPE IN/OM8 ')
N01  A            PKOT09         2          TEXT('OPPD.TYPE IN/OM9 ')
N01  A            PKOT10         2          TEXT('OPPD.TYPE IN/OM10')
     A* Include/Omit landkode
     A            PKLKIO         1          TEXT('LAND. INC/OM. I/O')
     A            PKLK01         2          TEXT('LANDKODE  IN/OM1 ')
N01  A            PKLK02         2          TEXT('LAND-KODE IN/OM2 ')
N01  A            PKLK03         2          TEXT('LAND-KODE IN/OM3 ')
N01  A            PKLK04         2          TEXT('LAND-KODE IN/OM4 ')
N01  A            PKLK05         2          TEXT('LAND-KODE IN/OM5 ')
N01  A            PKLK06         2          TEXT('LAND-KODE IN/OM6 ')
N01  A            PKLK07         2          TEXT('LAND-KODE IN/OM7 ')
N01  A            PKLK08         2          TEXT('LAND-KODE IN/OM8 ')
N01  A            PKLK09         2          TEXT('LAND-KODE IN/OM9 ')
N01  A            PKLK10         2          TEXT('LAND-KODE IN/OM10')
N01  A* IN/OM  FRA-STED
N01  A            PKFSIO         1          TEXT('FRA-ST. IN/OM I/O')
N01  A            PKFS01         5          TEXT('FRA-STED  IN/OM1 ')
N01  A            PKFS02         5          TEXT('FRA-STED  IN/OM2 ')
N01  A            PKFS03         5          TEXT('FRA-STED  IN/OM3 ')
N01  A            PKFS04         5          TEXT('FRA-STED  IN/OM4 ')
N01  A            PKFS05         5          TEXT('FRA-STED  IN/OM5 ')
N01  A            PKFS06         5          TEXT('FRA-STED  IN/OM6 ')
N01  A            PKFS07         5          TEXT('FRA-STED  IN/OM7 ')
N01  A            PKFS08         5          TEXT('FRA-STED  IN/OM8 ')
N01  A            PKFS09         5          TEXT('FRA-STED  IN/OM9 ')
N01  A            PKFS10         5          TEXT('FRA-STED  IN/OM10')
N01  A* IN/OM  TIL-STED
N01  A            PKTSIO         1          TEXT('TIL-ST. IN/OM I/O')
N01  A            PKTS01         5          TEXT('TIL-STED  IN/OM1 ')
N01  A            PKTS02         5          TEXT('TIL-STED  IN/OM2 ')
N01  A            PKTS03         5          TEXT('TIL-STED  IN/OM3 ')
N01  A            PKTS04         5          TEXT('TIL-STED  IN/OM4 ')
N01  A            PKTS05         5          TEXT('TIL-STED  IN/OM5 ')
N01  A            PKTS06         5          TEXT('TIL-STED  IN/OM6 ')
N01  A            PKTS07         5          TEXT('TIL-STED  IN/OM7 ')
N01  A            PKTS08         5          TEXT('TIL-STED  IN/OM8 ')
N01  A            PKTS09         5          TEXT('TIL-STED  IN/OM9 ')
N01  A            PKTS10         5          TEXT('TIL-STED  IN/OM10')
N01  A* IN/OM  LOSSESTED
N01  A            PKLSIO         1          TEXT('LOS IN/OM I/O')
N01  A            PKLS01        20          TEXT('LOS   IN/OM1 ')
N01  A            PKLS02        20          TEXT('LOS   IN/OM2 ')
N01  A            PKLS03        20          TEXT('LOS   IN/OM3 ')
N01  A            PKLS04        20          TEXT('LOS   IN/OM3 ')
N01  A            PKLS05        20          TEXT('LOS   IN/OM3 ')
N01  A* IN/OM  LASTESTED
N01  A            PKL2IO         1          TEXT('LAS IN/OM I/O')
N01  A            PKL201        20          TEXT('LAS   IN/OM1 ')
N01  A            PKL202        20          TEXT('LAS   IN/OM2 ')
N01  A            PKL203        20          TEXT('LAS   IN/OM3 ')
N01  A            PKL204        20          TEXT('LAS   IN/OM3 ')
N01  A            PKL205        20          TEXT('LAS   IN/OM3 ')
N01  A* IN/OM  FRA-STED
N01  A            PTRAIO         1          TEXT('TRAFIKK IN/OM I/O')
N01  A            PTRA01         4          TEXT('TRAFIKK   IN/OM1 ')
N01  A            PTRA02         4          TEXT('TRAFIKK   IN/OM2 ')
N01  A            PTRA03         4          TEXT('TRAFIKK   IN/OM3 ')
N01  A            PTRA04         4          TEXT('TRAFIKK   IN/OM4 ')
N01  A            PTRA05         4          TEXT('TRAFIKK   IN/OM5 ')
N01  A            PTRA06         4          TEXT('TRAFIKK   IN/OM6 ')
N01  A            PTRA07         4          TEXT('TRAFIKK   IN/OM7 ')
N01  A            PTRA08         4          TEXT('TRAFIKK   IN/OM8 ')
N01  A            PTRA09         4          TEXT('TRAFIKK   IN/OM9 ')
N01  A            PTRA10         4          TEXT('TRAFIKK   IN/OM10')
     A* SAMMENSLÅES
     A            PKSAMM         1          TEXT('SAMMENSLÅS KODE')
     A          K PKKNR
     A          K PKAVTN
     A          K PKGEBY
     A          K PKAVTT
     A          K PKINT
     A          K PKLNR
