     A*____________________________
     A* PRODUKTTYPER STANDARDVERDIER VEKTINNDELING
     A*""""""""""""""""""""""""""""
     A          R PRODTR
     A            PTPROD         1          TEXT('PRODUCTCODE')
     A            PTAVDE         4S 0       TEXT('DEPARTMENT')
     A            PTVEKT         9P 0       TEXT('WEIGHTGROUP')
     A            PTPRPR         5P 0       TEXT('PRICE PR.')
     A            PTADJU         5P 0       TEXT('AJUST TO')
     A          K PTPROD
     A          K PTAVDE
     A          K PTVEKT
