     A          R PROSR                     PFILE(PROSF)
     A                                      TEXT('Prosjektregister')
     A          K FIRMA
     A          K STDAAR
     A          K STDMND
     A          K STDDAG
