     A*__________________________
     A* SYSPED / FILER TIL  PTF-ENDRING
     A*""""""""""""""""""""""""""
     A          R PTFFILIR
     A            MBFILE        10          COLHDG('FILNAVN')
     A            MBLIB         10          COLHDG('BIBLIOTEK')
     A            MBFTYP         4          COLHDG('P/L')
     A            MBNAME        10          COLHDG('MEMBER')
     A            SLKODE         1          COLHDG('SLETTEKODE')
     A            SLLIBR        10          COLHDG('SLETTEBILIOTEK')
     A            FLKODE         1          COLHDG('FLYTTEKODE')
     A            FLLIBR        10          COLHDG('FLYTTEBILIOTEK')
     A            KOKODE         1          COLHDG('KOPIERINGSKODE')
     A          K MBFTYP
