     A          R PWDINTR
     A*
     A            PWD            6          COLHDG('PASSORD')
     A*
     A            FIRMA          2          COLHDG('FIRMA')
     A            KUNDNR         8S 0       COLHDG('KUNDNR')
     A            LEVENR         8S 0       COLHDG('LEV.NR')
     A            BRUKER1       10          COLHDG('USER 1')
     A            BRUKER2       10          COLHDG('USER 2')
     A            BRUKER3       10          COLHDG('USER 3')
     A            BRUKER4       10          COLHDG('USER 4')
     A            BRUKER5       10          COLHDG('USER 5')
     A*
     A          K PWD
