     A                                      DSPSIZ(24 80 *DS3)
     A          R SIGNON
     A                                      CLEAR
     A                                      BLINK
     A                                  1  2'System  . :'
     A            SYSNAME        8A  O  1 14
     A                                  1 28'Delsystem . :'
     A            SBSNAME       10A  O  1 42
     A                                  1 58'Skjerm  . :'
     A            DEVNAME       10A  O  1 70
     A                                  2 19'                                  -
     A                                               '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  3 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  3 22'               SSSSSSS            -
     A                                         '
     A                                      DSPATR(RI)
     A                                  3 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  4 22'              SSSSSSSSS           -
     A                                         '
     A                                      DSPATR(RI)
     A                                  4 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  5 22'             SS       SS          -
     A                                         '
     A                                      DSPATR(RI)
     A                                  5 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  6 22'             SS                   -
     A                                         '
     A                                      DSPATR(RI)
     A                                  6 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  7 22'             SSSSSSSSSS           -
     A                                         '
     A                                      DSPATR(RI)
     A                                  7 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  8 22'              SSSSSSSSSS          -
     A                                         '
     A                                      DSPATR(RI)
     A                                  8 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                  9 22'                      SS          -
     A                                         '
     A                                      DSPATR(RI)
     A                                  9 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 10 22'             SS       SS          -
     A                                         '
     A                                      DSPATR(RI)
     A                                 10 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 11 22'              SSSSSSSSS           -
     A                                         '
     A                                      DSPATR(RI)
     A                                 11 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12 19'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 12 22'               SSSSSSS            -
     A                                         '
     A                                      DSPATR(RI)
     A                                 12 60'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 13 19'                                  -
     A                                               '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 14 39'   '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 15 39'   '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 16  5'                                  -
     A                                                                         -
     A                                        '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  5'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 17  8'                                  -
     A                                                                     '
     A                                      DSPATR(RI)
     A                                 17 74'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  5'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 18  8'                       S Y S T E M-
     A                                       A   A / S                     '
     A                                      DSPATR(RI)
     A                                 18 74'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  5'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 19  8'                                  -
     A                                                                     '
     A                                      DSPATR(RI)
     A                                 19 74'  '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 20  5'                                  -
     A                                                                         -
     A                                        '
     A                                      DSPATR(RI)
     A                                      COLOR(BLU)
     A                                 23  3'Bruker:'
     A                                      COLOR(BLU)
     A            USERID        10A  B 23 12COLOR(BLU)
     A  01                             23 28'Passord:'
     A                                      COLOR(BLU)
     A  01        PASSWRD       10A  I 23 37DSPATR(ND)
     A            PROGRAM       10A  B 23 48CHECK(LC)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A            MENU          10A  B 23 59CHECK(LC)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A            CURLIB        10A  B 23 70CHECK(LC)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A  02        QSNERROR      80A  O 24  1DSPATR(HI)
     A            COPYRIGHT     40A  O 24 40DSPATR(HI)
     A            UBUFFER      128A  H
