     A*____________________________
     A* SYSPED / Rate Class Codes
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R RATCDR
     A            RAST           1          TEXT('STATUS')
     A            RARACD         1          TEXT('RATE CLASS CODE')
     A            RABESK        30          TEXT('BESKRIVELSE')
     A          K RARACD
