     A*___________________________
     A* SYSPED / REMOTE PARAMETERE
     A*"""""""""""""""""""""""""""
     A          R REMOTER                   TEXT('REMOTE PARAMETERE')
     A            RMTEXT        50A         COLHDG('Beskrivelse')
     A            RMP01          8A         COLHDG('RMTLOCNAME')
     A            RMP02         10A         COLHDG('VRTCTL')
     A            RMP03         10A         COLHDG('VRTDEV')
     A            RMP04          8A         COLHDG('MODE')
     A            RMP05          8A         COLHDG('LCLLOCNAME')
     A            RMP06          8A         COLHDG('RMTNETID')
     A            RMP07         10A         COLHDG('SRQ10PGM')
     A            RMP08         10A         COLHDG('SRQ10LIB')
     A            RMP09         10A         COLHDG('RMTUSER')
     A            RMP10         10A         COLHDG('RMTPWD')
     A            RMP11         10A         COLHDG('RMTINLPGM')
     A            RMP12         10A         COLHDG('RMTINLMNU')
     A            RMP13         10A         COLHDG('RMTCURLIB')
     A            RMP14          4A         COLHDG('PASTHRSCN')
     A          K RMTEXT
