     A*%%TS  SD  20140402  135947  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A*
     A          R BILDE01
     A*%%TS  SD  20140402  135947  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'avslutt program')
     A            MSGNR          7A  P
     A                                  7 16' Merk til og med år'
     A            WSAAR          4Y 0B  7 39EDTCDE(4)
     A                                 23  3'F3=avbryt program '
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  1  4'REOBUD0'
     A                                      COLOR(BLU)
     A                                  1 16'MERKER BUDSJETTPOSTER Status S til-
     A                                       og med ett årstall'
     A                                      COLOR(WHT)
     A                                  7 45'(eks:'
     A                                  7 51'2013)'
