********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
PXXXX * 01 YBC PTF5 VIS ANTALL BEHANDLET OPPDRAG PÅ SKJERMEN
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      INVITE
      *
     A          R BILDE
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'REORGANISERING')
     A  29                                  ALARM
     A                                  2 58MSGCON(22 DIV0047 SYMSGF)
     A                                      COLOR(TRQ)
     A  26                              3 15MSGCON(60 YBC0547 SYMSGF)
     A                                      COLOR(WHT)
     A  27                              3 15MSGCON(60 YBC0001 SYMSGF)
     A                                      COLOR(WHT)
     A  28                              3 15MSGCON(60 YBC0002 SYMSGF)
     A                                      COLOR(WHT)
     A  29                              3 15MSGCON(60 YBC0003 SYMSGF)
     A                                      COLOR(RED)
     A                                 10 15MSGCON(30 DIV1318 SYMSGF)
     A  29                                  COLOR(RED)
     A            WSDT           6Y 0B 10 46DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  29                                  COLOR(RED)
     A N29                                  COLOR(YLW)
     A  98                             14 15MSGCON(50 DIV1320 SYMSGF)
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
N01  A  95                             16 15MSGCON(50 YBC0763 SYMSGF)
N01  A                                      DSPATR(RI)
N01  A                                      COLOR(YLW)
N01  A  94                             16 15MSGCON(50 YBC0764 SYMSGF)
N01  A                                      DSPATR(RI)
N01  A                                      COLOR(YLW)
N01  A  93                             16 15MSGCON(50 YBC0765 SYMSGF)
N01  A                                      DSPATR(RI)
N01  A                                      COLOR(YLW)
N01  A  92                             16 15MSGCON(50 YBC0766 SYMSGF)
N01  A                                      DSPATR(RI)
N01  A                                      COLOR(YLW)
N01  A  98                             18 60MSGCON(10 YBC0767 SYMSGF)
N01  A                                      COLOR(WHT)
N01  A  98        WSTDST         6Y 0O 18 71EDTWRD('  .  .  ')
N01  A                                      COLOR(WHT)
N01  A            WSANT          9Y 0O 19 15EDTCDE(4)
N01  A N97N96                               DSPATR(ND)
N01  A                                      COLOR(WHT)
N01  A  97                             19 25MSGCON(30 YBC0761 SYMSGF)
N01  A                                      COLOR(WHT)
N01  A  96                             19 25MSGCON(30 YBC0762 SYMSGF)
N01  A                                      COLOR(WHT)
N01  A                                 19 60MSGCON(10 YBC0768 SYMSGF)
N01  A N97N96                               DSPATR(ND)
N01  A                                      COLOR(WHT)
N01  A            WSTDNÅ         6Y 0O 19 71EDTWRD('  .  .  ')
N01  A N97N96                               DSPATR(ND)
N01  A                                      COLOR(WHT)
     A                                 23 15MSGCON(60 DIV1319 SYMSGF)
     A                                      COLOR(BLU)
     A  99                             24  2MSGCON(78 SPD0001 SYMSGF)
     A                                      COLOR(WHT)
