     A          R RUCKDFTR
     A            RDDGF          3S 0       COLHDG('FRA XX DAGER GAMLE')
     A            RDDGT          3S 0       COLHDG('TIL XX DAGER GAMLE')
     A            RDOTIO         1A         COLHDG('INKL/OVERSE O.TYPE')
     A            RDOT          40A         COLHDG('INNTIL 20 OPPDTYP.')
     A            RDBEV1         5A         COLHDG('LAGERBEVILLINGSKO1')
     A            RDBEV2         5A         COLHDG('LAGERBEVILLINGSKO2')
     A            RDBEV3         5A         COLHDG('LAGERBEVILLINGSKO3')
     A            RDBEV4         5A         COLHDG('LAGERBEVILLINGSKO4')
     A            RDBEV5         5A         COLHDG('LAGERBEVILLINGSKO5')
     A            RDBEV6         5A         COLHDG('LAGERBEVILLINGSKO6')
     A            RDBEV7         5A         COLHDG('LAGERBEVILLINGSKO7')
     A            RDBEV8         5A         COLHDG('LAGERBEVILLINGSKO8')
     A            RDBEV9         5A         COLHDG('LAGERBEVILLINGSKO9')
