     A          R RUCKPUR
     A            RUAVD          4S 0       COLHDG('AVD')
     A            RUOPD          7S 0       COLHDG('OPPDR')
     A            RUEPOST       50A         COLHDG('EPOST')
     A            RUDATO         8S 0       COLHDG('DATO')
     A            RUTID          6S 0       COLHDG('TID')
      *
     A          K RUAVD
     A          K RUOPD
     A          K RUEPOST
