     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SADE009' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                  1  4'SYSPED/SAD025S'
     A                                      COLOR(BLU)
     A                                  1 29'Utskrift av lasteliste'
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(GRN)
     A                                  1 73TIME
     A                                      COLOR(GRN)
     A                                  6 16'Signatur.........:'
     A            WSSG           3   B  6 37DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                  7 16'Samlaste cont....:'
     A            WSCNR         17   B  7 37DSPATR(UL)
     A                                  9 16'Avdeling'
     A                                  9 37'Oppdragsnr.'
     A            WSAVD1         4Y 0B 10 16DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSTDN1         7Y 0B 10 37DSPATR(UL)
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSAVD2         4Y 0B 11 16DSPATR(UL)
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSTDN2         7Y 0B 11 37DSPATR(UL)
     A  95                                  DSPATR(RI)
     A  95                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSAVD3         4Y 0B 12 16DSPATR(UL)
     A  94                                  DSPATR(RI)
     A  94                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSTDN3         7Y 0B 12 37DSPATR(UL)
     A  93                                  DSPATR(RI)
     A  93                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSAVD4         4Y 0B 13 16DSPATR(UL)
     A  92                                  DSPATR(RI)
     A  92                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSTDN4         7Y 0B 13 37DSPATR(UL)
     A  91                                  DSPATR(RI)
     A  91                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSAVD5         4Y 0B 14 16DSPATR(UL)
     A  90                                  DSPATR(RI)
     A  90                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSTDN5         7Y 0B 14 37DSPATR(UL)
     A  89                                  DSPATR(RI)
     A  89                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A                                 23 16'F3=Avslutt'
     A                                      COLOR(BLU)
     A  99                             24  2MSGCON(78 SPS0001 SYMSGF)
     A                                      COLOR(WHT)
     A  98
     AO 96
     AO 94
     AO 92
     AO 90                             24  2MSGCON(78 SPA0001 SYMSGF)
     A                                      COLOR(WHT)
     A  97
     AO 95
     AO 93
     AO 91
     AO 89                             24  2MSGCON(78 SPO0001 SYMSGF)
     A                                      COLOR(WHT)
     A  80                             24  2'LASTELISTE ER UTSKREVET'
