     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 12 65 *NOMSGLIN)
     A                                      OVERLAY
      *
     A          R SUBFIL                    SFL
     A            WSNR           1A  B  6  2VALUES(' ' '1' '2' '4')
     A            CMAKD          2A  O  6  5
     A            CMATXT        52A  O  6 10
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      WINDOW(WINDOWSZ)
     A                                      SFLSIZ(0006)
     A                                      SFLPAG(0005)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                      CA03(03 'Avslutt program')
     A                                      CF04(04 'SØK')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'Lag ny')
     A                                      CA12(12 'Avslutt program')
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SAD014'
     A                                      COLOR(BLU)
     A                                  1 20'Vedlikehold av miljøavgift'
     A                                      COLOR(WHT)
     A                                  1 50DATE
     A                                      EDTCDE(Y)
     A            ZRECNO         4S 0O  1 61SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2  2'Kunde:'
     A            UKN            8Y 0O  2  9DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            UNA           30A  O  2 18DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  2 50TIME
     A                                  3  2'Velg opsjon:   1=Lage   2=Endre   -
     A                                      4=Slett'
     A                                      COLOR(BLU)
     A                                  4  2'Op Miljøavgiftkode og beskrivelse'
     A                                      COLOR(WHT)
     A            W2NR           1A  B  5  2DSPATR(UL)
     A            W2KD           2A  B  5  5DSPATR(UL)
     A            W2TXT         52A  B  5 10DSPATR(UL)
      *
     A          R BUNN
     A                                      WINDOW(WINDOWSZ)
     A*                                     SLNO(11)
     A*                                     CLRL(02)
     A                                      OVERLAY
     A                                 11  2'F3=Avslutt  F5=Frisk  F6=Lage ny  -
     A                                      F12=Forrige'
     A                                      COLOR(BLU)
     A  30        MSGTXT        60A  O 12  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VARELI
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(11)
     A                                      CLRL(02)
     A                                      CF04(04 'SØK')
     A                                      CA12(12 'AVBRYT')
     A                                      OVERLAY
     A                                  1  2'Kd'
     A            WMAKD          2A  B  1  5DSPATR(UL)
     A  40                                  DSPATR(PR)
     A N40
     AO 90                                  DSPATR(PC)
     A  90                                  DSPATR(RI)
     A N40                                  COLOR(YLW)
     A  40                                  COLOR(WHT)
     A            WMATXT        52A  B  1 10DSPATR(UL)
     A  40                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A N30                              2  2'F12=Avbryt'
     A                                      COLOR(BLU)
     A  30        MSGTXT        60A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VAREL3
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(11)
     A                                      CLRL(02)
     A                                      CA12(12 'AVBRYT')
     A                                      OVERLAY
     A                                  1  1'Kd:'
     A            CMAKD          2A  O  1  5DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A            CMATXT        52A  O  1 10DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2  2'F12=Avbryt'
     A                                      COLOR(BLU)
      *
     A          R NYVARE
     A                                      WINDOW(WINDOWSZ)
     A                                      CA03(03 'Avslutt program')
     A                                      CF04(04 'SØK')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'Lag ny')
     A                                      CA12(12 'Avslutt program')
     A                                      OVERLAY
     A                                  1  2'SYSPED/SAD014'
     A                                      COLOR(BLU)
     A                                  1 20'Vedlikehold av miljøavgift'
     A                                      COLOR(WHT)
     A                                  1 50DATE
     A                                      EDTCDE(Y)
     A                                  2  2'Kunde:'
     A            UKN            8Y 0O  2  9DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            UNA           30A  O  2 18DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  2 50TIME
     A                                  3  2'Velg opsjon:   1=Lage   2=Endre   -
     A                                      4=Slett'
     A                                      COLOR(BLU)
     A                                  4  2'Op Miljøavgiftkode og beskrivelse'
     A                                      COLOR(WHT)
     A            W2NR           1A  B  5  2DSPATR(UL)
     A            W2KD           2A  B  5  5DSPATR(UL)
     A            W2TXT         52A  B  5 10DSPATR(UL)
     A                                 11  2'F3=Avslutt  F5=Frisk  F6=Lage ny  -
     A                                      F12=Forrige'
     A                                      COLOR(BLU)
     A  30        MSGTXT        60A  O 12  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
