     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 14 32 *NOMSGLIN)
     A                                      OVERLAY
      *
     A          R SUBFIL                    SFL
     A            SFTXT         17A  O  4  2
     A            SFDT           8Y 0H
     A            WSDT           6Y 0O  4 20EDTCDE(Y)
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A                                      CA05(05 'Frisk')
     A                                      CA12(12 'Forrige')
     A                                  1  2'SAD017B'
     A                                      COLOR(BLU)
     A                                  1 10'Fakturainformasjoner'
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  2 26SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  3  2'Fakturanr         Fakt.dato'
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      WINDOW(WINDOWSZ)
     A                                 13  2'F5=Frisk   F12=Forrige'
     A                                      COLOR(BLU)
      *
     A          R NYWRK
     A                                      WINDOW(WINDOWSZ)
     A                                      CA12(12 'Forrige')
     A                                  1  2'SAD017B'
     A                                      COLOR(BLU)
     A                                  1 10'Fakturainformasjoner'
     A                                      COLOR(WHT)
     A                                  3  2'Fakturanr         Fakt.dato'
     A                                      COLOR(WHT)
     A                                 13  2'F12=Forrige'
     A                                      COLOR(BLU)
