     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP(01)
     A                                      CF01(01)
      *
     A          R BILDE
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(12 'Bytt avdeling')
     A                                  2  5'SAD026'
     A                                      COLOR(BLU)
     A                                  2 21'Utskrift av statistikk avsender/mo-
     A                                      ttaker'
     A                                      COLOR(WHT)
     A                                  3 34'E K S P O R T'
     A                                      COLOR(WHT)
     A                                  5 21'Avdeling:'
     A            UAVD           4S 0O  5 31COLOR(BLU)
     A            UAVDNV        33A  O  5 36COLOR(BLU)
     A                                  8 21'Fra dato:'
     A            WSDTF          6D 0B  8 41DSPATR(UL)
     A                                  9 21'Til dato:'
     A            WSDTT          6D 0B  9 41DSPATR(UL)
     A                                 11 49'A=Avsender M=Mottaker'
     A                                 11 21'Avsender/mottaker:'
     A            WSKL           1A  B 11 41DSPATR(UL)
     A                                      VALUES(' ' 'A' 'M')
     A                                 13 21'Fra nummer:'
     A            WSKNF          8Y 0B 13 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 14 21'Til nummer:'
     A            WSKNT          8Y 0B 14 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 16 21'Kun totaler ?'
     A            WSDETJ         1A  B 16 41DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                 16 49'J=Kun totaler'
     A                                 23 21'F3 = Avslutt'
     A                                      COLOR(BLU)
     A                                 23 35'F12 = Bytt avdeling'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
