********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10319 * 01 YBC PTF10 FLERE ENN 8 AVGIFTER
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11108 * 02 YBC PTF11 TAKLE OMBEREGNING
********************************************************************
S02  A*                                     DSPSIZ(24 80 *DS3 27 132 *DS4)
N02  A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE
     A                                      CA03(03 'Gå til inngangsbilde')
     A                                      CA12(12 'Gå til inngangsbilde')
     A  27                                  CF15(15 'Mer rubr.28')
     A                                  1  2'SYSPED/SAD016'
     A                                      COLOR(BLU)
     A                                  1 20'HOVED-OPPLYSNINGER'
     A                                      COLOR(WHT)
     A                                  1 57'1.Dekl.'
     A            SIDTY          2A  O  1 65TEXT('Deklarasjonstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SIDP           2Y 0O  1 68TEXT('Dekl.prosedyre')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(9)
     A                                  2  1'2.Avsender'
     A            SIKNS          8Y 0O  2 13TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 40'Meldingstype:'
     A            SI1225         3A  O  2 54TEXT('Meldingstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SI1225T       12A  O  2 58TEXT('Meldingstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
N02  A                                  2 85'Total toll/avg'
N02  A            SITOTA        11Y 0O  2100TEXT('TOTAL TOLL/AVG')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A            SINAS         30A  O  3  1TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 40'6.Kolli'
     A            SINTK          7Y 0O  3 49TEXT('Antall kolli')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3 58'Ref'
     A            SIAVD          4Y 0O  3 62COLOR(WHT)
     A                                      EDTCDE(4)
     A            SITDN          7Y 0O  3 67COLOR(WHT)
     A                                      EDTCDE(4)
     A            SISG           3A  O  3 75COLOR(WHT)
N02  A                                  3 85'Avgift:'
N02  A            SITKD1         2A  O  3100TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV1        11Y 0O  3103TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
N02  A            SITKD2         2A  O  3116TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV2        11Y 0O  3119TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A            SIADS1        30A  O  4  1TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4 40'D/K'
     A            SIKDDK         1A  O  4 44TEXT('Dagsoppgjør/Kontant')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4 53'Tariffør'
     A            SITARF        16A  O  4 62TEXT('TARIFFØRSNAVN')
     A                                      COLOR(WHT)
N02  A            SITKD3         2A  O  4100TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV3        11Y 0O  4103TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
N02  A            SITKD4         2A  O  4116TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV4        11Y 0O  4119TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A            SIADS2        30A  O  5  1TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
N02  A            SITKD5         2A  O  5100TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV5        11Y 0O  5103TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
N02  A            SITKD6         2A  O  5116TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV6        11Y 0O  5119TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A            SIADS3        30A  O  6  1TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
N02  A            SITKD7         2A  O  6100TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV7        11Y 0O  6103TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
N02  A            SITKD8         2A  O  6116TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV8        11Y 0O  6119TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A                                  7  1'8.Mottaker'
     A            SIKNK          8Y 0O  7 13TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  7 22'Regnr'
     A            SIRG          11A  O  7 28TEXT('Regn Fylk.skatt.sjef')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  7 40'12.Verdioppl.'
     A                                  7 58'Andre kostnad'
     A                                  7 72'+/-(P/M)'
N02  A            SITKD9         2A  O  7100TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV9        11Y 0O  7103TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
N02  A            SITKD10        2A  O  7116TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV10       11Y 0O  7119TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A            SINAK         30A  O  8  1TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SIVAL1         3A  O  8 40TEXT('Valutakode Frakt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SIBEL1        11Y 2O  8 44TEXT('Beløp tollb.frakt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SIVAL2         3A  O  8 58TEXT('Val.kode A. kost')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SIBEL2        11Y 2O  8 62TEXT('Beløp A. kost')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SIFTG2         1A  O  8 77TEXT('Fortegn +/- a.kost (el. P/M --
     A                                       uten add til rub.22)')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
N02  A            SITKD11        2A  O  8100TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV11       11Y 0O  8103TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
N02  A            SITKD12        2A  O  8116TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV12       11Y 0O  8119TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A            SIADK1        30A  O  9  1TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 40'15.Avs/utf.land'
     A            SILKA          2A  O  9 56TEXT('Landk avs/utf-land')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
N02  A            SITKD13        2A  O  9100TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV13       11Y 0O  9103TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
N02  A            SITKD14        2A  O  9116TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV14       11Y 0O  9119TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A            SIADK2        30A  O 10  1TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
N02  A            SITKD15        2A  O 10100TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV15       11Y 0O 10103TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
N02  A            SITKD16        2A  O 10116TEXT('AVGIFTSKODE')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A            SITAV16       11Y 0O 10119TEXT('AVGIFTS BELØP')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                      EDTCDE(4)
     A            SIADK3        30A  O 11  1TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 40'19.Cont.'
     A            SIKDC          1A  O 11 49TEXT('Container 0/1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  1'14.Deklarant'
     A            SITLF         12A  O 12 14TEXT('Telefon Deklarant')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 40'20.Lev.vilk.'
     A            SILV           3A  O 12 53TEXT('Leveringsvilkår kod')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SILVT         17A  O 12 57TEXT('Leveringsvilkår txt')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SINAD         30A  O 13  1TEXT('Navn Deklarant')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 40'22.Fakturasum'
     A                                 13 59'23.Omregn '
     A                                 13 70'24.Tr.type'
     A                                 14  1'21.Ident.'
     A            SITRID        17A  O 14 11TEXT('Transport ID')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SILKT          2A  O 14 29TEXT('Landk Tr.middel')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SIVAL3         3A  O 14 40TEXT('Val.kode Faktsum')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SIBEL3        13Y 2O 14 44TEXT('Beløp Faktsum')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SIVKU          7Y 3O 14 60TEXT('Valutakurs')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SITST          1Y 0O 14 73TEXT('Transaksjonstype')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 15  1'25.Transportmåte'
     A            SITRM          2Y 0O 15 18TEXT('Transportmåte')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(9)
     A                                 15 38'28.Dato'
     A            SIFID          8Y 0O 15 47DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 56'Finans'
     A            SIFIF         17A  O 15 63TEXT('Finans oppl.faknr')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16  1'30.Lag.st.'
     A            SILS          16A  O 16 12TEXT('Lagringssted tekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SIKDLS         2A  O 16 29TEXT('Lagringssted kode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16 32'48.KT.'
     A            SIKT           8A  O 16 39DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 16 50'49.Godsn'
     A            SIGN          15A  O 16 59TEXT('Godsnummer')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SIPOS          9A  O 17 59TEXT('Posisjon')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S02  A*                                18  1'Total toll/avg'
S02  A*           SITOTA        11Y 0O 18 18TEXT('TOTAL TOLL/AVG')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*                                19  1'Avgift:'
S02  A*           SITKD1         2A  O 19 10TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV1        11Y 0O 19 13TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD2         2A  O 19 27TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV2        11Y 0O 19 30TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD3         2A  O 19 44TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV3        11Y 0O 19 47TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD4         2A  O 19 61TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV4        11Y 0O 19 64TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD5         2A  O 20 10TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV5        11Y 0O 20 13TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD6         2A  O 20 27TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV6        11Y 0O 20 30TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD7         2A  O 20 44TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV7        11Y 0O 20 47TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD8         2A  O 20 61TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV8        11Y 0O 20 64TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD9         2A  O 21 10TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV9        11Y 0O 21 13TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD10        2A  O 21 27TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV10       11Y 0O 21 30TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD11        2A  O 21 44TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV11       11Y 0O 21 47TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD12        2A  O 21 61TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV12       11Y 0O 21 64TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD13        2A  O 22 10TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV13       11Y 0O 22 13TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD14        2A  O 22 27TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV14       11Y 0O 22 30TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD15        2A  O 22 44TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV15       11Y 0O 22 47TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*           SITKD16        2A  O 22 61TEXT('AVGIFTSKODE')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*           SITAV16       11Y 0O 22 64TEXT('AVGIFTS BELØP')
S02  A*                                     DSPATR(UL)
S02  A*                                     COLOR(YLW)
S02  A*                                     EDTCDE(4)
S02  A*                                23  2'F3/F12=Avbryt'
S02  A*                                     COLOR(BLU)
S02  A* 27                             23 18'F15=Rubr. 28'
S02  A*                                     COLOR(BLU)
N02  A  39                             18  2'Omberegning:'
N02  A  39                             19  2'Typetilfelle:'
N02  A  39        SITYPE         4A  O 19 16TEXT('Typetilfelle')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A  39                             19 22'Original fortolling løpenr:'
N02  A  39        SITLL         10A  O 19 50TEXT('Tollnr Løpenr')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A  39                             20  2'Melding til TVINN:'
N02  A  39        SIFT01        70A  O 20 22TEXT('Melding til TVINN')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A  39        SIFT02        70A  O 21 22TEXT('Melding til TVINN')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A  39        SIFT03        70A  O 22 22TEXT('Melding til TVINN')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A  39        SIFT04        70A  O 23 22TEXT('Melding til TVINN')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A  39        SIFT05        70A  O 24 22TEXT('Melding til TVINN')
N02  A                                      DSPATR(UL)
N02  A                                      COLOR(YLW)
N02  A                                 26  2'F3/F12=Avbryt'
N02  A                                      COLOR(BLU)
N02  A  27                             26 18'F15=Rubr. 28'
N02  A                                      COLOR(BLU)
