********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10319 * 01 YBC PTF10 FLERE ENDRET/NYE FELTER
      *              MYE ENDRINGER, INGEN MERKING
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11055 * 02 YBC PTF11 GRUNNLAG MED 2 DESIMALER
********************************************************************
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  4  2VALUES(' ' '5')
     A            SVLI           5Y 0O  4  4EDTCDE(4)
     A            SVLK           2A  O  4 10TEXT('Landk. oppr.land')
     A            SVVNT          8S 0O  4 13TEXT('Varenr Tolltariff')
     A            SVTN           1A  O  4 22TEXT('Tollnedsettelse')
     A            SVPRE          1A  O  4 25TEXT('Preferanse')
     A            SVBELS        11Y 2O  4 27EDTCDE(4)
     A            SVBELT        11Y 2O  4 40EDTCDE(L)
     A            SVVKTN         9Y 0O  4 54EDTCDE(4)
     A            SVNTM          9Y 0O  4 64EDTCDE(4)
     A            SVNT           6Y 0O  4 74EDTCDE(4)
     A            SVEH           4A  O  4 81
     A            SVVB1         30A  O  4 86
     A            SVVKTB         9Y 0H
     A            SVBELR        11Y 2H
     A            SVMN1         17A  H
     A            SVMN2         17A  H
     A            SVMN3         17A  H
     A            SVMN4         17A  H
     A            SVMN5         17A  H
     A            SVMN6         17A  H
     A            SVMN7         17A  H
     A            SVVB2         30A  H
     A            SVVB3         30A  H
     A            SVVB4         30A  H
     A            SVVB5         30A  H
     A            SVAV11         2A  H
     A            SVAV21         3A  H
E02  A            SVAV31        11Y 2H
     A            SVAV41         7Y 2H
     A            SVAV51        11Y 0H
     A            SVAV12         2A  H
     A            SVAV22         3A  H
E02  A            SVAV32        11Y 2H
     A            SVAV42         7Y 2H
     A            SVAV52        11Y 0H
     A            SVAV13         2A  H
     A            SVAV23         3A  H
E02  A            SVAV33        11Y 2H
     A            SVAV43         7Y 2H
     A            SVAV53        11Y 0H
     A            SVAV14         2A  H
     A            SVAV24         3A  H
E02  A            SVAV34        11Y 2H
     A            SVAV44         7Y 2H
     A            SVAV54        11Y 0H
     A            SVAV15         2A  H
     A            SVAV25         3A  H
E02  A            SVAV35        11Y 2H
     A            SVAV45         7Y 2H
     A            SVAV55        11Y 0H
     A            SVAV16         2A  H
     A            SVAV26         3A  H
E02  A            SVAV36        11Y 2H
     A            SVAV46         7Y 2H
     A            SVAV56        11Y 0H
     A            SVAV17         2A  H
     A            SVAV27         3A  H
E02  A            SVAV37        11Y 2H
     A            SVAV47         7Y 2H
     A            SVAV57        11Y 0H
     A            SVAV18         2A  H
     A            SVAV28         3A  H
E02  A            SVAV38        11Y 2H
     A            SVAV48         7Y 2H
     A            SVAV58        11Y 0H
     A            SVDC11         3A  H
     A            SVDC21        17A  H
     A            SVDC12         3A  H
     A            SVDC22        17A  H
     A            SVDC13         3A  H
     A            SVDC23        17A  H
     A            SVDC14         3A  H
     A            SVDC24        17A  H
     A            SVDC15         3A  H
     A            SVDC25        17A  H
     A            SVDC16         3A  H
     A            SVDC26        17A  H
     A            SVDC17         3A  H
     A            SVDC27        17A  H
     A            SVDC18         3A  H
     A            SVDC28        17A  H
     A            SVDC19         3A  H
     A            SVDC29        17A  H
     A            SVDC110        3A  H
     A            SVDC210       17A  H
     A            SVDC111        3A  H
     A            SVDC211       17A  H
     A            SVDC112        3A  H
     A            SVDC212       17A  H
     A            SVDC113        3A  H
     A            SVDC213       17A  H
     A            SVDC114        3A  H
     A            SVDC214       17A  H
     A            SVDC115        3A  H
     A            SVDC215       17A  H
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0020)
     A                                      SFLPAG(0019)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  1 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2MSGCON(18 DIV1725 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 29MSGCON(11 DIV1927 SYMSGF)
     A            SIAVD          4Y 0O  1 41COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  1 46'-'
     A                                      COLOR(BLU)
     A            SITDN          7Y 0O  1 48COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  2  2MSGCON(40 DIV1934 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  1'Op Linje LK Varenr.. TN P Stat.ver-
     A                                      di.. Juster.verdi. Nettovekt Mengde-
     A                                      ... Kolli. Enh. Varebeskrivelse'
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF08(08 'Hopp til')
     A                                      CF12(12 'FORRIGE')
     A                                      SLNO(25)
     A                                      CLRL(03)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  2  2'F3/12=Avbryt   F5=Frisk   F8=Søk'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  3  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R NYVARE
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF08(08 'Hopp til')
     A                                      CF12(12 'FORRIGE')
     A                                  1  2MSGCON(18 DIV1725 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 29MSGCON(11 DIV1927 SYMSGF)
     A            SIAVD          4Y 0O  1 41COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  1 46'-'
     A                                      COLOR(BLU)
     A            SITDN          7Y 0O  1 48COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  2  2MSGCON(40 DIV1934 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  1'Op Linje LK Varenr.. TN P Stat.ver-
     A                                      di.. Juster.verdi. Nettovekt Mengde-
     A                                      ... Kolli. Enh. Varebeskrivelse'
     A                                      COLOR(WHT)
     A                                 26  2'F3/12=Avbryt   F5=Frisk   F8=Søk'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VAREL2
     A                                      CF12(12 'Forrige')
     A                                      SLNO(25)
     A                                      CLRL(03)
     A                                  2  2'Hopp til linje   -->'
     A            WSLI           5S 0I  2 24DSPATR(UL)
     A                                  3  2'F12=Forrige'
     A                                      COLOR(BLU)
      *
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                  1  2MSGCON(18 DIV1725 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 29MSGCON(11 DIV1927 SYMSGF)
     A            SIAVD          4Y 0O  1 41COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  1 46'-'
     A                                      COLOR(BLU)
     A            SITDN          7Y 0O  1 48COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  1 56'-'
     A                                      COLOR(BLU)
     A            SVLI           5Y 0O  1 58COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  3  4'VF Opp Varenr.  TN P Stat.verdi.. -
     A                                      Juster.verdi. Brut.vekt Nettovekt M-
     A                                      engde... Kolli. Enh.'
     A            SVVF           1A  O  4  4TEXT('Verdi fasts.kode')
     A                                      DSPATR(PC)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVLK           2A  O  4  7TEXT('Landk. oppr.land')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVVNT          8S 0O  4 11TEXT('Varenr Tolltariff')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVTN           1A  O  4 20TEXT('Tollnedsettelse')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVPRE          1A  O  4 23TEXT('Preferanse')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVBELS        11Y 2O  4 25TEXT('Beløp Tollverdi')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            SVBELT        11Y 2O  4 38TEXT('Beløp Tollverdi')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(L)
     A            SVVKTB         9Y 0O  4 52TEXT('Vekt Brutto')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            SVVKTN         9Y 0O  4 62TEXT('Vekt Netto')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            SVNTM          9Y 0O  4 72TEXT('Mengde')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            SVNT           6Y 0O  4 82TEXT('Kolli')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            SVEH           4A  O  4 87TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2'Merking:'
     A            SVMN1         17A  O  5 11TEXT('Merking')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 32'Beskrivelse:'
     A            SVVB1         30A  O  5 45TEXT('Beskrivelse')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVMN2         17A  O  6 11TEXT('Merking')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVVB2         30A  O  6 45TEXT('Beskrivelse')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVMN3         17A  O  7 11TEXT('Merking')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVVB3         30A  O  7 45TEXT('Beskrivelse')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVMN4         17A  O  8 11TEXT('Merking')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVVB4         30A  O  8 45TEXT('Beskrivelse')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVMN5         17A  O  9 11TEXT('Merking')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVVB5         30A  O  9 45TEXT('Beskrivelse')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVMN6         17A  O 10 11TEXT('Merking')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVMN7         17A  O 11 11TEXT('Merking')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A                                 13  2'Avgift Grunnlag.... Sats.... Beløp-
E02  A                                      ......'
E02  A                                 13 48'Kode og referansenr.'
     A            SVAV11         2A  O 14  2TEXT('Avg.KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV21         3A  O 14  5TEXT('Avg.SEKVENS')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVAV31        11Y 2O 14  9TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV41         7Y 2O 14 22TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV51        11Y 0O 14 31DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVDC11         3A  O 14 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC21        17A  O 14 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV12         2A  O 15  2TEXT('Avg.KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV22         3A  O 15  5TEXT('Avg.SEKVENS')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVAV32        11Y 2O 15  9TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV42         7Y 2O 15 22TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV52        11Y 0O 15 31DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVDC12         3A  O 15 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC22        17A  O 15 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV13         2A  O 16  2TEXT('Avg.KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV23         3A  O 16  5TEXT('Avg.SEKVENS')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVAV33        11Y 2O 16  9TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV43         7Y 2O 16 22TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV53        11Y 0O 16 31DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVDC13         3A  O 16 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC23        17A  O 16 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV14         2A  O 17  2TEXT('Avg.KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV24         3A  O 17  5TEXT('Avg.SEKVENS')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVAV34        11Y 2O 17  9TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV44         7Y 2O 17 22TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV54        11Y 0O 17 31DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVDC14         3A  O 17 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC24        17A  O 17 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV15         2A  O 18  2TEXT('Avg.KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV25         3A  O 18  5TEXT('Avg.SEKVENS')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVAV35        11Y 2O 18  9TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV45         7Y 2O 18 22TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV55        11Y 0O 18 31DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVDC15         3A  O 18 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC25        17A  O 18 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV16         2A  O 19  2TEXT('Avg.KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV26         3A  O 19  5TEXT('Avg.SEKVENS')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVAV36        11Y 2O 19  9TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV46         7Y 2O 19 22TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV56        11Y 0O 19 31DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVDC16         3A  O 19 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC26        17A  O 19 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV17         2A  O 20  2TEXT('Avg.KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV27         3A  O 20  5TEXT('Avg.SEKVENS')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVAV37        11Y 2O 20  9TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV47         7Y 2O 20 22TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV57        11Y 0O 20 31DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVDC17         3A  O 20 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC27        17A  O 20 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV18         2A  O 21  2TEXT('Avg.KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            SVAV28         3A  O 21  5TEXT('Avg.SEKVENS')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVAV38        11Y 2O 21  9TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV48         7Y 2O 21 22TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVAV58        11Y 0O 21 31DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E02  A            SVDC18         3A  O 21 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC28        17A  O 21 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC19         3A  O 22 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC29        17A  O 22 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC110        3A  O 23 48TEXT('KODE')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
E02  A            SVDC210       17A  O 23 52TEXT('REFERANSENR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 26  2'F12 = Forrige'
     A                                      COLOR(BLU)
