     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP(01)
     A                                      CF01(01)
      *
     A          R BILDE
     A                                      CF03(03 'Avslutt program')
     A                                  2  7'SAD027'
     A                                      COLOR(BLU)
     A                                  2 25'Utskrift av statistikk tariffnumme-
     A                                      r'
     A                                      COLOR(WHT)
     A                                  3 32'E K S P O R T'
     A                                      COLOR(WHT)
     A                                  8 25'Fra dato:'
     A            WSDTF          6D 0B  8 44DSPATR(UL)
     A            WSDTT          6D 0B  9 44DSPATR(UL)
     A                                 11 25'Fra tariffnr.'
     A            WSFRAT         8D 0B 11 44DSPATR(UL)
     A                                 12 25'Til tariffnr.'
     A            WSTILT         8D 0B 12 44DSPATR(UL)
     A                                 23 25'F3 = Avslutt'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
