     A*%%TS  SD  20160930  085828  SVEIN       REL-V7R1M0  5770-WDS
     A*
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers  Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXXA* 01 YBC PTF10 OPSJON 8 = FULL MODULS
10262A* 02 YBC PTF10 SATS ER UTVIDERT TIL 7.2
10XXXA* 03 YBC PTF10 UTVIDER TIL 27X132, INGEN MERKING
10286A* 04 YBC PTF10 VEKT ER ENDRET FRA 5.0 TIL 12.3
     A*              VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
10329A* 05 YBC PTF10 MENGDE I ANNEN ENHET ER ENDRET FRA 7.0 TIL 9.0
     A*              INGEN MERKING
xxxxxA*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11016A* 06 YBC PTF11 OMBEREGNING
11174A* 07 YBC PTF11 TILLEGGSLINJER MED SAMME POST
     A* 08 SH  PTF11 EXTERNREF = VARENUMMER
*****A**************************************************************
     A*
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R SUBFIL                    SFL
S01  A*           WSNR           1A  I  6  2VALUES(' ' '5')
N01  A            WSNR           1A  I  6  2VALUES(' ' '5' '8')
     A            SVLI           5Y 0H
     A            SVVF           1A  H
S04  A*           SVVKTB         9Y 0H
N04  A            SVVKTB        12Y 3H
     A            SVASA1         7Y 2H
     A            SVEH2          1A  H
     A            SVAGR1        11Y 2H
     A            SVFT01        28A  H
     A            SVNT01         6Y 0H
     A            SVEH01         4A  H
     A            SVTOP1        17A  H
     A            SVCRE1         3A  H
N01  A            SVREFL         5Y 0H
N08  A            SVEXR03       35   H
     A            SVLN           5Y 0H
     A            WXLN           5Y 0O  6  4EDTCDE(4)
     A            SVLK           2A  O  6 10TEXT('Landk. oppr.land')
     A            SVVNT          8S 0O  6 13TEXT('Varenr Tolltariff')
     A            SVTN           1A  O  6 22TEXT('Tollnedsettelse')
     A            SVPRE          1A  O  6 25TEXT('Preferanse')
     A            SVBELT        11Y 2O  6 27EDTCDE(4)
S04  A*           SVVKTN         9Y 0O  6 40EDTCDE(4)
N04  A            SVVKTN        12Y 3O  6 40EDTCDE(4)
     A            SVNTM          9Y 0O  6 54EDTCDE(4)
     A            SVPVA          1A  O  6 64TEXT('Enhet PVAF')
S02  A*           SVAS           5Y 2O  6 54TEXT('Avgiftssats')
N02  A            SVAS           7Y 2O  6 68TEXT('Avgiftssats')
     A                                      EDTCDE(4)
     A            SVMFR          1A  O  6 77TEXT('MVA fri kod')
     A            SVAKD1         2A  O  6 81TEXT('Avgiftskode')
     A  27                                  COLOR(YLW)
     A            SVASV1         3A  H
     A            SVABL1        11Y 2O  6 84EDTCDE(4)
     A  27                                  COLOR(YLW)
S04  A*           SVVT          15A  O  6 97
N04  A            SVVT01        30A  O  6 97
     A  27                                  COLOR(YLW)
N06  A            SVPREÆ         1A  O  6128COLOR(RED)
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  1 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2MSGCON(18 DIV1725 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 29MSGCON(11 DIV1927 SYMSGF)
     A            SIAVD          4Y 0O  1 41COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  1 46'-'
     A                                      COLOR(BLU)
     A            SITDN          7Y 0O  1 48COLOR(BLU)
S06  A*                                     EDTCDE(4)
N06  A                                      EDTCDE(L)
     A                                  2  2MSGCON(11 DIV1928 SYMSGF)
     A            UFAKNO         9Y 0O  2 14COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  2 29MSGCON(8 DIV1929 SYMSGF)
     A            SIBEL8        11Y 2O  2 38TEXT('Frakt omberegnet')
     A                                      EDTCDE(4)
     A                                      COLOR(BLU)
     A                                  2 52MSGCON(7 DIV1930 SYMSGF)
     A            SIBELC        11Y 2O  2 60COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(11 DIV1931 SYMSGF)
     A            SIBEL9        11Y 2O  3 14TEXT('Andre kost.omber')
     A                                      EDTCDE(4)
     A                                      COLOR(BLU)
     A                                  3 29MSGCON(8 DIV1932 SYMSGF)
     A            SIBELA         7Y 0O  3 38TEXT('Beløp Forsikring')
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  3 52MSGCON(7 DIV1933 SYMSGF)
     A            WSBEL4         9Y 0O  3 60TEXT('Beløp CIFsum')
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  4  2MSGCON(40 DIV1934 SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  1'Op Linje Op Varenr.. TN P T.verdi.-
     A                                      .... Nettovekt       Mengde  PVA To-
     A                                      llsats MVA Avgift......... Varebesk-
S06  A*                                     rivelse'
N06  A                                      rivelse                T'
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF01(01 'BYTT AVDELINGER')
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF08(08 'Hopp til')
     A                                      CF11(11 'Se oppdrag')
     A                                      CF12(12 'FORRIGE')
     A                                      SLNO(23)
     A                                      CLRL(05)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(5 DIV1938 SYMSGF)
     A            SIBEL5         9Y 0O  1  8TEXT('Beløp Tot Toll')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 22MSGCON(5 DIV1939 SYMSGF)
     A            SIBEL6         9Y 0O  1 28TEXT('Beløp Tot MVA')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 42MSGCON(5 DIV1940 SYMSGF)
     A            W2AVGA         9Y 0O  1 48COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 62MSGCON(5 DIV1941 SYMSGF)
     A            SIBEL7        11Y 0O  1 68TEXT('Beløp Tot avg')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2MSGCON(6 DIV1935 SYMSGF)
     A            SIBEL3        13Y 2O  2 10TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 27MSGCON(6 DIV1936 SYMSGF)
     A            W2VSUM        13Y 2O  2 35TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 52MSGCON(6 DIV1937 SYMSGF)
     A            W2DIFF        13Y 2O  2 60TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(L)
     A                                  3  2MSGCON(18 DIV1914 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 42MSGCON(18 DIV0021 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 62MSGCON(18 DIV0023 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 82'F11=Se oppdrag'
     A                                      COLOR(BLU)
     A                                  3102MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  5  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R NYVARE
     A                                      CF01(01 'BYTT AVDELNGER')
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF08(08 'SØK')
     A                                      CF11(11 'Se oppdrag')
     A                                      CF12(12 'FORRIGE')
     A                                  1  2MSGCON(18 DIV1725 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 29MSGCON(11 DIV1927 SYMSGF)
     A            SIAVD          4Y 0O  1 41COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  1 46'-'
     A                                      COLOR(BLU)
     A            SITDN          7Y 0O  1 48COLOR(BLU)
S06  A*                                     EDTCDE(4)
N06  A                                      EDTCDE(L)
     A                                  2  2MSGCON(11 DIV1928 SYMSGF)
     A            UFAKNO         9Y 0O  2 14COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  2 29MSGCON(8 DIV1929 SYMSGF)
     A            SIBEL8        11Y 2O  2 38TEXT('Frakt omberegnet')
     A                                      EDTCDE(4)
     A                                      COLOR(BLU)
     A                                  2 52MSGCON(7 DIV1930 SYMSGF)
     A            SIBELC        11Y 2O  2 60COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(11 DIV1931 SYMSGF)
     A            SIBEL9        11Y 2O  3 14TEXT('Andre kost.omber')
     A                                      EDTCDE(4)
     A                                      COLOR(BLU)
     A                                  3 29MSGCON(8 DIV1932 SYMSGF)
     A            SIBELA         7Y 0O  3 38TEXT('Beløp Forsikring')
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  3 52MSGCON(7 DIV1933 SYMSGF)
     A            WSBEL4         9Y 0O  3 60TEXT('Beløp CIFsum')
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  4  2MSGCON(40 DIV1934 SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  1'Op Linje Op Varenr.. TN P T.verdi.-
     A                                      .... Nettovekt       Mengde  PVA To-
     A                                      llsats MVA Avgift......... Varebesk-
S06  A*                                     rivelse'
N06  A                                      rivelse                T'
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(5 DIV1938 SYMSGF)
     A            SIBEL5         9Y 0O 23  8TEXT('Beløp Tot Toll')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 23 22MSGCON(5 DIV1939 SYMSGF)
     A            SIBEL6         9Y 0O 23 28TEXT('Beløp Tot MVA')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 23 42MSGCON(5 DIV1940 SYMSGF)
     A            W2AVGA         9Y 0O 23 48COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 23 62MSGCON(5 DIV1941 SYMSGF)
     A            SIBEL7        11Y 0O 23 68TEXT('Beløp Tot avg')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 24  2MSGCON(6 DIV1935 SYMSGF)
     A            SIBEL3        13Y 2O 24 10TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 24 27MSGCON(6 DIV1936 SYMSGF)
     A            W2VSUM        13Y 2O 24 35TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 24 52MSGCON(6 DIV1937 SYMSGF)
     A            W2DIFF        13Y 2O 24 60TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(L)
     A                                 25  2MSGCON(18 DIV1914 SYMSGF)
     A                                      COLOR(BLU)
     A                                 25 22MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                 25 42MSGCON(18 DIV0021 SYMSGF)
     A                                      COLOR(BLU)
     A                                 25 62MSGCON(18 DIV0023 SYMSGF)
     A                                      COLOR(BLU)
     A                                 25 82'F11=Se oppdrag'
     A                                      COLOR(BLU)
     A                                 25102MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VAREL2
     A                                      CF12(12 'Forrige')
     A                                      SLNO(23)
     A                                      CLRL(05)
     A                                  1  2'Hopp til linje   -->'
     A            W3LN           5Y 0I  1 24DSPATR(UL)
     A                                      DSPATR(PC)
     A                                  2  2'Hopp til varenr. -->'
     A            W3VNT          8Y 0B  2 24DSPATR(UL)
     A            W3LK           2A  I  2 34DSPATR(UL)
     A                                  3  2'Hopp til postnr. -->'
     A            W3LI           5S 0I  3 24DSPATR(UL)
     A                                  4  2'F12=Forrige'
     A                                      COLOR(BLU)
N01  A*
     A          R BILDE
     A*%%TS  SD  20160930  085828  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                  1  2'SYSPED/SAD005B'
     A                                      COLOR(BLU)
     A                                  1 21'TOLLDEKLARASJON'
     A                                      COLOR(WHT)
     A                                  1 40'Tdeknr'
     A            UAVD           4Y 0O  1 47COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 52'-'
     A                                      COLOR(WHT)
     A            UTDN           7Y 0O  1 54COLOR(WHT)
     A                                      EDTCDE(L)
     A                                  1 63'-'
     A                                      COLOR(WHT)
     A            SVLI           5Y 0O  1 65COLOR(WHT)
     A                                      EDTCDE(4)
     A            SVLN           5Y 0O  1 71COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1110DATE
     A                                      EDTCDE(Y)
     A                                  1120TIME
     A                                  2  4'VF Opp Varenr.  TN P Tollverdi... -
     A                                      Bruttovekt... Nettovekt.... Mengde.-
     A                                      .. PVA T.sats Mf'
     A                                      COLOR(WHT)
     A            SVVF           1A  O  3  4TEXT('Verdi fasts.kode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVLK           2   O  3  7TEXT('Landk. oppr.land')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVVNT          8Y 0O  3 11TEXT('Varenr Tolltariff')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTWRD('0       ')
     A            SVTN           1A  O  3 20TEXT('Tollnedsettelse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVPRE          1A  O  3 23TEXT('Preferanse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVBELT        11Y 2O  3 25TEXT('Beløp Tollverdi')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
S04  A*           SVVKTB         9Y 0O  3 38TEXT('Vekt Brutto')
     A            SVVKTB        12Y 3O  3 38TEXT('Vekt Brutto')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
S04  A*           SVVKTN         9Y 0O  3 48TEXT('Vekt Netto')
     A            SVVKTN        12Y 3O  3 52TEXT('Vekt Netto')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVNTM          9Y 0O  3 66TEXT('Mengde')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVPVA          1A  O  3 77TEXT('Enhet PVAF')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S02  A*           SVAS           5Y 2O  3 72TEXT('Avgiftssats')
     A            SVAS           7Y 2O  3 79TEXT('Avgiftssats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVMFR          1A  O  3 88TEXT('MVA fri kod')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2'Avg'
     A            SVAKD1         2A  O  4  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV1         3A  O  4  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA1         7Y 2O  4 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR1        11Y 2O  4 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL1        11Y 2O  4 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  4 50'Justering.....:'
     A            SJBEL         11Y 2O  4 66DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A            SVAKD2         2A  O  5  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV2         3A  O  5  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA2         7Y 2O  5 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR2        11Y 2O  5 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL2        11Y 2O  5 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 50'% av vareverdi:'
     A            SJPROS         5Y 2O  5 66DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A            SVAKD3         2A  O  6  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV3         3A  O  6  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA3         7Y 2O  6 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR3        11Y 2O  6 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL3        11Y 2O  6 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 50'Valutakode....:'
     A            SJVAL          3A  O  6 66DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVAKD4         2A  O  7  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV4         3A  O  7  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA4         7Y 2O  7 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR4        11Y 2O  7 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL4        11Y 2O  7 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  7 50'Beløp i NOK...:'
     A            SJBELN        11Y 0O  7 66DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      EDTCDE(L)
     A            SVAKD5         2A  O  8  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV5         3A  O  8  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA5         7Y 2O  8 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR5        11Y 2O  8 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL5        11Y 2O  8 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAKD6         2A  O  9  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV6         3A  O  9  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA6         7Y 2O  9 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR6        11Y 2O  9 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL6        11Y 2O  9 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAKD7         2A  O 10  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV7         3A  O 10  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA7         7Y 2O 10 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR7        11Y 2O 10 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL7        11Y 2O 10 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAKD8         2A  O 11  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV8         3A  O 11  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA8         7Y 2O 11 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR8        11Y 2O 11 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL8        11Y 2O 11 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12  2'V.B'
     A            SVFT01        28   O 12  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT01         6Y 0O 12 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH01         4A  O 12 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S04  A*           SVVT01        15A  O 12 47TEXT('Varetekst')
     A            SVVT01        30A  O 12 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT02        28A  O 13  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT02         6Y 0O 13 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH02         4A  O 13 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S04  A*           SVVT02        15A  O 13 36TEXT('Varetekst')
     A            SVVT02        30A  O 13 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT03        28A  O 14  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT03         6Y 0O 14 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH03         4A  O 14 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S03  A*           SVVT03        15A  O 14 47TEXT('Varetekst')
     A            SVVT03        30A  O 14 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT04        28A  O 15  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT04         6Y 0O 15 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH04         4A  O 15 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S03  A*           SVVT04        15A  O 15 47TEXT('Varetekst')
     A            SVVT04        30A  O 15 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT05        28A  O 16  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT05         6Y 0O 16 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH05         4A  O 16 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S04  A*           SVVT05        15A  O 16 47TEXT('Varetekst')
     A            SVVT05        30A  O 16 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT06        28A  O 17  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT06         6Y 0O 17 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH06         4A  O 17 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S04  A*           SVVT06        15A  O 17 47TEXT('Varetekst')
N04  A*           SVVT06        30A  O 17 47TEXT('Varetekst')
N01  A*                                     DSPATR(UL)
N01  A*                                     COLOR(YLW)
     A            SVFT07        28A  O 18  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT07         6Y 0O 18 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH07         4A  O 18 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
S04  A*           SVVT07        15A  O 18 47TEXT('Varetekst')
N04  A*           SVVT07        30A  O 18 47TEXT('Varetekst')
N01  A*                                     DSPATR(UL)
N01  A*                                     COLOR(YLW)
     A                                 19  2'T.O'
     A            SVTOP1        17A  O 19  6DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19 24'Ref.'
     A            SVCRE1         3A  O 19 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19 42'T.O'
     A            SVTOP2        17A  O 19 46DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19 64'Ref.'
     A            SVCRE2         3A  O 19 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP3        17A  O 20  6DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE3         3A  O 20 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP4        17A  O 20 46DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE4         3A  O 20 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP5        17A  O 21  6DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE5         3A  O 21 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP6        17A  O 21 46DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE6         3A  O 21 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP7        17A  O 22  6DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE7         3A  O 22 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP8        17A  O 22 46DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE8         3A  O 22 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP9        17   O 23  6DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE9         3A  O 23 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP10       17A  O 23 46DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE10        3A  O 23 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
N08  A                                 24  2'Edi artikkelnr:'
N08  A            SVEXR03       35   O 24 19COLOR(YLW)
     A                                 26 57MSGCON(012 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
