     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
      *
     A          R BILDE
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SAD063D'
     A                                      COLOR(BLU)
     A                                  1 20'Endre/slett særavgift'
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  5  2'Kundenr:'
     A            WSKN           8Y 0B  5 22DSPATR(UL)
     A  99                                  DSPATR(HI)
     A                                      EDTCDE(Z)
     A                                  5 32'(99999999=Alle kunder)'
     A                                  7  2'Avgiftskode:'
     A            WSKDA          2A  B  7 22DSPATR(UL)
     A  98                                  DSPATR(HI)
     A                                  9  2'Sekvens:'
     A            WSKDS          3A  B  9 22DSPATR(UL)
     A  97                                  DSPATR(HI)
     A                                  9 32'(*=Alle sekvenser)'
     A                                 11  2'Gammel sats:'
     A            WSSATS1        7Y 2B 11 22DSPATR(UL)
     A  96                                  DSPATR(HI)
     A                                      EDTCDE(L)
     A                                 11 42'Ny sats:'
     A            WSSATS2        7Y 2B 11 52DSPATR(UL)
     A                                      EDTCDE(L)
     A                                 13  2'Avgift slettes:'
     A            WSSLET         1A  B 13 22DSPATR(UL)
     A                                      VALUES('J' 'N')
     A                                 13 32'(J/N)'
     A                                 23  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
