      *
********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr *Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10205 * 01 YBC PTF10 AUTO SPLITTER LINJER VED FLERE ENN 6 SÆRAVGIFTER
10262 * 02 YBC PTF10 TOLLSATS ER UTVIDERT TIL 7.2
10XXX * 03 YBC PTF10 UTVIDER TIL 27X132, INGEN MERKING
10279 * 04 CB  PTF10 Økt SVFT fra 17 til 28, INGEN MERKING
10286 * 05 YBC PTF10 VEKT ER ENDRET FRA 9.0 TIL 12.3
      *              VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
10329 * 06 YBC PTF10 MENGDE I ANNEN ENHET ER ENDRET FRA 7.0 TIL 9.0
      *              INGEN MERKING
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11009 * 07 YBC PTF11 VIS FEILMELDING PÅ EN ANNEN MÅTE
11016 * 08 YBC PTF11 OMBEREGNING
11138 * 09 YBC PTF11 VIS STATUS PÅ FEILMELDING FRA TVINN
11174 * 10 YBC PTF11 TILLEGGSLINJER MED SAMME POST
11185 * 11 YBC PTF11 VIS TOTAL VEKT OG SUM AV LINJEVEKT
********************************************************************
      *
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SAD061APNL)
     A                                      HLPTITLE('SAD IMPORT')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  6  2VALUES(' ' '2' '4' '5')
     A            SVLI           5Y 0H
     A            SVVF           1A  H
S05  A*           SVVKTB         9Y 0H
N05  A            SVVKTB        12Y 3H
     A            SVASA1         7Y 2H
     A            SVEH21         1A  H
     A            SVAGR1        11Y 2H
S05  A*           SVFT          17A  H
N05  A            SVFT01        28A  H
     A            SVNT01         6Y 0H
     A            SVEH01         4A  H
     A            SVTO01        45A  H
     A            SVCRE1         3A  H
     A            SVLN           5Y 0H
     A            SVREFL         5Y 0H
     A            WXLN           5Y 0O  6  4EDTCDE(4)
     A            SVLK           2A  O  6 10TEXT('Landk. oppr.land')
     A            SVVNT          8S 0O  6 13TEXT('Varenr Tolltariff')
N09  A  52                                  COLOR(YLW)
     A            SVTN           1A  O  6 22TEXT('Tollnedsettelse')
     A            SVPRE          1A  O  6 25TEXT('Preferanse')
     A            SVBELT        11Y 2O  6 27EDTCDE(4)
S05  A*           SVVKTN         9Y 0O  6 40EDTCDE(4)
N05  A            SVVKTN        12Y 3O  6 40EDTCDE(4)
     A            SVNTM          9Y 0O  6 54EDTCDE(4)
     A            SVPVA          1A  O  6 64TEXT('Enhet PVAF')
S02  A*           SVAS           5Y 2O  6 54TEXT('Avgiftssats')
     A            SVAS           7Y 2O  6 66TEXT('Avgiftssats')
     A                                      EDTCDE(4)
     A            SVMFR          1A  O  6 77TEXT('MVA fri kod')
     A            SVAKD1         2A  O  6 81TEXT('Avgiftskode')
     A                                      COLOR(WHT)
     A            SVASV1         3A  H
     A            SVABL1        11Y 2O  6 84EDTCDE(4)
     A                                      COLOR(WHT)
S05  A*           SVVT          15   O  6 97
N05  A            SVVT01        30   O  6 97
     A  27                                  COLOR(YLW)
S05  A*           SV01           1   O  6113DSPATR(BL)
N05  A            SV01           1   O  6128DSPATR(BL)
     A                                      COLOR(RED)
N08  A            SVPREÆ         1   O  6130DSPATR(BL)
N08  A                                      COLOR(RED)
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  1 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SAD061A'
     A                                      COLOR(BLU)
     A            MSGTXH        25A  O  1 17MSGID(&HEAMSG SYMSGF)
     A                                      COLOR(WHT)
     A            HEAMSG         7A  P
     A                                  1 43'REF:'
     A            UAVD           4Y 0O  1 48COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 53'-'
     A                                      COLOR(WHT)
     A            UTDN           7Y 0O  1 55COLOR(WHT)
S08  A*                                     EDTCDE(4)
N08  A                                      EDTCDE(L)
     A  39                              1 65'Kalkulator på'
     A                                      DSPATR(BL)
     A                                      COLOR(RED)
     A                                  2  3'Fakt.bel:'
     A            UFAKNO         9Y 0O  2 15COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 30'Frakt:'
     A            SIBEL8        11Y 2O  2 38TEXT('Frakt omberegnet')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 54'Rabatt:'
     A            SIBELC        11Y 2O  2 62COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  3'Andre kost:'
     A                                  3 30'Forsik:'
     A            SIBEL9        11Y 2O  3 15TEXT('Andre kost.omber')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            SIBELA         7Y 0O  3 38TEXT('Beløp Forsikring')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 54'CIFSUM:'
     A            WSBEL4         9Y 0O  3 62TEXT('Beløp CIFsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4  2'Velg option, 2=Endre 4=Slette 5=Vi-
     A                                      se'
     A                                      COLOR(BLU)
     A  37                              4 65'Auto kopi T.O.'
     A                                      DSPATR(BL)
     A                                      COLOR(RED)
     A                                  5  1'Op Linje Op Varenr.. TN P T.verdi.-
     A                                      .... Nettovekt       Mengde  PVA To-
     A                                      llsats MVA Avgift......... Varebesk-
S08  A*                                     rivelse                S'
N08  A                                      rivelse                S T'
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'Be om utskrift')
     A                                      CF05(05 'FRISK')
     A                                      CF06(06 'LAGE NY')
     A    N36                               CF07(07 'SØKE OPPDRAG')
     A                                      CF08(08 'SØK')
     A                                      CF09(09 'Kalkulator av/på')
     A                                      CF12(12 'Gå til bilde02')
     A                                      CF14(14 'SØK KUNDERS VAREREGISTER')
     A                                      CF15(15 'Automatisk kopiering av T.-
     A                                      O. fra linje til linje.')
     A                                      CF17(17 'Be om utskrift/behold en d-
     A                                      el oppl. for neste SAD')
     A                                      CA18(18 'UTVIDERT BILDE')
     A                                      CA19(19 'HENT FRA Z-FIL')
N44  A N36                                  CF20(20 'FRIE SØKEVEIER')
N08  A  51                                  CF22(22 'OMSTART OMBEREGING')
     A                                      SLNO(22)
     A                                      CLRL(06)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  2  2'Fsum->'
     A            SIBEL3        13Y 2O  2 10TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E11  A                                  2 25'Vsum->'
E11  A            W2VSUM        13Y 2O  2 32TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E11  A                                  2 47'Diff->'
E11  A            W2DIFF        13Y 2O  2 54TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(L)
N11  A                                  2 70'Tvkt->'
N11  A            SIVKB          9Y 0O  2 77TEXT('Beløp Faktsum')
N11  A                                      COLOR(WHT)
N11  A                                      EDTCDE(4)
N11  A                                  2 87'Lvkt->'
N11  A            W2VKB         13Y 3O  2 94TEXT('Beløp Faktsum')
N11  A                                      COLOR(WHT)
N11  A                                      EDTCDE(4)
N11  A                                  2109'Diff->'
N11  A            W2VDIF        13Y 3O  2116TEXT('Beløp Faktsum')
N11  A                                      COLOR(WHT)
N11  A                                      EDTCDE(L)
     A                                  3  2'F18=Full modul  F5=Forny   F6=Lage-
     A                                       ny'
     A                                      COLOR(BLU)
     A                                  3 42'F3=Neste/avslutt'
     A  35                                  COLOR(RED)
     A N35                                  COLOR(BLU)
     A                                  3 61'F9=Kalkulator'
     A                                      COLOR(BLU)
     A                                  4  2'F12=forrige  F14=K.varereg.  F19=A-
     A                                      utofortoll.'
     A                                      COLOR(BLU)
     A N36                              4 67'F7=Søk oppd.'
     A                                      COLOR(BLU)
N44  A N36                              4 80'F20=Frie søkeveier'
N44  A                                      COLOR(BLU)
     A                                  5  2'F15=Autokopiering T.O.linje  F17=N-
     A                                      este sad kopier fra denne  F8=Hopp -
     A                                      til'
     A                                      COLOR(BLU)
N08  A  51                              5 76'F22=Angre'
N08  A                                      COLOR(BLU)
     A N30        MSGTX2        78A  O  6  2COLOR(RED)
     A  30        MSGTXT        78A  O  6  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VARELI
     A                                      CSRLOC(LINNBR     POSNBR)
     A N40                                  CF03(03 'Be om utskrift')
     A                                      CF04(04 'Søk')
N44  A N36                                  CF07(07 'Søke oppdrag')
     A N40                                  CF09(09 'Kalkulator av/på')
     A                                      CF11(11 'Automatisk beregning av br-
     A                                      utto/nettovekt')
     A                                      CF12(12 'Forrige')
     A                                      CF13(13 'Oppdater søketekst på tari-
     A                                      ff-register')
     A N40                                  CF14(14 'SØK KUNDERS VAREREGISTER')
     A N40                                  CF15(15 'Automatisk kopiering av T.-
     A                                      O. fra linje til linje.')
     A                                      CF16(16 'JUSTERING')
     A N40                                  CF17(17 'Be om utskrift/behold en d-
     A                                      el oppl. for neste SAD')
     A                                      CA18(18 'UTVIDERT BILDE')
N44  A N36                                  CF20(20 'FRIE SØKEVEIER')
     A  60                                  CF21(21 'Automatisk beregning av br-
     A                                      utto/nettovekt')
     A  60                                  CF22(22 'MERK B PÅ STATUS')
     A                                      SLNO(22)
     A                                      CLRL(06)
     A                                      OVERLAY
     A          H                           HLPPNLGRP(SAD010 SAD061APNL)
     A                                      HLPARA(02 004 02 008)
     A          H                           HLPPNLGRP(SAD011 SAD061APNL)
     A                                      HLPARA(02 011 02 020)
     A          H                           HLPPNLGRP(SADPRE SAD061APNL)
     A                                      HLPARA(02 023 02 023)
     A          H                           HLPPNLGRP(SAD012 SAD061APNL)
     A                                      HLPARA(02 025 02 064)
     A          H                           HLPPNLGRP(SAD013 SAD061APNL)
     A                                      HLPARA(02 067 02 078)
     A          H                           HLPPNLGRP(SAD014 SAD061APNL)
     A                                      HLPARA(03 006 03 007)
     A          H                           HLPPNLGRP(SAD014A SAD061APNL)
     A                                      HLPARA(03 009 03 011)
     A          H                           HLPPNLGRP(SAD014B SAD061APNL)
     A                                      HLPARA(03 013 03 020)
     A          H                           HLPPNLGRP(SAD014C SAD061APNL)
     A                                      HLPARA(03 022 03 033)
     A          H                           HLPPNLGRP(SAD014D SAD061APNL)
     A                                      HLPARA(03 035 03 046)
     A          H                           HLPPNLGRP(SAD014E SAD061APNL)
     A                                      HLPARA(04 006 04 050)
     A          H                           HLPPNLGRP(SAD015 SAD061APNL)
     A                                      HLPARA(05 006 05 054)
     A          H                           HLPPNLGRP(SAD016 SAD061APNL)
     A                                      HLPARA(06 001 06 130)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            W2LI           5S 0H
     A            W2VNT          8S 0H
S07  A*           MSGNR          7A  P
     A                                  1  4'VF Opp Varenr.  TN P Tollverdi... -
     A                                      Bruttovekt... Nettovekt.... Mengde.-
     A                                      .. PVA T.sats Mf'
     A                                      COLOR(WHT)
     A            W2VF           1A  B  2  4TEXT('Verdi fasts.kode')
     A                                      DSPATR(UL)
     A  39                                  DSPATR(HI)
     A  89                                  DSPATR(RI)
     A  39                                  DSPATR(PR)
     A N39                                  COLOR(YLW)
     A                                      DUP
     A            W2LK           2A  B  2  7TEXT('Landk. oppr.land')
     A                                      DSPATR(UL)
     A  39                                  DSPATR(HI)
     A  88                                  DSPATR(RI)
     A  39                                  DSPATR(PR)
     A N39                                  COLOR(YLW)
     A                                      DUP
     A            W2VNTI         8A  B  2 11TEXT('Varenr Tolltariff')
     A                                      DSPATR(UL)
     A  39                                  DSPATR(HI)
     A  87                                  DSPATR(RI)
N08  A  28
     AO 39                                  DSPATR(PR)
     A N39                                  COLOR(YLW)
     A                                      DUP(61)
     A            W2TN           1A  B  2 20TEXT('Tollnedsettelse')
     A                                      DSPATR(UL)
     A  39                                  DSPATR(HI)
     A  86                                  DSPATR(RI)
     A  39                                  DSPATR(PR)
     A N39                                  COLOR(YLW)
     A                                      DUP
     A            W2PRE          1A  B  2 23TEXT('Preferanse')
     A                                      DSPATR(UL)
     A  39                                  DSPATR(HI)
     A  85                                  DSPATR(RI)
     A  39                                  DSPATR(PR)
     A N39                                  COLOR(YLW)
     A                                      DUP
     A            W2BELT        11Y 2B  2 25TEXT('Beløp Tollverdi')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      COMP(GE ,00)
S05  A*           W2VKTB         9Y 0B  2 38TEXT('Vekt Brutto')
N05  A            W2VKTB        12Y 3B  2 38TEXT('Vekt Brutto')
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
S05  A*           W2VKTN         9Y 0B  2 48TEXT('Vekt Netto')
N05  A            W2VKTN        12Y 3B  2 52TEXT('Vekt Netto')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            W2NTM          9Y 0B  2 66TEXT('Mengde')
     A                                      DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            W2PVA          1A  B  2 77TEXT('Enhet PVAF')
     A                                      DSPATR(UL)
     A  39                                  DSPATR(HI)
     A  82                                  DSPATR(RI)
     A  46
     AO 39                                  DSPATR(PR)
     A N39                                  COLOR(YLW)
     A                                      DUP
S02  A*           W2AS           5Y 2B  2 72TEXT('Avgiftssats')
     A            W2AS           7Y 2B  2 79TEXT('Avgiftssats')
     A                                      DSPATR(UL)
     A  39                                  DSPATR(HI)
     A  81                                  DSPATR(RI)
     A  46
     AO 39                                  DSPATR(PR)
     A N39                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            W2MFR          1A  B  2 88TEXT('MVA fri kod')
     A                                      DSPATR(UL)
     A  39
     AO 80                                  DSPATR(HI)
     A  46
     AO 39                                  DSPATR(PR)
     A N39                                  COLOR(YLW)
     A                                      DUP
     A                                  3  2'Avg'
     A            W2AKD1         2A  B  3  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      DUP
     A            W2ASV1         3A  B  3  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            W2ASA1         7Y 2B  3 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A  74                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            W2AGR1        11Y 2B  3 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            W2ABL1        11Y 2B  3 35DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3 74'Fsum->'
     A            SIBEL3        13Y 2O  3 81TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4  2'V.B'
S05  A*           W2FT          17A  B  4  6TEXT('Fritekst')
N05  A            W2FT01        28A  B  4  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      DUP
     A            W2NT01         6Y 0B  4 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            W2EH01         4A  B  4 42TEXT('Enhet')
     A  73                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      DUP
S05  A*           W2VT          15A  B  4 47TEXT('Varetekst')
N05  A            W2VT01        30A  B  4 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      DUP
S05  A*                                 4 70'Rf'
S05  A*                                 4 74'Vsum->'
S05  A*           W2VSUM        13Y 2O  4 81TEXT('Beløp Faktsum')
N05  A                                  4 89'Vsum->'
N05  A            W2VSUM        13Y 2O  4 96TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5  2'T.O'
     A            W2TOP1        17A  B  5  6DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      DUP
S05  A*           W2CREF         3A  B  5 70TEXT('KOMMUNIKASJONREF.')
N05  A                                  5 72'Rf'
N05  A            W2CRE1         3A  B  5 75TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A  76                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      DUP
S05  A*                                 5 74'Diff->'
S05  A*           W2DIFF        13Y 2O  5 81TEXT('Beløp Faktsum')
N05  A                                  5 89'Diff->'
N05  A            W2DIFF        13Y 2O  5 96TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(L)
     A N30        MSGTX2        78A  O  6  2COLOR(RED)
S07  A* 30        MSGTXT        78A  O  6  2MSGID(&MSGNR SYMSGF)
S07  A*                                     COLOR(WHT)
N07  A  30        MSGTX3        78A  O  6  2COLOR(WHT)
      *
     A          R JUSTL
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      WINDOW(*DFT 6 40 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CF04(04 'SØK')
     A                                      CF12(12 'FORRIGE')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'Justering på linjenivå'
     A                                      COLOR(WHT)
     A                                  2  2'Justering.....:'
     A            W3BEL         11  2B  2 18DSPATR(UL)
     A  89                                  DSPATR(HI)
     A N30
     AO 89                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A                                  3  2'% av vareverdi:'
     A            W3PROS         5  2B  3 18DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A                                  4  2'Valutakode....:'
     A            W3VAL          3A  B  4 18DSPATR(UL)
     A  88                                  DSPATR(HI)
     A  88                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  5  2'Beløp i NOK...:'
     A            W3BELN        13  2O  5 18DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      EDTCDE(L)
     A N30                              6  2'F12=Avbryt'
     A                                      COLOR(BLU)
     A  30        MSGTXT        36A  O  6  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R BILDE
     A                                      CF12(12 'Forrige')
     A                                  1  2'SYSPED/SAD061A'
     A                                      COLOR(BLU)
     A                                  1 21'TOLLDEKLARASJON'
     A                                      COLOR(WHT)
     A                                  1 40'Tdeknr'
     A            UAVD           4Y 0O  1 47COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 52'-'
     A                                      COLOR(WHT)
     A            UTDN           7Y 0O  1 54COLOR(WHT)
     A                                      EDTCDE(L)
     A                                  1 63'-'
     A                                      COLOR(WHT)
     A            SVLI           5Y 0O  1 65COLOR(WHT)
     A                                      EDTCDE(4)
     A            SVLN           5Y 0O  1 71COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1110DATE
     A                                      EDTCDE(Y)
     A                                  1120TIME
     A                                  2  4'VF Opp Varenr.  TN P Tollverdi... -
     A                                      Bruttovekt... Nettovekt.... Mengde.-
     A                                      .. PVA T.sats Mf'
     A                                      COLOR(WHT)
     A            SVVF           1A  O  3  4TEXT('Verdi fasts.kode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVLK           2A  O  3  7TEXT('Landk. oppr.land')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVVNT          8Y 0O  3 11TEXT('Varenr Tolltariff')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTWRD('0       ')
     A            SVTN           1A  O  3 20TEXT('Tollnedsettelse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVPRE          1A  O  3 23TEXT('Preferanse')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVBELT        11Y 2O  3 25TEXT('Beløp Tollverdi')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVVKTB        12Y 3O  3 38TEXT('Vekt Brutto')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVVKTN        12Y 3O  3 52TEXT('Vekt Netto')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVNTM          9Y 0O  3 66TEXT('Mengde')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVPVA          1A  O  3 77TEXT('Enhet PVAF')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVAS           7Y 2O  3 79TEXT('Avgiftssats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVMFR          1A  O  3 88TEXT('MVA fri kod')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2'Avg'
     A            SVAKD1         2A  O  4  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV1         3A  O  4  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA1         7Y 2O  4 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR1        11Y 2O  4 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL1        11Y 2O  4 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  4 50'Justering.....:'
     A            SJBEL         11Y 2O  4 66DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A            SVAKD2         2A  O  5  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV2         3A  O  5  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA2         7Y 2O  5 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR2        11Y 2O  5 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL2        11Y 2O  5 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 50'% av vareverdi:'
     A            SJPROS         5Y 2O  5 66DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A            SVAKD3         2A  O  6  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV3         3A  O  6  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA3         7Y 2O  6 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR3        11Y 2O  6 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL3        11Y 2O  6 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6 50'Valutakode....:'
     A            SJVAL          3A  O  6 66DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVAKD4         2A  O  7  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV4         3A  O  7  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA4         7Y 2O  7 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR4        11Y 2O  7 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL4        11Y 2O  7 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  7 50'Beløp i NOK...:'
     A            SJBELN        11Y 0O  7 66DSPATR(UL)
     A                                      DSPATR(HI)
     A                                      EDTCDE(L)
     A            SVAKD5         2A  O  8  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV5         3A  O  8  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA5         7Y 2O  8 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR5        11Y 2O  8 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL5        11Y 2O  8 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAKD6         2A  O  9  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV6         3A  O  9  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA6         7Y 2O  9 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR6        11Y 2O  9 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL6        11Y 2O  9 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAKD7         2A  O 10  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV7         3A  O 10  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA7         7Y 2O 10 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR7        11Y 2O 10 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL7        11Y 2O 10 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAKD8         2A  O 11  6TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASV8         3A  O 11  9TEXT('Avgiftskode')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVASA8         7Y 2O 11 13TEXT('Toll og Avg.sats')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVAGR8        11Y 2O 11 22TEXT('Avgiftsgrunnlag')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVABL8        11Y 2O 11 35DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12  2'V.B'
     A            SVFT01        28A  O 12  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT01         6Y 0O 12 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH01         4A  O 12 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVVT01        30A  O 12 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT02        28A  O 13  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT02         6Y 0O 13 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH02         4A  O 13 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVVT02        30A  O 13 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT03        28A  O 14  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT03         6Y 0O 14 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH03         4A  O 14 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVVT03        30A  O 14 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT04        28A  O 15  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT04         6Y 0O 15 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH04         4A  O 15 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVVT04        30A  O 15 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT05        28A  O 16  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT05         6Y 0O 16 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH05         4A  O 16 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVVT05        30A  O 16 47TEXT('Varetekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT06        28A  O 17  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT06         6Y 0O 17 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH06         4A  O 17 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVFT07        28A  O 18  6TEXT('Fritekst')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVNT07         6Y 0O 18 35TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            SVEH07         4A  O 18 42TEXT('Enhet')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19  2'T.O'
     A            SVTOP1        17A  O 19  6DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19 24'Ref.'
     A            SVCRE1         3A  O 19 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19 42'T.O'
     A            SVTOP2        17A  O 19 46DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19 64'Ref.'
     A            SVCRE2         3A  O 19 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP3        17A  O 20  6DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE3         3A  O 20 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP4        17A  O 20 46DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE4         3A  O 20 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP5        17A  O 21  6DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE5         3A  O 21 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP6        17A  O 21 46DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE6         3A  O 21 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP7        17A  O 22  6DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE7         3A  O 22 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP8        17A  O 22 46DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE8         3A  O 22 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP9        17A  O 23  6DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE9         3A  O 23 30TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVTOP10       17A  O 23 46DSPATR(UL)
     A                                      COLOR(YLW)
     A            SVCRE10        3A  O 23 70TEXT('KOMMUNIKASJONREF.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 26 57MSGCON(012 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R NYWRK
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF02(02 'MOTORVOGN-FORT.')
     A                                      CF03(03 'Be om utskrift')
     A                                      CF05(05 'FRISK')
     A                                      CF06(06 'LAGE NY')
     A N36                                  CF07(07 'Søke oppdrag')
     A                                      CF08(08 'Søk')
     A                                      CF09(09 'Kalkulator av/på')
     A                                      CF12(12 'Gå til bilde02')
     A                                      CF14(14 'SØK KUNDERS VAREREGISTER')
     A                                      CF15(15 'Automatisk kopiering av T.-
     A                                      O. fra linje til linje.')
     A                                      CF17(17 'Be om utskrift/behold en d-
     A                                      el oppl. for neste SAD')
     A                                      CA18(18 'UTVIDERT BILDE')
N44  A N36                                  CF20(20 'FRIE SØKEVEIER')
     A                                      CA19(19 'HENT FRA Z-FIL')
N08  A  51                                  CF22(22 'OMSTART OMBEREGING')
     A                                  1  2'SYSPED/SAD061A'
     A                                      COLOR(BLU)
     A                                  1 21'TOLLDEKLARASJON'
     A                                      COLOR(WHT)
     A                                  1 40'Tdeknr.'
     A            UAVD           4Y 0O  1 48COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 53'-'
     A                                      COLOR(WHT)
     A            UTDN           7Y 0O  1 55COLOR(WHT)
S08  A*                                     EDTCDE(4)
N08  A                                      EDTCDE(L)
     A  39                              1 65'Kalkulator på'
     A                                      DSPATR(BL)
     A                                      COLOR(RED)
     A                                  2  3'Fakt.bel:'
     A            UFAKNO         9Y 0O  2 15COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 30'Frakt:'
     A            SIBEL8        11Y 2O  2 38TEXT('Frakt omberegnet')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 54'Rabatt:'
     A            SIBELC        11Y 2O  2 62COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  3'Andre kost:'
     A                                  3 30'Forsik:'
     A            SIBEL9        11Y 2O  3 15TEXT('Andre kost.omber')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            SIBELA         7Y 0O  3 38TEXT('Beløp Forsikring')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 54'CIFSUM:'
     A            WSBEL4         9Y 0O  3 62TEXT('Beløp CIFsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4  2'Velg option, 2=Endre 4=Slette 5=Vi-
     A                                      se'
     A                                      COLOR(BLU)
     A  37                              4 65'Auto kopi T.O.'
     A                                      DSPATR(BL)
     A                                      COLOR(RED)
     A                                  5  1'Op Linje Op Varenr.. TN P T.verdi.-
     A                                      .... Nettovekt      Mengde  PVA To-
     A                                      llsats MVA Avgift......... Varebesk-
S08  A*                                     rivelse S'
N08  A                                      rivelse                S T'
     A                                      COLOR(WHT)
     A                                 23  2'Fsum->'
     A            SIBEL3        13Y 2O 23 10TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E11  A                                 23 25'Vsum->'
E11  A            W2VSUM        13Y 2O 23 32TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
E11  A                                 23 47'Diff->'
E11  A            W2DIFF        13Y 2O 23 54TEXT('Beløp Faktsum')
     A                                      COLOR(WHT)
     A                                      EDTCDE(L)
N11  A                                  2 70'Tvkt->'
N11  A            SIVKB          9Y 0O  2 77TEXT('Beløp Faktsum')
N11  A                                      COLOR(WHT)
N11  A                                      EDTCDE(4)
N11  A                                  2 87'Lvkt->'
N11  A            W2VKB         13Y 3O  2 94TEXT('Beløp Faktsum')
N11  A                                      COLOR(WHT)
N11  A                                      EDTCDE(4)
N11  A                                  2109'Diff->'
N11  A            W2VDIF        13Y 3O  2116TEXT('Beløp Faktsum')
N11  A                                      COLOR(WHT)
N11  A                                      EDTCDE(L)
     A                                 24  2'F2=Motorv.fort. F5=Forny   F6=Lage-
     A                                       ny '
     A                                      COLOR(BLU)
     A                                 24 42'F3=Neste/avslutt'
     A  35                                  COLOR(RED)
     A N35                                  COLOR(BLU)
     A                                 24 61'F9=Kalkulator'
     A                                      COLOR(BLU)
     A                                 25  2'F12=forrige  F14=K.varereg.  F19=A-
     A                                      utofortoll.'
     A                                      COLOR(BLU)
     A N36                             25 67'F7=Søk oppd.'
     A                                      COLOR(BLU)
N44  A N36                             25 80'F20=Frie søkeveier'
N44  A                                      COLOR(BLU)
     A                                 26  2'F15=Auto T.O.linje  F17=Neste sad -
     A                                      kopier fra denne  F8=Hopp til  F18=-
     A                                      Full moduls'
     A                                      COLOR(BLU)
N08  A  51                             26 84'F22=Angre'
N08  A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGFHOL)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A*
     A          R VAREL2
     A*%%TS  SD  20141002  193547  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      SLNO(22)
     A                                      CLRL(06)
     A                                  1  2'Hopp til linje   -->'
     A            W3LN           5Y 0I  1 24DSPATR(UL)
     A                                      DSPATR(PC)
     A                                  2  2'Hopp til varenr. -->'
     A            W3VNT          8Y 0B  2 24DSPATR(UL)
     A            W3LK           2A  I  2 34DSPATR(UL)
     A                                  3  2'Hopp til postnr. -->'
     A            W3LI           5S 0I  3 24DSPATR(UL)
     A                                  4  2'Hopp til land/Vare->'
     A            W3LK2          2   I  4 24
     A            W3VNT2         8Y 0B  4 27DSPATR(UL)
     A                                  5  2'F12=Forrige'
     A                                      COLOR(BLU)
      *
     A          R SUBFIL2                   SFL
     A            WSNR           1A  O  6  2
     A            SVLI           5Y 0H
     A            SVREFL         5Y 0H
     A            WXLN           5Y 0O  6  4EDTCDE(4)
     A            SVLK           2A  O  6 10TEXT('Landk. oppr.land')
     A            SVVNT          8S 0O  6 13TEXT('Varenr Tolltariff')
     A            SVTN           1A  O  6 22TEXT('Tollnedsettelse')
     A            SVPRE          1A  O  6 25TEXT('Preferanse')
     A            SVBELT        11Y 2O  6 27EDTCDE(4)
S05  A*           SVVKTN         9Y 0O  6 40EDTCDE(4)
N05  A            SVVKTN        12Y 3O  6 40EDTCDE(4)
     A            SVNTM          9Y 0O  6 50EDTCDE(4)
     A            SVPVA          1A  O  6 60TEXT('Enhet PVAF')
S02  A*           SVAS           5Y 2O  6 54TEXT('Avgiftssats')
N02  A            SVAS           7Y 2O  6 64TEXT('Avgiftssats')
     A                                      EDTCDE(4)
     A            SVMFR          1A  O  6 73TEXT('MVA fri kod')
     A            SVAKD1         2A  O  6 77TEXT('Avgiftskode')
     A  27                                  COLOR(YLW)
     A            SVASV1         3A  H
     A            SVABL1        11Y 2O  6 80EDTCDE(4)
     A  27                                  COLOR(YLW)
S05  A*           SVVT          15A  O  6 93
N05  A            SVVT01        30A  O  6 93
     A  27                                  COLOR(YLW)
S05  A*           SV01           1A  O  6109DSPATR(BL)
N05  A            SV01           1A  O  6124DSPATR(BL)
     A                                      COLOR(RED)
N08  A            SVPREÆ         1   O  6126DSPATR(BL)
N08  A                                      COLOR(RED)
      *
     A          R SUBCTL2                   SFLCTL(SUBFIL2)
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A  41                                  SFLDSP
     A  42                                  SFLDSPCTL
     A  43                                  SFLCLR
     A  44                                  SFLEND
     A  41N43N44                            ROLLUP(25)
     A            ZRECN2         4S 0O  1 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SAD061A'
     A                                      COLOR(BLU)
     A                                  1 21'TOLLDEKLARASJON'
     A                                      COLOR(WHT)
     A                                  1 40'Tdeknr.'
     A            UAVD           4Y 0O  1 48COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 53'-'
     A                                      COLOR(WHT)
     A            UTDN           7Y 0O  1 55COLOR(WHT)
S08  A*                                     EDTCDE(4)
N08  A                                      EDTCDE(L)
     A                                  3  2'Trykk Enter for å bekrefte at du v-
     A                                      algte 4=Slette.'
     A                                      COLOR(BLU)
     A                                  4  2'Trykk F12 for å gå tilbake og endr-
     A                                      e valget.'
     A                                      COLOR(BLU)
     A                                  5  1'Op Postn Op Varenr.. TN P T.verdi.-
     A                                      .... Nettovekt      Mengde  PVA To-
     A                                      llsats MVA Avgift......... Varebesk-
S08  A*                                     rivelse S'
N08  A                                      rivelse                S T'
     A                                      COLOR(WHT)
     A          R BUNN2
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF12(12 'Gå tilbake')
     A                                      SLNO(26)
     A                                      CLRL(02)
     A                                      OVERLAY
     A                                  1  2'F12=Avbryt'
     A                                      COLOR(BLU)
      *
     A          R BEKREFT
     A                                      WINDOW(*DFT 6 40 *NOMSGLIN)
     A                                      CF12(12 'Avbryt')
     A                                      OVERLAY
     A                                  1  2'Hent varelinjer fra Z-filer på nyt-
     A                                      t'
     A                                      COLOR(WHT)
     A                                  3  2'ENTER = Slette alle eksistrerende '
     A                                      COLOR(BLU)
     A                                  4  2'        linjer og hente linjer fra'
     A                                      COLOR(BLU)
     A                                  5  2'        Z-filer'
     A                                      COLOR(BLU)
     A                                  6  2'F12   = Avbryt'
     A                                      COLOR(BLU)
      *
     A          R OPDTANR
     A                                      WINDOW(*DFT 7 45 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CF04(04 'SØKING')
     A                                  1  2'SYSPED/SAD061A'
     A                                      COLOR(BLU)
     A                                  1 18'OPPDATER TOLLTARIFFNR'
     A                                      COLOR(WHT)
     A                                  3  2'VARENR:'
     A            VAANR         15A  O  3 10
     A            VAVARE        35A  O  4 10
     A                                  5  2'TARIFF:'
     A            W2VNTI         8A  B  5 10DSPATR(UL)
     A            W2VNT          8S 0H
     A                                  6  2'F4=SØK'
     A                                      COLOR(BLU)
     A  99                              7  2'OPPGITT TOLLTARIFFNR ER FEIL.'
     A                                      COLOR(WHT)
N01   *
N01  A          R SPLITT
N02  A                                      WINDOW(*DFT 7 45 *NOMSGLIN)
N02  A                                      OVERLAY
N02  A                                  1  2'SYSPED/SAD061A'
N02  A                                      COLOR(BLU)
N02  A                                  1 18'Auto splitt linjer'
N02  A                                      COLOR(WHT)
N02  A                                  3  2'Dette oppdraget har flere enn 8 av-
N02  A                                      gifter.'
N02  A                                      COLOR(RED)
N02  A                                  5  2'Vil du la program splitte alle lin-
N02  A                                      jer med'
N02  A                                  6  2'avgift GG/MG eller tollnedsettelse-
N02  A                                      =S til'
N02  A                                  7  2'et nytt oppdrag ?'
N02  A            WSSPLITT       1A  B  7 20DSPATR(UL)
N02  A                                  7 22'(J/N)'
N09   *
N09  A          R VISMELD
N09  A                                      WINDOW(*DFT 5 40 *NOMSGLIN)
N09  A                                      OVERLAY
N09  A                                  2  2'Minst en linje med gull farge på'
N09  A                                      COLOR(YLW)
N09  A                                  3  2'tariff er ikke gjennomgått.'
N09  A                                      COLOR(YLW)
N09  A                                  4  2'Bruk opsjon 2 eller 8 på disse lin-
N09  A                                      jene.'
N09  A                                      COLOR(WHT)
