********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 FEIL INDIKATOR PÅ TEKST
10318 * 02 YBC PTF10 VEKT ER ENDRET FRA 5.0 TIL 12.3
      *              VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
xxxxxx*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
11XXX * 03 YBC PTF11 NÅ ER DET NOK PLASS TIL GODSNR. TRENG IKKE HØYREINNST.
11XXX * 04 YBC PTF11 REFERANSE
11XXX * 05 YBC PTF11 SKRIV 3 EKSTRA T.O.-LINJER
11XXX * 06 YBC PTF11 SKRIV UT ENDRING AV AVGIFTER
11XXX * 07 YBC PTF11 SKRIV UT LØPENR AV OPPRINNELIG SAD PÅ OMBEREGNING
********************************************************************
      *
      *  TOLLDEKLARASJON   EKSPORT
      *
      *  DEL1
      *
     A          R DEL1
     A            KFMT1         75      1  1
     A                                  2 14'REF:'
     A            SEAVD          4S 0   2 19EDTCDE(Z)
     A                                  2 23'/'
     A            SETDN          7S 0   2 24EDTCDE(Z)
     A                                  2 31'/'
     A            SESG           3      2 32
     A            FSSO25        15      2 38
N06  A N26
E06  AA 39   N37                        2 93'LINJEDEKLARERT'
S01  A* 39 34N37                        2 93'L.DEKLARERT KOPI'
N06  A N26
E06  AAN39 34N37                        2 93'L.DEKLARERT KOPI'
N06  A N26
E06  AA 39    37                        2 93'UTLEV.-ATTEST '
N06  A N26
E06  AAN39 34 37                        2 93'UTLEV-ATTEST KOPI'
N06  A  26                              2 88'OMBEREGNING:'
N06  A  26        SEMF           3A     2101
N06  A  26        SETYPE         4A     2105
E24  A                                  4 10'**'
     A            XRG           11      4 41
     A            SEDTG         10      4 88
N07  A  26                              4104'ORI.:'
N07  A  26        OMB_SEDTG     10      4110
E24  A                                  5 10'**'
     A            SENAK         30      5 14
     A            SEDTY          2      5 69
     A            XDP1           1S 0   5 74
     A            SETLL         10      5 88
N07  A  26        OMB_SETLL     10      5110
     A            SEADK1        30      6 14
     A            SETLE          6      6 88
N07  A  26        OMB_SETLE      6      6110
     A            SEADK2        30      7 14
     A            XSIDE          2S 0   7 68EDTCDE(Z)
     A            XTSIDE         2S 0   7 73EDTCDE(Z)
     A            SEADK3        30      8 14
     A            SEKNK          8S 0  10104EDTCDE(Z)
     A            XNR            5S 0  11 70EDTCDE(Z)
     A            SENTK          7S 0  11 80EDTCDE(Z)
S04  A*           SEAVD1         4S 0  11 90EDTCDE(Z)
S04  A*           SETDN1         7S 0  11 94EDTCDE(Z)
S04  A*           SESG1          3     11101
N04  A            SEAVD1         4S 0  11 89
N04  A                                 11 93'/'
N04  A            SETDN1         7S 0  11 94
N04  A                                 11101'/'
N04  A            SESG1          3     11102
     A            SEKNS          8S 0  13 48EDTCDE(Z)
     A            SENAS         30     14 14
     A            SEADS1        30     15 14
     A            SEADS2        30     16 14
     A            SEADS3        30     17 14
     A            SETLF         12     22 40
     A            SENAD         30     23 14
     A            SELKAT        17     23 69
     A            SELKA          2     23 97
     A            SELKB          2     23110
     A            SEFTB         17     26 96
     A            SEKDC          1     30 64
     A            SELV2          3     30 69
     A            SELVT         17     30 75
     A            SETRID        17     33 14
     A            SELKT          2     33 63
     A N89N93     SEVAL1         3     33 69
     A N89N93N43  XBEL1         13S 2  33 77EDTCDE(M)
     A N89N93N43  SEVKU          7S 3  33 94EDTCDE(M)
     A            SETST          1S 0  33110
     A            SETRM          2S 0  36 14
     A N60        SEFIF         17     36 69
     A N60 92     SEFIDÅ         4S 0  36 99
     A N60 92                          36103'.'
     A N60 92     SEFIDM         2S 0  36104
     A N60 92                          36106'.'
     A N60 92     SEFIDD         2S 0  36107
     A  60                             36 77'SE FAKTURAOVERSIKT'
E24  A                                 38 10'**'
E24  A                                 39 10'**'
     A            SEKDFT        17     39 14
     A            SELS          16     39 42
     A                                 39 58' '
     A            SEKDLS         2     39 64
      *
     A            XN2            4S 0  42 72EDTCDE(Z)
     A            XWFVN1         6S 0  42 86EDTWRD('0    &  ')
     A            XWFVN2         2S 0  42 95
      *
     A            WFEKN1A       24A    43 14
     A N99        WFEANT         6S 0  43 39EDTCDE(Z)
     A N99        WFEVT          4     43 46
     A  99        WFEVT1         4     43 39
     A  99        WFEANT1        6S 0  43 44
     A            WFEVB1        30A    43 51
      *
     A            WFEKN2A       24A    44 14
     A            WFEVB2        30A    44 51
      *
     A            WFEKN3A       24A    45 14
     A            WFEVB3        30A    45 51
     A            WFEFYL         2     45 90
     A            WFEVKB         9S 0  45 97EDTCDE(Z)
      *
     A N95        WFEKN4A       24A    46 14
     A N95        WFEVB4        30A    46 51
     A  95                             46 14'Varemottaker:'
     A  95        HENAK         30     46 36
      *
     A N95        WFEKN5A       24A    47 14
     A N95        WFEVB5        30A    47 51
     A  95                             47 14'(Empfanger)  '
     A  95        HEADK1        30     47 36
      *
     A N95        WFEKN6A       24A    48 14
     A*N95        WFEVB6        30A    48 51
     A  95                             48 14'(Consignee)  '
     A  95        HEADK2        30     48 36
     A            SEDP           2S 0  48 83
     A            WFEVKN         9S 0  48 97EDTCDE(Z)
      *
     A N95        WFEKN7A       24A    49 14
     A*N95N48     WFEVB7        30A    49 51
     A*N95 48 91  WFEVB71       30A    49 51
     A N95 48N91                       49 52'EX Cont:'
     A N95 48N91  HETRCN        17     49 61
      *
     A  95        HEADK3        30     49 36
      *
     A            WFETO1        45     54 14
     A            XVNTM          9S 0  54 85EDTCDE(Z)
      *
     A            WFETO2        45     55 14
      *
     A            WFETO3        45     56 14
      *
     A            WFETO4        45     57 14
      *
     A            WFETO5        45     58 14
N05  A            WFETO6        45     59 14
N05  A            WFETO7        45     60 14
     A            WFESTB        11S 0  60100EDTCDE(Z)
N05  A            WFETO8        45     61 14
      *
     A            WTY01          2     63 15
     A            WGL01          9S 0  63 23EDTCDE(Z)
     A            WST01          7S 3  63 38EDTCDE(2)
     A            WPR01          1     63 46
     A            WBL01          9S 0  63 53EDTCDE(Z)
     A N41N42     SEKTC          1     63 68
     A N41N42     SEKTA          5S 0  63 69
     A N41N42                          63 74'-'
     A N41N42     SEKTB          2S 0  63 75
     A  41                             63 68'DAGSOPPGJØR'
     A  42                             63 68'KONTANT    '
S03  A*           UTGNP         22     63 94
N03  A            UTGNP         25     63 95
      *
     A            WTY02          2     64 15
     A            WGL02          9S 0  64 23EDTCDE(Z)
     A            WST02          7S 3  64 38EDTCDE(2)
     A            WPR02          1     64 46
     A            WBL02          9S 0  64 53EDTCDE(Z)
      *
     A            WTY03          2     65 15
     A            WGL03          9S 0  65 23EDTCDE(Z)
     A            WST03          7S 3  65 38EDTCDE(2)
     A            WPR03          1     65 46
     A            WBL03          9S 0  65 53EDTCDE(Z)
      *
     A            WTY04          2     66 14
     A            WGL04          9S 0  66 23EDTCDE(Z)
     A            WST04          7S 3  66 38EDTCDE(2)
     A            WPR04          1     66 46
     A            WBL04          9S 0  66 53EDTCDE(Z)
     A            XBETALT       30     66 72
      *
     A            XFAKTNR       30     67 72
     A            XBETALL       30     68 72
      *
     A            XTOT          10S 0  74 52EDTCDE(Z)
      *
     A            SEGFT1        30     87 14
      *
     A            SEGFT2        30     88 14
     A            SEGKD          1S 0  88 83EDTCDE(Z)
      *
     A            SEDST         15     92 81
     A            PRODAT        10     92104
      *
     A            SENAD1        30     95 81
      *
     A            SETARF        16     97 81
N00   * ENDRING 38 I RPG
N00  A            EPOSTT        50     99 81
      *
     A            KFMT2         75    105  1
      ***************************************************
      *  DLDEL1
      ***************************************************
     A          R DLDEL1
     A            KFMT1         75      1  1
     A                                  2 14'REF:'
     A            SEAVD          4S 0   2 19EDTCDE(Z)
     A                                  2 23'/'
     A            SETDN          7S 0   2 24EDTCDE(Z)
     A                                  2 31'/'
     A            SESG           3      2 32
     A            FSSO25        15      2 38
N06  A N26
E06  AA 39   N37                        3 93'LINJEDEKLARERT'
S01  A* 39 34N37                        3 93'L.DEKLARERT KOPI'
N06  A N26
E06  AAN39 34N37                        3 93'L.DEKLARERT KOPI'
N06  A N26
E06  AA 39    37                        3 93'UTLEV.-ATTEST '
N06  A N26
E06  AAN39 34 37                        3 93'UTLEV-ATTEST KOPI'
N06  A  26                              3 88'OMBEREGNING:'
N06  A  26        SEMF           3A     3101
N06  A  26        SETYPE         4A     3105
E24  A                                  4 10'**'
     A            XRG           11      4 41
     A            SEDTG         10      4 88
N07  A  26                              4104'ORI.:'
N07  A  26        OMB_SEDTG     10      4110
      *
E24  A                                  5 10'**'
     A            SENAK         30      5 14
     A            SEDTY          2      5 69
     A            XDP1           1S 0   5 74
     A            SETLL         10      5 88
N07  A  26        OMB_SETLL     10      5110
      *
     A            SEADK1        30      6 14
     A            SETLE          6      6 88
N07  A  26        OMB_SETLE      6      6110
      *
     A            SEADK2        30      7 14
      *
     A            SEADK3        30      8 14
     A            SEKNK          8S 0  10104EDTCDE(Z)
      *
     A            XNR            5S 0  11 70EDTCDE(Z)
     A            SENTK          7S 0  11 80EDTCDE(Z)
S04  A*           SEAVD1         4S 0  11 90EDTCDE(Z)
S04  A*           SETDN1         7S 0  11 94EDTCDE(Z)
S04  A*           SESG1          3     11101
N04  A            SEAVD1         4S 0  11 89
N04  A                                 11 93'/'
N04  A            SETDN1         7S 0  11 94
N04  A                                 11101'/'
N04  A            SESG1          3     11102
      *
     A            SEKNS          8S 0  13 48EDTCDE(Z)
     A            SENAS         30     14 14
     A            SEADS1        30     15 14
     A            SEADS2        30     16 14
     A            SEADS3        30     17 14
     A            SETLF         12     22 40
     A            SENAD         30     23 14
     A            SELKAT        17     23 69
     A            SELKA          2     23 97
     A            SELKB          2     23110
     A            SEFTB         17     26 96
      *
     A            SEKDC          1     30 64
     A            SELV2          3     30 69
     A            SELVT         17     30 75
      *
     A            SETRID        17     33 14
     A            SELKT          2     33 63
     A N89N93     SEVAL1         3     33 69
     A N89N93N43  XBEL1         13S 2  33 77EDTCDE(M)
     A N89N93N43  SEVKU          7S 3  33 94EDTCDE(M)
     A            SETST          1S 0  33110
      *
     A            SETRM          2S 0  36 14
     A N60        SEFIF         17     36 69
     A N60 92     SEFIDÅ         4S 0  36 99
     A N60 92                          36103'.'
     A N60 92     SEFIDM         2S 0  36104
     A N60 92                          36106'.'
     A N60 92     SEFIDD         2S 0  36107
     A  60                             36 77'SE FAKTURAOVERSIKT'
E24  A                                 38 10'**'
E24  A                                 39 10'**'
     A            SEKDFT        17     39 14
     A            SELS          16     39 42
     A                                 39 58' '
     A            SEKDLS         2     39 64
      *
     A            SEFT1         45     45 14
     A            XTVKTB         9S 0  45 97EDTCDE(Z)
      *
     A  95                             46 14'Varemottaker:'
     A  95        HENAK         30     46 36
     A  95                             47 14'(Empfanger)  '
     A  95        HEADK1        30     47 36
     A  95                             48 14'(Consignee)  '
     A  95        HEADK2        30     48 36
     A            SEDP           2S 0  48 83
     A N95        SEFT2         45     48 14
     A  95        HEADK3        30     49 36
      *
     A            SEFT3         45     55 14
     A            WFETO3        45     56 14
     A            WFETO4        45     57 10
     A            WFETO5        45     58 10
      *
     A            WT101          2     63 15
     A            WT201          9S 0  63 53EDTCDE(Z)
     A N41N42     SEKTC          1     63 68
     A N41N42     SEKTA          5S 0  63 69
     A N41N42                          63 74'-'
     A N41N42     SEKTB          2S 0  63 75
     A  41                             63 68'DAGSOPPGJØR'
     A  42                             63 68'KONTANT    '
S03  A*           UTGNP         22     63 94
N03  A            UTGNP         25     63 95
      *
     A            WT102          2     64 15
     A            WT202          9S 0  64 53EDTCDE(Z)
      *
     A            WT103          2     65 15
     A            WT203          9S 0  65 53EDTCDE(Z)
      *
     A            WT104          2     66 15
     A            WT204          9S 0  66 53EDTCDE(Z)
      *
     A            XBETALT       30     66 72
     A            XFAKTNR       30     67 72
     A            XBETALL       30     68 72
      *
     A            XTOT          10S 0  74 52EDTCDE(Z)
      *
     A            SEGFT1        30     87 14
      *
     A            SEGFT2        30     88 14
     A            SEGKD          1S 0  88 83EDTCDE(Z)
      *
     A            SEDST         15     92 81
     A            PRODAT        10     92104
      *
     A            SENAD1        30     95 81
      *
     A            SETARF        16     97 81
N38  A            EPOSTT        50     99 81
      *
     A            KFMT2         75    105  1
      ***************************************************
      *  DLDEL1
      ***************************************************
      *
     A          R OVL
     A                                      ENDPAGE
     A                                      OVERLAY(&FB01 7.5 4.3)
     A            FB01           8A  P
