     A          R SAD62AWR
     A            SAD62A1        4S 0       COLHDG('Avdeling')
     A            SAD62A2        7S 0       COLHDG('Tolldeklarasjonsnr')
     A            SAD62A3        1          COLHDG('Sortering 1 2 3')
     A            SAD62A4        2          COLHDG('Avgiftstype')
     A            SAD62A5        7S 2       COLHDG('Avgiftssats')
     A            SAD62A6       13S 2       COLHDG('Avgiftsgrunnlag')
     A            SAD62A7       13S 0       COLHDG('Avgiftsbeløp')
     A          K SAD62A1
     A          K SAD62A2
     A          K SAD62A3
     A          K SAD62A4
     A          K SAD62A5
