     A          R SAD62BWR
     A            SAD62B3        1          COLHDG('Sortering 1 2 3')
     A            SAD62B4        2          COLHDG('Avgiftstype')
     A            SAD62B5        7S 2       COLHDG('Avgiftssats')
     A            SAD62B6       13S 2       COLHDG('Avgiftsgrunnlag')
     A            SAD62B7       13S 0       COLHDG('Avgiftsbeløp')
     A          K SAD62B3
     A          K SAD62B4
     A          K SAD62B5
