     A*____________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Signatur
     A*""""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('Signatur')
     A          K SIAVD
     A          K SISG
     A          K SIDT
