     A                                      REF(SR)
     A          R SADHINR
     A            INSIAVD        4S 0       COLHDG('AVDELING')
     A            INSITDN   R               REFFLD(TDN)
     A            INSIVF         1          COLHDG('Standard VF')
     A            INSIBVNV       4S 2       COLHDG('Fakt Br/ne.vekt')
     A          K INSIAVD
     A          K INSITDN
