     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Kjøper
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('Kjøper')
     A          K SIAVD
     A          K SIKNK
     A          K SIDT
