     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Status
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('Status')
     A          K SIST
     A          K SIAVD
     A          K SITDN
