     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Selger
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('Selger')
     A          K SIAVD
     A          K SIKNS
     A          K SIDT
