     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Instikk
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('Instikk')
     A          K SIAVD
     A          K SIMI
