     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Godsnr
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('Godsnr')
     A          K SIAVD
     A          K SIGN
