     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Løpenr (KOMPLIMERT)
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADHRCMP                  PFILE(SADHCMP)
     A                                      TEXT('Løpenr')
     A          K SIAVD
     A          K SITLL
