      *__________________________________________
      * SYSPED / Tolldeklarasjoner Import, Kjøper
      *""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A          K SIAVD
     A          K SIRG
     A          K SIDT
