     A          R SADHRCMP                  PFILE(SADHCMP)
     A                                      TEXT('Regdato')
     A            SIAVD     R
     A            SITDN     R
     A            SIDT      R
     A          K SIDT
