     A*____________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Signatur (KOMPLIMERT)
     A*""""""""""""""""""""""""""""""""""""""""""""
     A          R SADHRCMP                  PFILE(SADHCMP)
     A                                      TEXT('Signatur')
     A          K SIAVD
     A          K SISG
     A          K SIDT
