     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Godsnr (KOMPLIMERT)
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADHRCMP                  PFILE(SADHCMP)
     A                                      TEXT('Godsnr')
     A          K SIAVD
     A          K SIGN
