      *___________________________________________
      * SYSPED / Tolldeklarasjoner Import, Regdato
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A          K SIDT
     A          K SIAVD
     A          K SITDN
