     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Regdato (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADHRCMP                  PFILE(SADHCMP)
     A                                      TEXT('Regdato')
     A          K SIAVD
     A          K SIDT
