      *__________________________________________
      * SYSPED / Tolldeklarasjoner Import, eksp.sted/Løpenr
      *""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A          K SITLE
     A          K SITLL
