     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import, Løpenr
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A                                      TEXT('Løpenr')
     A          K SIAVD
     A          K SITLL
