      *__________________________________________
      * SYSPED / Tolldeklarasjoner Import, Kjøper
      *""""""""""""""""""""""""""""""""""""""""""
     A          R SADHR                     PFILE(SADH)
     A          K SIKNK
     A          K SIDT
     A          K SIAVD
     A          K SITDN
