********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
12001 * 01 YBC PTF12 NYTT FELT FOR MVA-REGISTRTERT
********************************************************************
     A*__________________________________
     A* SYSPED / Tolldeklarasjoner Import (KOMPLIMERT)
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SADHRCMP
     A            SIAVD          4S 0       COLHDG('AVDELING')
     A            SITDN          7S 0       COLHDG('TOLLDEK.NR.')
E01  A            SISG      R               REFFLD(SG)
E01  A            SIDT      R               REFFLD(DT)
E01  A                                      COLHDG('Registreringsdato')
     A            SIKNS          8S 0       COLHDG('Kundenr Selger')
     A            SINAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            SINTK     R               REFFLD(NTK)
     A            SIVKB     R               REFFLD(VKT9)
     A                                      COLHDG('Bruttovekt')
     A            SIKNK          8S 0       COLHDG('Kundenr Kjøper')
     A            SIRG          11A         COLHDG('FORETAKSNR.')
N01  A            SIMVA          1A         COLHDG('J/N MVA-REGISTRERT')
     A            SINAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            SIVAL1    R               REFFLD(VAL)
     A                                      COLHDG('Valutakode Frakt')
     A            SIBEL1    R               REFFLD(BEL11)
     A                                      COLHDG('Beløp tollb.frakt')
     A            SIVAL2    R               REFFLD(VAL)
     A                                      COLHDG('Val.kode A. kost')
     A            SIBEL2    R               REFFLD(BEL11)
     A                                      COLHDG('Beløp A. kost')
     A            SIFTG2    R               REFFLD(KDFT)
     A                                      COLHDG('Fortegn +/- a.kost')
     A            SIVAL3    R               REFFLD(VAL)
     A                                      COLHDG('Val.kode Faktsum')
     A            SIBEL3    R               REFFLD(BEL13)
     A                                      COLHDG('Beløp Faktsum')
     A            SIGN          15          COLHDG('GODSNR.')
     A            SIDTG     R               REFFLD(DTG)
     A            SITLL     R               REFFLD(TLL)
     A            SITLE     R               REFFLD(TLE)
     A            SIBEL5    R               REFFLD(BEL9)
     A                                      COLHDG('Beløp Tot Toll')
     A            SIBEL6    R               REFFLD(BEL9)
     A                                      COLHDG('Beløp Tot MVA')
     A            SIBEL7    R               REFFLD(BEL110)
     A                                      COLHDG('Beløp Tot avg')
     A          K SIAVD
     A          K SITDN
