********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10244 * 01 YBC PTF10 VARENUMMER ER UTVIDERT FRA 15A TIL 28A
10262 * 02 YBC PTF10 SATS ER UTVIDERT TIL 7.2,
10286 * 03 YBC PTF10 SLVEKT ER ENDRET FRA 5.0 TIL 12.3
********************************************************************
     A*_____________________________________
     A* SYSPED / KUNDERS VAREREGISTER (SAD)
     A*"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SADLR
     A            SLSTAT         1          TEXT('STATUS')
     A            SLKNR          8S 0       TEXT('KUNDENR.')
S01  A*           SLALFA        15          TEXT('ALFASØKING')
N01  A            SLALFA        28          TEXT('ALFASØKING')
     A            SLTXT         25          TEXT('BESKRIVELSE')
      * SISTE 5 TEGN PÅ SLTXT BRUKES FOR SLR31,SLPRE,SLMFR, OSV
      *           SLR31          1          TEXT('TEKST TIL RUBR. 31')
      *           SLPRE          1          TEXT('PREFERANSE')
      *           SLMFR          1          TEXT('MOMS FRI')
      *
     A            SLOPPL         2          TEXT('OPPRINGELSE LAND')
S03  A*           SLVEKT         5S 0       TEXT('VEKR')
N03  A            SLVEKT        12S 3       TEXT('VEKR')
     A            SLTANR         8S 0       TEXT('TARIFFNR.')
     A            SLTAR          3          TEXT('RESERVERT TARIFFNR.')
     A            SLPVA          1          TEXT('PVA')
S02  A*           SLSATS         5P 2       TEXT('PVA SATS')
N02  A            SLSATS         7S 2       TEXT('PVA SATS')
     A            SLTN           1          TEXT('TOLLNEDSETTELSE')
     A            SLKDAÆ         2          COLHDG('AVGIFTSKODE')
     A            SLKDSÆ         3A         COLHDG('AVGIFTS SEKVENS')
     A            SLTO          45          COLHDG('TILLEGGSOPPLYSNINGER')
     A            SLCREF         3          COLHDG('KOMMUNIKASJONREF.')
     A          K SLKNR
     A          K SLALFA
