     A          R SADMAVFR
     A            MAKD           2A         COLHDG('AVGIFTSKODE')
     A            MARG           9S 0       COLHDG('ORGANISASJONSNR')
     A            MANV          35A         COLHDG('FIRMANVN')
     A            MAAD1         35A         COLHDG('ADRESSE')
     A            MAPN           4S 0       COLHDG('POSTNR')
     A            MAST          35A         COLHDG('POSTSTED')
     A          K MAKD
     A          K MARG
