      *_________________________________________________
      * SYSPED / Tolldekl. Import Varelinjer (JUSTERING)
      *"""""""""""""""""""""""""""""""""""""""""""""""""
      *#############################################################
      * OBS!!!  SAMME SOM SADVJ MED ET EKSTRA FELT FOR OMBEREGNINGSNR
      *#############################################################
     A                                      REF(SR)
     A          R SADOMTVJR
     A            SJAVD     R               REFFLD(AVD)
     A            SJTDN     R               REFFLD(TDN)
     A            SJOMBN         2S 0       COLHDG('OMBEREGNSNR')
     A            SJLI      R               REFFLD(LI5)
     A            SJVAL     R               REFFLD(VAL)
     A                                      COLHDG('VALUTAKODE')
     A            SJBEL     R               REFFLD(BEL11)
     A                                      COLHDG('Beløp JUSTERING')
     A            SJBELN    R               REFFLD(BEL110)
     A                                      COLHDG('NOK JUSTERING')
     A            SJPROS         5P 2       COLHDG('PROSENT')
     A          K SJAVD
     A          K SJTDN
     A          K SJOMBN
     A          K SJLI
