     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, SELGER
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTRHR                   PFILE(SADTRH)
     A                                      TEXT('SELGER')
     A          K SEAVD
     A          K SEKNK
     A          K SEDT
