     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, SIGNATUR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTRHR                   PFILE(SADTRH)
     A                                      TEXT('SIGNATUR')
     A          K SEAVD
     A          K SESG
     A          K SEDT
