     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTRHR                   PFILE(SADTRH)
     A          K SEAVD
     A          K SEST
