     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, TRANSITTERINGSNR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTRHR                   PFILE(SADTRH)
     A          K SEAVD
     A          K SECTN
