     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner TRANSITT, Regdato (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTCMPR                  PFILE(SADTRCMP)
     A                                      TEXT('Regdato')
     A          K SEAVD
     A          K SEDT
