     A*__________________________________
     A* SYSPED / Tolldekl. TRANSITTERINGSNR.TELLER
     A*""""""""""""""""""""""""""""""""""
     A          R SADTRTR
     A            STTTYP         1          COLHDG('TELLERTYPE')
     A            STTNR          5S 0       COLHDG('STARTNR.')
     A            STTLK          2          COLHDG('LANDKODE')
     A            STTDS         19          COLHDG('DISTRIKTSTOLLSTED')
     A            STTNV         15          COLHDG('AUTORISERT AVS.')
     A            STTAN          6          COLHDG('AUTORISASSJONSNR.')
     A          K STTTYP
