     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, LASTELISTE
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTRHR                   PFILE(SADTRH)
     A                                      TEXT('LASTELISTE STATUS')
     A          K SESTL
     A          K SEWS
