     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, ARBEIDSSTASJON
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTRHR                   PFILE(SADTRH)
     A                                      TEXT('ARBEIDSSTASJON')
     A          K SEWS
     A          K SEST
