     A*__________________________________________
     A* SYSPED / Tolldekl. TRANSITT VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADTRVR                   PFILE(SADTRV)
     A          K SVAVD
     A          K SVTDN
     A          K SVLN
