     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner TRANSITT, KJØPER (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTCMPR                  PFILE(SADTRCMP)
     A                                      TEXT('KJØPER')
     A          K SEAVD
     A          K SEKNS
     A          K SEDT
