     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, TRANSITTERINGSNR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTCMPR                  PFILE(SADTRCMP)
     A          K SECTN
