     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, Regdato
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SADTRHR                   PFILE(SADTRH)
     A                                      TEXT('Regdato')
     A          K SEAVD
     A          K SEDT
