      *_____________________________________
      * SYSPED / SAD-IMPORT VARELINJE ETTER SAMMENSLÅING
      * KOPI AV WFILEIMP
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SADVAVGR
     A            WFAVD     R               REFFLD(AVD)
     A            WFTDN     R               REFFLD(TDN)
     A            WFIRNR         5S 0       COLHDG('RECORDSNR.')
     A            WFIVNT         8S 0       COLHDG('VARENR')
     A            WFITN          1          COLHDG('TOLLNEDSETTELSE')
     A            WFILK          2          COLHDG('OPPRINNELSESLANDKODE')
     A            WFIVKB         9S 0       COLHDG('BRUTTO VEKT')
     A            WFIVKN         9S 0       COLHDG('NETTO VEKT')
     A            WFIPRE         1          COLHDG('PREFERANSE')
     A            WFINTM         9S 0       COLHDG('ANTALL STYKKE')
     A            WFPVA     R               REFFLD(PVA)
     A            WFISKV         3          COLHDG('MOMS SEKVENS')
     A            WFIMVS         5S 2       COLHDG('MOMS SATS')
     A            WFIVF          1          COLHDG('V.F. KODE')
     A            WFIJUS        11S 0       COLHDG('JUSTERINGSBELØP')
     A            WFIFTG         1          COLHDG('FORTEGN AV JUS.BELØP')
     A            WFISTB        13S 0       COLHDG('STATISTISKVERDI')
     A            WFIBBL        13S 0       COLHDG('BEARBEIDINGSKOST.')
     A            WFIMVA         9S 0       COLHDG('MOMS')
     A            WFIMVG         9S 0       COLHDG('MOMSGRUNNLAG')
     A            WFITOL         9S 0       COLHDG('TOLL')
     A            WFITLG         9S 0       COLHDG('TOLLGRUNNLAG')
     A            WFITRA         9S 0       COLHDG('TRAFIKKAVGIFT')
     A            WFISAT         7S 2       COLHDG('TOLLSATS')
     A            WFISUM        11S 0       COLHDG('AVGIFTSUM AV LINJE')
     A            WFITY1         2          COLHDG('AVGIFTTYPE-1')
     A            WFITY2         2          COLHDG('AVGIFTTYPE-2')
     A            WFITY3         2          COLHDG('AVGIFTTYPE-3')
     A            WFITY4         2          COLHDG('AVGIFTTYPE-4')
     A            WFITY5         2          COLHDG('AVGIFTTYPE-5')
     A            WFITY6         2          COLHDG('AVGIFTTYPE-6')
     A            WFISK1         3          COLHDG('SEKVENS-1')
     A            WFISK2         3          COLHDG('SEKVENS-2')
     A            WFISK3         3          COLHDG('SEKVENS-3')
     A            WFISK4         3          COLHDG('SEKVENS-4')
     A            WFISK5         3          COLHDG('SEKVENS-5')
     A            WFISK6         3          COLHDG('SEKVENS-6')
     A            WFIGL1        11S 2       COLHDG('GRUNNLAG AV AVGIFT-1')
     A            WFIGL2        11S 2       COLHDG('GRUNNLAG AV AVGIFT-2')
     A            WFIGL3        11S 2       COLHDG('GRUNNLAG AV AVGIFT-3')
     A            WFIGL4        11S 2       COLHDG('GRUNNLAG AV AVGIFT-4')
     A            WFIGL5        11S 2       COLHDG('GRUNNLAG AV AVGIFT-5')
     A            WFIGL6        11S 2       COLHDG('GRUNNLAG AV AVGIFT-6')
     A            WFIST1         7S 2       COLHDG('SATS AV AVGIFT-1')
     A            WFIST2         7S 2       COLHDG('SATS AV AVGIFT-2')
     A            WFIST3         7S 2       COLHDG('SATS AV AVGIFT-3')
     A            WFIST4         7S 2       COLHDG('SATS AV AVGIFT-4')
     A            WFIST5         7S 2       COLHDG('SATS AV AVGIFT-5')
     A            WFIST6         7S 2       COLHDG('SATS AV AVGIFT-6')
     A            WFIPR1         1          COLHDG('TYPE FOR SATS-1')
     A            WFIPR2         1          COLHDG('TYPE FOR SATS-2')
     A            WFIPR3         1          COLHDG('TYPE FOR SATS-3')
     A            WFIPR4         1          COLHDG('TYPE FOR SATS-4')
     A            WFIPR5         1          COLHDG('TYPE FOR SATS-5')
     A            WFIPR6         1          COLHDG('TYPE FOR SATS-6')
     A            WFIBL1        11S 2       COLHDG('BELØP AV AVGIFT-1')
     A            WFIBL2        11S 2       COLHDG('BELØP AV AVGIFT-2')
     A            WFIBL3        11S 2       COLHDG('BELØP AV AVGIFT-3')
     A            WFIBL4        11S 2       COLHDG('BELØP AV AVGIFT-4')
     A            WFIBL5        11S 2       COLHDG('BELØP AV AVGIFT-5')
     A            WFIBL6        11S 2       COLHDG('BELØP AV AVGIFT-6')
     A            WFIPRO         1          COLHDG('PROSENTTEGN')
     A            WFIKN1        28          COLHDG('CONTAINERNR-1')
     A            WFIKN2        28          COLHDG('CONTAINERNR-2')
     A            WFIKN3        28          COLHDG('CONTAINERNR-3')
     A            WFIKN4        28          COLHDG('CONTAINERNR-4')
     A            WFIKN5        28          COLHDG('CONTAINERNR-5')
     A            WFIKN6        28          COLHDG('CONTAINERNR-6')
     A            WFIKN7        28          COLHDG('CONTAINERNR-7')
     A            WFIANT         6S 0       COLHDG('ANTALL')
     A            WFIVT          4          COLHDG('TYPE AV ANTALL')
     A            WFIVB1        30          COLHDG('VAREBESKRIVELSE-1')
     A            WFIVB2        30          COLHDG('VAREBESKRIVELSE-2')
     A            WFIVB3        30          COLHDG('VAREBESKRIVELSE-3')
     A            WFIVB4        30          COLHDG('VAREBESKRIVELSE-4')
     A            WFIVB5        30          COLHDG('VAREBESKRIVELSE-5')
     A            WFITO1        45          COLHDG('TILLEGGSOPPLYSNING-1')
     A            WFITO2        45          COLHDG('TILLEGGSOPPLYSNING-2')
     A            WFITO3        45          COLHDG('TILLEGGSOPPLYSNING-3')
     A            WFITO4        45          COLHDG('TILLEGGSOPPLYSNING-4')
     A            WFITO5        45          COLHDG('TILLEGGSOPPLYSNING-5')
     A            WFITO6        45          COLHDG('TILLEGGSOPPLYSNING-6')
     A            WFITO7        45          COLHDG('TILLEGGSOPPLYSNING-7')
     A            WFITO8        45          COLHDG('TILLEGGSOPPLYSNING-8')
     A            WFITO9        45          COLHDG('TILLEGGSOPPLYSNING-9')
     A            WFITO10       45          COLHDG('TILLEGGSOPPLYSNING10')
     A            WFITO11       45          COLHDG('TILLEGGSOPPLYSNING11')
     A            WFITO12       45          COLHDG('TILLEGGSOPPLYSNING12')
     A            WFITO13       45          COLHDG('TILLEGGSOPPLYSNING13')
     A            WFITO14       45          COLHDG('TILLEGGSOPPLYSNING14')
     A            WFITO15       45          COLHDG('TILLEGGSOPPLYSNING15')
     A            WFITC1         3          COLHDG('CREF-1')
     A            WFITC2         3          COLHDG('CREF-2')
     A            WFITC3         3          COLHDG('CREF-3')
     A            WFITC4         3          COLHDG('CREF-4')
     A            WFITC5         3          COLHDG('CREF-5')
     A            WFITC6         3          COLHDG('CREF-6')
     A            WFITC7         3          COLHDG('CREF-7')
     A            WFITC8         3          COLHDG('CREF-8')
     A            WFITC9         3          COLHDG('CREF-9')
     A            WFITC10        3          COLHDG('CREF-10')
     A            WFITC11        3          COLHDG('CREF-11')
     A            WFITC12        3          COLHDG('CREF-12')
     A            WFITC13        3          COLHDG('CREF-13')
     A            WFITC14        3          COLHDG('CREF-14')
     A            WFITC15        3          COLHDG('CREF-15')
     A            WFITRG         9S 0       COLHDG('GRUNNLAG AV TRAFIKK')
     A            WFITRP         1          COLHDG('OMBER. J=NY/S=SLETT')
     A          K WFAVD
     A          K WFTDN
     A          K WFIRNR
