     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADVR                     PFILE(SADV)
     A          K SVAVD
     A          K SVTDN
     A          K SVERR                     DESCEND
     A          K SVLN
