     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import VARELINJE (VARENR.)
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADVR                     PFILE(SADV)
     A          K SVVNT
