     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner Import VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SADVR                     PFILE(SADV)
     A          K SVAVD
     A          K SVTDN
     A          K SVVNT
     A          K SVLK
     A          K SVTN
     A          K SVPRE
     A          K SVAS
     A          K SVPVA
     A          K SVMFR
     A          K SVVF
