     A          R SAEFEDIR
     A            SFAVD          4S 0       COLHDG('AVDELING')
     A            SFOPDN         7S 0       COLHDG('OPPDRAGSNR.')
     A            SFTXT         17          COLHDG('TXT AV FINANS. OPPL.')
     A            SFDT           8S 0       COLHDG('DATO AV RUBR.28')
     A          K SFAVD
     A          K SFOPDN
