     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, LØPENR. (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHRCMP                  PFILE(SAEHCMP)
     A                                      TEXT('LØPENR.')
     A          K SEAVD
     A          K SETLL
