********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11102 * 01 YBC PTF11 5. LINJE FOR BEGRUNNELSE AV OMBEREGING
********************************************************************
      *__________________________________
      * SYSPED / SAD Export, OMBEREGNING
      *""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SAEHR
     A            SEAVD          4S 0       COLHDG('AVDELING')
     A            SETDN     R               REFFLD(TDN)
      *
      * EKSTRA FELTER FOR OMBEREGNING
     A            SETYPE         4A         COLHDG('TYPETILFELLE')
     A            SEFT01        70A         COLHDG('BEGRUNNELSE 1')
     A            SEFT02        70A         COLHDG('BEGRUNNELSE 2')
     A            SEFT03        70A         COLHDG('BEGRUNNELSE 3')
     A            SEFT04        70A         COLHDG('BEGRUNNELSE 4')
N01  A            SEFT05        70A         COLHDG('BEGRUNNELSE 5')
     A            SEFT11        70A         COLHDG('BESKJED FRA TVINN 1')
     A            SEFT12        70A         COLHDG('BESKJED FRA TVINN 2')
     A            SEFT13        70A         COLHDG('BESKJED FRA TVINN 3')
     A            SEFT14        70A         COLHDG('BESKJED FRA TVINN 4')
N01  A            SEFT15        70A         COLHDG('BESKJED FRA TVINN 5')
     A            SEBLTT    R               REFFLD(BEL11)
     A                                      COLHDG('TOTAL AVGIFTER')
     A            SETY01         2A         COLHDG('AVGIFTSTYPE 1')
     A            SEBL01    R               REFFLD(BEL11)
     A                                      COLHDG('AVGIFTS BELØP 1')
     A            SETY02         2A         COLHDG('AVGIFTSTYPE 2')
     A            SEBL02    R               REFFLD(BEL11)
     A                                      COLHDG('AVGIFTS BELØP 2')
     A            SETY03         2A         COLHDG('AVGIFTSTYPE 3')
     A            SEBL03    R               REFFLD(BEL11)
     A                                      COLHDG('AVGIFTS BELØP 3')
     A            SETY04         2A         COLHDG('AVGIFTSTYPE 4')
     A            SEBL04    R               REFFLD(BEL11)
     A                                      COLHDG('AVGIFTS BELØP 4')
     A            SETY05         2A         COLHDG('AVGIFTSTYPE 5')
     A            SEBL05    R               REFFLD(BEL11)
     A                                      COLHDG('AVGIFTS BELØP 5')
      *
     A          K SEAVD
     A          K SETDN
