     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, SELGER (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHRCMP                  PFILE(SAEHCMP)
     A                                      TEXT('SELGER')
     A          K SEAVD
     A          K SEKNK
     A          K SEDT
