     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, LØPENR.
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A                                      TEXT('LØPENR.')
     A          K SEAVD
     A          K SETLL
