********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11109 * 01 YBC PTF11 FELTER FOR OMBEREGNING
********************************************************************
      *__________________________________
      * SYSPED / Tolldeklarasjoner Export
      *""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SAEHEDIR
     A            SEAVD          4S 0       COLHDG('AVDELING')
     A            SETDN     R               REFFLD(TDN)
     A            SE1225         3A         COLHDG('MELDINGSTYPE')
     A            SE1225T       12A         COLHDG('MELDINGSTYPE TEKST')
     A            S3039E    R               REFFLD(N3039E)
     A            SEDTY     R               REFFLD(DTY)
     A            SEDP      R               REFFLD(DP)
     A            SEKNS     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Selger')
     A            SENAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            SEADS1    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Selger')
     A            SEADS2    R               REFFLD(AD)
     A                                      COLHDG('Adresse-2 Selger')
     A            SEADS3    R               REFFLD(AD)
     A                                      COLHDG('Adresse-3 Selger')
     A            SENTK     R               REFFLD(NTK)
     A            SEVKB     R               REFFLD(VKT9)
     A                                      COLHDG('Bruttovekt')
     A            SETOTL    R               REFFLD(LI5)
     A            SEKDC     R               REFFLD(KDC)
     A            SESG      R               REFFLD(SG)
     A            SEKNK     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Kjøper')
     A            SERG          11A         COLHDG('FORETAKSNR.')
     A            SENAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            SEADK1    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Kjøper')
     A            SEADK2    R               REFFLD(AD)
     A                                      COLHDG('Adresse-2 Kjøper')
     A            SEADK3    R               REFFLD(AD)
     A                                      COLHDG('Adresse-3 Kjøper')
     A            SELKA     R               REFFLD(LKA)
     A                                      COLHDG('Landk avs/utf-land')
     A            SETLF     R               REFFLD(TLF)
     A                                      COLHDG('Telefon Deklarant')
     A            SENAD     R               REFFLD(NA)
     A                                      COLHDG('Navn Deklarant')
     A            SELV      R               REFFLD(LV)
     A            SELVT     R               REFFLD(LVT)
     A            SETRID    R               REFFLD(TRID)
     A            SELKT     R               REFFLD(LKA)
     A                                      COLHDG('Landk Tr.middel')
     A            SEVAL1    R               REFFLD(VAL)
     A                                      COLHDG('Val.kode Faktsum')
     A            SEBEL1    R               REFFLD(BEL13)
     A                                      COLHDG('Beløp Faktsum')
     A            SEVKU     R               REFFLD(VKU)
     A            SEKDH          4S 0       COLHDG('TOLLSTEDSKODE')
     A            SETST     R               REFFLD(TST)
     A            SEBEL2    R               REFFLD(BEL11)
     A                                      COLHDG('Beløp A. kost')
     A            SEFTG2    R               REFFLD(KDFT)
     A                                      COLHDG('Fortegn +/- a.kost')
     A            SETRM     R               REFFLD(TRM)
     A            SEFIF     R               REFFLD(FIF)
     A            SEFID     R               REFFLD(DT)
     A                                      COLHDG('Finans oppl.fakdat')
     A            SEKT           8          COLHDG('TOLLKREDITNR')
     A            SEGN          15          COLHDG('GODSNR.')
     A            SEDST     R               REFFLD(DST)
     A            SEDTG     R               REFFLD(DTG)
     A            SETLL     R               REFFLD(TLL)
     A            SETLE     R               REFFLD(TLE)
     A            SELS      R               REFFLD(LS)
     A            SEKDLS         2A         COLHDG('Lagringssted kode')
     A            SEDT      R               REFFLD(DT)
     A                                      COLHDG('Registreringsdato')
     A            SEGKD          1S 0       COLHDG('GARATIKODE')
     A            SEGFT1        30          COLHDG('GARATI FRITEKST-1')
     A            SEGFT2        30          COLHDG('GARATI FRITEKST-2')
     A            SEPOS          8          COLHDG('POSISJON')
     A            SEFTB         17          COLHDG('FRITEKST TIL B.LAND')
     A            SELKB     R               REFFLD(LKA)
     A                                      COLHDG('LANDK TIL B.LAND')
     A            SEFTM         17          COLHDG('F.T. MIDLETS ID LAND')
     A            SELKM     R               REFFLD(LKA)
     A                                      COLHDG('LK MIDLETS ID LAND')
     A            SEKDFT        17          COLHDG('FRITEKST TOLLSTED')
     A            SETARF        16          COLHDG('TARIFFØRSNAVN')
     A            SELKAT        17          COLHDG('F.T. AVS/UTF.LAND')
     A            SEVAL2    R               REFFLD(VAL)
     A                                      COLHDG('Valutakode A.KOST')
     A            SEBEL3    R               REFFLD(BEL9)
     A                                      COLHDG('Andre kost.omber')
      *
     A            SETOTA        11S 0       COLHDG('TOTAL AVGIFTER')
     A            SETKD1         2          COLHDG('TOTAL AVGIFT1, KODE')
     A            SETAV1        11S 0       COLHDG('TOTAL AVGIFT1, BELØP')
     A            SETKD2         2          COLHDG('TOTAL AVGIFT2, KODE')
     A            SETAV2        11S 0       COLHDG('TOTAL AVGIFT2, BELØP')
     A            SETKD3         2          COLHDG('TOTAL AVGIFT3, KODE')
     A            SETAV3        11S 0       COLHDG('TOTAL AVGIFT3, BELØP')
     A            SETKD4         2          COLHDG('TOTAL AVGIFT4, KODE')
     A            SETAV4        11S 0       COLHDG('TOTAL AVGIFT4, BELØP')
N01   *
N01   * EKSTRA FELTER FOR OMBEREGNING
N01  A            SETYPE         4A         COLHDG('TYPETILFELLE')
N01  A            SEFT01        70A         COLHDG('BEGRUNNELSE 1')
N01  A            SEFT02        70A         COLHDG('BEGRUNNELSE 2')
N01  A            SEFT03        70A         COLHDG('BEGRUNNELSE 3')
N01  A            SEFT04        70A         COLHDG('BEGRUNNELSE 4')
N01  A            SEFT05        70A         COLHDG('BEGRUNNELSE 5')
N01  A            SEFT11        70A         COLHDG('BESKJED FRA TVINN 1')
N01  A            SEFT12        70A         COLHDG('BESKJED FRA TVINN 2')
N01  A            SEFT13        70A         COLHDG('BESKJED FRA TVINN 3')
N01  A            SEFT14        70A         COLHDG('BESKJED FRA TVINN 4')
N01  A            SEFT15        70A         COLHDG('BESKJED FRA TVINN 5')
N01  A            SEBLTT    R               REFFLD(BEL11)
N01  A                                      COLHDG('TOTAL AVGIFTER')
N01  A            SETY01         2A         COLHDG('AVGIFTSTYPE 1')
N01  A            SEBL01    R               REFFLD(BEL11)
N01  A                                      COLHDG('AVGIFTS BELØP 1')
N01  A            SETY02         2A         COLHDG('AVGIFTSTYPE 2')
N01  A            SEBL02    R               REFFLD(BEL11)
N01  A                                      COLHDG('AVGIFTS BELØP 2')
N01  A            SETY03         2A         COLHDG('AVGIFTSTYPE 3')
N01  A            SEBL03    R               REFFLD(BEL11)
N01  A                                      COLHDG('AVGIFTS BELØP 3')
N01  A            SETY04         2A         COLHDG('AVGIFTSTYPE 4')
N01  A            SEBL04    R               REFFLD(BEL11)
N01  A                                      COLHDG('AVGIFTS BELØP 4')
N01  A            SETY05         2A         COLHDG('AVGIFTSTYPE 5')
N01  A            SEBL05    R               REFFLD(BEL11)
N01  A                                      COLHDG('AVGIFTS BELØP 5')
     A          K SEAVD
     A          K SETDN
