     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, KJØPER (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHRCMP                  PFILE(SAEHCMP)
     A                                      TEXT('KJØPER')
     A          K SEAVD
     A          K SEKNS
     A          K SEDT
