********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 ENDRE TEKST (SELGER OG KJØPER BYTTER OM), INGEN MERKING
********************************************************************
     A*__________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT (KOMPLIMERT)
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SAEHRCMP
     A            SEAVD          4S 0       COLHDG('AVDELING')
     A            SETDN          7S 0       COLHDG('TOLLDEK.NR.')
     A            SEDK           2          COLHDG('DEKLARASJONSKODE')
     A            SEKNS          8S 0       COLHDG('Kundenr Kjøper')
     A            SENAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            SENTK     R               REFFLD(NTK)
     A            SEVKB     R               REFFLD(VKT9)
     A                                      COLHDG('Bruttovekt')
     A            SESG      R               REFFLD(SG)
     A            SEKNK     R               REFFLD(KN)
     A                                      COLHDG('Kundenr Selger')
     A            SERG          11A         COLHDG('FORETAKSNR.')
     A            SENAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            SEVAL1    R               REFFLD(VAL)
     A                                      COLHDG('Val.kode Faktsum')
     A            SEBEL1    R               REFFLD(BEL13)
     A                                      COLHDG('Beløp Faktsum')
     A            SEBEL2    R               REFFLD(BEL11)
     A                                      COLHDG('Beløp A. kost')
     A            SEFTG2    R               REFFLD(KDFT)
     A                                      COLHDG('Fortegn +/- a.kost')
     A            SEGN          15          COLHDG('GODSNR.')
     A            SEDTG     R               REFFLD(DTG)
     A            SETLL     R               REFFLD(TLL)
     A            SETLE     R               REFFLD(TLE)
     A            SEDT      R               REFFLD(DT)
     A                                      COLHDG('Registreringsdato')
     A            SEKNA     R               REFFLD(KN)
     A                                      COLHDG('HOVEDANSVARLIG')
     A            SENAA     R               REFFLD(NA)
     A                                      COLHDG('Navn ANSVARLIG')
     A            SEVAL2    R               REFFLD(VAL)
     A                                      COLHDG('Valutakode A.KOST')
     A          K SEAVD
     A          K SETDN
