     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, Regdato (KOMPLIMERT)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHRCMP                  PFILE(SAEHCMP)
     A                                      TEXT('Regdato')
     A          K SEAVD
     A          K SEDT
