     A*___________________________________________
     A* SYSPED / Tolldeklarasjoner EKSPORT, KJØPER
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAEHR                     PFILE(SAEH)
     A                                      TEXT('KJØPER')
     A          K SEAVD
     A          K SEKNS
     A          K SEDT
