     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner EXPORT VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SAEVR                     PFILE(SAEV)
     A          K SVAVD
     A          K SVTDN
     A          K SVREFL
