     A*__________________________________________
     A* SYSPED / Tolldeklarasjoner EXport VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R SAEVR                     PFILE(SAEV)
     A          K SVAVD
     A          K SVTDN
     A          K SVLN
