     A                                      REF(SR)
     A          R SAEVEDIR
     A            SVAVD     R               REFFLD(AVD)
     A            SVTDN     R               REFFLD(TDN)
     A            SVLI      R               REFFLD(LI5)
     A            SVBELT    R               REFFLD(BEL11)
     A                                      COLHDG('Beløp Tollverdi')
     A            SVFYL          2          COLHDG('FYLKE')
     A            SVVNT     R               REFFLD(VNT)
     A            SVAVT          2A         COLHDG('FERSK FISK')
     A            SVAVTS         3A         COLHDG('AVG.SEKVENS')
     A            SVAVTP         7S 3       COLHDG('PROSENTSATS AV SVAVT')
     A            SVAVTG         9S 0       COLHDG('GRUNNLAG')
     A            SVAVTB         9S 0       COLHDG('BELØP FOR FF')
     A            SVVKTB    R               REFFLD(VKT9)
     A                                      COLHDG('Vekt Brutto')
     A            SVVKTN    R               REFFLD(VKT9)
     A                                      COLHDG('Vekt Netto')
     A            SVNTM          9S 0       COLHDG('Mengde')
     A            SVBELS    R               REFFLD(BEL11)
     A                                      COLHDG('Stat. Tollverdi')
     A            SVNT           6P 0       COLHDG('ANTALL')
     A            SVEH      R               REFFLD(EH)
     A            SVMN1     R               REFFLD(FT17)
     A            SVMN2     R               REFFLD(FT17)
     A            SVMN3     R               REFFLD(FT17)
     A            SVMN4     R               REFFLD(FT17)
     A            SVMN5     R               REFFLD(FT17)
     A            SVMN6     R               REFFLD(FT17)
     A            SVMN7     R               REFFLD(FT17)
     A            SVVB1         30A         COLHDG('VAREBESKRIVELSE 1')
     A            SVVB2         30A         COLHDG('VAREBESKRIVELSE 2')
     A            SVVB3         30A         COLHDG('VAREBESKRIVELSE 3')
     A            SVVB4         30A         COLHDG('VAREBESKRIVELSE 4')
     A            SVVB5         30A         COLHDG('VAREBESKRIVELSE 5')
     A            SVDC11         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC21        17A         COLHDG('REFERANSE')
     A            SVDC12         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC22        17A         COLHDG('REFERANSE')
     A            SVDC13         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC23        17A         COLHDG('REFERANSE')
     A            SVDC14         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC24        17A         COLHDG('REFERANSE')
     A            SVDC15         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC25        17A         COLHDG('REFERANSE')
     A            SVDC16         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC26        17A         COLHDG('REFERANSE')
     A            SVDC17         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC27        17A         COLHDG('REFERANSE')
     A            SVDC18         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC28        17A         COLHDG('REFERANSE')
     A            SVDC19         3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC29        17A         COLHDG('REFERANSE')
     A            SVDC110        3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC210       17A         COLHDG('REFERANSE')
     A            SVDC111        3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC211       17A         COLHDG('REFERANSE')
     A            SVDC112        3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC212       17A         COLHDG('REFERANSE')
     A            SVDC113        3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC213       17A         COLHDG('REFERANSE')
     A            SVDC114        3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC214       17A         COLHDG('REFERANSE')
     A            SVDC115        3A         COLHDG('KOMMUNIKASJONREF.')
     A            SVDC215       17A         COLHDG('REFERANSE')
     A          K SVAVD
     A          K SVTDN
     A          K SVLI
