*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
PXXXXA* 01 YBC PTF5 F9=NESTE LEDIG ADRESSENR
P5105A* 02 YBC PTF5 LENGDE PÅ ADRESSENR ER ØKT FRA 3.0 TIL 5.0
     A*             NYE FELTER FOR TELEFONNR, FAXNR OG E-MAIL
     A*             SØK PÅ NAVN
P0601A* 03 JOV PTF6 KOPIER FRA KUNDE....
P0651A* 04 JOV PTF6 FILTER PÅ POSTNR ...
P0651A* 05 JOV PTF7 TEST PÅ KUREF      .
P0651A* 06 JOV MERKE INAKTIV
*****A**************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('VEDKLKNR' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
      *
     A          R BILDE01
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'Søk kunde')
     A                                      CF12(12 'Gå til forrige bilde')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SAMKRE'
     A                                      COLOR(BLU)
     A                                  1 19'Tilbakestille hel samlefaktura'
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                 11  2MSGCON(012 DIV0199 *LIBL/SYMSGF)
     A            WSKUNR         8Y 0B 11 17DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A            WSFANR         7Y 0B 12 17EDTCDE(4)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(050 DIV2589 *LIBL/SYMSGF)
     A                                  4  2MSGCON(043 DIV2590 *LIBL/SYMSGF)
     A                                  5  2MSGCON(040 DIV2591 *LIBL/SYMSGF)
     A                                  6  2MSGCON(054 DIV2592 *LIBL/SYMSGF)
     A                                 12  2MSGCON(013 DIV2593 *LIBL/SYMSGF)
     A                                 23  2MSGCON(030 DIV2594 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
