     A*___________________________________________
     A* SYSPED / SAML    (SAMLEFAKTURA)
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SAMLR                     PFILE(SAML)
     A          K SAKN
     A          K SAPRO
     A          K SAOPD
