     A          R SASCARGON
     A            F1            18A         COLHDG('Sted')
     A            F2             8A         COLHDG('Dest')
     A            F5             9A         COLHDG('WOW')
     A            F9A            6S 0       COLHDG('M')
     A            F9X            1          COLHDG('Komma1')
     A            F9B            2S 0       COLHDG('M')
     A            F10A           6S 0       COLHDG('M')
     A            F10X           1          COLHDG('Komma1')
     A            F10B           2S 0       COLHDG('M')
     A            F11A           6S 0       COLHDG('M')
     A            F11X           1          COLHDG('Komma1')
     A            F11B           2S 0       COLHDG('M')
     A            F12A           6S 0       COLHDG('GCQ100')
     A            F12X           1          COLHDG('Komma1')
     A            F12B           2S 0       COLHDG('GCQ100')
     A            F13A           6S 0       COLHDG('GCQ500')
     A            F13X           1          COLHDG('Komma1')
     A            F13B           2S 0       COLHDG('GCQ500')
     A            F14A           6S 0       COLHDG('PCmin.')
     A            F14X           1          COLHDG('Komma1')
     A            F14B           2S 0       COLHDG('PCmin.')
     A            F15A           6S 0       COLHDG('PCN')
     A            F15X           1          COLHDG('Komma1')
     A            F15B           2S 0       COLHDG('PCN')
     A            F16A           6S 0       COLHDG('PCQ45')
     A            F16X           1          COLHDG('Komma1')
     A            F16B           2S 0       COLHDG('PCQ45')
     A            F17A           6S 0       COLHDG('PCQ100')
     A            F17X           1          COLHDG('Komma1')
     A            F17B           2S 0       COLHDG('PCQ100')
     A            F18A           6S 0       COLHDG('DDBase')
     A            F18X           1          COLHDG('Komma1')
     A            F18B           2S 0       COLHDG('DDBase')
     A            F19A           6S 0       COLHDG('DDper')
     A            F19X           1          COLHDG('Komma1')
     A            F19B           2S 0       COLHDG('DDper')
     A          K F1
