     A          R SASPRISR
     A            F1            18A         COLHDG('Sted')
     A            F2             8A         COLHDG('Dest')
     A            F5             9A         COLHDG('WOW')
     A            F9             6S 2       COLHDG('GCmin.')
     A            F10            6S 2       COLHDG('GCN')
     A            F11            6S 2       COLHDG('GCQ45')
     A            F12            6S 2       COLHDG('GCQ100')
     A            F13            6S 2       COLHDG('GCQ500')
     A            F14            6S 2       COLHDG('PCmin.')
     A            F15            6S 2       COLHDG('PCN')
     A            F16            6S 2       COLHDG('PCQ45')
     A            F17            6S 2       COLHDG('PCQ100')
     A            F18            6S 2       COLHDG('DDBase')
     A            F19            6S 2       COLHDG('DDper')
     A          K F1
