     A          R SASTILLR
     A            TILKOD         1          COLHDG('KODE')
     A            TILLEG         5S 2       COLHDG('TILLEGG')
     A          K TILKOD
