     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/HEADF)
     A                                      PRINT
     A                                      HLPDOC('SI01D' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'Søk')
     A                                      CF12(12 'Annuller')
      *
     A          R SI01DA
     A                                      CSRLOC(ZLIN       ZPOS)
     A                                      OVERLAY
     A                                      HLPCLR
     A          H                           HLPDOC('SI01DA' 'HLPNU' 'HLP400')
     A                                      HLPARA(01 001 04 024)
     A            ZLIN           3S 0H
     A            ZPOS           3S 0H
     A                                  1  2'SI01D A'
     A                                      COLOR(BLU)
     A                                  1 31MSGCON(030 SSI0010 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(030 SSI0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  4MSGCON(034 SSI0030 *LIBL/SYMSGF)
     A            ZEAVD     R     D  B  5 41REFFLD(HEAVD)
     A                                      RANGE(1 9998)
     A  31                                  COLOR(RED)
     A                                  5 52MSGCON(010 SSI0040 *LIBL/SYMSGF)
     A                                  6  6MSGCON(032 SSI0050 *LIBL/SYMSGF)
     A            ZEKNKF    R     D  B  6 41REFFLD(HEKNKF)
     A                                      RANGE(1 99999999)
     A  32                                  COLOR(RED)
     A                                  6 52MSGCON(010 SSI0040 *LIBL/SYMSGF)
     A                                  7  4MSGCON(034 SSI0090 *LIBL/SYMSGF)
     A            ZEUR      R        B  7 41REFFLD(HEUR)
     A  31                                  COLOR(RED)
     A                                  8  4MSGCON(032 SHU0313 *LIBL/SYMSGF)
     A            ZSK            1A  B  8 41VALUES('S' 'K')
     A                                 21 71MSGCON(010 SSI0060 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(040 SSI0070 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R SI01DB
     A  61                                  CF10(10 'Flere parametere')
     A                                      CF08(08 'beregn kubikk')
     A                                      CSRLOC(ZLIN       ZPOS)
     A                                      OVERLAY
     A            ZLIN           3S 0H
     A            ZPOS           3S 0H
     A                                  1  2'SI01D B'
     A                                      COLOR(BLU)
     A                                  1 31MSGCON(030 SSI0080 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A            KNAVN     R        O  3  4REFFLD(KUNDR/KNAVN *LIBL/KUNDF)
     A            KOANVN    R        O  3 36REFFLD(KOAR/KOANVN *LIBL/KODTA)
     A                                  5  2MSGCON(030 SSI0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  8  4MSGCON(034 SSI0110 *LIBL/SYMSGF)
     A            ZESDF     R        B  8 41REFFLD(HESDF)
     A  32                                  COLOR(RED)
     A                                  8 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A                                  9  4MSGCON(034 SSI0130 *LIBL/SYMSGF)
     A            ZESDT     R        B  9 41REFFLD(HESDT)
     A  33                                  COLOR(RED)
     A                                  9 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A                                 11  4MSGCON(034 SSI0140 *LIBL/SYMSGF)
     A            ZEOT      R        B 11 41REFFLD(HEOT)
     A  34                                  COLOR(RED)
     A                                 11 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A                                 12  6MSGCON(032 SSI0150 *LIBL/SYMSGF)
     A            ZEFR      R        B 12 41REFFLD(HEFR)
     A  35                                  COLOR(RED)
     A                                 12 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A                                 13  6MSGCON(032 SSI0400 *LIBL/SYMSGF)
     A            ZEANK     R     D  B 13 41REFFLD(HEANK)
     A  36                                  DSPATR(PC)
     A  36                                  COLOR(RED)
     A                                 13 52MSGCON(010 SSI0040 *LIBL/SYMSGF)
     A                                 14  4MSGCON(034 SHU1021 *LIBL/SYMSGF)
     A            ZEKDPL         1   B 14 41
     A  39                                  COLOR(RED)
     A                                 14 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A                                 15  4MSGCON(034 SSI0160 *LIBL/SYMSGF)
     A            ZENT      R     D  B 15 41REFFLD(HENT)
     A                                 15 52MSGCON(010 SSI0170 *LIBL/SYMSGF)
     A                                 16  4MSGCON(034 SSI0180 *LIBL/SYMSGF)
     A            ZEVKT     R     D  B 16 41REFFLD(HEVKT)
     A                                 16 52MSGCON(010 SSI0190 *LIBL/SYMSGF)
     A                                 17  4MSGCON(034 SSI0200 *LIBL/SYMSGF)
     A            ZELM      R     Y  B 17 41REFFLD(HELM)
     A                                      EDTCDE(J)
     A                                 17 52MSGCON(010 SSI0210 *LIBL/SYMSGF)
     A                                 18  4MSGCON(034 SSI0220 *LIBL/SYMSGF)
     A            ZEM3      R     Y  B 18 41REFFLD(HEM3)
     A                                      EDTCDE(J)
     A                                 18 52MSGCON(015 SSI0230 *LIBL/SYMSGF)
     A                                 20  4MSGCON(034 SSI0410 *LIBL/SYMSGF)
     A            ZELKS          2A  B 20 41DSPATR(PC)
     A            ZESDFF    R        B 20 46REFFLD(HESDFF)
     A  37                                  COLOR(RED)
     A                                 20 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A  61                                  DSPATR(ND)
     A                                 21  4MSGCON(034 SSI0420 *LIBL/SYMSGF)
     A            ZELKK          2A  B 21 41
     A            ZESDVT    R        B 21 46REFFLD(HESDVT)
     A  38                                  COLOR(RED)
     A                                 21 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A  61                                  DSPATR(ND)
     A                                 22  4MSGCON(034 SSI0430 *LIBL/SYMSGF)
     A            ZENTF     R     D  B 22 41REFFLD(HENTF)
     A                                 22 52MSGCON(010 SSI0440 *LIBL/SYMSGF)
     A  61                                  DSPATR(ND)
     A                                 22 71MSGCON(010 SSI0060 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(070 SSI0240 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R SI01DØ
     A                                      OVERLAY
     A            ZMSGTX        79A  O 24  2MSGID(&ZMSGNO SYMSGF)
     A N30                                  COLOR(WHT)
     A  30                                  COLOR(RED)
     A            ZMSGNO         7A  P
      *
     A          R SI01DBP
     A  61                                  CF10(10 'Flere parametere')
     A                                      CF08(08 'beregn kubikk')
     A                                      CSRLOC(ZLIN       ZPOS)
     A                                      OVERLAY
     A            ZLIN           3S 0H
     A            ZPOS           3S 0H
     A                                  1  2'SI01D B'
     A                                      COLOR(BLU)
     A                                  1 31MSGCON(030 SSI0080 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A            KNAVN     R        O  3  4REFFLD(KUNDR/KNAVN *LIBL/KUNDF)
     A            KOANVN    R        O  3 36REFFLD(KOAR/KOANVN *LIBL/KODTA)
     A                                  5  2MSGCON(030 SSI0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  8  4MSGCON(034 SSI0110 *LIBL/SYMSGF)
     A            ZELKS          2A  B  8 41
     A  37                                  COLOR(RED)
     A            ZESDFF    R        B  8 44REFFLD(HESDFF)
     A  37                                  COLOR(RED)
     A            ZEPNFR        30A  B  8 51
     A                                  9  4MSGCON(034 SSI0130 *LIBL/SYMSGF)
     A            ZELKK          2A  B  9 41
     A  38                                  COLOR(RED)
     A            ZESDVT    R        B  9 44REFFLD(HESDVT)
     A  38                                  COLOR(RED)
     A            ZEPNTI        30A  B  9 51
     A                                 11  4MSGCON(034 SSI0140 *LIBL/SYMSGF)
     A            ZEOT      R        B 11 41REFFLD(HEOT)
     A  34                                  COLOR(RED)
     A                                 11 51MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A                                 12  6MSGCON(032 SSI0150 *LIBL/SYMSGF)
     A            ZEFR      R        B 12 41REFFLD(HEFR)
     A  35                                  COLOR(RED)
     A                                 12 51MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A                                 13  6MSGCON(032 SSI0400 *LIBL/SYMSGF)
     A            ZEANK     R     D  B 13 41REFFLD(HEANK)
     A  36                                  DSPATR(PC)
     A  36                                  COLOR(RED)
     A                                 13 51MSGCON(010 SSI0040 *LIBL/SYMSGF)
     A                                 14  4MSGCON(034 SHU1021 *LIBL/SYMSGF)
     A            ZEKDPL         1   B 14 41
     A  39                                  COLOR(RED)
     A                                 14 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A                                 15  4MSGCON(034 SSI0160 *LIBL/SYMSGF)
     A            ZENT      R     D  B 15 41REFFLD(HENT)
     A                                 15 53MSGCON(010 SSI0170 *LIBL/SYMSGF)
     A                                 16  4MSGCON(034 SSI0180 *LIBL/SYMSGF)
     A            ZEVKT     R     D  B 16 41REFFLD(HEVKT)
     A                                 16 53MSGCON(010 SSI0190 *LIBL/SYMSGF)
     A                                 17  4MSGCON(034 SSI0200 *LIBL/SYMSGF)
     A            ZELM      R     Y  B 17 41REFFLD(HELM)
     A                                      EDTCDE(J)
     A                                 17 53MSGCON(010 SSI0210 *LIBL/SYMSGF)
     A                                 18  4MSGCON(034 SSI0220 *LIBL/SYMSGF)
     A            ZEM3      R     Y  B 18 41REFFLD(HEM3)
     A                                      EDTCDE(J)
     A                                 18 53MSGCON(015 SSI0230 *LIBL/SYMSGF)
     A                                 20  4MSGCON(034 SSI0411 *LIBL/SYMSGF)
     A            ZESDF     R        B 20 41REFFLD(HESDF)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A                                 20 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A  61                                  DSPATR(ND)
     A                                 21  4MSGCON(034 SSI0421 *LIBL/SYMSGF)
     A            ZESDT     R        B 21 41REFFLD(HESDT)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A                                 21 52MSGCON(010 SSI0120 *LIBL/SYMSGF)
     A  61                                  DSPATR(ND)
     A                                 22  4MSGCON(034 SSI0430 *LIBL/SYMSGF)
     A            ZENTF     R     D  B 22 41REFFLD(HENTF)
     A                                 22 52MSGCON(010 SSI0440 *LIBL/SYMSGF)
     A  61                                  DSPATR(ND)
     A                                 22 71MSGCON(010 SSI0060 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(070 SSI0240 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
