     A                                      REF(SR)
     A          R SIFR
     A            IUSR      R               REFFLD(USR)
     A            INA       R               REFFLD(NA)
     A            IKN       R               REFFLD(KN)
     A            IAVD      R               REFFLD(AVD)
     A            ISG       R               REFFLD(SG)
     A            IEUR      R               REFFLD(UR)
     A            ISK            1          COLHDG('SELGER/KJØPER')
     A          K IUSR
