     A*___________________________
     A* SYSPED / SKPOS1
     A*"""""""""""""""""""""""""""
     A          R SKPOSR                    PFILE(SKPOS)
     A          K SKKN
     A          K SKPOS
