     A*__________________________________
     A* SYSPED / SKPOS
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SKPOSR
     A            SKKN      R               REFFLD(KN)
     A            SKPOS          7A         COLHDG('POSISJON')
     A            SKAVD     R               REFFLD(AVD)
     A            SKOPD     R               REFFLD(OPD)
     A          K SKAVD
     A          K SKOPD
