     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/SMA04F)
     A                                      PRINT
     A                                      CF03(03 'Exit')
      *
     A          R SMA03DA                   OVERLAY
     A                                  1  3'SMART Trade Vision AB'
     A                                      COLOR(BLU)
     A                                  1 34'Monitor Dataq'
     A                                      COLOR(WHT)
     A            TLIB      R        O  1 48
     A            TQNAME    R        O  1 59
     A                                  1 74'SMA03DA'
     A                                      COLOR(BLU)
     A                                  3  3'Length'
     A                                      COLOR(WHT)
     A                                  3 10'Field'
     A                                      COLOR(WHT)
     A                                  3 31'Length'
     A                                      COLOR(WHT)
     A                                  3 38'Key'
     A                                      COLOR(WHT)
     A                                  3 51'Length'
     A                                      COLOR(WHT)
     A                                  3 58'SenderID'
     A                                      COLOR(WHT)
     A                                 24  2'F3=Exit'
     A                                      COLOR(BLU)
      *
     A          R SMA03DB
     A                                      SLNO(*VAR)
     A                                      OVERLAY
     A            TKEYLE    R        O  1 34
     A            TKEY      R        O  1 38
     A            TFIELD    R        O  1 10
