********************************************************************
      * RETTINGER I DETTE PROGRAM:
     A          R TARR                      PFILE(SOKTARI)
     A          K TARIFF
     A          K BESKR1
