     A*_____________________________
     A* SYSPED / SONE PRISTABELL L01
     A*"""""""""""""""""""""""""""""
     A          R SONESR                    PFILE(SONES)
     A          K SSAVDE
     A          K SSPROD
     A          K SSZONO
