     A*_____________________________
     A* SYSPED / SONE PRISTABELL L02
     A*"""""""""""""""""""""""""""""
     A          R SONESR                    PFILE(SONES)
     A          K SSZONO
     A          K SSPROD
     A          K SSAVDE
