     A*____________________________
     A* SONETABELLER
     A*""""""""""""""""""""""""""""
     A          R SONETR
     A            SOPROD         1          TEXT('PRODUCTCODE')
     A            SOAVDE         4S 0       TEXT('DEPARTMENT')
     A            SOZONO         5          TEXT('ZONE NBR')
     A            SOVEKT         9P 0       TEXT('WEIGHTGROUP')
     A            SOPRPR         5P 0       TEXT('PRICE PR.')
     A            SOADJU         5P 0       TEXT('AJUST TO')
     A            SOPRIC        13P 2       TEXT('PRICE')
     A            SOMMBE        13P 2       TEXT('MIN/MAX BELØP')
     A            SOFRKO        13P 2       TEXT('FRI KODE')
     A          K SOPROD
     A          K SOAVDE
     A          K SOZONO
     A          K SOVEKT
