     A          R SS182PA
     A                                  3  2'LIST OF DELIVERIED ORDERS'
     A                                  3111'DATE:'
     A                                  3117DATE EDTCDE(Y)
     A                                  3126'TIME:'
     A            XTID4          4  0   3132EDTWRD('  .  ')
     A                                  3141'PAGE:'
     A                                  3147PAGNBR
     A                                  5  2'-------------------------'
     A                                  5 27'-------------------------'
     A                                  5 52'-------------------------'
     A                                  5 77'-------------------------'
     A                                  5102'-------------------------'
     A                                  5127'-------------------------'
     A                                  6  2'P.O.no.'
     A                                  6 23'Vendor'
     A                                  6 39'Acc. No.'
     A                                  6 50'Colli'
     A                                  6 56'  Weight'
     A                                  6 65' Volum'
     A                                  6 72'Final custom'
     A                                  6 93'Order/ref.'
     A                                  6104'Area'
     A                                  6109'Tr.week'
     A                                  6117'Need date'
     A                                  6128'Del. date '
     A                                  6139'Trip No.'
     A                                  7  2'-------------------------'
     A                                  7 27'-------------------------'
     A                                  7 52'-------------------------'
     A                                  7 77'-------------------------'
     A                                  7102'-------------------------'
     A                                  7127'-------------------------'
     A                                  8  2' '
      *
     A          R SS182PB                   SPACEB(1)
     A            POCONO        20A        2
     A            ORSNM         15A       23
     A            WSACC         10A       39
     A            ORCLI          5  0     50EDTCDE(Z)
     A            ORWT           7  1     56EDTCDE(3)
     A            ORVOL          5  2     65EDTCDE(3)
     A            W2CNA         20A       72
     A            XXSAL         10A       93
     A            ORAREA         2A      104
     A            W2TYM          7A      109
     A            ORDTWL         8  0    117EDTWRD('    .  .  ')
     A            ORDTL          8  0    128EDTWRD('    .  .  ')
     A            ORTNO         11  0    139EDTCDE(Z)
      *
     A          R SS182PC                   SPACEB(2)
     A                                     2'-------------------------'
     A                                    27'-------------------------'
     A                                    52'-----------   E N D   O F'
     A                                    77'   L I S T   ------------'
     A                                   102'-------------------------'
     A                                   127'-------------------------'
