     A*________________________________
     A* SYSPED / Faktureringsstatistikk
     A*""""""""""""""""""""""""""""""""
     A                                      REF(SR SRR)
     A          R STATHFR                   TEXT('Faktureringsstatistikk')
     A            STRI      R               REFFLD(RI)
     A            STDTC     R               REFFLD(DTC)
     A            STDTÅ     R               REFFLD(DTÅ)
     A            STK1           8          COLHDG('Key del-1')
     A            STK2           8          COLHDG('Key del-2')
     A            STAVD     R               REFFLD(AVD)
     A            STFB01        11  0       COLHDG('Fbvekt per01')
     A            STFB02        11  0       COLHDG('Fbvekt per02')
     A            STFB03        11  0       COLHDG('Fbvekt per03')
     A            STFB04        11  0       COLHDG('Fbvekt per04')
     A            STFB05        11  0       COLHDG('Fbvekt per05')
     A            STFB06        11  0       COLHDG('Fbvekt per06')
     A            STFB07        11  0       COLHDG('Fbvekt per07')
     A            STFB08        11  0       COLHDG('Fbvekt per08')
     A            STFB09        11  0       COLHDG('Fbvekt per09')
     A            STFB10        11  0       COLHDG('Fbvekt per10')
     A            STFB11        11  0       COLHDG('Fbvekt per11')
     A            STFB12        11  0       COLHDG('Fbvekt per12')
     A            STFB13        11  0       COLHDG('Fbvekt totalt')
     A            STV01         11  0       COLHDG('Vekt per01')
     A            STV02         11  0       COLHDG('Vekt per02')
     A            STV03         11  0       COLHDG('Vekt per03')
     A            STV04         11  0       COLHDG('Vekt per04')
     A            STV05         11  0       COLHDG('Vekt per05')
     A            STV06         11  0       COLHDG('Vekt per06')
     A            STV07         11  0       COLHDG('Vekt per07')
     A            STV08         11  0       COLHDG('Vekt per08')
     A            STV09         11  0       COLHDG('Vekt per09')
     A            STV10         11  0       COLHDG('Vekt per10')
     A            STV11         11  0       COLHDG('Vekt per11')
     A            STV12         11  0       COLHDG('Vekt per12')
     A            STV13         11  0       COLHDG('Vekt totalt')
     A            STA01     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per01')
     A            STA02     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per02')
     A            STA03     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per03')
     A            STA04     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per04')
     A            STA05     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per05')
     A            STA06     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per06')
     A            STA07     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per07')
     A            STA08     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per08')
     A            STA09     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per09')
     A            STA10     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per10')
     A            STA11     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per11')
     A            STA12     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd per12')
     A            STA13     R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd totalt')
     A            STAV01    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp01')
     A            STAV02    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp02')
     A            STAV03    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp03')
     A            STAV04    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp04')
     A            STAV05    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp05')
     A            STAV06    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp06')
     A            STAV07    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp07')
     A            STAV08    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp08')
     A            STAV09    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp09')
     A            STAV10    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp10')
     A            STAV11    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp11')
     A            STAV12    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp grp12')
     A            STAV13    R               REFFLD(NTO)
     A                                      COLHDG('Ant.opd/vgrp totalt')
     A            STAT01    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per01')
     A            STAT02    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per02')
     A            STAT03    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per03')
     A            STAT04    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per04')
     A            STAT05    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per05')
     A            STAT06    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per06')
     A            STAT07    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per07')
     A            STAT08    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per08')
     A            STAT09    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per09')
     A            STAT10    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per10')
     A            STAT11    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per11')
     A            STAT12    R               REFFLD(NTO)
     A                                      COLHDG('TEUS Tot. per12')
     A            STAT13    R               REFFLD(NTO)
     A                                      COLHDG('TEUS totalt')
     A            STSS01    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per01')
     A            STSS02    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per02')
     A            STSS03    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per03')
     A            STSS04    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per04')
     A            STSS05    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per05')
     A            STSS06    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per06')
     A            STSS07    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per07')
     A            STSS08    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per08')
     A            STSS09    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per09')
     A            STSS10    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per10')
     A            STSS11    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per11')
     A            STSS12    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods per12')
     A            STSS13    R               REFFLD(NTO)
     A                                      COLHDG('Stk. gods totalt')
     A            STVS01        11  0       COLHDG('Vekt stk.gods per01')
     A            STVS02        11  0       COLHDG('Vekt stk.gods per02')
     A            STVS03        11  0       COLHDG('Vekt stk.gods per03')
     A            STVS04        11  0       COLHDG('Vekt stk.gods per04')
     A            STVS05        11  0       COLHDG('Vekt stk.gods per05')
     A            STVS06        11  0       COLHDG('Vekt stk.gods per06')
     A            STVS07        11  0       COLHDG('Vekt stk.gods per07')
     A            STVS08        11  0       COLHDG('Vekt stk.gods per08')
     A            STVS09        11  0       COLHDG('Vekt stk.gods per09')
     A            STVS10        11  0       COLHDG('Vekt stk.gods per10')
     A            STVS11        11  0       COLHDG('Vekt stk.gods per11')
     A            STVS12        11  0       COLHDG('Vekt stk.gods per12')
     A            STVS13        11  0       COLHDG('Vekt stk.gods totalt')
     A            STM301         9  3       COLHDG('M3 stk.gods per01')
     A            STM302         9  3       COLHDG('M3 stk.gods per02')
     A            STM303         9  3       COLHDG('M3 stk.gods per03')
     A            STM304         9  3       COLHDG('M3 stk.gods per04')
     A            STM305         9  3       COLHDG('M3 stk.gods per05')
     A            STM306         9  3       COLHDG('M3 stk.gods per06')
     A            STM307         9  3       COLHDG('M3 stk.gods per07')
     A            STM308         9  3       COLHDG('M3 stk.gods per08')
     A            STM309         9  3       COLHDG('M3 stk.gods per09')
     A            STM310         9  3       COLHDG('M3 stk.gods per10')
     A            STM311         9  3       COLHDG('M3 stk.gods per11')
     A            STM312         9  3       COLHDG('M3 stk.gods per12')
     A            STM313         9  3       COLHDG('M3 stk.gods totalt')
     A            STSTNR        11P 0       COLHDG('Running unique nbr.')
     A                                      EDTCDE(Z)
