     A*__________________________
     A* SYSPED / Oppdragsregister
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R STATVFR
     A            HEAVD     R               REFFLD(AVD)
     A            HEOPD     R               REFFLD(OPD)
     A            HEUR      R               REFFLD(UR)
     A            HEDTMP    R               REFFLD(DTM)
     A            HEDTÅP    R               REFFLD(DTÅ)
NV5  A            HEDTCP    R               REFFLD(DTC)
      *
     A            HEDTM     R               REFFLD(DTM)
SV5  A*           HEDTÅ     R               REFFLD(DTÅ)
NV5  A            HEDTÅ          4  0
     A            HESG      R               REFFLD(SG)
     A            HEPRO     R               REFFLD(PRO)
     A            HELKA     R               REFFLD(LKA)
     A            HETRI     R               REFFLD(LKA)
     A            HELKS     R               REFFLD(LKA)
     A            HELKK     R               REFFLD(LKA)
     A            HESDFF    R               REFFLD(SD)
     A            HESDF     R               REFFLD(SD)
     A            HESDT     R               REFFLD(SD)
     A            HESDVT    R               REFFLD(SD)
     A            HEKNA     R               REFFLD(KN)
     A            HEKNT     R               REFFLD(KN)
     A            HEKNS     R               REFFLD(KN)
     A            HEKNSF    R               REFFLD(KN)
     A            HEKNK     R               REFFLD(KN)
     A            HEKNKF    R               REFFLD(KN)
     A            HEOT      R               REFFLD(OT)
     A            HEFR      R               REFFLD(FR)
     A            HENT      R               REFFLD(NTS)
     A            HEVKT     R               REFFLD(VKT9)
     A            HEFBV     R               REFFLD(VKT9)
     A            HEM3           7P 3       COLHDG('KUBIKKMETER')
      *
     A            WSDTM     R               REFFLD(DTM)
     A            WSDTÅ     R               REFFLD(DTÅ)
     A            WSSG      R               REFFLD(SG)
     A            WSPRO     R               REFFLD(PRO)
     A            WSLKA     R               REFFLD(LKA)
     A            WSTRI     R               REFFLD(LKA)
     A            WSLKS     R               REFFLD(LKA)
     A            WSLKK     R               REFFLD(LKA)
     A            WSSDFF    R               REFFLD(SD)
     A            WSSDF     R               REFFLD(SD)
     A            WSSDT     R               REFFLD(SD)
     A            WSSDVT    R               REFFLD(SD)
     A            WSKNA     R               REFFLD(KN)
     A            WSKNT     R               REFFLD(KN)
     A            WSKNS     R               REFFLD(KN)
     A            WSKNSF    R               REFFLD(KN)
     A            WSKNK     R               REFFLD(KN)
     A            WSKNKF    R               REFFLD(KN)
     A            WSOT      R               REFFLD(OT)
     A            WSFR      R               REFFLD(FR)
     A            WSNT      R               REFFLD(NTS)
     A            WSVKT     R               REFFLD(VKT9)
     A            WSFBV     R               REFFLD(VKT9)
     A            WSM3           7P 3       COLHDG('KUBIKKMETER')
      *
     A          K HEAVD
     A          K HEOPD
