      *_______________________________________________
      * SYSPED / ARBEIDSFIL FOR UTSKRIFT AV STATISTIKK
      *"""""""""""""""""""""""""""""""""""""""""""""""
     A          R STWRKFR
     A            SWDTC          2S 0       COLHDG('ÅRHUNDRE')
     A            SWDTÅ          2S 0       COLHDG('ÅRSTALL')
     A            SWK1           8          COLHDG('Key del-1')
     A            SWK2           8          COLHDG('Key del-2')
     A            SWAVD          5S 0       COLHDG('AVD.: 0=TOTAL')
     A            SWLN           3S 0       COLHDG('LINJENR.')
      * WSLN = 01     -->  FRAKTBREGNET VEKT
      * WSLN = 02     -->  AKTUELL VEKT
      * WSLN = 03     -->  ANTALL SENDINGER I PRIODE
      * WSLN = 04     -->  ANTALL SENDINGER I VEKTGRUPPER
      * WSLN = 05     -->  ANTALL TEUS I PRIODE            (SJØ-PAKKE)
      * WSLN = 06     -->  ANTALL STYKKGODS I PRIODE       (SJØ-PAKKE)
      * WSLN = 07     -->  SUM AV INNTEKTER
      * WSLN = 08     -->  SUM AV KOSTNADER
      * WSLN = 09     -->  AKT.VEKT STYKKGODS I PRIODE     (SJØ-PAKKE)
      * WSLN = 10     -->  AKT. M3 STYKKGODS I PRIODE      (SJØ-PAKKE)
      *                    OBS! MED 3 DISIMALER
      * WSLN = 11-30  -->  DETALJER AV INNTEKTER/KOSTNADER
     A            SWTXT         20          COLHDG('TEKST')
     A            SWE01         11S 0       COLHDG('ELEMENT 01')
     A            SWE02         11S 0       COLHDG('ELEMENT 02')
     A            SWE03         11S 0       COLHDG('ELEMENT 03')
     A            SWE04         11S 0       COLHDG('ELEMENT 04')
     A            SWE05         11S 0       COLHDG('ELEMENT 05')
     A            SWE06         11S 0       COLHDG('ELEMENT 06')
     A            SWE07         11S 0       COLHDG('ELEMENT 07')
     A            SWE08         11S 0       COLHDG('ELEMENT 08')
     A            SWE09         11S 0       COLHDG('ELEMENT 09')
     A            SWE10         11S 0       COLHDG('ELEMENT 10')
     A            SWE11         11S 0       COLHDG('ELEMENT 11')
     A            SWE12         11S 0       COLHDG('ELEMENT 12')
     A            SWE13         11S 0       COLHDG('ELEMENT 13')
     A            SWM01          9S 3       COLHDG('ELEMENT 01')
     A            SWM02          9S 3       COLHDG('ELEMENT 02')
     A            SWM03          9S 3       COLHDG('ELEMENT 03')
     A            SWM04          9S 3       COLHDG('ELEMENT 04')
     A            SWM05          9S 3       COLHDG('ELEMENT 05')
     A            SWM06          9S 3       COLHDG('ELEMENT 06')
     A            SWM07          9S 3       COLHDG('ELEMENT 07')
     A            SWM08          9S 3       COLHDG('ELEMENT 08')
     A            SWM09          9S 3       COLHDG('ELEMENT 09')
     A            SWM10          9S 3       COLHDG('ELEMENT 10')
     A            SWM11          9S 3       COLHDG('ELEMENT 11')
     A            SWM12          9S 3       COLHDG('ELEMENT 12')
     A            SWM13          9S 3       COLHDG('ELEMENT 13')
     A          K SWDTC
     A          K SWDTÅ
     A          K SWK1
     A          K SWK2
     A          K SWAVD
     A          K SWLN
