     A          R STATHFR                   PFILE(STATHF)
     A          K STRI
     A          K STDTC
     A          K STDTÅ
     A          K STK1
     A          K STK2
