     A*____________________
     A* SYSPED / STEDSNAVN
     A*""""""""""""""""""""
     A          R STED2R                    PFILE(STED2)
     A          K ST2UNI
