     A*____________________
     A* SYSPED / STEDSNAVN
     A*""""""""""""""""""""
     A* Sortert på stedskode 2.
     A* Når denne er ulik blank betyr det at frakt til/fra stedskode1
     A* skal avregnes etter tabell for kode 2.
     A* Kode 1 er i så fall kun et "alias-navn" for kode 2
     A          R STED2R                    PFILE(STED2)
     A          K ST2KO2
