     A*____________________________________________________________
     A* SYSPED / Logg over endrede statuskoder på HEAD/SADH/SAEH-REG.
     A*""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R STSR
     A            SSDT      R               REFFLD(DT)
     A            SSTM      R               REFFLD(TM)
     A            SSAVD     R               REFFLD(AVD)
     A            SSOPD     R               REFFLD(OPD)
     A            SSUSR     R               REFFLD(USR)
     A            SSSG      R               REFFLD(SG)
     A            SSRTYP    R               REFFLD(ST)
     A                                      COLHDG('REGISTERTYPE')
      * SSRTYP = A   ---> LAND-IMPORT (HEADF)
      *          B   ---> LAND-EXPORT (HEADF)
      *          C   ---> FLY-IMPORT (HEADF)
      *          D   ---> FLY-EXPORT (HEADF)
      *          E   ---> INNLAND (HEADF)
      *          F   ---> BÅT-IMPORT (HEADF)
      *          G   ---> BÅT-EXPORT (HEADF)
      *          H   ---> TRANSPORT  (HEADF)
      *          I   ---> SAD-IMPORT (SADH)
      *          J   ---> SAD-EXPORT (SAEH)
      *          K   ---> BÅT-EXPORT (BOOKING)
      *          L   ---> BÅT-IMPORT (BILLOF)
      *          M   ---> BÅT-EXPORT (BILLOF)
      *          N   ---> SAD-TRANSI (SADTRH)
      *          Q   ---> TET-EXPORT (TRUH/SVXH)   FRA TR015R/SVX015R
      *          R   ---> TET-EXPORT (TRUH/SVXH)   FRA TR010R/SVX010R
      *          P   ---> TET-IMPORT (TRIH/SVNH)   FRA TR060R/SVX060R
      *          S   ---> TET-IMPORT (TRIH/SVNH)   FRA TR068R/SVX068R
      *          O   ---> SHIP-ORDRE (GSSORF)
      *          T   ---> SHIP-TUR   (GSSTUF)
     A            SSSTG     R               REFFLD(ST)
     A                                      COLHDG('Status gammel')
     A            SSSTN     R               REFFLD(ST)
     A                                      COLHDG('Status ny')
     A          K SSDT
     A          K SSTM
     A          K SSAVD
     A          K SSOPD
     A          K SSUSR
