     A*__________________________
     A* SYSPED / STATUS-FIL KOLLIID-NIVÅ
     A*""""""""""""""""""""""""""
     A          R STSCLIR                   PFILE(STSCLI)
     A          K SCPRO
     A          K SCAVD
     A          K SCOPD
     A          K SCFBNR
     A          K SCCLID
