     A*__________________________
     A* SYSPED / STATUS-FIL KOLLIID-NIVÅ
     A*""""""""""""""""""""""""""
     A          R STSCLIR                   PFILE(STSCLI)
     A          K SCCLID
