     A*__________________________
     A* SYSPED / STATUS-FIL KOLLIID-NIVÅ
     A*""""""""""""""""""""""""""
      * Hjelpefil (se STSTUR/STSOPD/STSFBR/STSCLI) for å logge status
      * på "alle nivå" fra kolli-ID->TUR  (normalt via strekkodelesing)
      * (Status "forplanter seg" normalt oppover fra laveste nivå.
      *  Når alle poster på gitt nivået er kontrollert settes det X i
      *  status-feltet, addes 1 i telleverket i filen på nivået over.)
      * Feltet "TYPE" angir hvilken statushandling det gjelder.
      * F.eks. UTLAS=Utlasting til bil (før tur-start)
     A          R STSCLIR
     A            SCTYPE         5A         COLHDG('Status-type')
     A            SCPRO          8S 0       COLHDG('Turnummer')
     A            SCAVD          4S 0       COLHDG('Avdeling')
     A            SCOPD          7S 0       COLHDG('Oppdr-nr')
     A            SCFBNR         3S 0       COLHDG('Fr-br-nr')
     A            SCCLID        20A         COLHDG('Kolli-ID')
     A            SCSTAT         1A         COLHDG('Status')
     A            SCDT           8S 0       COLHDG('Ktr. dato')
     A            SCTID          4S 0       COLHDG('Ktr. tid')
     A            SCUSER        10A         COLHDG('Kontrollør')
     A          K SCTYPE
     A          K SCPRO
     A          K SCAVD
     A          K SCOPD
     A          K SCFBNR
     A          K SCCLID
