     A          R STSF06P1
     A                                  2  2'RAPPORT OM FELTKONTROLL'
     A                                      HIGHLIGHT
     A                                  2 60'Dato:'
     A                                  2 66DATE EDTWRD('  .  .  ')
     A                                  3 60'Tid:'
     A                                  3 66TIME EDTWRD('  :  :  ')
     A                                  4  2'Listenr:'
     A            XPRO           8  0   4 11EDTCDE(Z)
     A                                  4 22'Kontrollør:'
     A            PDAUSR        10A     4 34
     A                                  4 60'Side:'
     A                                  4 66PAGNBR
     A                                  5  2'Felt:'
     A                                      HIGHLIGHT
     A            UTYPE          5      5 14
     A                                      HIGHLIGHT
     A            KFTXT         50A     5 22
     A                                      HIGHLIGHT
     A N50                              6  2'FØLGENE SENDINGER/KOLLI-ID ER '
     A                                      HIGHLIGHT
     A N50                              6 32'IKKE FUNNET:'
     A                                      HIGHLIGHT
     A                                  7  2'------------------------------'
     A                                  7 32'------------------------------'
     A                                  7 62'-----------------'
     A                                  8  2'Avd.'
     A                                  8  7'Opd.nr.'
     A                                  8 15'Anr.'
     A                                  8 20'Sendingsnummer'
     A                                  8 42'Kolli-ID (el. merknad)'
     A                                  8 65'Kolli løpenr'
     A                                  9  2'------------------------------'
     A                                  9 32'------------------------------'
     A                                  9 62'-----------------'
     A          R STSF06P2                  SPACEB(1)
     A  51        SOAVD          4  0      2EDTCDE(Z)
     A  51                                  SPACEB(1)
     A  51        SOOPD          7  0      7EDTCDE(Z)
     A  51        HENT4          4  0     15EDTCDE(Z)
     A  51        HXSNDN        20A       20
     A N52        SCCLID        20A       42
     A N52N53     LNR            4  0     65EDTCDE(Z)
     A N52N53                             71 'AV'
     A N52N53     TOT            4  0     73EDTCDE(Z)
     A  52        MERKNAD       39A       42
     A  53        TKTEXT_B      48A       10SPACEB(1)
     A          R STSF06P3                  SPACEB(1)
     A                                     2'----------------   R A P P O R'
     A                                    32' T    S L U T T  -------------'
     A                                    62'-----------------'
     A          R STSF06P4                  SPACEB(1)
     A                                     2'A L L E   K O L L I   P Å   F '
     A                                    32'E L T E T   E R   K O N T R O '
     A                                    62'L L E R T'
     A                                    74'O K'
     A                                      HIGHLIGHT
     A          R STSF06P5                  SPACEB(3)
     A                                     2'FØLGENE "FREMMEDE SENDINGER/KO'
     A                                      HIGHLIGHT
     A                                    32'LLI-ID"  BLE FUNNET PÅ FELTET:'
     A                                      HIGHLIGHT
     A                                     2'------------------------------'
     C                                      SPACEB(1)
     A                                    32'--------------------'
