     A*__________________________
     A* SYSPED / STATUS-FIL OPPDRAGSNIVÅ
     A*""""""""""""""""""""""""""
     A          R STSOPDR                   PFILE(STSOPD)
     A          K SOAVD
     A          K SOOPD
