     A*__________________________
     A* SYSPED / STATUS-FIL OPPDRAGSNIVÅ
     A*""""""""""""""""""""""""""
      * Hjelpefil (se STSTUR/STSOPD/STSFBR/STSKLI) for å logge status
      * på "alle nivå" fra kolli-ID->TUR  (normalt via strekkodelesing)
      * (Status "forplanter seg" normalt oppover fra laveste nivå.
      *  Når alle poster på gitt nivået er kontrollert settes det X i
      *  status-feltet, addes 1 i telleverket i filen på nivået over.)
      * Feltet "TYPE" angir hvilken statushandling det gjelder.
      * F.eks. UTLAS=Utlasting til bil (før tur-start)
     A          R STSOPDR
     A            SOTYPE         5A         COLHDG('Status-type')
     A            SOPRO          8S 0       COLHDG('Turnummer')
     A            SOAVD          4S 0       COLHDG('Avdeling')
     A            SOOPD          7S 0       COLHDG('Oppdr-nr')
     A            SOSTAT         1A         COLHDG('Status')
     A            SOANFB         4S 0       COLHDG('Antall Fraktbrev')
     A            SOANFK         4S 0       COLHDG('Antall Kontrollert')
      * Manuelle overstyringer (først og fremst ved IKKE kollimerket gods)
     A            SOAMFK         4S 0       COLHDG('Ant fb OK MANUELT')
     A            SOAMKK         4S 0       COLHDG('Ant Kll OK MANUELT')
     A            SOMERK        30A         COLHDG('Merknad (v/umerket)')
     A            SOSORT        30A         COLHDG('ALT.SORT(NAVN MOTT)')
     A          K SOTYPE
     A          K SOPRO
     A          K SOAVD
     A          K SOOPD
