     A*__________________________
     A* SYSPED / STATUS-FIL OPPDRAGSNIVÅ
     A*""""""""""""""""""""""""""
     A          R STSOPDR                   PFILE(STSOPD)
     A          K SOTYPE
     A          K SOPRO
     A          K SOSORT
