     A*__________________________
     A* SYSPED / STATUS-FIL TURNIVÅ
     A*""""""""""""""""""""""""""
     A          R STSTURR                   PFILE(STSTUR)
     A          K STPRO
