     A*__________________________
     A* SYSPED / STATUS-FIL TURNIVÅ
     A*""""""""""""""""""""""""""
      * Hjelpefil (se STSTUR/STSOPD/STSFBR/STSKLI) for å logge status
      * på "alle nivå" fra kolli-ID->TUR  (normalt via strekkodelesing)
      * (Status "forplanter seg" normalt oppover fra laveste nivå.
      *  Når alle poster på gitt nivået er kontrollert settes det X i
      *  status-feltet, addes 1 i telleverket i filen på nivået over.)
      * Feltet "TYPE" angir hvilken statushandling det gjelder.
      * F.eks. UTLAS=Utlasting til bil (før tur-start)
      *
     A          R STSTURR
     A            STTYPE         5A         COLHDG('Status-type')
     A            STPRO          8P 0       COLHDG('Turnummer')
     A            STSTAT         1A         COLHDG('Status')
     A            STANOP         4P 0       COLHDG('Antall oppdrag')
     A            STANOK         4P 0       COLHDG('Antall Kontrollert')
     A          K STTYPE
     A          K STPRO
