     A*%%TS  SD  20150629  224734  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPTITLE('ED För Export')
     A                                      HLPPNLGRP(HLPSCR SVE001PNL)
     A                                      ALTHELP
     A                                      HELP
     A*
     A          R SVE001DA
     A*%%TS  SD  20130319  190249  CB          REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'Sök')
     A                                      CA12(12 'Forrige')
     A                                      OVERLAY
     A          H                           HLPPNLGRP(SVE0010010 SVE001PNL)
     A                                      HLPARA(03 073 03 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SVE001'
     A                                      COLOR(BLU)
     A                                  1 16'DA'
     A                                      COLOR(BLU)
     A                                  1 54'Underhåll av TDS Export'
     A                                      COLOR(WHT)
     A                                  1116DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1125TIME
     A                                      COLOR(BLU)
     A                                  2 60'Ärendenivå'
     A                                      COLOR(WHT)
     A                                  6  2'Avdelning . . . . . :'
     A            ZVEH_SYAV      4Y 0B  6 27EDTCDE(4)
     A                                      CHECK(FE)
     A                                  7  4'Ärendenummer .  . :'
     A            ZVEH_SYOP      7Y 0B  7 27EDTCDE(4)
     A                                      CHECK(FE)
     A                                  7 36'Vid 0 genereras nytt nummer'
     A                                  8  4'Signatur  . . . . :'
     A            ZVEH_SYSG      3A  B  8 27
     A                                  8 36'Om ärendenummer är ifyllt är prior-
     A                                      iteringen:'
     A                                  9  4'Ext.ref . . . . . :'
     A            EXTREF        35A  B  9 27
     A                                 10 36'1. Hämta existerande deklaration.'
     A                                 11 36'2. Kopiera från Norsk importdeklar-
     A                                      ation.'
     A                                 12 36'3. Kopiera från Norskt importuppdr-
     A                                      ag.'
     A                                 26  2'F4=Sök'
     A                                      COLOR(BLU)
     A                                 26 11'F12=Avbryt'
     A                                      COLOR(BLU)
     A*
     A          R SVE001DB
     A*%%TS  SD  20150629  224424  CB          REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'Sök')
     A                                      CF09(09 'X-tra R.44')
     A                                      CA12(12 'Forrige')
     A                                      OVERLAY
     A          H                           HLPPNLGRP(SVE0010001 SVE001PNL)
     A                                      HLPARA(03 057 03 069)
     A          H                           HLPPNLGRP(SVE0010010 SVE001PNL)
     A                                      HLPARA(04 001 04 018)
     A          H                           HLPPNLGRP(SVE0010015 SVE001PNL)
     A                                      HLPARA(04 020 04 021)
     A          H                           HLPPNLGRP(SVE0010371 SVE001PNL)
     A                                      HLPARA(04 024 04 042)
     A          H                           HLPPNLGRP(SVE0010372 SVE001PNL)
     A                                      HLPARA(04 044 04 046)
     A          H                           HLPPNLGRP(SVE0010480 SVE001PNL)
     A                                      HLPARA(04 050 04 065)
     A          H                           HLPPNLGRP(SVE0010240 SVE001PNL)
     A                                      HLPARA(04 057 04 067)
     A          H                           HLPPNLGRP(SVE0010020 SVE001PNL)
     A                                      HLPARA(06 002 08 080)
     A          H                           HLPPNLGRP(SVE0010080 SVE001PNL)
     A                                      HLPARA(10 002 13 080)
     A          H                           HLPPNLGRP(SVE0010220 SVE001PNL)
     A                                      HLPARA(15 001 15 032)
     A          H                           HLPPNLGRP(SVE0010230 SVE001PNL)
     A                                      HLPARA(15 035 15 051)
     A          H                           HLPPNLGRP(SVE0010300 SVE001PNL)
     A                                      HLPARA(15 059 15 078)
     A          H                           HLPPNLGRP(SVE0010280 SVE001PNL)
     A                                      HLPARA(16 034 16 058)
     A          H                           HLPPNLGRP(SVE0010280 SVE001PNL)
     A                                      HLPARA(16 065 16 080)
     A          H                           HLPPNLGRP(SVE0010150 SVE001PNL)
     A                                      HLPARA(16 001 16 018)
     A          H                           HLPPNLGRP(SVE0010170 SVE001PNL)
     A                                      HLPARA(16 020 16 021)
     A          H                           HLPPNLGRP(SVE0010440 SVE001PNL)
     A                                      HLPARA(16 067 16 070)
     A          H                           HLPPNLGRP(SVE0010491 SVE001PNL)
     A                                      HLPARA(17 059 17 080)
     A          H                           HLPPNLGRP(SVE0010260 SVE001PNL)
     A                                      HLPARA(18 001 18 017)
     A          H                           HLPPNLGRP(SVE0010180 SVE001PNL)
     A                                      HLPARA(18 021 18 054)
     A          H                           HLPPNLGRP(SVE0010250 SVE001PNL)
     A                                      HLPARA(19 001 19 017)
     A          H                           HLPPNLGRP(SVE0010210 SVE001PNL)
     A                                      HLPARA(19 021 19 071)
     A          H                           HLPPNLGRP(SVE0010060 SVE001PNL)
     A                                      HLPARA(21 001 21 024)
     A          H                           HLPPNLGRP(SVE0010350 SVE001PNL)
     A                                      HLPARA(21 028 21 051)
     A          H                           HLPPNLGRP(SVE0010290 SVE001PNL)
     A                                      HLPARA(21 056 21 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SVE001'
     A                                      COLOR(BLU)
     A                                  1 16'DB'
     A                                      COLOR(BLU)
     A                                  1 54'Underhåll av TDS Export'
     A                                      COLOR(WHT)
     A                                  1116DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1125TIME
     A                                      COLOR(BLU)
     A                                  2 57'Ärendenivå del-1'
     A                                      COLOR(WHT)
     A                                  3  2'Ext.ref......:'
     A            EXTREF2       35A  O  3 17COLOR(WHT)
     A                                  4  2'Avd/Uppd/Sign:'
     A            XVEH_SYAV      4Y 0O  4 17EDTCDE(4)
     A                                      COLOR(WHT)
     A            XVEH_SYOP      7Y 0O  4 22EDTCDE(4)
     A                                      COLOR(WHT)
     A            XVEH_SYSG      3A  O  4 30COLOR(WHT)
     A                                  4 36'Tullid:'
     A            XVEH_TUID     10A  O  4 44COLOR(WHT)
     A                                  4 57'Medd.typ:'
     A            XVEH_MTYP      3A  B  4 67
     A  27                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                  4 73'1.Deklaration:'
     A            XVEH_DEK1      2A  B  4 88
     A  27                                  DSPATR(PR)
     A  32                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A            XVEH_DEK2      2A  B  4 91
     A  27                                  DSPATR(PR)
     A  32                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                  4 96'48.Uppskj.bet:'
     A            XVEH_UPPS      1A  B  4111
     A  27                                  DSPATR(PR)
     A  73                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                  4115'24.T.art:'
     A            XVEH_TART      1A  B  4125COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                  5115'Test:'
     A            XVEH_0035      1A  B  5121
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' '1')
     A                                  5123'1=Test'
     A                                  6  2'2.Avs:'
     A            XVEH_AVKN      8Y 0B  6  9EDTCDE(4)
     A  27                                  DSPATR(PR)
     A  35                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A            XVEH_AVEO     17A  B  6 18
     A  27                                  DSPATR(PR)
     A  41                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A            XVEH_AVNA     35A  B  6 45
     A  27                                  DSPATR(PR)
     A  36                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            XVEH_AVA1     35A  B  6 81COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_AVA2     35A  B  7  9COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_AVPN      9A  B  7 45COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_AVPA     35A  B  7 55COLOR(YLW)
     A  27                                  DSPATR(PR)
     A  39                                  DSPATR(HI)
     A                                      CHECK(LC)
     A            XVEH_AVLK      2A  B  7 91COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_AVHA     35A  B  8  9
     A  27                                  DSPATR(PR)
     A  49                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A            XVEH_AVTL     25A  B  8 45
     A  27                                  DSPATR(PR)
     A  50                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 10  2'8.Mot:'
     A            XVEH_MOKN      8Y 0B 10  9EDTCDE(4)
     A  27                                  DSPATR(PR)
     A  40                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A            XVEH_MOEO     17A  B 10 18
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            XVEH_MONA     35A  B 10 45COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_MOA1     35A  B 10 81COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_MOA2     35A  B 11  9COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_MOPN      9A  B 11 45COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_MOPA     35A  B 11 55COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_MOLK      2A  B 11 91COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 13  1'22.Valuta/bel.:'
     A            XVEH_VAKD      3A  B 13 17
     A  27                                  DSPATR(PR)
     A  66                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A            XVEH_FABL     11Y 3B 13 21EDTCDE(4)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                 13 35'23.Kurs.....:'
     A            XVEH_VAKU      7Y 4B 13 49EDTCDE(4)
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                 13 59'30.Godslokalkod:'
     A            XVEH_GOLK      4A  B 13 76
     A  27                                  DSPATR(PR)
     A  87                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 14  1'15.Avs/17.Best:'
     A            XVEH_AVUT      2A  B 14 17
     A  27                                  DSPATR(PR)
     A  74                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A            XVEH_AUBE      2A  B 14 20
     A  27                                  DSPATR(PR)
     A  75                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 14 35'44.Fa.nr/Typ:'
     A            XVEH_FATX     17A  B 14 49
     A  27                                  DSPATR(PR)
     A  69                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A            XVEH_FATY      4A  B 14 67COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 16  1'26.Tr.s.inrik.:'
     A            XVEH_TRIN      1A  B 16 17
     A  27                                  DSPATR(PR)
     A  78                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 16 21'18.Trid/Nat:'
     A            XVEH_TRID     35A  B 16 34
     A  27                                  DSPATR(PR)
     A  86                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 17  1'25.Tr.s.gräns.:'
     A            XVEH_TRGR      1A  B 17 17
     A  27                                  DSPATR(PR)
     A  77                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 17 21'21.Akt.Trid:'
     A            XVEH_TRAI     35A  B 17 34COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_TRAL      2A  B 17 70
     A  27                                  DSPATR(PR)
     A  76                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 19  2'6.Kollital...:'
     A            XVEH_KOTA      8Y 0B 19 17EDTCDE(4)
     A  27                                  DSPATR(PR)
     A  83                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                 19 28'Bruttovikt tot:'
     A            XVEH_BRUT     12Y 3B 19 44EDTCDE(4)
     A  27                                  DSPATR(PR)
     A  85                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      CHECK(FE)
     A                                 19 60'29.Utf.kontor:'
     A            XVEH_UTFA      8A  B 19 75
     A  27                                  DSPATR(PR)
     A  79                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 19 86'19.Container:'
     A            XVEH_CONT      1A  B 19100COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 19104'Lastplkod.: '
     A            XVEH_LAST      3A  B 19117COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 21  2'7.Ytt.ref.nr.:'
     A            XVEH_RFAC     35A  B 21 17COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RFAC2    35A  B 21 53COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RFAC3    35A  B 21 89COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 23  1'Klaringsenhet.:'
     A            XVEH_KENH     35A  B 23 18COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 23 56'Klaringsbehörig EORI:'
     A            XVEH_KLEO     17A  B 23 78COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 24  1'Transitnr/land:'
     A            XVEH_TRNR     20A  B 24 18COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_AUKD      2A  B 24 39COLOR(YLW)
     A  27                                  DSPATR(PR)
     A  92                                  DSPATR(HI)
     A                                 24 56'Ber.Avg.Tid.........:'
     A            XVEH_BEAT     12Y 0B 24 78EDTCDE(4)
     A  27                                  DSPATR(PR)
     A  51                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 24 93'Taxeb.Dag:'
     A            XVEH_TAXD      8Y 0B 24104EDTCDE(4)
     A  27                                  DSPATR(PR)
     A  51                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                 26  2'F4=Sök'
     A                                      COLOR(BLU)
     A                                 26 11'F12=Avbryt'
     A                                      COLOR(BLU)
     A                                 26 24'F9=Extra R.44'
     A                                      COLOR(BLU)
     A                                 13 83'Godsnummer:'
     A            XVEH_GODN     15A  B 13 95
     A  27                                  DSPATR(PR)
     A                                      COLOR(YLW)
      *
     A          R SVE001DC
     A*%%TS  SD  20130319  200711  CB          REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'Sök')
     A                                      CA12(12 'Forrige')
     A                                      OVERLAY
     A          H                           HLPPNLGRP(SVE0010140 SVE001PNL)
     A                                      HLPARA(05 002 07 080)
     A          H                           HLPPNLGRP(SVE0010141 SVE001PNL)
     A                                      HLPARA(08 002 09 080)
     A          H                           HLPPNLGRP(SVE0010S13 SVE001PNL)
     A                                      HLPARA(10 001 10 038)
     A          H                           HLPPNLGRP(SVE0010S29 SVE001PNL)
     A                                      HLPARA(10 042 10 055)
     A          H                           HLPPNLGRP(SVE0010S32 SVE001PNL)
     A                                      HLPARA(10 059 10 074)
     A          H                           HLPPNLGRP(SVE0010S02 SVE001PNL)
     A                                      HLPARA(11 001 11 080)
     A          H                           HLPPNLGRP(SVE0010S28 SVE001PNL)
     A                                      HLPARA(12 001 13 080)
     A          H                           HLPPNLGRP(SVE0010491 SVE001PNL)
     A                                      HLPARA(15 002 15 064)
     A          H                           HLPPNLGRP(SVE0010120 SVE001PNL)
     A                                      HLPARA(16 002 16 045)
     A          H                           HLPPNLGRP(SVE0010190 SVE001PNL)
     A                                      HLPARA(17 002 17 053)
     A          H                           HLPPNLGRP(SVE0010400 SVE001PNL)
     A                                      HLPARA(18 002 19 062)
     A          H                           HLPPNLGRP(SVE0010400 SVE001PNL)
     A                                      HLPARA(19 002 19 068)
     A          H                           HLPPNLGRP(SVE0019901 SVE001PNL)
     A                                      HLPARA(20 039 20 049)
     A          H                           HLPPNLGRP(SVE0019902 SVE001PNL)
     A                                      HLPARA(20 002 20 035)
     A          H                           HLPPNLGRP(SVE0019903 SVE001PNL)
     A                                      HLPARA(21 002 21 048)
     A          H                           HLPPNLGRP(SVE0019904 SVE001PNL)
     A                                      HLPARA(22 002 22 040)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SVE001'
     A                                      COLOR(BLU)
     A                                  1 16'DC'
     A                                      COLOR(BLU)
     A                                  1 54'Underhåll av TDS Export'
     A                                      COLOR(WHT)
     A                                  1116DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1125TIME
     A                                      COLOR(BLU)
     A                                  2 52'Ärendenivå, fler upplysningar'
     A                                      COLOR(WHT)
     A                                  3  2'Avd/Uppd/Sign:'
     A            XVEH_SYAV      4Y 0O  3 17EDTCDE(4)
     A                                      COLOR(WHT)
     A            XVEH_SYOP      7Y 0O  3 22EDTCDE(4)
     A                                      COLOR(WHT)
     A            XVEH_SYSG      3A  O  3 30COLOR(WHT)
     A                                  3 36'Tullid:'
     A            XVEH_TUID     10A  O  3 44COLOR(WHT)
     A                                  3115'Test:'
     A            XVEH_0035      1A  O  3121COLOR(WHT)
     A                                  3123'1=Test'
     A                                  5  2'14.Deklarant:'
     A            XVEH_DKKN      8Y 0B  5 16EDTCDE(4)
     A  27                                  DSPATR(PR)
     A  51                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A            XVEH_DKEO     17A  B  5 25COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_DKNA     35A  B  5 52COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_DKA1     35A  B  5 88COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_DKA2     35A  B  6 16COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_DKPN      9A  B  6 52COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_DKPA     35A  B  6 62COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_DKLK      2A  B  6 98COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                  8  2'14.Ombud EORI/typ:'
     A            XVEH_OMEO     17A  B  8 21COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_OMTY      1A  B  8 39COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                  8 43'Hnd/tel:'
     A            XVEH_OMHA     35A  B  8 52COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            XVEH_OMTL     25A  B  8 88COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                  8115'Kvl.säk:'
     A            XVEH_KVSA      1A  B  8124COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                      VALUES('J' 'N')
     A                                  8126'J/N'
     A                                 10  5'Resplan..:'
     A            XVEH_RES1      2A  B 10 16COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RES2      2A  B 10 19COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RES3      2A  B 10 22COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RES4      2A  B 10 25COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RES5      2A  B 10 28COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RES6      2A  B 10 31COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RES7      2A  B 10 34COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_RES8      2A  B 10 37COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 10 42'Bet.kod.Trp:'
     A            XVEH_BETK      1A  B 10 55COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 10 59'Särsk.omständ:'
     A            XVEH_SAOM      1A  B 10 74COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 11  5'Kom:'
     A            XVEH_KOMR     70A  B 11 10COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 12  5'Sel:'
     A            XVEH_SEL1     70A  B 12 10COLOR(YLW)
     A  27                                  DSPATR(PR)
     A            XVEH_SEL2     70A  B 13 10COLOR(YLW)
     A  27                                  DSPATR(PR)
     A                                 26  2'F4=Sök'
     A                                      COLOR(BLU)
     A                                 26 11'F12=Avbryt'
     A                                      COLOR(BLU)
     A          R SVE001DØ
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79   O 27  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
