     A                                      REF(SVEH)
      *________
      * Heading
      *""""""""
     A          R SVE012PA
     A                                  2 16'FELMEDDELANDE FRÅN TDS'
     A                                      UNDERLINE
     A                                  2 50DATE EDTCDE(Y)
     A                                  2 59'Sidan:'
     A                                  2 66PAGNBR EDTCDE(Z)
     A                                  4  4'Tullid:'
     A            SVEH_TUID R           4 12
     A                                  4 43'Referans:'
     A            SVEH_SYAV R           4 53EDTCDE(Z)
     A                                  4 57'/'
     A            SVEH_SYOP R           4 58EDTCDE(Z)
     A                                  4 65'/'
     A            SVEH_SYSG R           4 66
      *
     A                                  6  4'Text'
     A                                  7  4'----------------------------------'
     A                                  7 38'--------------------------------'
      * Detaljer
     A          R SVE012PB                  SPACEB(1)
     A            SVEHH_TXH     35         4SPACEA(1)
     A            SVEHH_TX1     70         4SPACEA(1)
     A            SVEHH_TX2     70         4SPACEA(1)
     A            SVEHH_TX3     70         4SPACEA(1)
     A            SVEHH_TX4     70         4SPACEA(1)
     A            SVEHH_TX5     70         4SPACEA(1)
     A          R SVE012PZ                  SPACEB(1)
     A                                     4'---------------------  S I S T A  '
     A                                    38'S I D A N  ---------------------'
