     A          R SVEHER
     A            SVEHE_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            SVEHE_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVEHE_DTA     80          COLHDG('EDIFACT Data')
     A          K SVEHE_SYA
     A          K SVEHE_SYO
