     A          R SVEVXR
     A            SVEVX_SYAV     4S 0       COLHDG('SYSPED Avdeling')
     A            SVEVX_SYOP     7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVEVX_SYLI     5S 0       COLHDG('SYSPED Linjenr')
     A            SVEVX_SUK1     5          COLHDG('Særsk.uppl.kod')
     A            SVEVX_SUK6     5          COLHDG('Særsk.uppl.kod')
     A            SVEVX_SUKB     5          COLHDG('Særsk.uppl.kod')
     A            SVEVX_SUT1    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUT2    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUT3    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUT4    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUT5    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUT6    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUT7    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUT8    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUT9    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUTA    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUTB    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUTC    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUTD    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUTE    70          COLHDG('Særsk.uppl.text')
     A            SVEVX_SUTF    70          COLHDG('Særsk.uppl.text')
     A          K SVEVX_SYAV
     A          K SVEVX_SYOP
     A          K SVEVX_SYLI
