     A          R SVEVR
     A            SVEV_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            SVEV_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVEV_SYLI      5S 0       COLHDG('SYSPED Linjenr')
     A            SVEV_KOTA      5S 0       COLHDG('Kollital')
     A            SVEV_KOT2      5S 0       COLHDG('Kollital')
     A            SVEV_KOT3      5S 0       COLHDG('Kollital')
     A            SVEV_KOT4      5S 0       COLHDG('Kollital')
     A            SVEV_KOT5      5S 0       COLHDG('Kollital')
     A            SVEV_KOSL      4          COLHDG('Kollislag')
     A            SVEV_KOS2      4          COLHDG('Kollislag')
     A            SVEV_KOS3      4          COLHDG('Kollislag')
     A            SVEV_KOS4      4          COLHDG('Kollislag')
     A            SVEV_KOS5      4          COLHDG('Kollislag')
     A            SVEV_VASL     70          COLHDG('Varubeskrivning')
     A            SVEV_VAS2     70          COLHDG('Varubeskrivning')
     A            SVEV_VAS3     70          COLHDG('Varubeskrivning')
     A            SVEV_VAS4     70          COLHDG('Varubeskrivning')
     A            SVEV_VAS5     70          COLHDG('Varubeskrivning')
     A            SVEV_GODM     42          COLHDG('Godsmærkning')
     A            SVEV_GOD2     42          COLHDG('Godsmærkning')
     A            SVEV_GOD3     42          COLHDG('Godsmærkning')
     A            SVEV_GOD4     42          COLHDG('Godsmærkning')
     A            SVEV_GOD5     42          COLHDG('Godsmærkning')
     A            SVEV_VANO      5S 0       COLHDG('Varupost nr.')
     A            SVEV_VATA      8          COLHDG('Varukod Taric nr')
     A            SVEV_VATI      4          COLHDG('Varukod till 33:3')
     A            SVEV_VAT4      4          COLHDG('Varukod till 33:4')
     A            SVEV_VAT5      4          COLHDG('Varukod till 33:5')
     A            SVEV_ULKD      2          COLHDG('Ursprungsland, kod')
S01  A*           SVEV_BRUT     11S 0       COLHDG('Bruttovikt')
N01  A            SVEV_BRUT     14S 3       COLHDG('Bruttovikt')
     A            SVEV_EUP1      4          COLHDG('Førfarande 37:1')
     A            SVEV_EUP2      3          COLHDG('Førfarande 37:2')
S01  A*           SVEV_NETO     11S 0       COLHDG('Nettovikt')
N01  A            SVEV_NETO     14S 3       COLHDG('Nettovikt')
     A            SVEV_KONO      3          COLHDG('Kontigentnummer')
     A            SVEV_ANKV     10S 0       COLHDG('Annan kvantitet')
     A            SVEV_SUKO      5          COLHDG('Særsk.uppl.kod')
     A            SVEV_SUK6      5          COLHDG('Særsk.uppl.kod')
     A            SVEV_SUKB      5          COLHDG('Særsk.uppl.kod')
     A            SVEV_SUTX     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUT2     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUT3     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUT4     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUT5     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUT6     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUT7     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUT8     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUT9     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUTA     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUTB     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUTC     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUTD     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUTE     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUTF     70          COLHDG('Særsk.uppl.text')
     A            SVEV_SUOK     11S 0       COLHDG('Særsk.uppl.ø.kost')
     A            SVEV_SUKR     11S 0       COLHDG('Særsk.uppl.kassa.r')
     A            SVEV_SUAR     11S 0       COLHDG('Særsk.uppl.annan.r')
     A            SVEV_ATIN      3          COLHDG('Åtgærdsindikator')
     A            SVEV_STVA     11S 0       COLHDG('Stat.værde')
     A            SVEV_STVA2    11S 0       COLHDG('Tullværde')
     A            SVEV_FABL     11S 3       COLHDG('Fakturabelopp')
     A            SVEV_BETK      1          COLHDG('Betalkod Transp')
     A            SVEV_KOMR     70          COLHDG('Komm Refnr')
     A            SVEV_FNKD      4          COLHDG('FN Kod FG')
     A            SVEV_BIT1      4          COLHDG('Bil.handl, typ')
     A            SVEV_BIT2      4          COLHDG('Bil.handl, typ')
     A            SVEV_BIT3      4          COLHDG('Bil.handl, typ')
     A            SVEV_BIT4      4          COLHDG('Bil.handl, typ')
     A            SVEV_BIT5      4          COLHDG('Bil.handl, typ')
     A            SVEV_BIT6      4          COLHDG('Bil.handl, typ')
     A            SVEV_BIT7      4          COLHDG('Bil.handl, typ')
     A            SVEV_BIT8      4          COLHDG('Bil.handl, typ')
     A            SVEV_BIT9      4          COLHDG('Bil.handl, typ')
     A            SVEV_BII1     35          COLHDG('Bil.handl, id')
     A            SVEV_BII2     35          COLHDG('Bil.handl, id')
     A            SVEV_BII3     35          COLHDG('Bil.handl, id')
     A            SVEV_BII4     35          COLHDG('Bil.handl, id')
     A            SVEV_BII5     35          COLHDG('Bil.handl, id')
     A            SVEV_BII6     35          COLHDG('Bil.handl, id')
     A            SVEV_BII7     35          COLHDG('Bil.handl, id')
     A            SVEV_BII8     35          COLHDG('Bil.handl, id')
     A            SVEV_BII9     35          COLHDG('Bil.handl, id')
     A            SVEV_CO01     17          COLHDG('Containernummer')
     A            SVEV_CO02     17          COLHDG('Containernummer')
     A            SVEV_CO03     17          COLHDG('Containernummer')
     A            SVEV_CO04     17          COLHDG('Containernummer')
     A            SVEV_CO05     17          COLHDG('Containernummer')
     A            SVEV_CO06     17          COLHDG('Containernummer')
     A            SVEV_CO07     17          COLHDG('Containernummer')
     A            SVEV_CO08     17          COLHDG('Containernummer')
     A            SVEV_CO09     17          COLHDG('Containernummer')
     A            SVEV_CO10     17          COLHDG('Containernummer')
     A            SVEV_CO11     17          COLHDG('Containernummer')
     A            SVEV_CO12     17          COLHDG('Containernummer')
     A            SVEV_CO13     17          COLHDG('Containernummer')
     A            SVEV_CO14     17          COLHDG('Containernummer')
     A            SVEV_CO15     17          COLHDG('Containernummer')
     A            SVEV_CO16     17          COLHDG('Containernummer')
     A            SVEV_CO17     17          COLHDG('Containernummer')
     A            SVEV_CO18     17          COLHDG('Containernummer')
     A            SVEV_CO19     17          COLHDG('Containernummer')
     A            SVEV_CO20     17          COLHDG('Containernummer')
     A            SVEV_TIK1      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIK2      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIK3      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIK4      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIK5      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIK6      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIK7      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIK8      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIK9      1          COLHDG('Tid.handl. kat')
     A            SVEV_TIT1      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIT2      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIT3      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIT4      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIT5      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIT6      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIT7      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIT8      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIT9      3          COLHDG('Tid.handl. typ')
     A            SVEV_TIX1     35          COLHDG('Tid.handl. txt')
     A            SVEV_TIX2     35          COLHDG('Tid.handl. txt')
     A            SVEV_TIX3     35          COLHDG('Tid.handl. txt')
     A            SVEV_TIX4     35          COLHDG('Tid.handl. txt')
     A            SVEV_TIX5     35          COLHDG('Tid.handl. txt')
     A            SVEV_TIX6     35          COLHDG('Tid.handl. txt')
     A            SVEV_TIX7     35          COLHDG('Tid.handl. txt')
     A            SVEV_TIX8     35          COLHDG('Tid.handl. txt')
     A            SVEV_TIX9     35          COLHDG('Tid.handl. txt')
     A            SVEV_LAGI     14          COLHDG('49.Lager ID')
     A            SVEV_LAGT      1          COLHDG('49.Lager Typ')
     A            SVEV_LAGL      2          COLHDG('49.Lager LK')
     A            SVEV_CALL      2          COLHDG('Call me')
     A            SVEV_UNIK      9P 0       COLHDG('RECORDNR')
     A            SVEV_REFF     17          COLHDG('REFERANSE')
     A          K SVEV_REFF
