     A          R SVEVR                     PFILE(SVEV)
     A          K SVEV_SYAV
     A          K SVEV_SYOP
     A          K SVEV_ERR                  DESCEND
