     A          R SVEVAR
     A            SVEVA_SAV      4S 0       COLHDG('SYSPED Avdeling')
     A            SVEVA_SOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVEVA_SLI      5S 0       COLHDG('SYSPED Linjenr')
     A            SVEVA_ABK      3          COLHDG('Avgber.avgkod')
     A            SVEVA_ABG     11S 3       COLHDG('Avgber.besk.gr')
     A            SVEVA_ABS      9S 4       COLHDG('Avgber.avg.sats')
     A            SVEVA_ABX      4          COLHDG('Avgber.x.menhet')
     A            SVEVA_ABB      9S 0       COLHDG('Belopp')
     A          K SVEVA_SAV
     A          K SVEVA_SOP
     A          K SVEVA_SLI
     A          K SVEVA_ABK
