     A          R SVEWR
     A            SVEW_KNNR      8S 0       COLHDG('Kundnummer')
     A            SVEW_KNSO     35          COLHDG('Søkbegrepp')
     A            SVEW_KOTA      5S 0       COLHDG('Kollital')
     A            SVEW_KOT2      5S 0       COLHDG('Kollital')
     A            SVEW_KOT3      5S 0       COLHDG('Kollital')
     A            SVEW_KOT4      5S 0       COLHDG('Kollital')
     A            SVEW_KOT5      5S 0       COLHDG('Kollital')
     A            SVEW_KOSL      4          COLHDG('Kollislag')
     A            SVEW_KOS2      4          COLHDG('Kollislag')
     A            SVEW_KOS3      4          COLHDG('Kollislag')
     A            SVEW_KOS4      4          COLHDG('Kollislag')
     A            SVEW_KOS5      4          COLHDG('Kollislag')
     A            SVEW_VASL     70          COLHDG('Varubeskrivning')
     A            SVEW_VAS2     70          COLHDG('Varubeskrivning')
     A            SVEW_VAS3     70          COLHDG('Varubeskrivning')
     A            SVEW_VAS4     70          COLHDG('Varubeskrivning')
     A            SVEW_VAS5     70          COLHDG('Varubeskrivning')
     A            SVEW_GODM     42          COLHDG('Godsmærkning')
     A            SVEW_GOD2     42          COLHDG('Godsmærkning')
     A            SVEW_GOD3     42          COLHDG('Godsmærkning')
     A            SVEW_GOD4     42          COLHDG('Godsmærkning')
     A            SVEW_GOD5     42          COLHDG('Godsmærkning')
     A            SVEW_VANO      5S 0       COLHDG('Varupost nr.')
     A            SVEW_VATA      8          COLHDG('Varukod Taric nr')
     A            SVEW_VATI      4          COLHDG('Varukod till 33:3')
     A            SVEW_VAT4      4          COLHDG('Varukod till 33:4')
     A            SVEW_VAT5      4          COLHDG('Varukod till 33:5')
     A            SVEW_ULKD      2          COLHDG('Ursprungsland, kod')
S01  A*           SVEW_BRUT     11S 0       COLHDG('Bruttovikt')
N01  A            SVEW_BRUT     14S 3       COLHDG('Bruttovikt')
     A            SVEW_EUP1      4          COLHDG('Førfarande 37:1')
     A            SVEW_EUP2      3          COLHDG('Førfarande 37:2')
S01  A*           SVEW_NETO     11S 0       COLHDG('Nettovikt')
N01  A            SVEW_NETO     14S 3       COLHDG('Nettovikt')
     A            SVEW_KONO      3          COLHDG('Kontigentnummer')
     A            SVEW_ANKV     10S 0       COLHDG('Annan kvantitet')
     A            SVEW_SUKO      5          COLHDG('Særsk.uppl.kod')
     A            SVEW_SUK6      5          COLHDG('Særsk.uppl.kod')
     A            SVEW_SUKB      5          COLHDG('Særsk.uppl.kod')
     A            SVEW_SUTX     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUT2     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUT3     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUT4     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUT5     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUT6     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUT7     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUT8     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUT9     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUTA     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUTB     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUTC     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUTD     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUTE     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUTF     70          COLHDG('Særsk.uppl.text')
     A            SVEW_SUOK     11S 0       COLHDG('Særsk.uppl.ø.kost')
     A            SVEW_SUKR     11S 0       COLHDG('Særsk.uppl.kassa.r')
     A            SVEW_SUAR     11S 0       COLHDG('Særsk.uppl.annan.r')
     A            SVEW_ATIN      3          COLHDG('Åtgærdsindikator')
     A            SVEW_STVA     11S 0       COLHDG('Stat.værde')
     A            SVEW_STVA2    11S 0       COLHDG('Tullværde')
     A            SVEW_FABL     11S 3       COLHDG('Fakturabelopp')
     A            SVEW_BETK      1          COLHDG('Betalkod Transp')
     A            SVEW_KOMR     70          COLHDG('Komm Refnr')
     A            SVEW_FNKD      4          COLHDG('FN Kod FG')
     A            SVEW_BIT1      4          COLHDG('Bil.handl, typ')
     A            SVEW_BIT2      4          COLHDG('Bil.handl, typ')
     A            SVEW_BIT3      4          COLHDG('Bil.handl, typ')
     A            SVEW_BIT4      4          COLHDG('Bil.handl, typ')
     A            SVEW_BIT5      4          COLHDG('Bil.handl, typ')
     A            SVEW_BIT6      4          COLHDG('Bil.handl, typ')
     A            SVEW_BIT7      4          COLHDG('Bil.handl, typ')
     A            SVEW_BIT8      4          COLHDG('Bil.handl, typ')
     A            SVEW_BIT9      4          COLHDG('Bil.handl, typ')
     A            SVEW_BII1     35          COLHDG('Bil.handl, id')
     A            SVEW_BII2     35          COLHDG('Bil.handl, id')
     A            SVEW_BII3     35          COLHDG('Bil.handl, id')
     A            SVEW_BII4     35          COLHDG('Bil.handl, id')
     A            SVEW_BII5     35          COLHDG('Bil.handl, id')
     A            SVEW_BII6     35          COLHDG('Bil.handl, id')
     A            SVEW_BII7     35          COLHDG('Bil.handl, id')
     A            SVEW_BII8     35          COLHDG('Bil.handl, id')
     A            SVEW_BII9     35          COLHDG('Bil.handl, id')
     A            SVEW_CO01     17          COLHDG('Containernummer')
     A            SVEW_CO02     17          COLHDG('Containernummer')
     A            SVEW_CO03     17          COLHDG('Containernummer')
     A            SVEW_CO04     17          COLHDG('Containernummer')
     A            SVEW_CO05     17          COLHDG('Containernummer')
     A            SVEW_CO06     17          COLHDG('Containernummer')
     A            SVEW_CO07     17          COLHDG('Containernummer')
     A            SVEW_CO08     17          COLHDG('Containernummer')
     A            SVEW_CO09     17          COLHDG('Containernummer')
     A            SVEW_CO10     17          COLHDG('Containernummer')
     A            SVEW_CO11     17          COLHDG('Containernummer')
     A            SVEW_CO12     17          COLHDG('Containernummer')
     A            SVEW_CO13     17          COLHDG('Containernummer')
     A            SVEW_CO14     17          COLHDG('Containernummer')
     A            SVEW_CO15     17          COLHDG('Containernummer')
     A            SVEW_CO16     17          COLHDG('Containernummer')
     A            SVEW_CO17     17          COLHDG('Containernummer')
     A            SVEW_CO18     17          COLHDG('Containernummer')
     A            SVEW_CO19     17          COLHDG('Containernummer')
     A            SVEW_CO20     17          COLHDG('Containernummer')
     A            SVEW_TIK1      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIK2      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIK3      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIK4      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIK5      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIK6      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIK7      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIK8      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIK9      1          COLHDG('Tid.handl. kat')
     A            SVEW_TIT1      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIT2      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIT3      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIT4      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIT5      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIT6      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIT7      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIT8      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIT9      3          COLHDG('Tid.handl. typ')
     A            SVEW_TIX1     35          COLHDG('Tid.handl. txt')
     A            SVEW_TIX2     35          COLHDG('Tid.handl. txt')
     A            SVEW_TIX3     35          COLHDG('Tid.handl. txt')
     A            SVEW_TIX4     35          COLHDG('Tid.handl. txt')
     A            SVEW_TIX5     35          COLHDG('Tid.handl. txt')
     A            SVEW_TIX6     35          COLHDG('Tid.handl. txt')
     A            SVEW_TIX7     35          COLHDG('Tid.handl. txt')
     A            SVEW_TIX8     35          COLHDG('Tid.handl. txt')
     A            SVEW_TIX9     35          COLHDG('Tid.handl. txt')
     A            SVEW_LAGI     14          COLHDG('49.Lager ID')
     A            SVEW_LAGT      1          COLHDG('49.Lager Typ')
     A            SVEW_LAGL      2          COLHDG('49.Lager LK')
     A            SVEW_CALL      2          COLHDG('Call me')
     A          K SVEW_KNNR
     A          K SVEW_KNSO
