     A*%%TS  SD  20120913  083221  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A          R SVG012DA
     A*%%TS  SD  20120913  083221  CB          REL-V7R1M0  5770-WDS
     A                                  1  2'SYSPED/SVG021'
     A                                      COLOR(BLU)
     A                                  1 16'DA'
     A                                      COLOR(BLU)
     A                                  1 53'TDS'
     A                                      COLOR(WHT)
     A                                  1113DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1124TIME
     A                                      COLOR(BLU)
     A                                  2 46'Lösenordskontroll'
     A                                      COLOR(WHT)
     A                                  4  2'Lösenordet är fel eller saknas !  -
     A                                      Ni blir nu avloggad. Kontakta säker-
     A                                      hetsansvarig om ni har fortsatta pr-
     A                                      oblem.'
     A                                 25  2'Enter=Avsluta och logga ut'
     A                                 26 87'(c) Systema A/S 2012'
