     A          R SVG511FR
     A            YVIH_GODN     15          COLHDG('Godsnummer')
     A            YVIH_GOLK      4          COLHDG('Godslokalkod')
     A            YVIH_SYDT      8S 0       COLHDG('Uttagsdatum')
     A            YVIH_EUP1      4          COLHDG('R37-1')
     A            YVIH_TUID     18          COLHDG('Tullid/ext.ref')
     A            YVIH_KOTA      8S 0       COLHDG('Kollital')
     A            YVIH_BRUT      9S 0       COLHDG('Bruttovikt')
     A          K YVIH_GODN
     A          K YVIH_TUID
