     A*%%TS  SD  20160229  180907  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A          R SVG512DA                  SFL
     A*%%TS  SD  20140319  151211  SYSTEMA     REL-V7R1M0  5770-WDS
     A            ZOP            1A  I  9  2VALUES(' ' '2' '4' '5')
     A            YVIH_GODN     15A  O  9  4
     A            YVIH_GOLK      4A  O  9 20
     A            YVIH_SYDT      8Y 0O  9 25EDTCDE(4)
     A            YVIH_EUP1      4A  O  9 34
     A            YVIH_TUID     18A  O  9 39
     A            YVIH_KOTA      8Y 0O  9 58EDTCDE(K)
     A            YVIH_BRUT      9Y 0O  9 70EDTCDE(K)
     A          R SVG512DB                  SFLCTL(SVG512DA)
     A*%%TS  SD  20160229  180907  CB          REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  91N93N94                            ROLLUP(25 'Rollup')
     A  91N93N94                            ROLLDOWN(26 'Rolldown')
     A                                      CF03(03 'Gå ut')
     A                                      CF04(04 'Søk')
     A                                      CF05(05 'Refresh')
     A                                      CF06(06 'NY')
     A                                      CF08(08 'SELEKTERA')
     A                                      CF12(12 'Forrige')
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                  1  2'SYSPED/TULLUT'
     A                                      COLOR(BLU)
     A                                  1 16'DA'
     A                                      COLOR(BLU)
     A                                  1 30'Underhåll av lager'
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  2 28'Uttag extern førtullning'
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  2 68SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  4  2'Vælj option eller tryck Enter.'
     A                                      COLOR(BLU)
     A                                  5  4'2=Ændra   4=Radera'
     A                                      COLOR(BLU)
     A                                  7  4'Godsnummer'
     A                                      COLOR(WHT)
     A                                  7 20'Kod'
     A                                      COLOR(WHT)
     A                                  7 25'Datum'
     A                                      COLOR(WHT)
     A                                  7 34'Førf'
     A                                      COLOR(WHT)
     A                                  7 39'Tullid/annan_ref'
     A                                      COLOR(WHT)
     A                                  7 63'Kolli'
     A                                      COLOR(WHT)
     A                                  7 77'Vikt'
     A                                      COLOR(WHT)
     A            XVIH_GODN     15A  I  8  4
     A            XVIH_TUID     18A  I  8 39
     A          R SVG512DC
     A*%%TS  SD  20160229  174800  CB          REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A                                 26  2'F3=Avsluta'
     A                                      COLOR(BLU)
     A                                 26 15'F4=Søk'
     A                                      COLOR(BLU)
     A                                 26 24'F6=Skapa'
     A                                      COLOR(BLU)
     A                                 26 35'F8=Selektera'
     A                                      COLOR(BLU)
     A                                 26 50'F12=Avbryt'
     A                                      COLOR(BLU)
     A          R SVG512DD
     A*%%TS  SD  20140319  151211  SYSTEMA     REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A                                      CF03(03 'Gå ut')
     A                                      CF04(04 'Søk')
     A                                      CF12(12 'Forrige')
     A            ZVIH_GODN     15A  B 24  4
     A  31                                  DSPATR(RI)
     A                                      DSPATR(PC)
     A            ZVIH_GOLK      4A  B 24 20
     A  32                                  DSPATR(RI)
     A  32                                  DSPATR(PC)
     A            ZVIH_SYDT      8Y 0B 24 25
     A  33                                  DSPATR(RI)
     A  33                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            ZVIH_EUP1      4A  B 24 34
     A  34                                  DSPATR(RI)
     A  34                                  DSPATR(PC)
     A            ZVIH_TUID     18A  B 24 39
     A  35                                  DSPATR(RI)
     A  35                                  DSPATR(PC)
     A            ZVIH_KOTA      8Y 0B 24 58
     A  36                                  DSPATR(RI)
     A  36                                  DSPATR(PC)
     A                                      EDTCDE(K)
     A            ZVIH_BRUT      9Y 0B 24 70
     A  37                                  DSPATR(RI)
     A  37                                  DSPATR(PC)
     A                                      EDTCDE(K)
     A                                 26  2'F3=Avsluta'
     A                                      COLOR(BLU)
     A                                 26 15'F4=Søk'
     A                                      COLOR(BLU)
     A                                 26 24'F12=Avbryt'
     A                                      COLOR(BLU)
     A          R SVG512DE
     A                                 23  2' '
     A                                 24  2' '
     A          R SVG512DØ
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79   O 27  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
