     A                                      REF(SVIH)
      *________
      * Heading
      *""""""""
     A          R SVI041PA
     A                                  2  4'INVOIC-INTRASTAT'
     A                                      HIGHLIGHT
     A                                  4  4'Not to be paid'
     A                                      UNDERLINE
     A                                      HIGHLIGHT
     A                                  6  4'Buyer:'
     A                                      HIGHLIGHT
     A            SVIH_MONA R           7  4
     A                                      HIGHLIGHT
     A            SVIH_MOA1 R           8  4
     A                                      HIGHLIGHT
     A            SVIH_MOLK R           9  4
     A                                      HIGHLIGHT
     A                                  9  6'-'
     A                                      HIGHLIGHT
     A            SVIH_MOPN R           9  7
     A                                      HIGHLIGHT
     A            SVIH_MOPA R           9 13
     A                                      HIGHLIGHT
     A                                  9 40'Date of invoice'
     A                                      HIGHLIGHT
     A            SVIH_SYDT R           9 60
     A                                 10 40'Reference'
     A                                      HIGHLIGHT
     A            SVIH_SYAV R          10 60
     A                                 10 64'/'
     A            SVIH_SYOP R          10 65
     A                                 11  4'VAT-no.'
     A                                      HIGHLIGHT
     A            SVIH_MOEO R          11 18
     A                                 11 40'KINGSRØD ÅKERI AB'
     A                                 12 40'VAT.no. 502059919601'
     A                                 19  4'Type of goods'
     A                                      HIGHLIGHT
     A                                 19 35'Gross weight'
     A                                      HIGHLIGHT
     A                                 19 67'Amount'
     A                                      HIGHLIGHT
     A*           SVIH_VASL R          20  4
     A            SVIH_BRUT R          20 36EDTCDE(K)
     A            SVIH_FABL R          20 59EDTCDE(K)
     A            SVIH_VAKD R          20 57
     A                                 29  4'Payment shall be done to:'
     A                                      HIGHLIGHT
     A            SVIH_AVNA R          30  4
     A                                      HIGHLIGHT
     A                                 30 35'Invoic no.'
     A                                      HIGHLIGHT
     A            SVIH_FATX R          30 62
     A            SVIH_AVA1 R          31  4
     A                                      HIGHLIGHT
     A                                 31 35'Date of invoic'
     A                                      HIGHLIGHT
     A            WVIH_SYDT      8S 0  31 60
     A            SVIH_AVLK R          32  4
     A                                      HIGHLIGHT
     A                                 32  6'-'
     A                                      HIGHLIGHT
     A            SVIH_AVPN R          32  7
     A                                      HIGHLIGHT
     A            SVIH_AVPA R          32 13
     A                                      HIGHLIGHT
     A                                 32 35'Total amount'
     A                                      HIGHLIGHT
     A            WVIH_FABL     11S 3  32 54EDTCDE(K)
     A            WVIH_VAKD      3     32 52
     A                                 39  4'Message for the buyer:'
     A                                      HIGHLIGHT
     A                                 40  4'Customs clearance within the Europ'
     A                                 40 38'ean Community for home use with'
     A                                 41  4'simultaneous entry for free circul'
     A                                 41 38'ation of goods subject to a zero'
     A                                 42  4'rated onward supply has been done '
     A                                 42 38'by Kingsrød Åkeri AB (VAT-nr.'
     A                                 43  4'SE 502059919601) represented by Ki'
     A                                 43 38'ngsrød Transport AS.'
     A                                 44  4'Customs ID:'
     A            SVIH_TUID R          44 16
     A                                 46  4'Please report this as an arrival t'
     A                                 46 38'o Intrastat and state Sweden'
     A                                 47  4'as dispatching country'
     A                                 49  4'In case You should have any questi'
     A                                 49 38'ns about this please contact'
     A                                 50  4'Kingsrød Transport AS, telephone +'
     A                                 50 38'4769111522'
