     A*%%TS  SD  20040819  211159  CB          REL-V5R2M0  5722-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A          R SVI004DA
     A*%%TS  SD  20040819  211159  CB          REL-V5R2M0  5722-WDS
     A                                      WINDOW(*DFT 17 43 *NOMSGLIN)
     A                                      CF03(03 'EXIT')
     A                                      CF04(04 'Prompt')
     A                                      CF12(12 'Cancel')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      OVRDTA
     A                                      OVRATR
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  1'SVI004D'
     A                                      COLOR(BLU)
     A                                  1  9'A'
     A                                      COLOR(BLU)
     A                                  1 12'Avgiftsberäkning'
     A                                      COLOR(WHT)
     A                                  3  1'Slag'
     A                                      COLOR(WHT)
     A                                  3 12'Grund'
     A                                      COLOR(WHT)
     A                                  3 24'Sats'
     A                                      COLOR(WHT)
     A                                  3 29'X-m'
     A                                      COLOR(WHT)
     A                                  3 37'Belopp'
     A                                      COLOR(WHT)
     A            Å01A           3A  B  4  1
     A  88                                  DSPATR(PR)
     A            Å02A          11Y 3B  4  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03A           9Y 4B  4 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04A           4A  B  4 29
     A  88                                  DSPATR(PR)
     A            Å05A           9Y 0B  4 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å01B           3A  B  5  1
     A  88                                  DSPATR(PR)
     A            Å02B          11Y 3B  5  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03B           9Y 4B  5 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04B           4A  B  5 29
     A  88                                  DSPATR(PR)
     A            Å05B           9Y 0B  5 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å01C           3A  B  6  1
     A  88                                  DSPATR(PR)
     A            Å02C          11Y 3B  6  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03C           9Y 4B  6 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04C           4A  B  6 29
     A  88                                  DSPATR(PR)
     A            Å05C           9Y 0B  6 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å01D           3A  B  7  1
     A  88                                  DSPATR(PR)
     A            Å02D          11Y 3B  7  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03D           9Y 4B  7 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04D           4A  B  7 29
     A  88                                  DSPATR(PR)
     A            Å05D           9Y 0B  7 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å01E           3A  B  8  1
     A  88                                  DSPATR(PR)
     A            Å02E          11Y 3B  8  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03E           9Y 4B  8 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04E           4A  B  8 29
     A  88                                  DSPATR(PR)
     A            Å05E           9Y 0B  8 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å01F           3A  B  9  1
     A  88                                  DSPATR(PR)
     A            Å02F          11Y 3B  9  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03F           9Y 4B  9 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04F           4A  B  9 29
     A  88                                  DSPATR(PR)
     A            Å05F           9Y 0B  9 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å01G           3A  B 10  1
     A  88                                  DSPATR(PR)
     A            Å02G          11Y 3B 10  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03G           9Y 4B 10 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04G           4A  B 10 29
     A  88                                  DSPATR(PR)
     A            Å05G           9Y 0B 10 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å01H           3A  B 11  1
     A  88                                  DSPATR(PR)
     A            Å02H          11Y 3B 11  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03H           9Y 4B 11 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04H           4A  B 11 29
     A  88                                  DSPATR(PR)
     A            Å05H           9Y 0B 11 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å01I           3A  B 12  1
     A  88                                  DSPATR(PR)
     A            Å02I          11Y 3B 12  5EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å03I           9Y 4B 12 18EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å04I           4A  B 12 29
     A  88                                  DSPATR(PR)
     A            Å05I           9Y 0B 12 34EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            Å05S          11Y 0O 14 32EDTCDE(4)
     A                                 16  1'F3=Avsluta'
     A                                      COLOR(BLU)
     A                                 16 14'F4=Sök'
     A                                      COLOR(BLU)
     A                                 16 23'F12=Avbryt'
     A                                      COLOR(BLU)
     A          R SVI004DB
     A                                      ASSUME
     A                                  1  4' '
