     A*%%TS  SD  20131115  121102  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A          R SVI037DA
     A*%%TS  SD  20131115  121102  CB          REL-V7R1M0  5770-WDS
     A                                      WINDOW(*DFT 8 71 *NOMSGLIN)
     A                                      CF03(03 'EXIT')
     A                                      CF12(12 'Cancel')
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      OVRDTA
     A                                      OVRATR
     A                                  1  1'SVI037D'
     A                                      COLOR(BLU)
     A                                  1  9'A'
     A                                      COLOR(BLU)
     A                                  1 21'Lægg till i kunders varuregister'
     A                                      COLOR(WHT)
     A                                  3  1'Ul'
     A                                      COLOR(WHT)
     A                                  3  4'Varukod'
     A                                      COLOR(WHT)
     A                                  3 15'Fm'
     A                                      COLOR(WHT)
     A                                  3 19'Førf'
     A                                      COLOR(WHT)
     A                                  3 24'Søktext'
     A                                      COLOR(WHT)
     A                                  3 60'Kundnummer'
     A                                      COLOR(WHT)
     A            SVIV_ULKD      2A  O  4  1
     A            SVIV_VATA     10A  O  4  4
     A            SVIV_FOKD      3A  O  4 15
     A            SVIV_EUP1      4A  O  4 19
     A            ZVIW_KNSO     35A  B  4 24CHECK(LC)
     A            ZVIW_KNNR      8S 0B  4 62
     A            SVIV_VASL     70A  O  5  1
     A                                  7  1'F3=Avsluta'
     A                                      COLOR(BLU)
     A                                  7 14'F12=Avbryt'
     A                                      COLOR(BLU)
     A*
     A          R SVI037DB
     A*%%TS  SD  20131115  104937  CB          REL-V7R1M0  5770-WDS
     A                                      ASSUME
     A                                  1  4' '
