      *
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXXA* 01 CB  KODE TIL SÆRSKILDA UPPLYSNINGAR
*****A**************************************************************
      *
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPTITLE('ED För Import')
     A                                      HLPPNLGRP(HLPSCR SVI034PNL)
     A                                      ALTHELP
     A                                      HELP
      *
     A          R SVI034DA
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'Sök')
     A                                      CA12(12 'Forrige')
     A                                      OVERLAY
     A          H                           HLPPNLGRP(SVI0340001 SVI034PNL)
     A                                      HLPARA(03 057 03 069)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SVI034'
     A                                      COLOR(BLU)
     A                                  1 16'DB'
     A                                      COLOR(BLU)
     A                                  1 25'Underhåll av Varupost R.44'
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  3  2'Avd/Uppd/Linje:'
     A            XVIVX_SYAV     4Y 0O  3 20EDTCDE(4)
     A                                      COLOR(WHT)
     A            XVIVX_SYOP     7Y 0O  3 25EDTCDE(4)
     A                                      COLOR(WHT)
     A            XVIVX_SYLI     5Y 0O  3 33EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  5  2'Kod '
     A                                      COLOR(WHT)
     A                                  5  8'Text'
     A                                      COLOR(WHT)
     A            XVIVX_SUK1     5A  B  6  2COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT1    70A  B  6  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT2    70A  B  7  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT3    70A  B  8  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT4    70A  B  9  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT5    70A  B 10  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUK6     5A  B 11  2COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT6    70A  B 11  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT7    70A  B 12  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT8    70A  B 13  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUT9    70A  B 14  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUTA    70A  B 15  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUKB     5A  B 16  2COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUTB    70A  B 16  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUTC    70A  B 17  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUTD    70A  B 18  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUTE    70A  B 19  8COLOR(YLW)
     A                                      CHECK(LC)
     A            XVIVX_SUTF    70A  B 20  8COLOR(YLW)
     A                                      CHECK(LC)
     A                                 23  2'F4=Sök'
     A                                      COLOR(BLU)
     A                                 23 11'F12=Avbryt'
     A                                      COLOR(BLU)
      *
     A          R SVI034DØ
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79   O 24  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
