     A          R SVI006FR
     A            SVI006F_A      4S 0       COLHDG('SYSPED Avdeling')
     A            SVI006F_O      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVI006F_K      3          COLHDG('Avgber.avgkod')
     A            SVI006F_B      9S 0       COLHDG('Belopp')
     A          K SVI006F_A
     A          K SVI006F_O
     A          K SVI006F_K
