     A          R SVIFR
     A            SVIF_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            SVIF_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVIF_FATY      4          COLHDG('Fakturatyp')
     A            SVIF_FATX     17          COLHDG('Fakturanummer')
     A            SVIF_VAKD      3          COLHDG('Valutaslag, kod')
     A            SVIF_VAKU      7S 4       COLHDG('Valutaslag, kurs')
     A            SVIF_FABL     11S 3       COLHDG('Fakturabelopp')
     A            SVIF_UNIK      9P 0       COLHDG('RECORDNR')
     A            SVIF_REFF     17          COLHDG('REFERANSE')
     A          K SVIF_REFF
