     A          R SVIHIR
     A            SVIHI_SAV      4S 0       COLHDG('SYSPED Avdeling')
     A            SVIHI_SOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A          K SVIHI_SAV
     A          K SVIHI_SOP
