     A          R SVIHGR
     A            SVIHG_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            SVIHG_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVIHG_DTA    256          COLHDG('EDIFACT Data')
     A          K SVIHG_SYA
     A          K SVIHG_SYO
