     A          R SVIHHR
     A            SVIHH_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            SVIHH_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVIHH_DTH     12          COLHDG('Datum før hændelse')
     A            SVIHH_TMH      6          COLHDG('Tid før hændelse')
     A            SVIHH_SR       1          COLHDG('Send/Receive')
     A            SVIHH_TXH     35          COLHDG('Text, huvud')
     A            SVIHH_TX1     70          COLHDG('Text, detalj-1')
     A            SVIHH_TX2     70          COLHDG('Text, detalj-2')
     A            SVIHH_TX3     70          COLHDG('Text, detalj-3')
     A            SVIHH_TX4     70          COLHDG('Text, detalj-4')
     A            SVIHH_TX5     70          COLHDG('Text, detalj-5')
     A          K SVIHH_SYA
     A          K SVIHH_SYO
