     A          R SVIVXR
     A            SVIVX_SYAV     4S 0       COLHDG('SYSPED Avdeling')
     A            SVIVX_SYOP     7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVIVX_SYLI     5S 0       COLHDG('SYSPED Linjenr')
     A            SVIVX_SUK1     5          COLHDG('Særsk.uppl.kod')
     A            SVIVX_SUK6     5          COLHDG('Særsk.uppl.kod')
     A            SVIVX_SUKB     5          COLHDG('Særsk.uppl.kod')
     A            SVIVX_SUT1    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUT2    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUT3    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUT4    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUT5    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUT6    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUT7    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUT8    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUT9    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUTA    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUTB    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUTC    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUTD    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUTE    70          COLHDG('Særsk.uppl.text')
     A            SVIVX_SUTF    70          COLHDG('Særsk.uppl.text')
     A          K SVIVX_SYAV
     A          K SVIVX_SYOP
     A          K SVIVX_SYLI
