     A          R SVIVR
     A            SVIV_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            SVIV_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVIV_SYLI      5S 0       COLHDG('SYSPED Linjenr')
     A            SVIV_KOTA      5S 0       COLHDG('Kollital')
     A            SVIV_KOT2      5S 0       COLHDG('Kollital')
     A            SVIV_KOT3      5S 0       COLHDG('Kollital')
     A            SVIV_KOT4      5S 0       COLHDG('Kollital')
     A            SVIV_KOT5      5S 0       COLHDG('Kollital')
     A            SVIV_KOSL      4          COLHDG('Kollislag')
     A            SVIV_KOS2      4          COLHDG('Kollislag')
     A            SVIV_KOS3      4          COLHDG('Kollislag')
     A            SVIV_KOS4      4          COLHDG('Kollislag')
     A            SVIV_KOS5      4          COLHDG('Kollislag')
     A            SVIV_GODM     42          COLHDG('Godsmærkning')
     A            SVIV_GOD2     42          COLHDG('Godsmærkning')
     A            SVIV_GOD3     42          COLHDG('Godsmærkning')
     A            SVIV_GOD4     42          COLHDG('Godsmærkning')
     A            SVIV_GOD5     42          COLHDG('Godsmærkning')
     A            SVIV_VASL     70          COLHDG('Varubeskrivning')
     A            SVIV_VAS2     70          COLHDG('Varubeskrivning')
     A            SVIV_VAS3     70          COLHDG('Varubeskrivning')
     A            SVIV_VAS4     70          COLHDG('Varubeskrivning')
     A            SVIV_VANO      5S 0       COLHDG('Varupost nr.')
     A            SVIV_VATA     10          COLHDG('Varukod Taric nr')
     A            SVIV_VATI      4          COLHDG('Varukod 33:3')
     A            SVIV_VAT4      4          COLHDG('Varukod 33:4')
     A            SVIV_VAT5      4          COLHDG('Varukod 33:5')
     A            SVIV_ULKD      2          COLHDG('Ursprungsland, kod')
     A            SVIV_BRUT     14S 3       COLHDG('Bruttovikt')
     A            SVIV_FOKD      3          COLHDG('Førmåner, kod')
     A            SVIV_EUP1      4          COLHDG('EU-Procedurkod')
     A            SVIV_EUP2      3          COLHDG('R37-2')
     A            SVIV_NETO     14S 3       COLHDG('Nettovikt')
     A            SVIV_KVOT      6          COLHDG('Kvoter')
     A            SVIV_KONO      3          COLHDG('Kontigentnummer')
     A            SVIV_ANKV      9S 0       COLHDG('Annan kvantitet')
     A            SVIV_SUKO      5          COLHDG('Særsk.uppl.kod')
     A            SVIV_SUK6      5          COLHDG('Særsk.uppl.kod')
     A            SVIV_SUKB      5          COLHDG('Særsk.uppl.kod')
     A            SVIV_SUTX     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUT2     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUT3     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUT4     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUT5     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUT6     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUT7     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUT8     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUT9     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUTA     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUTB     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUTC     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUTD     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUTE     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUTF     70          COLHDG('Særsk.uppl.text')
     A            SVIV_SUOK     11S 0       COLHDG('Særsk.uppl.ø.kost')
     A            SVIV_SUKR     11S 0       COLHDG('Særsk.uppl.kassa.r')
     A            SVIV_SUAR     11S 0       COLHDG('Særsk.uppl.annan.r')
     A            SVIV_ATIN      3          COLHDG('Åtgærdsindikator')
     A            SVIV_STVA     11S 0       COLHDG('Stat.værde')
     A            SVIV_STVA2    11S 0       COLHDG('Tullværde')
     A            SVIV_FABL     11S 3       COLHDG('Fakturabelopp')
     A            SVIV_BIT1      4          COLHDG('Bil.handl, typ')
     A            SVIV_BIT2      4          COLHDG('Bil.handl, typ')
     A            SVIV_BIT3      4          COLHDG('Bil.handl, typ')
     A            SVIV_BIT4      4          COLHDG('Bil.handl, typ')
     A            SVIV_BIT5      4          COLHDG('Bil.handl, typ')
     A            SVIV_BIT6      4          COLHDG('Bil.handl, typ')
     A            SVIV_BIT7      4          COLHDG('Bil.handl, typ')
     A            SVIV_BIT8      4          COLHDG('Bil.handl, typ')
     A            SVIV_BIT9      4          COLHDG('Bil.handl, typ')
     A            SVIV_BII1     35          COLHDG('Bil.handl, id')
     A            SVIV_BII2     35          COLHDG('Bil.handl, id')
     A            SVIV_BII3     35          COLHDG('Bil.handl, id')
     A            SVIV_BII4     35          COLHDG('Bil.handl, id')
     A            SVIV_BII5     35          COLHDG('Bil.handl, id')
     A            SVIV_BII6     35          COLHDG('Bil.handl, id')
     A            SVIV_BII7     35          COLHDG('Bil.handl, id')
     A            SVIV_BII8     35          COLHDG('Bil.handl, id')
     A            SVIV_BII9     35          COLHDG('Bil.handl, id')
     A            SVIV_CO01     17          COLHDG('Containernummer')
     A            SVIV_CO02     17          COLHDG('Containernummer')
     A            SVIV_CO03     17          COLHDG('Containernummer')
     A            SVIV_CO04     17          COLHDG('Containernummer')
     A            SVIV_CO05     17          COLHDG('Containernummer')
     A            SVIV_CO06     17          COLHDG('Containernummer')
     A            SVIV_CO07     17          COLHDG('Containernummer')
     A            SVIV_CO08     17          COLHDG('Containernummer')
     A            SVIV_CO09     17          COLHDG('Containernummer')
     A            SVIV_CO10     17          COLHDG('Containernummer')
     A            SVIV_CO11     17          COLHDG('Containernummer')
     A            SVIV_CO12     17          COLHDG('Containernummer')
     A            SVIV_CO13     17          COLHDG('Containernummer')
     A            SVIV_CO14     17          COLHDG('Containernummer')
     A            SVIV_CO15     17          COLHDG('Containernummer')
     A            SVIV_CO16     17          COLHDG('Containernummer')
     A            SVIV_CO17     17          COLHDG('Containernummer')
     A            SVIV_CO18     17          COLHDG('Containernummer')
     A            SVIV_CO19     17          COLHDG('Containernummer')
     A            SVIV_CO20     17          COLHDG('Containernummer')
     A            SVIV_TIK1      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIK2      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIK3      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIK4      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIK5      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIK6      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIK7      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIK8      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIK9      1          COLHDG('Tid.handl. kat')
     A            SVIV_TIT1      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIT2      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIT3      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIT4      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIT5      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIT6      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIT7      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIT8      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIT9      3          COLHDG('Tid.handl. typ')
     A            SVIV_TIX1     35          COLHDG('Tid.handl. txt')
     A            SVIV_TIX2     35          COLHDG('Tid.handl. txt')
     A            SVIV_TIX3     35          COLHDG('Tid.handl. txt')
     A            SVIV_TIX4     35          COLHDG('Tid.handl. txt')
     A            SVIV_TIX5     35          COLHDG('Tid.handl. txt')
     A            SVIV_TIX6     35          COLHDG('Tid.handl. txt')
     A            SVIV_TIX7     35          COLHDG('Tid.handl. txt')
     A            SVIV_TIX8     35          COLHDG('Tid.handl. txt')
     A            SVIV_TIX9     35          COLHDG('Tid.handl. txt')
     A            SVIV_LAGI     14          COLHDG('49.Lager ID')
     A            SVIV_LAGT      1          COLHDG('49.Lager Typ')
     A            SVIV_LAGL      2          COLHDG('49.Lager LK')
     A            SVIV_CALL      2          COLHDG('CALL ME')
     A            SVIV_ERR       1          COLHDG('Error flag')
     A          K SVIV_SYAV
     A          K SVIV_SYOP
     A          K SVIV_SYLI
