     A          R SVIXR
     A            SVIX_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            SVIX_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVIX_KOT2      8S 0       COLHDG('Kollital')
     A            SVIX_GOD2     35          COLHDG('Godsmærkning')
     A            SVIX_KOS2      4          COLHDG('Kollislag')
     A            SVIX_VAS2     35          COLHDG('Vareslag')
     A            SVIX_KOT3      8S 0       COLHDG('Kollital')
     A            SVIX_GOD3     35          COLHDG('Godsmærkning')
     A            SVIX_KOS3      4          COLHDG('Kollislag')
     A            SVIX_VAS3     35          COLHDG('Vareslag')
     A            SVIX_KOT4      8S 0       COLHDG('Kollital')
     A            SVIX_GOD4     35          COLHDG('Godsmærkning')
     A            SVIX_KOS4      4          COLHDG('Kollislag')
     A            SVIX_VAS4     35          COLHDG('Vareslag')
     A            SVIX_KOT5      8S 0       COLHDG('Kollital')
     A            SVIX_GOD5     35          COLHDG('Godsmærkning')
     A            SVIX_KOS5      4          COLHDG('Kollislag')
     A            SVIX_VAS5     35          COLHDG('Vareslag')
     A            SVIX_KOT6      8S 0       COLHDG('Kollital')
     A            SVIX_GOD6     35          COLHDG('Godsmærkning')
     A            SVIX_KOS6      4          COLHDG('Kollislag')
     A            SVIX_VAS6     35          COLHDG('Vareslag')
     A            SVIX_KOT7      8S 0       COLHDG('Kollital')
     A            SVIX_GOD7     35          COLHDG('Godsmærkning')
     A            SVIX_KOS7      4          COLHDG('Kollislag')
     A            SVIX_VAS7     35          COLHDG('Vareslag')
     A            SVIX_KOT8      8S 0       COLHDG('Kollital')
     A            SVIX_GOD8     35          COLHDG('Godsmærkning')
     A            SVIX_KOS8      4          COLHDG('Kollislag')
     A            SVIX_VAS8     35          COLHDG('Vareslag')
     A            SVIX_KOT9      8S 0       COLHDG('Kollital')
     A            SVIX_GOD9     35          COLHDG('Godsmærkning')
     A            SVIX_KOS9      4          COLHDG('Kollislag')
     A            SVIX_VAS9     35          COLHDG('Vareslag')
     A            SVIX_SUK1      5          COLHDG('Særsk.uppl.kod')
     A            SVIX_SUK6      5          COLHDG('Særsk.uppl.kod')
     A            SVIX_SUK11     5          COLHDG('Særsk.uppl.kod')
     A            SVIX_SUT1     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT2     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT3     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT4     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT5     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT6     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT7     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT8     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT9     70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT10    70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT11    70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT12    70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT13    70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT14    70          COLHDG('Særsk.uppl.text')
     A            SVIX_SUT15    70          COLHDG('Særsk.uppl.text')
     A          K SVIX_SYAV
     A          K SVIX_SYOP
