     A          R SVIZR
     A            SVIZ_SYAV      4S 0       COLHDG('SYSPED Avdeling')
     A            SVIZ_SYOP      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVIZ_CON2     35          COLHDG('Containernr.')
     A            SVIZ_CON3     35          COLHDG('Containernr.')
     A            SVIZ_CON4     35          COLHDG('Containernr.')
     A            SVIZ_CON5     35          COLHDG('Containernr.')
     A            SVIZ_CON6     35          COLHDG('Containernr.')
     A            SVIZ_CON7     35          COLHDG('Containernr.')
     A            SVIZ_CON8     35          COLHDG('Containernr.')
     A            SVIZ_CON9     35          COLHDG('Containernr.')
     A          K SVIZ_SYAV
     A          K SVIZ_SYOP
