      *_______________________________________
      * SYSPED / Tolldekl. TRANSITT PEKER
      *"""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SVNHPKR
     A            TIAVD          4S 0       COLHDG('AVDELING')
     A            TITDN          7S 0       COLHDG('OPPDRAGSNR')
     A            NICTP         35A         COLHDG('PEKER TIL ATTR.')
     A            NICTNV        15A         COLHDG('NY VERDI')
      *
     A          K TIAVD
     A          K TITDN
