     A          R SVNHER
     A            SVNHE_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            SVNHE_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVNHE_DTA     80          COLHDG('EDIFACT Data')
     A          K SVNHE_SYA
     A          K SVNHE_SYO
