     A          R SVNHHR
     A            SVNHH_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            SVNHH_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVNHH_DTH     12          COLHDG('Datum før hændelse')
     A            SVNHH_TMH      6          COLHDG('Tid før hændelse')
     A            SVNHH_SR       1          COLHDG('Send/Receive')
     A            SVNHH_TXH     35          COLHDG('Text, huvud')
     A            SVNHH_TX1     70          COLHDG('Text, detalj-1')
     A            SVNHH_TX2     70          COLHDG('Text, detalj-2')
     A            SVNHH_TX3     70          COLHDG('Text, detalj-3')
     A            SVNHH_TX4     70          COLHDG('Text, detalj-4')
     A            SVNHH_TX5     70          COLHDG('Text, detalj-5')
     A          K SVNHH_SYA
     A          K SVNHH_SYO
