     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, GODSNR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVNHR                     PFILE(SVNH)
     A          K TIGN
