     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, Regdato
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVNHR                     PFILE(SVNH)
     A                                      TEXT('Regdato')
     A          K TIAVD
     A          K TIDT
