********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10312 * 01 YBC PTF10 LENGDE PÅ EN DEL FELTER
10311 * 02 YBC PTF10 DOKUMENTKODE ER ENDRET FRA 3A TIL 4A
********************************************************************
      *__________________________________________________
      * SYSPED / Tolldekl. TRANSIT Varelinjer DOKUMENT
      *""""""""""""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SVNLDKR
     A            TVAVD     R               REFFLD(AVD)
     A            TVTDN          7S 0       COLHDG('OPPDRAGSNR')
     A            TVLI      R               REFFLD(LI5)
S02  A*           TVDTY          3A         COLHDG('44 DOKUMENTTYPE')
N02  A            TVDTY          4A         COLHDG('44 DOKUMENTTYPE')
     A            TVDREF        35A         COLHDG('44 DOKUMENTREF.')
N01  A            TVDREFL        3S 0       COLHDG('LENGDE PÅ FELT')
     A            TVDSK          2A         COLHDG('44 DOKUMENT SPRÅK')
     A            TVDO          26A         COLHDG('44 UTFYLT OPPLYSN.')
N01  A            TVDOL          3S 0       COLHDG('LENGDE PÅ FELT')
     A            TVDOSK         2A         COLHDG('44 UTF. OPPL.SPRÅK')
      *
S02  A*           NVDTY          3A         COLHDG('44 DOKUMENTTYPE')
N02  A            NVDTY          4A         COLHDG('44 DOKUMENTTYPE')
     A            NVDREF        35A         COLHDG('44 DOKUMENTREF.')
     A            NVDSK          2A         COLHDG('44 DOKUMENT SPRÅK')
     A            NVDO          26A         COLHDG('44 UTFYLT OPPLYSN.')
     A            NVDOSK         2A         COLHDG('44 UTF. OPPL.SPRÅK')
     A          K TVAVD
     A          K TVTDN
     A          K TVLI
