      *_______________________________________
      * SYSPED / Tolldekl. TRANSITT PEKER
      *"""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SVNLKLR
     A            TVAVD          4S 0       COLHDG('AVDELING')
     A            TVTDN          7S 0       COLHDG('OPPDRAGSNR')
     A            TVLI      R               REFFLD(LI5)
     A            TVLI2          3S 0       COLHDG('UNDERLINJENR')
     A            TVNTEH         5S 0       COLHDG('31 ANTALL ENHET')
     A            TVEH           2A         COLHDG('31 PAKKTYPE')
     A            TVNT           5S 0       COLHDG('31 ANTALL KOLLI')
     A            NVEH           2A         COLHDG('31 PAKKTYPE')
     A            NVNT           5S 0       COLHDG('31 ANTALL KOLLI')
     A            NVNTEH         5S 0       COLHDG('31 ANTALL ENHET')
      *
     A          K TVAVD
     A          K TVTDN
     A          K TVLI
     A          K TVLI2
