     A*%%TS  SD  20130308  130740  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'Sök')
     A                                      CA12(12 'Forrige')
     A          R SVT065DA
     A*%%TS  SD  20130308  130740  CB          REL-V7R1M0  5770-WDS
     A                                      INVITE
     A                                      FRCDTA
     A                                      OVERLAY
     A                                  1  2'SYSPED/SVT065'
     A                                      COLOR(BLU)
     A                                  1 16'DA'
     A                                      COLOR(BLU)
     A                                  1 55'TDS Ändra lösenord'
     A                                      COLOR(WHT)
     A                                  1115DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1124TIME
     A                                      COLOR(BLU)
     A                                  4  4'Användaridentitet . . . . . . . :'
     A            WUSER         10A  O  4 41
     A                                  5  6'Nuvarande lösenord. . . . . . :'
     A            ZPWDG         10A  B  5 41DSPATR(ND)
     A                                      CHECK(LC)
     A                                      DSPATR(UL)
     A  31                                  DSPATR(PC)
     A                                  6  6'Nytt lösenord . . . . . . . . :'
     A            ZPWDN         10A  B  6 41DSPATR(ND)
     A                                      CHECK(LC)
     A                                      DSPATR(UL)
     A  32                                  DSPATR(PC)
     A                                  7  8'Nytt lösenord, repetition . :'
     A            ZPWDNR        10A  B  7 41DSPATR(ND)
     A                                      CHECK(LC)
     A                                      DSPATR(UL)
     A  33                                  DSPATR(PC)
     A                                 26  2'F3=Avsluta'
     A                                      COLOR(BLU)
     A                                 26 15'F12=Avbryt'
     A                                      COLOR(BLU)
     A          R SVT065DØ
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79   O 27  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
