     A          R SVTARR
     A            SVTA_IE        1          COLHDG('IMPORT/EXPORT')
     A            SVTA_VATA     10          COLHDG('VARUKOD Taric nr')
     A            SVTA_MTI       6          COLHDG('MEAS_TYP_ID')
     A            SVTA_RG        4          COLHDG('REGION/LAND')
     A            SVTA_ACT       1          COLHDG('ADD_COD_TYP_ID')
     A            SVTA_AC        3          COLHDG('ADD_COD')
     A            SVTA_ON        6          COLHDG('ORD_NUMB')
     A            SVTA_TCC       1          COLHDG('TOB_CROP_COD')
     A            SVTA_DTS       8S 0       COLHDG('DATO START')
     A            SVTA_SEKV      3S 0       COLHDG('SEKVENSNR')
     A            SVTA_BESL      1S 0       COLHDG('BESLUTAD')
     A            SVTA_DTE       8S 0       COLHDG('DATO END')
     A            SVTA_RGID      8          COLHDG('REG_ID')
     A            SVTA_OJI       5          COLHDG('OFF_JOURN_ID')
     A            SVTA_OJP       4          COLHDG('OFF_JOURN_PAGE')
     A            SVTA_JRI       8          COLHDG('JUST_REG_ID')
     A            SVTA_DTQ       8          COLHDG('DATE_QUOTA')
     A            SVTA_TKD       2          COLHDG('TOLLKODE')
     A            SVTA_SAT      10S 3       COLHDG('TOLLSATS')
     A            SVTA_VAL       3          COLHDG('VALUTA')
     A            SVTA_MUC       3          COLHDG('MEAS_UNIT_COD')
     A            SVTA_MUQ       1          COLHDG('MEAS_UNIT_QUAL_COD')
     A            SVTA_VILK      1S 0       COLHDG('VILLKORSBEROENE')
     A            SVTA_CTC       2          COLHDG('COND_TYP_COD')
     A            SVTA_SN        3          COLHDG('SEQ_NUMB')
     A            SVTA_CAMO     10S 3       COLHDG('COND_AMO')
     A            SVTA_CVAL      3          COLHDG('COND_VALUTA')
     A            SVTA_CMU       3          COLHDG('COND_MEAS_UNIT')
     A            SVTA_CMUC      1          COLHDG('COND_MEAS_UNIT_QUAL')
     A            SVTA_ACTC      3          COLHDG('ACT_COD')
     A            SVTA_CTCI      1          COLHDG('CERT_TYP_COD_ID')
     A            SVTA_CRI       3          COLHDG('CERT_REF_ID')
     A            SVTA_RGEX      4          COLHDG('GEO_AREA_ID_EXCL')
     A            SVTA_FTI       3          COLHDG('FOOTN_TYP_ID')
     A            SVTA_FI        5          COLHDG('FOOTN_ID')
     A            SVTA_SDTS      8S 0       COLHDG('TILFARLIGT STOPP')
     A            SVTA_SDTE      8S 0       COLHDG('SLUTT PÅ STOPP')
