     A          R SVTFIR
     A            SVTF_SIGM      1          COLHDG('Sigilleringsmetod')
      *                                             M=Manuell  I=Inbyggd
     A            SVTF_0004     35          COLHDG('UNB Avsændarid')
     A            SVTF_0008     14          COLHDG('UNB Avs.Vidareadress')
     A            SVTF_0010     35          COLHDG('UNB Mottagarid')
     A            SVTF_0014     14          COLHDG('UNB Mot.Vidareadress')
     A            SVTF_0022     14          COLHDG('UNB Løsenord')
     A            SVTF_0035      1          COLHDG('Testindikator')
      *                                             1=Test  blank=Produktion
     A            SVTF_PREF      3A         COLHDG('Prefix')
     A            SVTF_NUMB      6S 0       COLHDG('Sist anv.nr')
     A            SVTF_KVAL      1          COLHDG('Kvalitetssækrad')
      *                                             J=ja blank/N=Nej
     A            SVTF_SEC1     17          COLHDG('Sec Partyid, eget')
     A            SVTF_SEC2     17          COLHDG('Sec Partyid, Tullv')
     A            SVTF_CER1     35          COLHDG('Crf Serienr, eget')
     A            SVTF_CER2     35          COLHDG('Crf Keyid, eget')
     A            SVTF_CER3     35          COLHDG('Crf Serienr, Tullv')
     A            SVTF_CER4     35          COLHDG('Crf Keyid, Tullv')
      *                                             J=ja blank/N=Nej
     A            SVTF_USRI      8          COLHDG('SMS Snd Userid')
     A            SVTF_USRA      8          COLHDG('SMS Snd Address')
