     A          R SVTHAR
     A            SVTH_SYSG      3          COLHDG('Handlæggarens sign')
     A            SVTH_NAMN     35          COLHDG('Handlæggarens namn')
     A            SVTH_USID     10          COLHDG('OS/400 Userid')
     A            SVTH_ANN       5          COLHDG('I/E Anstællningsnr')
     A            SVTH_ANNN      5          COLHDG('NCTS Anstællningsnr')
     A            SVTH_SMS      17          COLHDG('PKI Mobilnummer SMS')
     A            SVTH_PWD      10          COLHDG('Løsenord')
     A            SVTH_PWDD      8S 0       COLHDG('Løsenord Datum')
     A            SVTH_LOCK      1          COLHDG('X=LÅST')
     A            SVTH_TLF      17          COLHDG('Handlæggare telefon')
     A          K SVTH_SYSG
