     A          R SVTKSR
     A            SVKS_IE        1A         COLHDG('IMPORT/EXPORT')
     A            SVKS_KS        4A         COLHDG('KOLLISLAG')
     A            SVKS_TX      100A         COLHDG('BESKRIVNING')
     A          K SVKS_IE
     A          K SVKS_KS
