     A          R SVTKDR
     A            SVKD_IE        1A         COLHDG('IMPORT/EXPORT')
     A            SVKD_TYP       3A         COLHDG('KODE TYPE')
     A            SVKD_KD       10A         COLHDG('KODE')
     A            SVKD_DTS       8S 0       COLHDG('DATO START')
     A            SVKD_DTE       8S 0       COLHDG('DATO END')
     A            SVKD_KBE      20A         COLHDG('KORTBESKRIVELSE')
     A            SVKD_KBS      20A         COLHDG('KORTBESKRIVELSE')
     A            SVKD_LBE     100A         COLHDG('LANGBESKRIVELSE')
     A            SVKD_LBS     100A         COLHDG('LANGBESKRIVELSE')
     A          K SVKD_IE
     A          K SVKD_TYP
     A          K SVKD_KD
     A          K SVKD_DTS
