     A          R SVTLVR
     A            SVLV_KD        3A         COLHDG('Leveransvillkår')
     A            SVLV_TR        1A         COLHDG('Transport S')
     A            SVLV_TR2       1A         COLHDG('Transport T')
     A            SVLV_FS        1A         COLHDG('Försäkring S')
     A            SVLV_FSP       5S 3       COLHDG('Försäkring S %')
     A            SVLV_FS2       1A         COLHDG('Försäkring T')
     A            SVLV_FS2P      5S 3       COLHDG('Försäkring T %')
     A            SVLV_OK        1A         COLHDG('Övriga_kostnader')
     A            SVLV_KR        1A         COLHDG('Kassarabatt')
     A            SVLV_AR        1A         COLHDG('Annan_Rabatt')
     A          K SVLV_KD
