     A          R SVTPROR
     A            SVPR_IE        1A         COLHDG('IMPORT/EXPORT')
     A            SVPR_PR        4A         COLHDG('PROCEDUR')
     A            SVPR_TX1     100A         COLHDG('BESKRIVNING')
     A            SVPR_TX2     100A         COLHDG('BESKRIVNING')
     A            SVPR_TX3     100A         COLHDG('BESKRIVNING')
     A            SVPR_TX4     100A         COLHDG('BESKRIVNING')
     A            SVPR_TX5     100A         COLHDG('BESKRIVNING')
     A          K SVPR_IE
     A          K SVPR_PR
