     A          R SVTVKR
     A            SVVK_KD        3A         COLHDG('VALUTAKODE')
     A            SVVK_DTS       8S 0       COLHDG('DATO START')
     A            SVVK_DTE       8S 0       COLHDG('DATO END')
     A            SVVK_OMR       7S 0       COLHDG('OMREGNINGSFAKTOR')
     A            SVVK_KRS      10S 6       COLHDG('KURS')
     A          K SVVK_KD
     A          K SVVK_DTS
