     A          R SVTVSR
     A            SVVS_VATA     10          COLHDG('VARUKOD Taric nr')
     A            SVVS_DTS       8S 0       COLHDG('DATO START')
     A            SVVS_DTE       8S 0       COLHDG('DATO END')
     A            SVVS_TXTK     50          COLHDG('SØKING')
     A            SVVS_TXTS    200          COLHDG('SVENSK BESKRIVELSE')
     A            SVVS_TXTE    200          COLHDG('ENGELSK BESKRIVELSE')
     A            SVVS_VATAK     4          COLHDG('KAPITEL')
     A          K SVVS_VATA
