     A          R SVTVKTR
     A            SVVKT_KD       3A         COLHDG('VALUTAKODE')
     A            SVVKT_TX      30          COLHDG('TEXT')
     A          K SVVKT_KD
