     A          R SVTVSR                    PFILE(SVTVS)
     A          K SVVS_VATAK
     A          K SVVS_TXTK
     A          O SVVS_VATAK                VALUES('0000')
