     A          R SVTX19R
      * meursingAdditionalCode
     A            SVTX19_01      3          COLHDG('additionalCodeId')
     A            SVTX19_02      6          COLHDG('SID')
     A            SVTX19_03     10          COLHDG('dateEnd')
     A            SVTX19_04     10          COLHDG('dateStart')
      * meursingTableCellComponent
     A            SVTX19_11A     3          COLHDG('headingNumber')
     A            SVTX19_12A     2          COLHDG('meursingTablePlanId')
     A            SVTX19_13A     1          COLHDG('rowColumnCode')
     A            SVTX19_14A     4          COLHDG('subheadingSequenceN')
      *                                             subheadingSequenceNumber
     A            SVTX19_15A    10          COLHDG('dateEnd')
     A            SVTX19_16A    10          COLHDG('dateStart')
     A            SVTX19_11B     3          COLHDG('headingNumber')
     A            SVTX19_12B     2          COLHDG('meursingTablePlanId')
     A            SVTX19_13B     1          COLHDG('rowColumnCode')
     A            SVTX19_14B     4          COLHDG('subheadingSequenceN')
      *                                             subheadingSequenceNumber
     A            SVTX19_15B    10          COLHDG('dateEnd')
     A            SVTX19_16B    10          COLHDG('dateStart')
     A            SVTX19_11C     3          COLHDG('headingNumber')
     A            SVTX19_12C     2          COLHDG('meursingTablePlanId')
     A            SVTX19_13C     1          COLHDG('rowColumnCode')
     A            SVTX19_14C     4          COLHDG('subheadingSequenceN')
      *                                             subheadingSequenceNumber
     A            SVTX19_15C    10          COLHDG('dateEnd')
     A            SVTX19_16C    10          COLHDG('dateStart')
     A            SVTX19_11D     3          COLHDG('headingNumber')
     A            SVTX19_12D     2          COLHDG('meursingTablePlanId')
     A            SVTX19_13D     1          COLHDG('rowColumnCode')
     A            SVTX19_14D     4          COLHDG('subheadingSequenceN')
      *                                             subheadingSequenceNumber
     A            SVTX19_15D    10          COLHDG('dateEnd')
     A            SVTX19_16D    10          COLHDG('dateStart')
