     A          R SVTX06R
      * <exportRefundNomenclature
     A            SVTX06_01      1          COLHDG('additionalCodeType')
     A            SVTX06_02     10          COLHDG('goodsNomenclatureC')
      *                                             goodsNomenclatureCode
     A            SVTX06_03      6          COLHDG('SIDGoodsNomenclature')
     A            SVTX06_05      2          COLHDG('productLineSuffix')
     A            SVTX06_06      3          COLHDG('exportRefundCode')
     A            SVTX06_07      6          COLHDG('SID')
     A            SVTX06_31    256          COLHDG('description')
     A            SVTX06_08     10          COLHDG('dateEnd')
     A            SVTX06_09     10          COLHDG('dateStart')
     A            SVTX06_12      2          COLHDG('quantityIndents')
      * <exportRefundNomenclatureFootnoteAssociation
     A            SVTX06_41A     3          COLHDG('footnoteId-1')
     A            SVTX06_42A     2          COLHDG('footnoteType-1')
     A            SVTX06_41B     3          COLHDG('footnoteId-2')
     A            SVTX06_42B     2          COLHDG('footnoteType-2')
     A            SVTX06_41C     3          COLHDG('footnoteId-3')
     A            SVTX06_42C     2          COLHDG('footnoteType-3')
     A            SVTX06_41D     3          COLHDG('footnoteId-4')
     A            SVTX06_42D     2          COLHDG('footnoteType-4')
     A            SVTX06_41E     3          COLHDG('footnoteId-5')
     A            SVTX06_42E     2          COLHDG('footnoteType-5')
