     A          R SVTX20R
      * meursingHeading
     A            SVTX20_01      3          COLHDG('headingNumber')
     A            SVTX20_02      2          COLHDG('meursingTablePlanId')
     A            SVTX20_03      1          COLHDG('rowColumnCode')
     A            SVTX20_21    128          COLHDG('description')
     A            SVTX20_05     10          COLHDG('dateEnd')
     A            SVTX20_06     10          COLHDG('dateStart')
      * meursingHeadingFootnoteAssociation
     A            SVTX20_11      3          COLHDG('footnoteId')
     A            SVTX20_12      2          COLHDG('footnoteType')
     A            SVTX20_13     10          COLHDG('dateEnd')
     A            SVTX20_14     10          COLHDG('dateStart')
