     A          R SVTX08R
     A            SVTX08_01      4          COLHDG('geographicalAreaId')
     A            SVTX08_02    256          COLHDG('description')
     A            SVTX08_03      6          COLHDG('SID')
     A            SVTX08_04     10          COLHDG('dateEnd')
     A            SVTX08_05     10          COLHDG('dateStart')
     A          K SVTX08_03
