     A          R SVTX17R
     A            SVTX17_01      4          COLHDG('measurementUnitCode')
     A            SVTX17_03     64          COLHDG('description')
     A            SVTX17_04     10          COLHDG('dateEnd')
     A            SVTX17_05     10          COLHDG('dateStart')
     A          K SVTX17_01
