     A          R SVTX18R
     A            SVTX18_01      1          COLHDG('measurementUnitQuali')
      *                                             measurementUnitQualifierCode
     A            SVTX18_02      4          COLHDG('measurementUnitCode')
     A            SVTX18_04     10          COLHDG('dateEnd')
     A            SVTX18_05     10          COLHDG('dateStart')
     A          K SVTX18_01
