     A          R SVTX082R
     A            SVTX082_01     4          COLHDG('geographicalAreaId')
     A            SVTX082_02     4          COLHDG('group')
     A            SVTX082_03     6          COLHDG('SIDgeographicalAreaG')
     A            SVTX082_04    10          COLHDG('dateEnd')
     A            SVTX082_05    10          COLHDG('dateStart')
     A          K SVTX082_01
     A          K SVTX082_02
