     A          R SVTX11R
     A            SVTX11_01     10          COLHDG('interpolate')
     A            SVTX11_02      9          COLHDG('maxInterval')
     A            SVTX11_03      1          COLHDG('minInterval')
     A            SVTX11_04      6          COLHDG('SID')
     A            SVTX11_05     10          COLHDG('dateEnd')
     A            SVTX11_06     10          COLHDG('dateStart')
     A            SVTX11_07      5          COLHDG('tableId')
     A            SVTX11_08      1          COLHDG('changeType')
     A            SVTX11_09    256          COLHDG('description-1')
     A            SVTX11_10      2          COLHDG('languageId-1')
     A            SVTX11_11    256          COLHDG('description-2')
     A            SVTX11_12      2          COLHDG('languageId-2')
     A            SVTX11_13A     9          COLHDG('threshold-1')
     A            SVTX11_14A     9          COLHDG('value-1')
     A            SVTX11_13B     9          COLHDG('threshold-2')
     A            SVTX11_14B     9          COLHDG('value-2')
     A            SVTX11_13C     9          COLHDG('threshold-3')
     A            SVTX11_14C     9          COLHDG('value-3')
     A            SVTX11_13D     9          COLHDG('threshold-4')
     A            SVTX11_14D     9          COLHDG('value-4')
     A            SVTX11_13E     9          COLHDG('threshold-5')
     A            SVTX11_14E     9          COLHDG('value-5')
     A            SVTX11_13F     9          COLHDG('threshold-6')
     A            SVTX11_14F     9          COLHDG('value-6')
     A            SVTX11_13G     9          COLHDG('threshold-7')
     A            SVTX11_14G     9          COLHDG('value-7')
     A            SVTX11_13H     9          COLHDG('threshold-8')
     A            SVTX11_14H     9          COLHDG('value-8')
     A            SVTX11_13I     9          COLHDG('threshold-9')
     A            SVTX11_14I     9          COLHDG('value-9')
