     A          R SVTX03R
     A            SVTX03_01      1          COLHDG('exportImportType')
     A            SVTX03_02      3          COLHDG('codeTypeId')
     A            SVTX03_03     10          COLHDG('id')
     A            SVTX03_04    256          COLHDG('description-1')
     A            SVTX03_05     10          COLHDG('dateEnd')
     A            SVTX03_06     10          COLHDG('dateStart')
     A          K SVTX03_01
     A          K SVTX03_02
     A          K SVTX03_03
