     A          R SVTX23R
     A            SVTX23_01      3          COLHDG('monetaryUnitCode')
     A            SVTX23_02      6          COLHDG('SID')
     A            SVTX23_03     10          COLHDG('dateEnd')
     A            SVTX23_04     10          COLHDG('dateStart')
     A            SVTX23_05      1          COLHDG('national')
     A            SVTX23_06      1          COLHDG('changeType')
