     A          R SVTX31R
     A            SVTX31_01      3          COLHDG('taxCode')
     A            SVTX31_02    256          COLHDG('description')
     A            SVTX31_03     10          COLHDG('dateEnd')
     A            SVTX31_04     10          COLHDG('dateStart')
     A            SVTX31_05      6          COLHDG('SID')
     A          K SVTX31_01
