     A          R SVTX02R
     A            SVTX02_01      1          COLHDG('certificateType')
     A            SVTX02_02      3          COLHDG('certificateCode')
     A            SVTX02_03    256          COLHDG('description')
     A            SVTX02_04     10          COLHDG('dateEnd')
     A            SVTX02_05     10          COLHDG('dateStart')
     A          K SVTX02_01
     A          K SVTX02_02
