     A          R SVTX24R
     A            SVTX24_01      3          COLHDG('prefCode')
     A            SVTX24_02    128          COLHDG('description-1')
     A            SVTX24_03     10          COLHDG('dateEnd')
     A            SVTX24_04     10          COLHDG('dateStart')
     A          K SVTX24_01
