     A          R SVTX23R2
     A            SVTX232_01     3          COLHDG('monetaryUnitCode-H')
     A            SVTX232_02     3          COLHDG('monetaryUnitCode-S')
     A            SVTX232_03     5S 4       COLHDG('monetaryConversionRa')
      *                                             monetaryConversionRate=
     A            SVTX232_04     1          COLHDG('national')
     A          K SVTX232_02
