     A          R SVTX13R
     A            SVTX13_01      1          COLHDG('conditionCode')
     A            SVTX13_11    256          COLHDG('description')
     A            SVTX13_03     10          COLHDG('dateEnd')
     A            SVTX13_04     10          COLHDG('dateStart')
