     A          R SVTX21R
     A            SVTX21_02      3          COLHDG('headingNumber')
     A            SVTX21_03      2          COLHDG('meursingTablePlanId')
     A            SVTX21_04      1          COLHDG('rowColumnCode')
     A            SVTX21_05      4          COLHDG('subheadingSequenceNu')
      *                                             subheadingSequenceNumber
     A            SVTX21_01    128          COLHDG('description')
     A            SVTX21_07     10          COLHDG('dateEnd')
     A            SVTX21_08     10          COLHDG('dateStart')
