     A          R SVTX01R
     A            SVTX01_01      1          COLHDG('additionalCodeType')
     A            SVTX01_02      3          COLHDG('additionalCodeId')
     A            SVTX01_03    256          COLHDG('description')
     A            SVTX01_04      6          COLHDG('SID')
     A            SVTX01_05     10          COLHDG('dateEnd')
     A            SVTX01_06     10          COLHDG('dateStart')
     A          K SVTX01_01
     A          K SVTX01_02
