     A          R SVTX12R
     A            SVTX12_01      3          COLHDG('actionCode')
     A            SVTX12_03    128          COLHDG('description')
     A            SVTX12_04     10          COLHDG('dateEnd')
     A            SVTX12_05     10          COLHDG('dateStart')
