     A          R SVTX16R
      * measurementUnitQualifier
     A            SVTX16_02      1          COLHDG('measurementUnitQuali')
      *                                           measurementUnitQualifierCode
     A            SVTX16_11    256          COLHDG('description')
     A            SVTX16_03     10          COLHDG('dateEnd')
     A            SVTX16_04     10          COLHDG('dateStart')
