     A          R SVTX07R
      * footnote
     A            SVTX07_01      3          COLHDG('footnoteId')
     A            SVTX07_02      2          COLHDG('footnoteType')
     A            SVTX07_21    512          COLHDG('description')
     A            SVTX07_04     10          COLHDG('dateEnd')
     A            SVTX07_05     10          COLHDG('dateStart')
