     A          R SVTX04R
     A            SVTX04_01      1          COLHDG('type')
     A            SVTX04_02     10          COLHDG('goodsNomenclatureCod')
      *                                             goodsNomenclatureCode
     A            SVTX04_03     10          COLHDG('dateEnd')
     A            SVTX04_04     10          COLHDG('dateStart')
     A          K SVTX04_02
