********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11133 * 01 YBC PTF11 VEKT ER ENDRET FRA 9.1 TIL 11.3
********************************************************************
      *_________________________________
      * FØLGESEDDEL
      *"""""""""""""""""""""""""""""""""
     A          R SVX027PF1
     A            PFFM1         75      1  2
     A            THTINS        17      4 40
     A            THNAS         30      5 15
     A            THDK           5      5 79
     A            THADS1        30      6 15
     A            THOMD          1  0   6 91EDTCDE(Z)
     A            THPNS          9      7 15
     A                                  7 67'---'
     A                                  7 72'---'
     A                                  7 79'1'
     A            THPSS         24      8 15
     A            THLKS          2      8 54
     A            THVPOS         5  0   9 67EDTCDE(Z)
     A            THNTK          7  0   9 77EDTCDE(Z)
     A            THTINK        17     10 15
     A            THNAK         30     11 15
     A            THTSSD         8     11 69
     A            THTSLK         2     11109
     A            THADK1        30     12 15
     A            THTSN1        35     12 69
     A            THPNK          9     13 15
     A            THTSN2        35     13 69
     A            THPSK         24     14 15
     A            THLKK          2     14 54
     A            THTSPN         9     14 69
     A            THTSPS        24     14 84
     A            XXALKT        17     17 74
     A            XXBLKT        17     19 96
     A            THTAID        27     21 15
     A            THTALK         2     21 57
      *
     A          R SVX027PF2
     A                                 29 74'--'
     A                                 29 82'----.--'
     A                                 29 96'--'
     A            TVMN          17     30 15
     A            TVCNR         17     30 42
     A            TVNT           5  0  31 15EDTCDE(Z)
     A            TVEH           2     31 24
     A                                 31 27'/'
     A            XVEHT         35     31 29
S01  A*           TVVKTB         9  1  31 97EDTCDE(4)
N01  A            TVVKTB        11  3  31 97EDTCDE(4)
     A            TVVT          48     32 15
S01  A*           TVVKTN         9  1  33 97EDTCDE(4)
N01  A            TVVKTN        11  3  33 97EDTCDE(4)
     A            TVTDT          6     35 79
     A            TVTDR         20     35 90
     A            TVDO          26     37 15
     A            X2DTY         28     38 15
     A            TVDREF        20     38 59
     A            X2TLO         35     39 15
     A            TVMTXT        48     40 15
      *
     A          R SVX027PF3
     A                                 31 22'SEE LIST OF ITEMS'
S01  A*           THVKB          9  1  31 97EDTCDE(4)
N01  A            THVKB         11  3  31 97EDTCDE(4)
      *
     A          R SVX027PF4
     A            THTINA        17     52 39
     A                                 52 86'______________________________'
     A                                 52116'_____'
     A            THNAA         30     53 15
     A                                 53 86'| '
     A                                 53 88'SE'
     A                                 53 93'|'
     A            THCATS         8     53 97
     A                                 53120'|'
     A            THADA1        30     54 15
     A                                 54 86'|-----------------------------'
     A                                 54116'----|'
     A*           THPNA          9     55 15
     A            XHADA3        40     55 15
     A                                 55 86'|'
     A            XNPNR          5  0  55 88EDTCDE(Z)
     A                                 55100'|'
     A            THTRDT         8  0  55102EDTWRD('    .  .  ')
     A                                 55120'|'
     A                                 56 51'FRITATT FOR UNDERSKRIFT'
     A                                 56 86'|'
     A                                 56 86'|-----------------------------'
     A                                 56116'----|'
     A            THLKA          2     57 15
     A            THDST         15     57 20
     A            XIDAG          8  0  57 42EDTWRD('    .  .  ')
     A                                 57 86'|'
     A            XHCNA         17     57 88
     A                                 57105'|'
     A                                 57120'|'
      *
     A          R SVX027PF5                 FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XKTXT1        25     58 12
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XKTXT2        25     58 32
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XKTXT3        25     58 52
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XKTXT4        25     58 72
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XKTXT5        25     58 92
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XKTXT6        25     58102
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XHTSD1         2     59 12
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XHTSD2         2     59 32
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XHTSD3         2     59 52
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XHTSD4         2     59 72
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XHTSD5         2     59 92
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
     A            XHTSD6         2     59102
     A                                      FNTCHRSET(C0H20060 +
     A                                      T1V10277)
      *
     A          R SVX027PF6
     A            THGFT1        24     60 13
     A            XHGBGI         2     60 75
     A            THGBGU         2     61 15
     A            XHGBGU        30     61 19
     A            THGKD          1  0  61 82
     A            XKTXTB        25     61 86
     A            XXTSB          2     61114
     A            PFFM2         75     69  2
