********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11133 * 01 YBC PTF11 VEKT ER ENDRET FRA 9.1 TIL 11.3
********************************************************************
      *_________________________________
      * LASTELISTE
      *"""""""""""""""""""""""""""""""""
     A          R SVX027PL1
     A            PLFM1         75      1  2
     A  27                              4 52'L A S T E L I S T E'
     A  27                              5 73'------------------------'
     A  27                              5 97'------------------------'
     A  27                              6 73'|'
     A                                  6 75'LISTE NR.   1'
     A            THDK           5      6115HIGHLIGHT
     A            THNAK         30      7 36
     A  27                              7 73'|'
     A            THADK1        30      8 36
     A  27                              8 73'|'
     A  27                              9 73'------------------------'
     A  27                              9 97'------------------------'
     A            THPNK          9     10 36
     A            THPSK         24     10 46
     A  27                             10 73'|'
     A  27                             11 73'|'
     A  27                             12 73'|'
     A  27                             13 73'|'
     A  27                             14 73'|'
     A  27                             15 73'|'
     A  27                             16 73'|'
     A  27                             17 73'|'
     A  27                             18  1'------------------------'
     A  27                             18 25'------------------------'
     A  27                             18 49'------------------------'
     A  27                             18 73'------------------------'
     A  27                             18 97'------------------------'
     A  27                             19  5'VAREPOST'
     A  27                             19 16'|'
     A  27                             19 73'|'
     A  27                             19 75'AVS/UTF.'
     A  27                             19 83'|'
     A  27                             19 85'BRUTTOVEKT'
     A  27                             19 96'|'
     A  27                             20  5'   NR   '
     A  27                             20 16'|'
     A  27                             20 22'MERKER, NR, ANTALL KOLLI'
     A  27                             20 47'OG SLAG; VAREBESKRIVELSE'
     A  27                             20 73'|'
     A  27                             20 75'  LAND  '
     A  27                             20 83'|'
     A  27                             20 85'   (KG)   '
     A  27                             20 96'|'
     A  27                             20100'FOR TOLLVESENET'
     A  27                             21  1'------------------------'
     A  27                             21 25'------------------------'
     A  27                             21 49'------------------------'
     A  27                             21 73'------------------------'
     A  27                             21 97'------------------------'
     A N27                             21  2' '
      *
     A          R SVX027PL2                   SPACEB(1)
     A            XLNR           3  0      8EDTCDE(Z)
     A  27                                16'|'
     A            TVMN          17        18
     A            TVNT           5  0     35EDTCDE(Z)
     A            TVVT30        30        41
     A  27                                73'|'
     A                                    78'SE'
     A  27                                83'|'
S01  A*           TVVKTB         9  1     85EDTCDE(4)
N01  A            TVVKTB        11  3     84EDTCDE(4)
     A  27                                96'|'
     A            TVDREF        20        98
      *
     A          R SVX027PL3                   SPACEB(1)
     A  27                                16'|'
     A  27                                73'|'
     A  27                                83'|'
     A  27                                96'|'
      *
     A          R SVX027PL4
     A  27                             60  1'------------------------'
     A  27                             60 25'------------------------'
     A  27                             60 49'------------------------'
     A  27                             60 73'------------------------'
     A  27                             60 97'------------------------'
     A  27                             61  9'RG-199'
     A            THTARF        16A    62100
     A  27                             62 97'........................'
     A  27                             63 97'     (UNDERSKRIFT)      '
     A            PLFM2         75     64  2
