     A          R SVXERRR
     A            TEST           1A         COLHDG('STATUS')
     A            TEMF           3A         COLHDG('MELDINGSFUNKSJON')
     A            TETRNR        18A         COLHDG('TRANSITTERINGSNR')
     A            TELIBR        10A         COLHDG('BIBLIOTEKNAVN')
     A            TEFILE        10A         COLHDG('FILNAVN')
     A            TEMEMB        10A         COLHDG('KOMPONENTNAVN')
     A          K TEST
     A          K TETRNR
