      *______________________________________
      * SYSPED / Tolldekl. TRANSITT GARANTINR
      *""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SVXHGNR
     A            TGAVD          4S 0       COLHDG('AVDELING')
     A            TGTDN          7S 0       COLHDG('OPPDRAGSNR')
     A            TGGFT1        24A         COLHDG('GARANTI')
     A            TGGADK         4A         COLHDG('ADGANGSKODE')
     A            TGGBGI         1S 0       COLHDG('BEGRENSNING INNEN EF')
     A            TGGBGU         2A         COLHDG('BEGRENSNING UTENFOR')
     A            TGGBL         11S 0       COLHDG('GARATIBELØP')
     A            TGGVK          3A         COLHDG('VALUTA')
      *
     A          K TGAVD
     A          K TGTDN
