     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, Regdato
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVXHR                     PFILE(SVXH)
     A                                      TEXT('Regdato')
     A          K THAVD
     A          K THDT
