     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, TRANSITTERINGSNR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R SVXHR                     PFILE(SVXH)
     A          K THTRNR
