      *__________________________________
      * SYSPED / Tolldekl. TRANSITT (KANSELLEIRNG)
      *""""""""""""""""""""""""""""""""""
     A          R SVXHFRR
     A            TFAVD          4S 0       COLHDG('AVDELING')
     A            TFTDN          7S 0       COLHDG('TOLLDEK.NR')
     A            TFDT           8S 0       COLHDG('KANSELLERINGSDATO')
     A            TFKODE         1S 0       COLHDG('KODE FOR FRIGIVELSE')
      *           0=NEI, 1=JA
     A            TFDTA          8S 0       COLHDG('KANSELLERINGSDATO')
     A            TFFT1A        70A         COLHDG('GRUNNLAG 1')
     A            TFFT2A        70A         COLHDG('GRUNNLAG 2')
     A            TFFT3A        70A         COLHDG('GRUNNLAG 3')
     A            TFFT4A        70A         COLHDG('GRUNNLAG 4')
     A            TFFT5A        70A         COLHDG('GRUNNLAG 5')
      *
     A          K TFAVD
     A          K TFTDN
