      *______________________________________
      * SYSPED / Tolldekl. TRANSIT LASTELISTE
      *""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SVXHLR
     A            TLAVD     R               REFFLD(AVD)
     A            TLTDN          7S 0       COLHDG('OPPDRAGSNR')
     A            TLAVD2    R               REFFLD(AVD)
     A                                      COLHDG('AVD. FOR HENTET OPD')
     A            TLTDN2         7S 0       COLHDG('OPPDRAGSNR')
     A            TLTXT         50          COLHDG('FRITEKST')
     A            TLTLKU         1          COLHDG('KUN UTFØRSEL')
     A          K TLAVD
     A          K TLTDN
