      *_______________________________________________
      * SYSPED / Tolldekl. TRANSITT GARANTI BEGRENSING
      *"""""""""""""""""""""""""""""""""""""""""""""""
     A          R SVXHGBR
     A            TGAVD          4S 0       COLHDG('AVDELING')
     A            TGTDN          7S 0       COLHDG('OPPDRAGSNR')
     A            TGGBGU         2A         COLHDG('BEGRENSNING UTENFOR')
      *
     A          K TGAVD
     A          K TGTDN
