     A          R SVXHHR
     A            SVXHH_SYA      4S 0       COLHDG('SYSPED Avdeling')
     A            SVXHH_SYO      7S 0       COLHDG('SYSPED Oppdragsnr')
     A            SVXHH_DTH     12          COLHDG('Datum før hændelse')
     A            SVXHH_TMH      6          COLHDG('Tid før hændelse')
     A            SVXHH_SR       1          COLHDG('Send/Receive')
     A            SVXHH_TXH     35          COLHDG('Text, huvud')
     A            SVXHH_TX1     70          COLHDG('Text, detalj-1')
     A            SVXHH_TX2     70          COLHDG('Text, detalj-2')
     A            SVXHH_TX3     70          COLHDG('Text, detalj-3')
     A            SVXHH_TX4     70          COLHDG('Text, detalj-4')
     A            SVXHH_TX5     70          COLHDG('Text, detalj-5')
     A          K SVXHH_SYA
     A          K SVXHH_SYO
