      * MÅ KOMPILERES MED FØLGENDE:
      * CRTPRTF FILE(SYENDPTF/SVZ004P) SRCFILE(SYENDPTF/QDDSSRC) +
      * DEVTYPE(*AFPDS) PAGESIZE(140 160) LPI(12) CPI(20) OVRFLW(140) +
      * FRONTOVL(SYENDPTF/SEEADV)
     A                                      REF(SVZH)
     A          R A
     A            SVZH_MRNN R          12113BARCODE(CODE128 6 *HRI *HRZ +
     A                                      (*WIDTH 0.009) (*RATIO 2.5) X'02')
     A          R B                         FONT(755 (*POINTSIZE 8))
     A            WVZV_R3A       3S 0  19 91EDTCDE(Z)
     A            WVZV_R3        3S 0  19 97EDTCDE(Z)
     A                                 35 20' '
     A          R C                         FONT(755 (*POINTSIZE 6))
     A                                    25'|'
     A                                      HIGHLIGHT
     A            WVZV_VPNR      5S 0     16EDTCDE(Z)
     A                                      SPACEB(1)
     A                                    25'|'
     A                                      HIGHLIGHT
     A*           WVZV_KOTA      5        27
     A*           WVZV_KOSLT    80        33
     A            WVZV_KOSLT    80        27
     A            WVZV_VASL     70        91
     A                                    25'|'
     A                                      HIGHLIGHT
     A                                      SPACEB(1)
     A            WVZV_GODM     42        27
     A          R D                         FONT(755 (*POINTSIZE 6))
     A                                    15'_________________________________+
     A                                       _________________________________+
     A                                       _________________________________+
     A                                       _________________________________+
     A                                       _________________________________+
     A                                       ______________________'
     A  86                                  HIGHLIGHT
     A  86                                  UNDERLINE
     A                                      SPACEB(1)
     A  85                                25'|'
     A                                      HIGHLIGHT
     A  84                                51'|'
     A  82                               107'|'
     A  83                               122'|'
     A  81                               136'|'
     A          R D2                        FONT(755 (*POINTSIZE 6))
     A                                    15'_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _+
     A                                       _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _+
     A                                       _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _+
     A                                       _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _+
     A                                       _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _+
     A                                       _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _+
     A                                       _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _+
     A                                       _ _ _'
     A                                      HIGHLIGHT
     A                                      SPACEB(1)
     A          R E                         FONT(755 (*POINTSIZE 6))
     A                                      SPACEB(1)
     A  85                                25'|'
     A                                      HIGHLIGHT
     A  84                                51'|'
     A  82                               107'|'
     A  83                               122'|'
     A  81                               136'|'
     A          R F                         FONT(755 (*POINTSIZE 6))
     A                                      SPACEB(1)
     A                                    91'- - -'
     A          R G                         FONT(755 (*POINTSIZE 6))
     A                                      SPACEB(1)
     A                                    16'- - -'
     A            WVZV_R33      21        91
     A                                      FONT(755 (*POINTSIZE 8))
     A          R H                         FONT(755 (*POINTSIZE 7))
     A                                      SPACEB(1)
     A            WVZV_R7       70        16
     A                                      FONT(755 (*POINTSIZE 6))
     A            WVZV_R40      26        91
     A          R I                         FONT(755 (*POINTSIZE 7))
     A                                      SPACEB(1)
     A            WVZV_R441A    70        16FONT(755 (*POINTSIZE 6))
     A            WVZV_R313     17        91
     A                                   136'|'
     A            WVZV_S28       5       139FONT(755 (*POINTSIZE 6))
     A            WVZV_R441B    35        16FONT(755 (*POINTSIZE 6))
     A                                      SPACEB(1)
     A                                   136'|'
     A          R J                         FONT(755 (*POINTSIZE 7))
     A                                      SPACEB(1)
     A            WVZV_R442A    70        16FONT(755 (*POINTSIZE 6))
     A            WVZV_R37      10        91
     A                                   107'|'
     A            WVZV_R15A      5       110
     A                                   122'|'
     A            WVZV_R17A      5       125
     A                                   136'|'
     A            WVZV_R35      18       139
     A            WVZV_R442B    70        16FONT(755 (*POINTSIZE 6))
     A                                      SPACEB(1)
     A                                   107'|'
     A                                   122'|'
     A                                   136'|'
     A          R K                         FONT(755 (*POINTSIZE 7))
     A                                      SPACEB(1)
     A            SVZV_FNKD      4        16
     A                                    51'|'
     A            WVZV_S29       5        53
     A                                   107'|'
     A            SVZV_STVA     11       110
     A                                   136'|'
     A            SVZV_NETO     18       139
