     A*%%TS  SD  20150812  103011  CB          REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A                                      HLPPNLGRP(HLPSCR SVZ000PNL)
     A                                      HLPTITLE('ED För Import')
      *
     A          R SVZ000DA                  SFL
     A            ZOP            1A  I  7  2
     A  31                                  DSPATR(HI)
     A  31                                  DSPATR(PC)
     A                                      VALUES(' ' 'A' 'P')
     A            SVZH_TUID     10A  O  7  4
     A            SVZH_UTDT      8S 0O  7 15
     A            SVZH_MRNN     18A  O  7 24
     A            SVZH_AVNA     35A  O  7 43
     A            SVZH_MOLK      2A  O  7 79
     A            SVZH_MONA     35A  O  7 82
     A*
     A          R SVZ000DB                  SFLCTL(SVZ000DA)
     A*%%TS  SD  20150812  103011  CB          REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0017)
     A                                      SFLPAG(0016)
     A  91N93N94                            ROLLUP(25 'Rollup')
     A  91N93N94                            ROLLDOWN(26 'Rolldown')
     A                                      CF03(03 'Gå ut')
     A                                      CF05(05 'Refresh')
     A                                      CF08(08 'Ny avd/sign')
     A                                      CF12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SVZ000'
     A                                      COLOR(BLU)
     A                                  1 16'DA'
     A                                      COLOR(BLU)
     A                                  1 29'Underhåll av ZEM Øversikt'
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  2 75SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  3  2'Välj option och tryck Enter.  '
     A                                      COLOR(BLU)
     A                                  4  4'P=Skriv ut   A=Arkiv'
     A                                      COLOR(BLU)
     A                                  6  4'Tullid'
     A                                      COLOR(WHT)
     A                                  6 15'Datum'
     A                                      COLOR(WHT)
     A                                  6 24'MRN'
     A                                      COLOR(WHT)
     A                                  6 43'Avsändare'
     A                                      COLOR(WHT)
     A                                  6 79'Mottagare'
     A                                      COLOR(WHT)
      *
     A          R SVZ000DC
     A                                      OVERLAY
     A                                 26  2'F3=Avsluta'
     A                                      COLOR(BLU)
     A                                 26 15'F5=Uppdatera'
     A                                      COLOR(BLU)
     A                                 26 30'F8=Selektera'
     A                                      COLOR(BLU)
     A                                 26 45'F12=Avbryt'
     A                                      COLOR(BLU)
      *
     A          R SVZ000DD
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'Sök kunde/leverandör')
     A                                      OVERLAY
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SVZ000'
     A                                      COLOR(BLU)
     A                                  1 16'DD'
     A                                      COLOR(BLU)
     A                                  1 25'UNDERHÅLL AV ZEM Selektion'
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  5  4'Välj sökväg:'
     A                                      COLOR(WHT)
     A                                  7  4'Tullid . :'
     A            ZVZH_TUID     10A  B  7 17TEXT('TULLID')
     A                                      DSPATR(UL)
     A  46                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 26  2'F3=Avsluta'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R SVZ000DØ
     A                                      OVERLAY
     A            ZMSGNO         7A  P
     A            ZMSGTX        79   O 27  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
