     A*****************************************************************
     A*                     F A K T U R A                             *
     A* ANTALL LINJE=72,  ANTALL TEGN PR. LINJE=80,  OVERFLOW=68      *
     A*****************************************************************
     A          R FHEAD1                    SPACEB(2)
     A N70N79                             68MSGCON(15 DIV0284 SYMSGF)
     A  70                                68MSGCON(15 DIV0323 SYMSGF)
     A  79                                68MSGCON(15 DIV0324 SYMSGF)
     A          R FHEAD
     A  46        HOHT1         80A     1  1
     A  46        HOHT2         80A     2  1
     A  46        HOHT3         80A     3  1
     A  46        HOHT4         80A     4  1
     A  46        HOHT5         80A     5  1
     A  46        HOHT6         80A     6  1
     A  46        HOHT7         80A     7  1
     A            KNAVN         30A    11 11
     A N88                             11 54'****** A M E T A *******'
     A                                      HIGHLIGHT
     A  88N70N79                       11 54MSGCON(24 DIV0286 SYMSGF)
     A                                      HIGHLIGHT
     A  88 70                          11 54MSGCON(24 DIV0321 SYMSGF)
     A                                      HIGHLIGHT
     A  88 79                          11 54MSGCON(24 DIV0322 SYMSGF)
     A                                      HIGHLIGHT
     A  88                             11 69PAGNBR
     A            ADR1          30A    12 11
     A N70N79                          12 54MSGCON(24 DIV0300 SYMSGF)
     A                                      HIGHLIGHT
     A  70                             12 54MSGCON(24 DIV0319 SYMSGF)
     A                                      HIGHLIGHT
     A  79                             12 54MSGCON(24 DIV0320 SYMSGF)
     A                                      HIGHLIGHT
     A            ADR2          30A    13 11HIGHLIGHT
     A N27                             13 54'************************'
     A                                      HIGHLIGHT
     A  27                             13 54'***** COPY *************'
     A                                      HIGHLIGHT
     A N37 38     POSTNR    R          14 11REFFLD(POSTNR CUNDF)
     A                                      DLTEDT
     A N37 38     ADR3      R          14 17REFFLD(ADR3 CUNDF)
     A N38        SYPOGE         9     14 11
     A N38        ADR3B     R          14 22REFFLD(ADR3 CUNDF)
     A  37 38     ADR3C     R          14 11REFFLD(ADR3 CUNDF)
     A N70N79                          14 54MSGCON(12 DIV0287 SYMSGF)
     A  70                             14 54MSGCON(12 DIV0317 SYMSGF)
     A  79                             14 54MSGCON(12 DIV0318 SYMSGF)
     A            XFN            7  0  14 71EDTCDE(3) HIGHLIGHT
     A            KLKNVN    R          15 11REFFLD(KLKNVN KODTLK)
     A N70N79                          15 54MSGCON(12 DIV0199 SYMSGF)
     A  79                             15 54MSGCON(12 DIV0315 SYMSGF)
     A  70                             15 54MSGCON(12 DIV0316 SYMSGF)
     A            KUNDNR         8  0  15 70EDTCDE(3) HIGHLIGHT
     A N70N79                          16 54MSGCON(12 DIV0288 SYMSGF)
     A  70                             16 54MSGCON(12 DIV0313 SYMSGF)
     A  79                             16 54MSGCON(12 DIV0314 SYMSGF)
     A N27                             16 70DATE EDTCDE(Y) HIGHLIGHT
     A  27        XDTU2          6  0  16 70EDTCDE(Y) HIGHLIGHT
     A N70N79                          17 54MSGCON(12 DIV0289 SYMSGF)
     A  70                             17 54MSGCON(12 DIV0311 SYMSGF)
     A  79                             17 54MSGCON(12 DIV0312 SYMSGF)
     A            XFFDT          6  0  17 70EDTCDE(Y) HIGHLIGHT
     A                                 18  1' _______________________'
     A                                 18 25'________________________'
     A                                 18 49'________________________'
     A                                 18 73'________'
     A                                 19  5'Our ref'
     A                                 19 25'Partner ref'
     A N70N79                          19 72'Beløp'
     A  70                             19 72'Amount'
     A  79                             19 72'Kosten'
     A                                 20  1' _______________________'
     A                                 20 25'________________________'
     A                                 20 49'________________________'
     A                                 20 73'________'
     A                                 21  1' '
     A N70N79                          23 15'A M E T A   I F Ø L G E   B I L A '
     A N70N79                          23 49'G'
     A  70                             23 15'A M E T A   A C C O R D I N G   T '
     A  70                             23 49'O   E N C L O S U R E'
     A  79                             23 15'A M E T A   L A U T   B E I L A G'
     A  79                             23 48' E'
     A                                 25  1' '
     A          R FTUR
     A            AHEREF        15A        5
     A            AHAREF        15A       21
     A            XHADAT         6  0     36EDTCDE(Y)
     A            XHBDAT         6  0     45EDTCDE(Y)
     A            AHBILN        10A       54
     A            XBRUTA        13  2     61EDTCDE(J)
     A                                      SPACEA(1)
     A          R FTOT
     A  72        MVAPRO         4  2      2EDTCDE(4)
     A  72                                 8'%'
     A  72N70N79                          10MSGCON(7 JOV0091 SYMSGF)
     A  72 70                             10'VAT  OF'
     A  72 79                             10'MWS VON'
     A  72        XMVGR          9  2     17EDTCDE(J)
     A  72                                30'='
     A  72        XMOM           8  2     35EDTCDE(J)
     A*
     A          R FTOT2B
     A N70N73N79                       66  1MSGCON(24 DIV0303 SYMSGF)
     A N70 73N79                       66 31MSGCON(15 DIV0304 SYMSGF)
     A  70 73                          66 31MSGCON(15 DIV0305 SYMSGF)
     A N70N71N79                       66 51MSGCON(13 DIV0298 SYMSGF)
     A N70 71N79
     AO 70                             66 44MSGCON(12 DIV0299 SYMSGF)
     A  79                             66 44MSGCON(12 DIV0306 SYMSGF)
     A N70 71N79
     AO 70
     AO 79        XVAL           3A    66 56
     A            XBRUT         13  2  66 61EDTCDE(J)
     A N70N73N79  BETTXT        30A    67  2
     A                                 67 50'========================'
     A                                 67 74'====='
     A  44        HOHT8         80A    68  1
     A  44        HOHT9         80A    69  1
     A  44        HOHT10        80A    70  1
     A*
