     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R SUBFIL                    SFL
     A            THDTD          2S 0H
     A            THLI           5S 0H
     A            WSNRO          1A  B  7  2VALUES(' ' '2' '4')
     A            THAVK          3A  O  7  6
     A            THEINT        13Y 2O  7 48EDTCDE(L)
     A                                      COLOR(YLW)
     A            THEUTG        13Y 2O  7 65EDTCDE(L)
     A                                      COLOR(YLW)
     A            THAINT        13Y 2O  7 11EDTCDE(L)
     A                                      COLOR(YLW)
     A            THAUTG        13Y 2O  7 28EDTCDE(L)
     A                                      COLOR(YLW)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(1000)
     A                                      SFLPAG(0012)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                  1  2'SYSPED/SYAM01A'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(035 DIV2417 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0O  1 65SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2  2MSGCON(009 TRO0103 *LIBL/SYMSGF)
     A            W1TNR          8Y 0O  2 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 23MSGCON(006 DIV2424 *LIBL/SYMSGF)
     A            W1KNA          8Y 0O  2 30EDTCDE(4)
     A                                      COLOR(WHT)
     A            W1NAVN        30A  O  2 39COLOR(WHT)
     A                                  2 72TIME
     A                                  6 11MSGCON(025 TGI0025 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  6 48MSGCON(025 TRO0124 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A            W1AVD          4Y 0O  3 23DSPATR(HI)
     A                                      EDTCDE(4)
     A            W1OPD          7Y 0O  3 34DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  4  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(007 TGI0030 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  5  2MSGCON(010 DIV2226 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5 13MSGCON(010 DIV2227 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            W1UNRX         2  0O  3 15EDTCDE(4)
     A                                      DSPATR(ND)
     A                                  3  2MSGCON(004 TRO0068 *LIBL/SYMSGF)
     A                                  3 18MSGCON(004 TRO0069 *LIBL/SYMSGF)
     A                                  3 28MSGCON(005 TRO0070 *LIBL/SYMSGF)
     A                                  3 40MSGCON(005 TRO0071 *LIBL/SYMSGF)
     A            W1VEKT         6Y 0O  3 46DSPATR(HI)
     A                                      EDTCDE(L)
     A                                  3 55MSGCON(004 TRO0072 *LIBL/SYMSGF)
     A            W1VOL          7Y 3O  3 60DSPATR(HI)
     A                                      EDTCDE(L)
     A                                  3 71MSGCON(005 TRO0073 *LIBL/SYMSGF)
     A            W1FRAN         3A  O  3 77DSPATR(HI)
     A            W1VTXT         2A  O  3 66DSPATR(HI)
     A            W1POS          7   O  3  7DSPATR(HI)
     A          R NYWRK
     A N55                                  CF06(06 'Ny linje')
     A                                      CF12(12 'FORIGE BILDE')
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SYAM01A'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(035 DIV2417 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                  2  2MSGCON(009 TRO0103 *LIBL/SYMSGF)
     A            W1TNR          8Y 0O  2 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 23MSGCON(006 DIV2424 *LIBL/SYMSGF)
     A            W1KNA          8Y 0O  2 30EDTCDE(4)
     A                                      COLOR(WHT)
     A            W1NAVN        30A  O  2 39COLOR(WHT)
     A                                  2 72TIME
     A            FLD001         7   O  3  7DSPATR(HI)
     A                                  6 11MSGCON(025 TGI0025 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  6 48MSGCON(025 TRO0124 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A            W1AVD          4Y 0O  3 23DSPATR(HI)
     A                                      EDTCDE(4)
     A            W1OPD          7Y 0O  3 34DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  4  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(007 TGI0030 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  5  2MSGCON(010 DIV2226 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5 13MSGCON(010 DIV2227 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            W1UNRX         2  0O  3 15EDTCDE(4)
     A                                      DSPATR(ND)
     A                                  3  2MSGCON(004 TRO0068 *LIBL/SYMSGF)
     A                                  3 18MSGCON(004 TRO0069 *LIBL/SYMSGF)
     A                                  3 28MSGCON(005 TRO0070 *LIBL/SYMSGF)
     A                                  3 40MSGCON(005 TRO0071 *LIBL/SYMSGF)
     A            W1VEKT         6Y 0O  3 46DSPATR(HI)
     A                                      EDTCDE(L)
     A                                  3 55MSGCON(004 TRO0072 *LIBL/SYMSGF)
     A            W1VOL          7Y 3O  3 60DSPATR(HI)
     A                                      EDTCDE(L)
     A                                  3 71MSGCON(005 TRO0073 *LIBL/SYMSGF)
     A            W1FRAN         3A  O  3 77DSPATR(HI)
     A            W1VTXT         2A  O  3 66DSPATR(HI)
     A                                 23 69MSGCON(011 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 10MSGCON(010 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N55                             23 26MSGCON(010 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BUNN
     A                                      CF12(12 'FORIGE BILDE')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF05(05 'Forny')
     A N55                                  CF06(06 'Lag ny')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            TOEINT        13Y 2O  1 48EDTCDE(L)
     A                                      COLOR(WHT)
     A            TOEUTG        13Y 2O  1 65EDTCDE(L)
     A                                      COLOR(WHT)
     A            TOAINT        13Y 2O  1 11EDTCDE(L)
     A                                      COLOR(WHT)
     A            TOAUTG        13Y 2O  1 28EDTCDE(L)
     A                                      COLOR(WHT)
     A                                  1  2'Sum'
     A                                  3 69MSGCON(011 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 10MSGCON(010 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N55                              3 26MSGCON(010 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98                              4  2MSGCON(078 DIV0012 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R DLTLIN
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(19)
     A                                      CLRL(05)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  2  2MSGCON(007 TGI0030 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2 11MSGCON(025 TGI0025 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2 48MSGCON(025 TRO0124 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A            THAVK          3A  O  3  6
     A            THEINT        13Y 2O  3 48EDTCDE(L)
     A                                      COLOR(YLW)
     A            THEUTG        13Y 2O  3 65EDTCDE(L)
     A                                      COLOR(YLW)
     A            THAINT        13Y 2O  3 11EDTCDE(L)
     A                                      COLOR(YLW)
     A            THAUTG        13Y 2O  3 28EDTCDE(L)
     A                                      COLOR(YLW)
     A                                  5 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R CHGLIN
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(19)
     A                                      CLRL(05)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  2  2MSGCON(007 TGI0030 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2 11MSGCON(025 TGI0025 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2 48MSGCON(025 TRO0124 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A            THAVK          3A  B  3  6
     A            THEINT        13Y 2B  3 48EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A                                      COLOR(YLW)
     A            THEUTG        13Y 2B  3 65EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A                                      COLOR(YLW)
     A            THAINT        13Y 2B  3 11EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A                                      COLOR(YLW)
     A            THAUTG        13Y 2B  3 28EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A                                      COLOR(YLW)
     A  30        MSGTXT        78A  O  5  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  5 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGNR          7A  P
     A          R ADDLIN
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(19)
     A                                      CLRL(05)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  2  2MSGCON(007 TGI0030 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2 11MSGCON(025 TGI0025 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2 48MSGCON(025 TRO0124 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A            THAVK          3A  B  3  6
     A            THEINT        13Y 2B  3 48EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A                                      COLOR(YLW)
     A            THEUTG        13Y 2B  3 65EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A                                      COLOR(YLW)
     A            THAINT        13Y 2B  3 11EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A                                      COLOR(YLW)
     A            THAUTG        13Y 2B  3 28EDTCDE(L)
     A                                      CHECK(RB)
     A                                      CHECK(FE)
     A                                      COLOR(YLW)
     A  30        MSGTXT        78A  O  5  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  5 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGNR          7A  P
