     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R SUBFIL                    SFL
     A            WSNR           1A  B  6  5VALUES(' ' '4')
     A            WSAVD     R        O  6  8REFFLD(SAMLR/SAAVD *LIBL/AMWSAML)
     A            WSOPD     R        O  6 13REFFLD(SAMLR/SAOPD *LIBL/AMWSAML)
     A            WSPRO     R        O  6 21REFFLD(SAMLR/SAPRO *LIBL/AMWSAML)
     A            WSKN      R        O  6 32REFFLD(SAMLR/SAKN *LIBL/AMWSAML)
     A            WSNAVN        30   O  6 41
     A            WSSK      R        O  6 74REFFLD(SAMLR/SASK *LIBL/AMWSAML)
     A            WSFIRM    R        H      REFFLD(SAMLR/SAFIRM *LIBL/AMWSAML)
     A            WSXXX          4   O  6 76
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1 12MSGCON(045 JOV0138 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  3  2MSGCON(050 JOV0137 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(030 JOV0139 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(078 DIV3290 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'TILBAKE')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  3  2MSGCON(018 SHU0027 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 42MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98                              4  2MSGCON(078 DIV0012 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R VAREL2
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            Y2AVD     R        I  2  8REFFLD(SAMLR/SAAVD *LIBL/AMWSAML)
     A                                      DSPATR(PC)
     A            Y2OPD     R        I  2 13REFFLD(SAMLR/SAOPD *LIBL/AMWSAML)
     A            Y2PRO     R        I  2 21REFFLD(SAMLR/SAPRO *LIBL/AMWSAML)
     A            Y2KN      R        I  2 32REFFLD(SAMLR/SAKN *LIBL/AMWSAML)
     A            Y2SK      R        I  2 74REFFLD(SAMLR/SASK *LIBL/AMWSAML)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R NYWRK
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'TILBAKE')
     A                                  1  2MSGCON(045 DIV3288 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(030 DIV3289 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(078 DIV3290 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
