     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R BILDE1
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'Søk agent')
     A                                      CF12(03 'Avslutt')
     A                                      CSRLOC(LINNBR POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYAM09'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 TRO0056 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                  2 67TIME
     A                                  7  7MSGCON(020 TRO0052 *LIBL/SYMSGF)
     A            W1FAVD         4S 0B  7 29DSPATR(HI)
     A            W1TAVD         4S 0B  7 39DSPATR(HI)
     A                                  7 53MSGCON(012 TRO0057 *LIBL/SYMSGF)
     A                                  9  7MSGCON(020 TRO0053 *LIBL/SYMSGF)
     A            W1FDAT         6S 0B  9 29DSPATR(HI)
     A            W1TDAT         6S 0B  9 39DSPATR(HI)
     A                                  9 53MSGCON(012 TRO0057 *LIBL/SYMSGF)
     A                                 11  7MSGCON(020 TRO0054 *LIBL/SYMSGF)
     A            W1AGNT         8S 0B 11 29DSPATR(HI)
     A                                 11 53MSGCON(012 TRO0057 *LIBL/SYMSGF)
     A                                 13  7MSGCON(020 TRO0055 *LIBL/SYMSGF)
     A            W1STAT         1A  B 13 29DSPATR(HI)
     A                                 13 53MSGCON(012 TRO0057 *LIBL/SYMSGF)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 29MSGCON(012 TRO0058 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
