     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('VEDLSTED' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  5  3VALUES(' ' '2' '4')
     A            SFVK           3A  O  5  7
     A            SFIK           1A  O  5 12
     A            SFIKAG         1A  O  5 17
     A            SFFR01         3   O  5 22
     A            SFFR02         3A  O  5 27
     A            SFFR03         3A  O  5 32
     A            SFFR04         3A  O  5 37
     A            SFFR05         3A  O  5 42
     A            SFFR06         3A  O  5 47
     A            SFFR07         3A  O  5 52
     A            SFFR08         3A  O  5 57
     A            SFFR09         3A  O  5 62
     A            SFFR10         3A  O  5 67
     A            SFDEL          8A  O  5 73DSPATR(HI)
     A*
     A            SFFR11         3   O  6 22
     A            SFFR12         3A  O  6 27
     A            SFFR13         3A  O  6 32
     A            SFFR14         3A  O  6 37
     A            SFFR15         3A  O  6 42
     A            SFFR16         3A  O  6 47
     A            SFFR17         3A  O  6 52
     A            SFFR18         3A  O  6 57
     A            SFFR19         3A  O  6 62
     A            SFFR20         3A  O  6 67
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYAM04'
     A                                      COLOR(BLU)
     A N75                              1 20MSGCON(042 TGI0026 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  75                              1 20MSGCON(042 TGI0031 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  2  2MSGCON(009 TGI0004 *LIBL/SYMSGF)
     A            SFKNA          8Y 0O  2 13DSPATR(HI)
     A                                      EDTCDE(4)
     A            SFNVN         30A  O  2 22DSPATR(HI)
     A                                  2 63TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(079 TGI0027 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORIGE BILDE')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R VARELI
     A  44                                  CF04(04 'SØKE')
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(079 TGI0027 *LIBL/SYMSGF)
     A            WSVK           3A  B  2  7
     A            WSIK           1A  B  2 12VALUES('I' 'K')
     A            WSIKAG         1A  B  2 17VALUES(' ' 'A')
     A            WSFR01         3A  B  2 22
     A            WSFR02         3A  B  2 27
     A            WSFR03         3A  B  2 32
     A            WSFR04         3A  B  2 37
     A            WSFR05         3A  B  2 42
     A            WSFR06         3A  B  2 47
     A            WSFR07         3A  B  2 52
     A            WSFR08         3A  B  2 57
     A            WSFR09         3A  B  2 62
     A            WSFR10         3A  B  2 67
     A            SFDEL          8A  B  2 73DSPATR(PR)
     A                                      DSPATR(ND)
     A*
     A            WSFR11         3A  B  3 22
     A            WSFR12         3A  B  3 27
     A            WSFR13         3A  B  3 32
     A            WSFR14         3A  B  3 37
     A            WSFR15         3A  B  3 42
     A            WSFR16         3A  B  3 47
     A            WSFR17         3A  B  3 52
     A            WSFR18         3A  B  3 57
     A            WSFR19         3A  B  3 62
     A            WSFR20         3A  B  3 67
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  4 61MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGNR          7A  P
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  1  2MSGCON(079 TGI0027 *LIBL/SYMSGF)
     A            SFVK           3A  O  2  7DSPATR(HI)
     A            SFIK           1A  O  2 12DSPATR(HI)
     A            SFIKAG         1A  O  2 17DSPATR(HI)
     A            SFFR01         3A  O  2 22DSPATR(HI)
     A            SFFR02         3A  O  2 27DSPATR(HI)
     A            SFFR03         3A  O  2 32DSPATR(HI)
     A            SFFR04         3A  O  2 37DSPATR(HI)
     A            SFFR05         3A  O  2 42DSPATR(HI)
     A            SFFR06         3A  O  2 47DSPATR(HI)
     A            SFFR07         3A  O  2 52DSPATR(HI)
     A            SFFR08         3A  O  2 57DSPATR(HI)
     A            SFFR09         3A  O  2 62DSPATR(HI)
     A            SFFR10         3A  O  2 67DSPATR(HI)
     A*
     A            SFFR11         3A  O  3 22DSPATR(HI)
     A            SFFR12         3A  O  3 27DSPATR(HI)
     A            SFFR13         3A  O  3 32DSPATR(HI)
     A            SFFR14         3A  O  3 37DSPATR(HI)
     A            SFFR15         3A  O  3 42DSPATR(HI)
     A            SFFR16         3A  O  3 47DSPATR(HI)
     A            SFFR17         3A  O  3 52DSPATR(HI)
     A            SFFR18         3A  O  3 57DSPATR(HI)
     A            SFFR19         3A  O  3 62DSPATR(HI)
     A            SFFR20         3A  O  3 67DSPATR(HI)
     A                                  4  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R NYKUNDE
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORIGE BILDE')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYAM04'
     A                                      COLOR(BLU)
     A N75                              1 20MSGCON(042 TGI0026 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  75                              1 20MSGCON(042 TGI0031 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  2  2MSGCON(009 TGI0004 *LIBL/SYMSGF)
     A            SFKNA          8Y 0O  2 13DSPATR(HI)
     A                                      EDTCDE(4)
     A            SFNVN         30A  O  2 22DSPATR(HI)
     A                                  2 63TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(079 TGI0027 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
