     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('VEDLSTED' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  5  3VALUES(' ' '2' '4')
     A            SFLK           1A  O  5  7
     A            SFGE01         3A  O  5 15
     A            SFGE02         3A  O  5 21
     A            SFGE03         3A  O  5 27
     A            SFGE04         3A  O  5 33
     A            SFGE05         3A  O  5 39
     A            SFGE06         3A  O  5 45
     A            SFGE07         3A  O  5 51
     A            SFGE08         3A  O  5 57
     A            SFGE09         3A  O  5 63
     A            SFGE10         3A  O  5 69
     A            SFDEL          8A  O  5 73DSPATR(HI)
     A*
     A            SFGE11         3A  O  6 15
     A            SFGE12         3A  O  6 21
     A            SFGE13         3A  O  6 27
     A            SFGE14         3A  O  6 33
     A            SFGE15         3A  O  6 39
     A            SFGE16         3A  O  6 45
     A            SFGE17         3A  O  6 51
     A            SFGE18         3A  O  6 57
     A            SFGE19         3A  O  6 63
     A            SFGE20         3A  O  6 69
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYAM06'
     A                                      COLOR(BLU)
     A N75                              1 20MSGCON(042 TRO0062 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  75                              1 20MSGCON(042 TGI0031 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  2 63TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(079 TRO0063 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORIGE BILDE')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R VARELI
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(079 TRO0063 *LIBL/SYMSGF)
     A            WSLK           1A  B  2  7CHECK(LC)
     A            WSGE01         3A  B  2 15
     A            WSGE02         3A  B  2 21
     A            WSGE03         3A  B  2 27
     A            WSGE04         3A  B  2 33
     A            WSGE05         3A  B  2 39
     A            WSGE06         3A  B  2 45
     A            WSGE07         3A  B  2 51
     A            WSGE08         3A  B  2 57
     A            WSGE09         3A  B  2 63
     A            WSGE10         3A  B  2 69
     A            SFDEL          8A  B  2 73DSPATR(PR)
     A                                      DSPATR(ND)
     A            WSGE11         3A  B  3 15
     A            WSGE12         3A  B  3 21
     A            WSGE13         3A  B  3 27
     A            WSGE14         3A  B  3 33
     A            WSGE15         3A  B  3 39
     A            WSGE16         3A  B  3 45
     A            WSGE17         3A  B  3 51
     A            WSGE18         3A  B  3 57
     A            WSGE19         3A  B  3 63
     A            WSGE20         3A  B  3 69
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  4 61MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGNR          7A  P
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  1  2MSGCON(079 TRO0063 *LIBL/SYMSGF)
     A            SFLK           1A  O  2  8DSPATR(HI)
     A            SFGE01         3A  O  2 15DSPATR(HI)
     A            SFGE02         3A  O  2 21DSPATR(HI)
     A            SFGE03         3A  O  2 27DSPATR(HI)
     A            SFGE04         3A  O  2 33DSPATR(HI)
     A            SFGE05         3A  O  2 39DSPATR(HI)
     A            SFGE06         3A  O  2 45DSPATR(HI)
     A            SFGE07         3A  O  2 51DSPATR(HI)
     A            SFGE08         3A  O  2 57DSPATR(HI)
     A            SFGE09         3A  O  2 63DSPATR(HI)
     A            SFGE10         3A  O  2 69DSPATR(HI)
     A*
     A            SFGE11         3A  O  3 15DSPATR(HI)
     A            SFGE12         3A  O  3 21DSPATR(HI)
     A            SFGE13         3A  O  3 27DSPATR(HI)
     A            SFGE14         3A  O  3 33DSPATR(HI)
     A            SFGE15         3A  O  3 39DSPATR(HI)
     A            SFGE16         3A  O  3 45DSPATR(HI)
     A            SFGE17         3A  O  3 51DSPATR(HI)
     A            SFGE18         3A  O  3 57DSPATR(HI)
     A            SFGE19         3A  O  3 63DSPATR(HI)
     A            SFGE20         3A  O  3 69DSPATR(HI)
     A                                  4  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R NYKUNDE
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORIGE BILDE')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYAM06'
     A                                      COLOR(BLU)
     A  75                              1 20MSGCON(042 TRO0062 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  2 63TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(079 TRO0063 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
