     A                                      REF(HEADF)
      *_________________________________
      * Format for markering av ny side.
      *"""""""""""""""""""""""""""""""""
     A          R KJØP1                     SPACEB(2)
     A  70                                65'** Continues **'
     A N70N79                             65MSGCON(15 DIV1673 SYMSGF)
     A  79                                65'* Fortsetzung *'
      *_____________________________________________
      * Format for hovedopplysninger vanlig faktura.
      *"""""""""""""""""""""""""""""""""""""""""""""
     A          R KJØP
     A  46        HP1           80      1  1
     A  46        HP2           80      2  1
     A  46        HP3           80      3  1
     A  46        HP4           80      4  1
     A  46        HP5           80      5  1
     A  46        HP6           80      6  1
     A  46        HP7           80      7  1
     A N48        KNAVN     R          11 11REFFLD(KNAVN CUNDF)
     A  48        XDINV         30     11 11
     A N88N51                          11 48'******************************'
     A N88N51                          11 48'******************************'
     A N88
     AA 51N70N79                       11 48MSGCON(30 DIV1674 SYMSGF)
     A N88
     AA 51N70N79                       11 48MSGCON(30 DIV1674 SYMSGF)
     A N88 51 70
     AAN81                             11 48'*** A M E T A ****************'
     A N88 51 70
     AA 81                             11 48'*** A M E T A ***** C O P Y **'
     A N88 51 79
     AAN81                             11 48'*** A M E T A ****************'
     A N88 51 79
     AA 81                             11 48'*** A M E T A ***** K O P I **'
     A  70 88                          11 48'********  P A G E '
     A  70 88                          11 48'********  P A G E '
     A N70N79 88                       11 48MSGCON(24 DIV1676 SYMSGF)
     A N70N79 88                       11 48MSGCON(24 DIV1676 SYMSGF)
     A  79 88                          11 48'********  S E I T E'
     A  79 88                          11 48'********  S E I T E'
     A  88        XSIDE          2  0  11 71EDTCDE(Z)
     A  88                             11 75'***'
     A  88                             11 75'***'
     A N48        ADR1      R          12 11REFFLD(ADR1 CUNDF)
     A  48        XDIAD1        30     12 11
     A N73                             12 48'*'
     A N73                             12 48'*'
     A                                 12 77'*'
     A                                 12 77'*'
     A N70N73N79  KO2NTX    R          12 48REFFLD(KO2NTX KODTOT2)
     A  70N73     KO2ETX    R          12 48REFFLD(KO2ETX KODTOT2)
     A N70 73N79                       12 48MSGCON(24 DIV1677 SYMSGF)
     A N70 73N79                       12 48MSGCON(24 DIV1677 SYMSGF)
     A  70 73                          12 48'*   C R E D I T N O T E '
     A  70 73                          12 48'*   C R E D I T N O T E '
     A  73 79                          12 48'*   G U T S C H R I F T '
     A  73 79                          12 48'*   G U T S C H R I F T '
     A N73 79                          12 48'*   R E C H N U N G     '
     A N73 79                          12 48'*   R E C H N U N G     '
     A N48        ADR2      R          13 11REFFLD(ADR2 CUNDF)
     A  48        XDIAD2        30     13 11
     A N57                             13 48'******************************'
     A N57                             13 48'******************************'
     A  57 70                          13 48'*   CREDIT OF INV:'
     A  57 70                          13 48'*   CREDIT OF INV:'
     A  57N70N79                       13 48MSGCON(24 DIV1675 SYMSGF)
     A  57N70N79                       13 48MSGCON(24 DIV1675 SYMSGF)
     A  57 79                          13 48'*   GUTSCHRIFT VON:'
     A  57 79                          13 48'*   GUTSCHRIFT VON:'
     A  57        XKREDA         6S 0  13 72EDTCDE(Z)
     A N37N48     POSTNR    R          14 11REFFLD(POSTNR CUNDF)
     A                                      DLTEDT
     A N37N48     ADR3      R          14 17REFFLD(ADR3 CUNDF)
     A N38N48     SYPOGE         9     14 11
     A N38N48     ADR3B     R          14 22REFFLD(ADR3 CUNDF)
     A  37 38N48  ADR3C     R          14 11REFFLD(ADR3 CUNDF)
     A  48        XDIAD3        30     14 11
     A N70N79                          14 48MSGCON(15 DIV1667 SYMSGF)
     A  70                             14 48'Invoice no....:'
     A  79                             14 48'Rechnung nr...:'
     A            XFN            7S 0  14 71EDTCDE(Z)
     A            KLKNVN    R          15 11REFFLD(KLKNVN KODTLK)
     A N70N79                          15 48MSGCON(15 DIV1668 SYMSGF)
     A  70                             15 48'Customer no...:'
     A  79                             15 48'Kunden nr.....:'
     A            KUNDNR    R          15 70REFFLD(KUNDNR CUNDF)
     A                                      EDTCDE(Z)
     A N70N79                          16 48MSGCON(15 DIV1666 SYMSGF)
     A  70                             16 48'Date of invoice'
     A  79                             16 48'Rechn.datum...:'
     A            IDAGX          6S 0  16 70EDTCDE(Y)
     A N70N79                          17 48MSGCON(15 DIV1665 SYMSGF)
     A  70                             17 48'Date due......:'
     A  79                             17 48'Verfallstag...:'
     A N39        XFFDT          6S 0  17 70EDTCDE(Y)
     A  39                             17 71'Kontant'
     A N70N79                          18 48MSGCON(15 DIV1669 SYMSGF)
     A  70                             18 48'Our reference.:'
     A  79                             18 48'Unsere ref....:'
     A            AHEREF    R          18 70REFFLD(AHEREF AMHE)
     A N70N79N53                       19 48MSGCON(15 DIV1659 SYMSGF)
     A  70N53                          19 48'Agentref......:'
     A  79N53                          19 48'Agentref......:'
     A            AHAREF    R          19 65REFFLD(AHAREF AMHE)
     A N70N79N53                       20 48MSGCON(15 DIV2526 SYMSGF)
     A  70N53                          20 48'Truck no......:'
     A  79N53                          20 48'L.K.W.nr......:'
     A            AHBILN    R          20 69REFFLD(AHBILN AMHE)
     A N70N79N53                       21 48MSGCON(15 DIV2527 SYMSGF)
     A  70N53                          21 48'Date..........:'
     A  79N53                          21 48'Abg. datum....:'
     A            XHADAT         6  0  21 70EDTCDE(Y)
     A          R HEAT
     A N70N79                              2MSGCON(13 DIV1651 SYMSGF)
     A                                      SPACEB(2)
     A  70                                 2'Shipper.....:'
     A                                      SPACEB(2)
     A  79                                 2'Absender....:'
     A                                      SPACEB(2)
     A N70N79                             42MSGCON(13 DIV1652 SYMSGF)
     A  70                                42'Consignee...:'
     A  79                                42'Empfanger...:'
     A                                     1' _______________________'
     A                                      SPACEB(1)
     A                                    25'________________________'
     A                                    49'________________________'
     A                                    73'________'
     A                                     2'!'
     A                                      SPACEB(1)
     A                                    41'!'
     A                                    80'!'
     A                                     2'!'
     A                                      SPACEB(1)
     A            HENAS         30         8
     A                                    41'!'
     A            HENAK         30        48
     A                                    80'!'
     A                                     2'!'
     A                                      SPACEB(1)
     A            HEADS1        30         8
     A                                    41'!'
     A            HEADK1        30        48
     A                                    80'!'
     A                                     2'!'
     A                                      SPACEB(1)
     A            HEADS2        30         8
     A                                    41'!'
     A            HEADK2        30        48
     A                                    80'!'
     A                                     2'!'
     A                                      SPACEB(1)
     A            HEADS3        30         8
     A                                    41'!'
     A            HEADK3        30        48
     A                                    80'!'
     A                                     2'!'
     A                                      SPACEB(1)
     A            SLAND         30         8
     A                                    41'!'
     A            KLAND         30        48
     A                                    80'!'
     A                                     1' _______________________'
     A                                      SPACEB(1)
     A                                    25'________________________'
     A                                    49'________________________'
     A                                    73'________'
     A          R HEAD22                    SPACEB(1)
     A                                     1' _______________________'
     A                                      SPACEB(1)
     A                                    25'________________________'
     A                                    49'________________________'
     A                                    73'________'
      *__________________________________
      * Format for faktura-total. IND: 72
      *""""""""""""""""""""""""""""""""""
     A          R TOTA                      SPACEB(2)
     A N70N79                              2MSGCON(16 DIV1682 SYMSGF)
     A  70                                 2'VAT of (* lines)'
     A  79                                 2'Tax von(* linen)'
     A            XMVAGR        13  2     22EDTCDE(J)
     A N70N79                             41MSGCON(20 DIV1683 SYMSGF)
     A  70                                41'VAT Domestic:      %'
     A  79                                41'Kosten stat:       %'
     A            PRITAX         4  2     54EDTCDE(J)
     A  70        XVAL           3        61
     A  79        XVALB          3        61
     A N70 71     XVALC          3        61
     A            XPMOMS        13  2     61EDTCDE(J)
      *___________________________________
      * Format for faktura-total. IND: N35
      *"""""""""""""""""""""""""""""""""""
     A          R TOTB0                     SKIPB(30)
     A  70                                15'A M E T A   A C C O R D I N G   T '
     A  70                                49'O   E N C L O S U R E'
     A  79                                15'A M E T A   L A U T   B E I L A G'
     A  79                                48' E'
     A          R TOTB                      SKIPB(44)
     A  70                                45'TOTAL:'
     A  79                                45'GESAMTBETRAG:'
     A            XVAL           3        61
     A            XBRUTT        13  2     61EDTCDE(J)
     A                                     2' '
     A                                      SPACEB(1)
     A N39N73N79  BETTXT        30         2
     A  39                                 2'Kontant'
     A  39 70                              2'Cash:'
     A                                    45'================================='
     A  44        HP8           80         1SPACEB(1)
     A  44        HP9           80         1SPACEB(1)
     A  44        HP10          80         1SPACEB(1)
      *_________________________________________________
      * Format for faktura-total. without Norwegian giro.
      *""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R TOTC0                     SPACEB(1)
     A  70                                15'A M E T A   A C C O R D I N G   T '
     A  70                                49'O   E N C L O S U R E'
     A  79                                15'A M E T A   L A U T   B E I L A G'
     A  79                                48' E'
     A          R TOTC                      SPACEB(3)
     A  70                                45'TOTAL:'
     A  79                                45'GESAMTBETRAG:'
     A            XVAL           3        61
     A            XBRUTT        13  2     61EDTCDE(J)
     A                                     2' '
     A                                      SPACEB(1)
     A N39N73N79  BETTXT        30         2
     A  39                                 2'Kontant'
     A  39 70                              2'Cash:'
     A                                    45'================================'
     A  44        HP8           80         1SPACEB(1)
     A  44        HP9           80         1SPACEB(1)
     A  44        HP10          80         1SPACEB(1)
