     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      CF03(03 'Gå ut')
     A                                      CF12(12 'Annuller')
     A                                      HLPDOC('SYAV0101' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILD01
     A                                      OVERLAY
     A          H                           HLPDOC('SYAV0101' 'HELPNU' 'HLP400')
     A                                      HLPARA(01 001 24 080)
     A                                  1 34MSGCON(015 DIV2019 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 74'SYAV01D'
     A                                  2 35MSGCON(015 DIV2030 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 74'BILD01'
     A                                  4  2MSGCON(030 DIV2020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  4MSGCON(036 DIV2021 *LIBL/SYMSGF)
     A            ZAVDF          4D 0B  6 43
     A  31                                  DSPATR(PC)
     A  31                                  COLOR(RED)
     A                                  6 56'1-9999'
     A                                  7  6MSGCON(034 DIV2022 *LIBL/SYMSGF)
     A            ZAVDT          4D 0B  7 43
     A  32                                  DSPATR(PC)
     A  32                                  COLOR(RED)
     A                                  7 56'1-9999'
     A                                  9  4MSGCON(036 DIV2023 *LIBL/SYMSGF)
     A            ZFLYF          3D 0B  9 43
     A  33                                  DSPATR(PC)
     A  33                                  COLOR(RED)
     A                                  9 56'1-999'
     A                                 10  4MSGCON(036 DIV2024 *LIBL/SYMSGF)
     A                                 10  6MSGCON(034 DIV2022 *LIBL/SYMSGF)
     A            ZFLYT          3D 0B 10 43
     A  34                                  DSPATR(PC)
     A  34                                  COLOR(RED)
     A                                 10 56'1-999'
     A            ZDTF           6D 0B 12 43
     A  35                                  DSPATR(PC)
     A  35                                  COLOR(RED)
     A                                 12 56MSGCON(006 DIV2025 *LIBL/SYMSGF)
     A                                 13  6MSGCON(034 DIV2022 *LIBL/SYMSGF)
     A            ZDTT           6D 0B 13 43
     A  36                                  DSPATR(PC)
     A  36                                  COLOR(RED)
     A                                 13 56MSGCON(006 DIV2025 *LIBL/SYMSGF)
     A                                 15  4MSGCON(036 DIV2026 *LIBL/SYMSGF)
     A            ZEI            1A  B 15 43
     A  37                                  DSPATR(PC)
     A  37                                  COLOR(RED)
     A                                      VALUES('E' 'I')
     A                                 15 56MSGCON(024 DIV2027 *LIBL/SYMSGF)
     A                                 17  4MSGCON(036 DIV2028 *LIBL/SYMSGF)
     A            ZDEV          10A  B 17 43
     A  38                                  DSPATR(PC)
     A  38                                  COLOR(RED)
     A                                 17 56MSGCON(024 DIV2029 *LIBL/SYMSGF)
     A                                 22  4MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 24MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BILD09
     A                                      OVERLAY
     A            ZMSGTX        79A  O 24  2MSGID(&ZMSGNO SYMSGF)
     A N30                                  COLOR(WHT)
     A  30                                  COLOR(RED)
     A            ZMSGNO         7A  P
