      *__________________________
      * ARBEIDSFIL FOR AVREGNING
      *""""""""""""""""""""""""""
     A          R SYAV06WR
     A            SFAVD          4S 0       COLHDG('AVDELING')
     A            SFOPD          7S 0       COLHDG('OPPDRAGSNR')
     A            SFLI           5S 0       COLHDG('FAKT.LINJENR.')
     A            SFKDPL         1A         COLHDG('PRODUKTKODE')
