     A                                      REF(HEADF)
     A          R SYAV02FF
     A            HEST      R
     A            HEAVD     R
     A            HEOPD     R
     A            HEGN      R
     A            HESDF     R
     A            HESDT     R
     A            HEOT      R
     A            HEFR      R
     A            HEDTOP    R
     A*           HERFA     R
     A            HERFA         35          COLHDG('AGENTREF')
     A            HEFLY          3  0       COLHDG('Flyselskap')
     A          K HEGN
