     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
      *
     A          R BILDE01
     A                                      CF12(12 'tILBAKE')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYCASS0R'
     A                                      COLOR(BLU)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  6  2'Leverandørnummer:'
     A            WSLEV          8Y 0B  6 21EDTCDE(4)
     A  70                                  DSPATR(RI)
     A            LNAVN         30A  O  6 32
     A                                  9  2'Gebyr overskudd.:'
     A            WSGEBO         3A  B  9 21
     A                                 12  2'Gebyrkode moms..:'
     A            WSGEBM         3A  B 12 21
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A                                  1 21'Faste koder for CASSavregning'
     A                                      COLOR(WHT)
