     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDEFA
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A  27                                  CF05(05 'Bekreft om slett')
     A N27                                  CF12(12 'Til rullbilde')
     A                                  1  2MSGCON(020 DIV0586 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
     A*           HERFA         15A  O  1 66TEXT('Referanse Agent')
     A            HERFA15       15A  O  1 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEPLAN         1A  O  2 17TEXT('PLANLEGGINSKODE')
     A                                      COLOR(WHT)
     A                                  2 19'P'
     A            HEPOS1         7A  O  2 21TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 29TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 34'D'
     A            WSDT           6Y 0O  2 36COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 43MSGCON(005 DIV0587 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 49TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A            HEVALT         3A  O  3 23TEXT('V.KODE TILLEGG')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 28TEXT('PROSENT TILLEGG')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 34MSGCON(003 DIV0590 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  3 38TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 59TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 71TEXT('KUBIKK')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 14 66TEXT('LASTEMETER')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('FORFRAKT FRA')
     A                                      COLOR(WHT)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('VIDEREFRAKT FRA')
     A                                      COLOR(WHT)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(012 DIV0595 *LIBL/SYMSGF)
     A            HEPK1          1A  O 17  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            HEPK2          1A  O 17  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 17  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 17 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A                                 17 27MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 17 38TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 17 49MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 17 60TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            W2TOLL         2Y 0O 18  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 18 20TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 18 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 18 40TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 18 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 18 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
EV5  A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 DIV0067 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDEEX
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A  27                                  CF05(05 'Bekreft om slett')
     A N27                                  CF12(12 'Til rullbilde')
     A                                  1  2MSGCON(020 DIV0726 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 17MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2 20COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 27MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A            HETLE          3A  O  2 33COLOR(WHT)
     A                                  2 37MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLL          5A  O  2 44COLOR(WHT)
     A                                  2 50MSGCON(008 DIV0620 *LIBL/SYMSGF)
     A            HETLKU         1A  O  2 59COLOR(WHT)
     A                                  2 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
     A*           HERFA         15A  O  2 66TEXT('Referanse Agent')
     A            HERFA15       15A  O  2 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 23MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  3 32TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 37COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0786 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 59TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 71TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 14 66TEXT('Lastemeter')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(048 DIV0621 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  6TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 17 16TEXT('Printerkode-6')
     A                                      COLOR(WHT)
     A            HEPK7          1A  O 17 41TEXT('Printerkode-7')
     A                                      COLOR(WHT)
     A                                 19  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 19 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
EV5  A            HEDTMO         8A  O 20 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 21  2MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 21 13TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 22 13TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 22 24MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 34COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 DIV0067 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDEFI
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A  27                                  CF05(05 'Bekreft om slett')
     A N27                                  CF12(12 'Til rullbilde')
     A                                  1  2MSGCON(020 DIV0070 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A*           HERFA         15A  O  1 66TEXT('Referanse Agent')
     A            HERFA15       15A  O  1 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 17'P'
     A            HEPOS1         7A  O  2 19TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 27TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 32MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 42MSGCON(006 DIV0077 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 49TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 18MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 23TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 34MSGCON(003 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  3 38TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0098 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 59TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEFBV          9Y 0O 13 69TEXT('Fraktberegn.vekt')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(015 DIV0101 *LIBL/SYMSGF)
     A            HEPK1          1A  O 17  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            HEPK2          1A  O 17  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 17  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 17 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 17 15TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A                                 17 27MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 17 38TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 17 49MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 17 60TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            W2TOLL         2Y 0O 18  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 18 20TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 18 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 18 40TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 18 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 18 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
EV5  A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 DIV0067 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDEEF
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A  27                                  CF05(05 'Bekreft om slett')
     A N27                                  CF12(12 'Til rullbilde')
     A                                  1  2'SYSPED/SYFM21A'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(020 DIV0123 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  2 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2MSGCON(005 DIV0062 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2  8COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 61MSGCON(004 DIV0117 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2 66TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 19TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 25MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 30TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 33MSGCON(006 DIV0124 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 40TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  3 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            HEGN          15A  O  3 66COLOR(WHT)
     A                                  4  2MSGCON(004 DIV0118 *LIBL/SYMSGF)
     A            HEKNF          3Y 0O  4  8COLOR(WHT)
     A                                      EDTCDE(4)
     A            KFSNAV        30A  O  4 17COLOR(WHT)
     A                                  4 61MSGCON(004 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  4 66TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0119 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 61MSGCON(004 DIV0120 *LIBL/SYMSGF)
     A*           HERFA         15A  O  5 66TEXT('Referanse Agent')
     A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0125 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  7TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13 18TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 59TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 69TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(017 DIV0122 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  5TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 17 10TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HEPK9          1A  O 17 15TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A                                 19  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 19 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
EV5  A            HEDTMO         8A  O 20 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 21  2MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 21 13TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 22 13TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 22 24MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 34COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 DIV0067 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDEIN
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A  27                                  CF05(05 'Bekreft om slett')
     A N27                                  CF12(12 'Til rullbilde')
     A                                  1  2MSGCON(020 DIV0115 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2MSGCON(005 DIV0062 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2  8COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 15MSGCON(009 DIV0116 *LIBL/SYMSGF)
     A            HEPK9          1A  O  2 25TEXT('Printerkode-9')
     A                                      COLOR(WHT)
     A                                  2 61MSGCON(004 DIV0117 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2 66TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 19TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 25MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 30TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 33MSGCON(006 DIV0613 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 40TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  3 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            HEGN          15A  O  3 66COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0118 *LIBL/SYMSGF)
     A            HEKNF          3Y 0O  4  8COLOR(WHT)
     A                                      EDTCDE(4)
     A            KFSNAV        30A  O  4 17COLOR(WHT)
     A                                  4 61MSGCON(004 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  4 66TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0119 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 61MSGCON(004 DIV0120 *LIBL/SYMSGF)
     A*           HERFA         15A  O  5 66TEXT('Referanse Agent')
     A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A N99                                  COLOR(WHT)
     A  99                                  COLOR(RED)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A N98                                  COLOR(WHT)
     A  98                                  COLOR(RED)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0121 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 59TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 69TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(017 DIV0122 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  5TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 17 10TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 17 15TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A                                 17 27MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 17 38TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 17 49MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 17 60TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
EV5  A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 DIV0067 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDETR
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A  27                                  CF05(05 'Bekreft om slett')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                  1  2'SYSPED/SYFM21A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(039 DIV4082 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 69TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2  8TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            HEOPD          7Y 0O  2 13TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                  2 21MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 25TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 29MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 34TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 39'Tur'
     A            HEPRO          8  0O  2 43TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 52'Rundt'
     A            TRRUND         8Y 0O  2 58TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 67'Dato'
     A            WSDT           6Y 0O  2 72DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  3  2'Opdgi'
     A            TRKDAK         1A  O  3  8COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEKNA          8Y 0O  3 10TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  3 19TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEADA         30A  O  3 50COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  2'Fmott'
     A            TRKDFF         1A  O  4  8COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEKNSF         8Y 0O  4 10TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HENASF        30A  O  4 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADSF        30A  O  4 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2'Søref'
     A*           HERFA         15A  O  5  8TEXT('Referanse Agent')
     A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 27MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  5 31TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  5 37TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 40MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  5 44TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 50MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  5 59TEXT('V.kode tillegg')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  5 64DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6  2'Fra'
     A            HESDF          5A  O  6  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
EV5  A            TRSDFD         8Y 0H
NV5  A            WSSDFD         6Y 0O  6 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSDFK         4Y 0O  6 21EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSLANF         2A  O  6 28COLOR(WHT)
     A            WSSONF         3A  O  6 31COLOR(WHT)
     A            WSPNRF         5Y 0O  6 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 44'Til'
     A            HESDT          5A  O  6 48TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
EV5  A            TRSDTD         8Y 0H
NV5  A            WSSDTD         6Y 0O  6 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSDTK         4Y 0O  6 61EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSLANT         2A  O  6 68COLOR(WHT)
     A            WSSONT         3A  O  6 71COLOR(WHT)
     A            WSPNRT         5Y 0O  6 75COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7  2'Forf'
     A            HESDFF         5A  O  7  8TEXT('Forfrakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
EV5  A            TRSFFD         8Y 0H
NV5  A            WSSFFD         6Y 0O  7 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSFFK         4Y 0O  7 21EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRSTAF         1   O  7 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLAN1         2A  O  7 28COLOR(WHT)
     A            WSSON1         3A  O  7 31COLOR(WHT)
     A            WSPNR1         5Y 0O  7 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7 44'Vid'
     A            HESDVT         5A  O  7 48TEXT('Viderefrakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
EV5  A            TRSVTD         8Y 0H
NV5  A            WSSVTD         6Y 0O  7 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSVTK         4Y 0O  7 61EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRSTAE         1   O  7 66DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLAN2         2A  O  7 68COLOR(WHT)
     A            WSSON2         3A  O  7 71COLOR(WHT)
     A            WSPNR2         5Y 0O  7 75COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8  2MSGCON(005 DIV2299 *LIBL/SYMSGF)
     A            TRKNFA         8Y 0O  8  8COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSNAFA        30A  O  8 19COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSADFA        30A  O  8 50COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  9  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMS        30A  O  9 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRS        30A  O  9 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2'Henteadresse'
     A            HENAS         30A  O 10 19TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS1        30A  O 10 50TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS2        30A  O 11 19TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS3        30A  O 11 50TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 13  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O 13  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMK        30A  O 13 19TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRK        30A  O 13 50TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14  2'Leveringsadr'
     A            HENAK         30A  O 14 19TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 14 50TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 15 19TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 15 50TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A            HEOT           2A  O 17  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEFR           3A  O 17  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 17  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 17 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 17 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 17 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 17 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            HEGM2         15A  O 18  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 18 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 18 67TEXT('Lastemeter')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19  2'Verdi.'
     A            TRVERV         3A  O 19  9COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRVERB        13Y 2O 19 13EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 19 28'E'
     A            TRETTV         3A  O 19 30COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRETTB        13Y 2O 19 34EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 19 49'Frakt'
     A            TRFRAK         1A  O 19 55COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFRAV         3A  O 19 57COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFRAB        13Y 2O 19 61COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 19 76'M'
     A            TRMVA          1A  O 19 78COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20  2'Far(I)'
     A            TRFA11         7A  O 20  9COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 17'-'
     A            TRFA12         4A  O 20 19COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 24'Fl.p'
     A            TRFLP1         3Y 0O 20 29COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 20 34'Far(A)'
     A            TRFA21         7A  O 20 41COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFA22         4A  O 20 49COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 54'Fl.p'
     A            TRFLP2         3Y 0O 20 59COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 20 63'T-stat'
     A            TRTSTA         1A  O 20 70COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 21  2'Godsn'
     A            HEGN          11A  O 21  9COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 21 22'Pos'
     A            HEPOS1         7A  O 21 26COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 21 34'/'
     A            HEPOS2         4Y 0O 21 36COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 22  2'Ar.or'
     A            HEPK3          1A  O 22  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 22 11TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 13'Tolld'
     A            HEPK6          1A  O 22 19TEXT('Printerkode-6')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 21'CMR/BL'
     A            HEPK7          1A  O 22 28TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 30'Frab'
     A            HEPK1          1A  O 22 35TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 48'Forp'
     A            HEPK2          1A  O 22 53TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HENTVS         3Y 0O 22 55EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A N27N28                          23  2MSGCON(018 DIV0067 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDESJ
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A  27                                  CF05(05 'Bekreft om slett')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                  1  2MSGCON(020 DIV3285 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
     A*           HERFA         15A  O  1 66TEXT('Referanse Agent')
     A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEPLAN         1A  O  2 17TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                  2 19'P'
     A            HEPOS1         7A  O  2 21TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 29TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 34'D'
     A            WSDT           6Y 0O  2 36COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 43MSGCON(005 DIV0587 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 49TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A            HEVALT         3A  O  3 23TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 28COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 34MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            HELB           5A  O  3 40TEXT('LOKAL BÅT')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV3284 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            KFSNA2        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(078 DIV3282 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(012 DIV0595 *LIBL/SYMSGF)
     A            HEPK1          1A  O 17  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            HEPK2          1A  O 17  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 17  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 17 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A                                 17 27MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 17 38TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 17 49MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 17 60TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            W2TOLL         2Y 0O 18  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 18 20TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 18 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 18 40TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 18 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 18 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
EV5  A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 DIV0067 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDESE
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A  27                                  CF05(05 'Bekreft om slett')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                  1  2MSGCON(020 DIV3286 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2  8TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  2 13TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 22MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 26TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 33MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 38TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  3  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 17MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  3 20
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 27MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A            HETLE          3A  O  3 33
     A                                      COLOR(WHT)
     A                                  3 37MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLL          5A  O  3 44
     A                                      COLOR(WHT)
     A                                  3 50MSGCON(008 DIV0620 *LIBL/SYMSGF)
     A            HETLKU         1A  O  3 59
     A                                      COLOR(WHT)
     A                                  3 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
     A*           HERFA         15A  O  3 66TEXT('Referanse Agent')
     A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  4  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  4 14'-'
     A            HESDT          5A  O  4 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  4 23MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  4 32TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  4 37DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4 46MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  4 51TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  4 57MSGCON(003 DIV0786 *LIBL/SYMSGF)
     A            HESDL         20A  O  4 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  5 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            KFSNA2        18A  O  5 63COLOR(WHT)
     A                                  6  2MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            HELB           5A  O  6  8TEXT('LOKAL BÅT')
     A                                      COLOR(WHT)
     A                                  8  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  8  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  8 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  8 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  8 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  8 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  8 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  8 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  8 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  9  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  9 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O 10  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O 10 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                 11  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O 11  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 11 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O 11 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 11 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O 11 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                 11 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O 11 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                 11 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O 11 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O 11 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 12  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 12 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 13  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 13 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(078 DIV3282 *LIBL/SYMSGF)
     A            HEOT           2A  O 16  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 16  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 16  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 16 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 16 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 16 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 16 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 17  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 17 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 18  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 18 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 18 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 18 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 18 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 18 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 18 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 18 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 19  2MSGCON(021 DIV3812 *LIBL/SYMSGF)
     A                                 19 27MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 19 38TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 19 49MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 19 60TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 20  6TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 20 14TEXT('Printerkode-6')
     A                                      COLOR(WHT)
     A            HEPK7          1A  O 20 20TEXT('Printerkode-7')
     A                                      COLOR(WHT)
     A                                 20 27MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 37TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 48MSGCON(009 DIV0111 *LIBL/SYMSGF)
EV5  A            HEDTMO         8A  O 20 58TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 DIV0067 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
