********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
      *01  PTF10 FLYTTET REF.: TIL HØYRE LINJE 23 + 24
      *02  PTF10 ID ENDRET
      *02  PTF10 AREF
      *03  PTF10 FLYTETT IDNR
********************************************************************
     A          R PRT2
     A     46     ZAWBI1        17      5  6CHRSIZ(1 2)
     A  77 46     ZAWBI2        15      5 57CHRSIZ(1 2)
     A N77 46     ZAWBI3        12      5 57CHRSIZ(1 2)
     A    N46     XAWBI1        17      5  6FNTCHRSET(C0S0OB10 T1D0BASE)
     A  77N46     XAWBI2        15      5 57FNTCHRSET(C0S0OB10 T1D0BASE)
     A N77N46     XAWBI3        12      5 57FNTCHRSET(C0S0OB10 T1D0BASE)
     A     46     ZLT1          22      7 59CHRSIZ(1 2)
SXX  A*   N46     KOFMNV        20      7 59FNTCHRSET(C0S0OB10 T1D0BASE)
EXX  A    N46     ELT1          22      7 59FNTCHRSET(C0S0OB10 T1D0BASE)
     A            ELT2          22      9 52
     A  88                              9  6'Phone:'
     A  88        DFTLFS        15      9 12
     A            HENAS         30     10  6
     A            ELT3          35     10 46
     A            HEADS1        30     11  6
     A            ELT4          35     11 46
     A            HEADS2        30     12  6
     A            ELT5          35     12 46
     A            HEADS3        30     13  6
     A            ELT6          35     13 46
     A            SELAND        30     14  6
     A  89                             16  6'Phone:'
     A  89        DFTLFK        15     16 12
     A            HENAK         30     17  6
     A            HEADK1        30     18  6
     A            HEADK2        30     19  6
     A            HEADK3        30     20  6
     A            DQAD4         30     21  6
     A            KJLAND        30     22  6
S01  A*                                23 45'REF:'
S01  A*           DFAVD          4  0  23 49
S01  A*                                23 53'/'
S01  A*           DFOPD          7  0  23 54
S01  A*                                23 61'/'
S01  A*           DFLOP          3  0  23 62
S01  A*                                23 65'/'
S01  A*           HEPRO          8  0  23 66
S01  A*N77                             23 74'/'
S01  A*N77        AREF06         6     23 75
N01  A                                 23 52'REF:'
N01  A            DFAVD          4  0  23 56
N01  A                                 23 60'/'
N01  A            DFOPD          7  0  23 61
N01  A                                 23 68'/'
N01  A            DFLOP          3  0  23 69
N01  A                                 23 72'/'
S04  A*N77        AREF06         6     24 74
N04  A N77        AREF06         6     23 74
S03  A*           HEPRO          8  0  24 55
     A            KNAVN         30     24  6
     A            DFINF1        35     24 42
S03  A*N77                             24 63'/'
S03  A*N77        AREF06         6     24 64
S02  A*                                25 22'ID:'
S02  A*           KSIDNR        20     25 25
S03  A*           KSIDNR        20     25 22
N03  A                                 25  6'ID:'
S07  A*           KSIDNR        20     25 10
S07  A       N55  KSIDNR        20     25 10
S07  A        55  KSIDCO        20     25 10
     A            DFINF2        35     25 42
     A            XFRAFL        30     26  6
     A            DQINF3        35     26 42
     A            DQINF4        35     27 42
     A            DQINF5        35     28 42
S07  A*           XIAT1          2  0  29  6
S07  A*                                29  8'-'
S07  A*           XIAT2          1  0  29  9
S07  A*                                29 10'-'
S07  A*           XIAT3          4  0  29 11
S07  A*           XIAT4          5     29 15
N07  A       N55  XIAT1          2  0  29  6
N07  A       N55                       29  8'-'
N07  A       N55  XIAT2          1  0  29  9
N07  A       N55                       29 10'-'
N07  A       N55  XIAT3          4  0  29 11
N07  A       N55  XIAT4          5     29 15
N07  A        55  XIATCO        50     29  6
     A            XKFSAC        14     29 28
     A            DQINF6        35     29 42
     A            DQINF7        35     30 42
     A            DQINF8        35     31 42
     A            ZFRAFL        30     32  6
     A            DFROA1         3     32 30
     A                                 32 33'/'
     A            DFROA2         3     32 34
     A                                 32 37'/'
     A            DFROA3         3     32 38
     A            DQINF9        35     32 42
     A            ZFROA1         3     35  6
     A N79        ELT117        17     35 10
     A  79        XROB12         2     35 13
     A            ZFROA2         3     35 27
     A            XROB22         2     35 31
     A            ZFROA3         3     35 34
     A            XROB32         2     35 38
     A            DFVAL          3     35 42
     A N70                             35 48'P   P'
     A  70                             35 50'C   C'
     A            DFDVCA         7     35 61
     A            DFDVCU         7     35 71
     A            WW2NVN        17     37  6
     A            DFROB1         7     37 23
     A            DFROC1         2  0  37 30EDTCDE(Z)
     A            DFROB2         7     37 32
     A            DFROC2         2  0  37 39EDTCDE(Z)
     A            DFBELF         7  0  37 45EDTCDE(Z)
     A  40                             37 47'NIL'
     A            DFROB3         7     38 32
     A            DFROC3         2  0  38 39EDTCDE(Z)
     A            DFINFA        71     40  6
     A            DFINFB        71     41  6
     A            WPINFC        61     42  6
     A            WPINFD        61     43  6
     A            DFTOLS         2     43 72
     A          R PRTDE0                    SKIPA(47)
     A                                     1'.'
     A          R PRTDE2                    SPACEA(1)
     A  30        KA1CXN         4  0      4EDTCDE(Z)
     A N30        KACXN          4         4
     A            VECXN          7  1      8EDTCDE(4)
     A            XKILOA         1        16
     A            RACXN          1        18
     A            ITCXN          4        21
     A            FVCXN          7  1     26EDTCDE(4)
     A N67        PRCXN          8  2     34EDTCDE(4)
     A  67                                35'AS AGREED'
     A N67        BECXN         10  2     45EDTCDE(4)
     A  67                                45'AS AGREED'
     A            VACXN         25        57
     A          R PRIO2                     SPACEA(1)
     A                                    27'PRIORITY CARGO'
     A          R PRIO3                     SPACEA(1)
     A                                    27'EUROPEXPRESS'
     A          R PRTDE3                    SPACEA(1)
     A            TX25          25        57
     A          R PRTFRT                    SPACEA(1)
     A            FRTTXT        70         6
     A            TX25          25        57
      *
      * SKRIVES VED INDIKATOR N70  =  PP-FORSENDELSE
      *      OG VED INDIKATOR N67  =  IKKE AS AGREED
      *
     A          R PRTTO2
     A            DFNTT          4  0  64  4EDTCDE(Z)
     A            DFVKTT         7  1  64  8EDTCDE(4)
     A            DFBLT          9  2  64 44EDTCDE(J)
N15  A            TX25          25     64 57
     A            DFFTO         41     66 37
     A N28        ZFBLT          9  2  67  6EDTCDE(J)
     A            DFFT          41     67 37
N10  A            DFFT3         41     68 37
     A  36        DFBLA          9  2  69  6EDTCDE(J)
     A            FN01          10  2  69 38EDTCDE(M)
     A            FK01           7     69 34
     A            FN02          10  2  69 53EDTCDE(M)
     A            FK02           7     69 49
     A            FN03          10  2  69 68EDTCDE(M)
     A            FK03           7     69 64
     A  61                             70 37'STC....'
     A  61        XMOMS          9  2  70 43EDTCDE(M)
     A            FN04          10  2  71 38EDTCDE(M)
     A            FK04           7     71 34
     A            FN05          10  2  71 53EDTCDE(M)
     A            FK05           7     71 49
     A            FN06          10  2  71 68EDTCDE(M)
     A            FK06           7     71 64
     A  61        YMOMS          9  2  72  6EDTCDE(J)
     A            FN07          10  2  72 39EDTCDE(M)
     A            FK07           7     72 37
     A            FN08          10  2  72 53EDTCDE(M)
     A            FK08           7     72 51
     A            FN09          10  2  72 67EDTCDE(M)
     A            FK09           7     72 64
     A  38        XTDUA          9  2  75  6EDTCDE(J)
     A  39        DFBLDC         9  2  78  6EDTCDE(J)
     A  35N37     XCACOL         9  2  78 20EDTCDE(J)
     A            FTXT2         12     78 36
     A            HENAS         30     78 49
     A            KNAVN         30     79 36
     A            LIN01         44     82 36
     A            XBELTO         9  2  83  6EDTCDE(J)
     A  35        YCACOL         9  2  83 20EDTCDE(J)
     A            LIN02         44     83 36
     A                                 84 36'  .  .  '
     A            UDT1           2  0  84 36
     A            UDT2           2  0  84 39
     A            UDT3           2  0  84 42
     A            XFRAF2        15     84 46
     A            KOSFNV        16     84 62
     A  77 46     ZAWBI2        15     89 57CHRSIZ(1 2)
     A N77 46     ZAWBI3        12     89 57CHRSIZ(1 2)
     A  77N46     XAWBI2        15     90 57FNTCHRSET(C0S0OB10 T1D0BASE)
     A N77N46     XAWBI3        12     90 57FNTCHRSET(C0S0OB10 T1D0BASE)
      *
      * SKRIVES VED INDIKATOR N70  =  PP-FORSENDELSE
      *      OG VED INDIKATOR  67  =  AS AGREED
      *
     A          R ARTTO2
     A            DFNTT          4  0  64  4EDTCDE(Z)
     A            DFVKTT         7  1  64  9EDTCDE(4)
     A                                 64 44'AS AGREED'
N15  A            TX25          25     64 57
     A N28                             67  6'AS AGREED'
     A  39                             78  6'AS AGREED'
     A  35                             78 20'AS AGREED'
     A            FTXT2         12     78 36
     A            HENAS         30     78 49
     A            KNAVN         30     79 36
     A            LIN01         44     82 36
     A                                 83  6'AS AGREED'
     A  35                             83 20'AS AGREED'
     A            LIN02         44     83 36
     A                                 84 36'  .  .  '
     A            UDT1           2  0  84 36
     A            UDT2           2  0  84 39
     A            UDT3           2  0  84 42
     A            XFRAF2        15     84 46
     A            KOSFNV        16     84 62
     A  77 46     ZAWBI2        15     89 57CHRSIZ(1 2)
     A N77 46     ZAWBI3        12     89 57CHRSIZ(1 2)
     A  77N46     XAWBI2        15     90 57FNTCHRSET(C0S0OB10 T1D0BASE)
     A N77N46     XAWBI3        12     90 57FNTCHRSET(C0S0OB10 T1D0BASE)
      *
      * SKRIVES VED INDIKATOR  70  =  CC-FORSENDELSE
      *      OG VED INDIKATOR N67  =  IKKE AS AGREED
      *
     A          R PRTTO3
     A            DFNTT          4  0  64  4EDTCDE(Z)
     A            DFVKTT         7  1  64  8EDTCDE(4)
     A            DFBLT          9  2  64 44EDTCDE(J)
N15  A            TX25          25     64 57
     A            DFFTO         41     66 37
     A            ZFBLT          9  2  67 20EDTCDE(J)
     A            DFFT          41     67 37
N10  A            DFFT3         41     68 37
     A  36        DFBLA          9  2  69 20EDTCDE(J)
     A            FN01          10  2  69 38EDTCDE(M)
     A            FK01           7     69 34
     A            FN02          10  2  69 53EDTCDE(M)
     A            FK02           7     69 49
     A            FN03          10  2  69 68EDTCDE(M)
     A            FK03           7     69 64
     A  61                             70 37'STC....'
     A  61        XMOMS          9  2  70 43EDTCDE(M)
     A            FN04          10  2  71 38EDTCDE(M)
     A            FK04           7     71 34
     A            FN05          10  2  71 53EDTCDE(M)
     A            FK05           7     71 49
     A            FN06          10  2  71 68EDTCDE(M)
     A            FK06           7     71 64
     A  61        YMOMS          9  2  72 20EDTCDE(J)
     A            FN07          10  2  72 39EDTCDE(M)
     A            FK07           7     72 37
     A            FN08          10  2  72 53EDTCDE(M)
     A            FK08           7     72 51
     A            FN09          10  2  72 67EDTCDE(M)
     A            FK09           7     72 64
     A  38N37     XTDUA          9  2  75 20EDTCDE(J)
     A  35        XCAPRE         9  2  78  6EDTCDE(J)
     A  39        DFBLDC         9  2  78 20EDTCDE(J)
     A            FTXT2         12     78 36
     A            HENAS         30     78 49
     A            KNAVN         30     79 36
     A            LIN01         44     82 36
     A  35        YCAPRE         9  2  83  6EDTCDE(J)
     A            XBELTO         9  2  83 20EDTCDE(J)
     A            LIN02         44     83 36
     A                                 84 36'  .  .  '
     A            UDT1           2  0  84 36
     A            UDT2           2  0  84 39
     A            UDT3           2  0  84 42
     A            XFRAF2        15     84 46
     A            KOSFNV        16     84 62
     A  77 46     ZAWBI2        15     89 57CHRSIZ(1 2)
     A N77 46     ZAWBI3        12     89 57CHRSIZ(1 2)
     A  77N46     XAWBI2        15     90 57FNTCHRSET(C0S0OB10 T1D0BASE)
     A N77N46     XAWBI3        12     90 57FNTCHRSET(C0S0OB10 T1D0BASE)
      *
      * SKRIVES VED INDIKATOR  70  =  CC-FORSENDELSE
      *      OG VED INDIKATOR  67  =  AS AGREED
      *
     A          R ARTTO3
     A            DFNTT          4  0  64  4EDTCDE(Z)
     A            DFVKTT         7  1  64  8EDTCDE(4)
     A                                 64 44'AS AGREED'
N15  A            TX25          25     64 57
     A                                 67 20'AS AGREED'
     A  35                             78  6'AS AGREED'
     A  39                             78 20'AS AGREED'
     A            FTXT2         12     78 36
     A            HENAS         30     78 49
     A            KNAVN         30     79 36
     A            LIN01         44     82 36
     A  35                             83  6'AS AGREED'
     A                                 83 20'AS AGREED'
     A            LIN02         44     83 36
     A                                 84 36'  .  .  '
     A            UDT1           2  0  84 36
     A            UDT2           2  0  84 39
     A            UDT3           2  0  84 42
     A            XFRAF2        15     84 46
     A            KOSFNV        16     84 62
     A  77 46     ZAWBI2        15     89 57CHRSIZ(1 2)
     A N77 46     ZAWBI3        12     89 57CHRSIZ(1 2)
     A  77N46     XAWBI2        15     90 57FNTCHRSET(C0S0OB10 T1D0BASE)
     A N77N46     XAWBI3        12     90 57FNTCHRSET(C0S0OB10 T1D0BASE)
     A          R OVL
     A                                      ENDPAGE
S01  A*                                     OVERLAY(&AW01 0.42 0,20)
N01  A                                      OVERLAY(&AW01 0.42 0.20)
     A            AW01           8A  P
