********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr *Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P8068 * 01 TH  PTF8 NY HELPFUNKSJON  KUN DDS
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
S01  A*                                     HLPDOC('SYEF2401' 'SYEF24 ' 'SY400-
S01  A*                                     LO/MAINT')
N01  A                                      HLPPNLGRP(HLPSCR SYEF24PNL)
N01  A                                      HLPTITLE('VEDLIKEHOLD AV DIVERSE GE-
N01  A                                      BYR (FLY)')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A                                      CF12(12 'Avbryt')
     A                                  1  2'SYSPED/SYEF24'
     A                                      COLOR(BLU)
     A            MSG001        50A  O  1 19MSGID(DIV 1429 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A            MSG003        30A  O  6  2MSGID(DIV 1430 SYMSGF)
     A                                      COLOR(GRN)
     A            MSG004        16A  O  8  2MSGID(DIV 1431 SYMSGF)
     A            WSSBL1         5Y 0B  8 21TEXT('BELØP-1')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            MSG005        17A  O  8 30MSGID(DIV 1432 SYMSGF)
     A            WSSBL2         5Y 0B  8 50TEXT('BELØP-2')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            MSG006        16A  O 10  2MSGID(DIV 1433 SYMSGF)
     A            WSSPRO         4Y 2B 10 21TEXT('PROSENT')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            MSG008        18A  O 10 30MSGID(DIV 1434 SYMSGF)
     A            WSSBL3         5Y 0B 10 50TEXT('BELØP-3')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            MSG009        10   O 13  2MSGID(DIV 1435 SYMSGF)
     A                                      COLOR(GRN)
     A            MSG010        13A  O 14  2MSGID(DIV 1436 SYMSGF)
     A            WSSBL4         5Y 0B 14 21TEXT('BELØP-4')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            MSG012        10A  O 16  2MSGID(DIV 1437 SYMSGF)
     A                                      COLOR(GRN)
     A            MSG011        13A  O 17  2MSGID(DIV 1436 SYMSGF)
     A            WSSBL5         5Y 0B 17 21TEXT('BELØP-5')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            MSG002        18A  O 23  2MSGID(DIV 0024 SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
