     A          R BOX
N39  A                                      BOX(1.9  0.18 2.7 3.9 0.02)
N39  A                                      BOX(2.7  0.28 3.5  3.9 0.01)
N39  A                                      BOX(3.5   3.08 4.5 3.9 0.01)
N39  A                                      LINE(2.7 1.8 1.8 *VRT 0.01)
