     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYFA78PNL)
     A                                      HLPTITLE('VEDLIKEHOLD AV FUEL SURCH-
     A                                      ARGE')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                  1  2'SYSPED/SYEF19'
     A                                      COLOR(BLU)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 69TIME
     A                                      COLOR(BLU)
     A                                  8  2MSGCON(015 SHU1173 *LIBL/SYMSGF)
     A            WSSONE         2A  B  8 19VALUES('F1' 'F2' 'F3')
     A                                  9 27'F1 = Sone 1'
     A                                 10 27'F2 = Sone 2'
     A                                 11 27'F3 = Sone 3'
     A                                 14  2'Tast landkode:'
     A            WSLAND         2A  B 14 19
     A            MSG506        18A  O 23  2MSGID(DIV 0020 SYMSGF)
     A                                      COLOR(BLU)
     A  98        MSG510        78A  O 24  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                             24 40'(C) COPYRIGHT  SYSTEMA A/S  2000  '
     A                                      COLOR(WHT)
     A                                  1 20'Innlegge soner på land'
     A                                      COLOR(WHT)
