     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/HEADF)
     A                                      CF03(03 'Avslutt')
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A                                  1  2'SYSPED/SYEF54'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(055 DIV2000 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  3 67TIME
     A                                      COLOR(BLU)
     A                                 11 15MSGCON(014 DIV0049 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B 11 39DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A                                 13 15MSGCON(022 DIV2001 *LIBL/SYMSGF)
     A            WSSD           3A  B 13 39DSPATR(UL)
     A                                      COLOR(YLW)
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A            WSLNR          3Y 0B 13 43
     A  98                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 15 15MSGCON(022 DIV2002 *LIBL/SYMSGF)
     A            WSSD2          3A  B 15 39DSPATR(UL)
     A                                      COLOR(YLW)
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A            WSLNR2         3Y 0B 15 43
     A  96                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
