     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(12 'Annuller')
     A          R BILDE01
     A                                      OVERLAY
     A                                  1  3'SYSPED/SYET01'
     A                                      COLOR(BLU)
     A                                  1 30'Utskrift etiketter           '
     A                                      COLOR(WHT)
     A                                  1 69DATE
     A                                      EDTCDE(Y)
     A                                  2 30'Med 6 linjer pr etikett           -
     A                                       '
     A                                      COLOR(WHT)
     A                                  2 69TIME
     A                                 10  6'Kunder med omsetning mer enn kr:  '
     A            KJOP          11Y 2B 10 43DSPATR(UL)
     A                                      EDTCDE(J)
     A                                 23  2'F3=start utskrift              '
     A                                      COLOR(BLU)
     A N51                             23 40'F12=Avbryt'
     A                                      COLOR(BLU)
