     A*%%TS  SD  20140613  134943  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A          R BILDE01
     A  29                                  CF01(01 'Bytt avdelinger')
     A  29                                  CF02(02 'Gå til valgbilde')
     A                                      CF03(03 'Avslutt')
     A N29                                  CF04(04 'Søke kundenr.')
     A N29                                  CF05(05 'Videre')
     A  29                                  CF06(06 'TIL FAKTURA')
     A N29                                  CF16(16 'Neste pos.')
     A                                      CF12(12 'Avbryt')
     A  28                                  ALARM
     A                                  1  6MSGCON(50 DIV0642 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 58MSGCON(22 DIV0047 SYMSGF)
     A                                      COLOR(TRQ)
     A                                  2  6MSGCON(12 DIV0050 SYMSGF)
     A            HEAVD          4Y 0O  2 19COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  2 31MSGCON(12 DIV0148 SYMSGF)
     A            HEOPD          7Y 0O  2 44COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  2 61MSGCON(12 DIV0641 SYMSGF)
     A            HESG           3A  O  2 74COLOR(BLU)
     A                                  4  2MSGCON(8 DIV0638 SYMSGF)
     A            HEKNS          8Y 0O  4 11DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAS         30A  O  4 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  4 51DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(8 DIV0639 SYMSGF)
     A            WSKNM          8Y 0B  5 11DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAM         30A  B  5 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSADM1        30A  B  5 51DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSADM2        30A  B  6 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSADM3        30A  B  6 51DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  7  2MSGCON(12 DIV0643 SYMSGF)
     A            HENAK         30A  O  7 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK1        30A  O  7 51DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(7 DIV0644 SYMSGF)
     A            WSFORT        16A  B  9 10DSPATR(UL)
     A  27                                  DSPATR(PC)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  9 28MSGCON(9 DIV0645 SYMSGF)
     A            WSSD          16A  B  9 38DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  9 56MSGCON(8 DIV0646 SYMSGF)
     A            WSBÅTN        16A  B  9 65DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 10  2MSGCON(7 DIV0647 SYMSGF)
     A            WSSDLA        16A  B 10 10DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 10 28MSGCON(9 DIV0648 SYMSGF)
     A            WSSDLO        16A  B 10 38DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 10 56MSGCON(8 DIV0649 SYMSGF)
     A            WSSDM         16A  B 10 65DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 11  2MSGCON(78 DIV0650 SYMSGF)
     A                                      DSPATR(UL)
     A            WSGM1         15A  B 12  2DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNT1          7Y 0B 12 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS1         25A  B 12 31DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSVKT1         9Y 0B 12 59DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM31          4Y 2B 12 69DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSGM2         15A  B 13  2DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNT2          7Y 0B 13 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS2         25A  B 13 31DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSVKT2         9Y 0B 13 59DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM32          4Y 2B 13 69DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSGM3         15A  B 14  2DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNT3          7Y 0B 14 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS3         25A  B 14 31DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSVKT3         9Y 0B 14 59DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM33          4Y 2B 14 69DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSGM4         15A  B 15  2DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNT4          7Y 0B 15 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS4         25A  B 15 31DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSVKT4         9Y 0B 15 59DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM34          4Y 2B 15 69DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSGM5         15A  B 16  2DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNT5          7Y 0B 16 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS5         25A  B 16 31DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSVKT5         9Y 0B 16 59DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM35          4Y 2B 16 69DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSGM6         15A  B 17  2DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNT6          7Y 0B 17 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS6         25A  B 17 31DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSVKT6         9Y 0B 17 59DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM36          4Y 2B 17 69DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSGM7         15A  B 18  2DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNT7          7Y 0B 18 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS7         25A  B 18 31DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSVKT7         9Y 0B 18 59DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM37          4Y 2B 18 69DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSGM8         15A  B 19  2DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSNT8          7Y 0B 19 20DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS8         25A  B 19 31DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSVKT8         9Y 0B 19 59DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM38          4Y 2B 19 69DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 21  2MSGCON(12 DIV0651 SYMSGF)
     A            WSKDDP         1A  B 21 15DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 21 17MSGCON(9 DIV0652 SYMSGF)
     A            WSSDDT        27A  B 21 27DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 21 55MSGCON(9 DIV0653 SYMSGF)
     A            WSABSL        15A  B 21 65DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 22  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A N29                             22 22MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A N29                             23  2MSGCON(18 DIV0636 SYMSGF)
     A                                      COLOR(BLU)
     A N29                             23 22MSGCON(18 DIV0030 SYMSGF)
     A                                      COLOR(BLU)
     A N29                             23 42MSGCON(18 DIV0031 SYMSGF)
     A                                      COLOR(BLU)
     A  29                             22 22MSGCON(18 DIV0114 SYMSGF)
     A                                      COLOR(BLU)
     A  29                             23  2MSGCON(18 DIV0067 SYMSGF)
     A                                      COLOR(BLU)
     A  29                             23 22MSGCON(18 DIV0113 SYMSGF)
     A                                      COLOR(BLU)
     A  29                             23 42MSGCON(18 DIV0177 SYMSGF)
     A                                      COLOR(BLU)
     A            UMSG          62A  O 24  6COLOR(WHT)
