     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                  1 19'D O K U M E N T U T S K R I F T'
     A                                      COLOR(WHT)
     A                                  2 19'C M R   F R A K T B R E V'
     A                                      DSPATR(HI)
     A                                  2 57'Copyright SYSTEMA A/S'
     A                                      COLOR(TRQ)
     A                                  3 19'K O P I U T S K R I F T'
     A                                      DSPATR(HI)
     A                                  3 57'Telefon:  02-33 10 86'
     A                                      COLOR(TRQ)
     A                                  4 19'Tast inn kostnadssted:'
     A            WSAVD          4Y 0B  4 43DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  99                                  ERRMSG('Tastet kostnadssted er ikke-
     A                                       registrert.' 99)
     A                                  6 19'Tast inn signatur:'
     A            WSSG           3A  B  6 43COLOR(YLW)
     A  98                                  ERRMSG('Tastet signatur er ikke reg-
     A                                      istrert.' 98)
     A                                      DSPATR(UL)
     A                                  9 19'Skal jobbkø benyttes:'
     A            WSJBK          1A  B  9 43DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                      COLOR(YLW)
     A                                  9 47'(J = ja)'
     A                                 11 19'Avvikende printer:'
     A            WSPRT         10A  B 11 43DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14 19'Tast de oppdragnummer som ønskes s-
     A                                      krevet'
     A                                      DSPATR(UL)
     A            KOPI1          7Y 0B 16 19
     A                                      EDTCDE(4)
     A            KOPI2          7Y 0B 16 28
     A                                      EDTCDE(4)
     A            KOPI3          7Y 0B 16 37
     A                                      EDTCDE(4)
     A            KOPI4          7Y 0B 16 46
     A                                      EDTCDE(4)
     A            KOPI5          7Y 0B 18 19
     A                                      EDTCDE(4)
     A            KOPI6          7Y 0B 18 28
     A                                      EDTCDE(4)
     A            KOPI7          7Y 0B 18 37
     A                                      EDTCDE(4)
     A            KOPI8          7Y 0B 18 46
     A                                      EDTCDE(4)
     A                                 23 59'F3 = Avslutt'
     A                                      COLOR(BLU)
