     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A            MSG101        22A  O  2 58MSGID(DIV 0047 SYMSGF)
     A                                      COLOR(TRQ)
     A            MSG102        33A  O  4 22MSGID(DIV 0222 SYMSGF)
     A                                      COLOR(WHT)
     A N27        MSG103        33A  O  5 22MSGID(DIV 0715 SYMSGF)
     A                                      COLOR(WHT)
     A  27        MSG104        33A  O  5 22MSGID(DIV 0717 SYMSGF)
     A                                      COLOR(WHT)
     A            MSG105        24A  O  8 22MSGID(DIV 0225 SYMSGF)
     A            WSAVD          4Y 0B  8 48DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            MSG106        24A  O 10 22MSGID(DIV 0226 SYMSGF)
     A            WSSG           3A  B 10 48DSPATR(UL)
     A  98                                  DSPATR(PC)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  27        MSG107        24A  O 12 22MSGID(DIV 0718 SYMSGF)
     A  27                             13 30'01'
     A  27        WSOP1          7Y 0B 13 33DSPATR(UL)
     A N30
     AO 97                                  DSPATR(PC)
     A  97                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  27                             13 40'02'
     A  27        WSOP2          7Y 0B 13 43DSPATR(UL)
     A  96                                  DSPATR(PC)
     A  96                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  27                             13 50'03'
     A  27        WSOP3          7Y 0B 13 53DSPATR(UL)
     A  95                                  DSPATR(PC)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  27                             13 60'04'
     A  27        WSOP4          7Y 0B 13 63DSPATR(UL)
     A  94                                  DSPATR(PC)
     A  94                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  27                             14 30'05'
     A  27        WSOP5          7Y 0B 14 33DSPATR(UL)
     A  93                                  DSPATR(PC)
     A  93                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  27                             14 40'06'
     A  27        WSOP6          7Y 0B 14 43DSPATR(UL)
     A  92                                  DSPATR(PC)
     A  92                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  27                             14 50'07'
     A  27        WSOP7          7Y 0B 14 53DSPATR(UL)
     A  91                                  DSPATR(PC)
     A  91                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  27                             14 60'08'
     A  27        WSOP8          7Y 0B 14 63DSPATR(UL)
     A  90                                  DSPATR(PC)
     A  90                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            MSG108        24A  O 17 22MSGID(DIV 0716 SYMSGF)
     A            WSJBK          1A  B 17 48DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N')
     A                                 17 52'(J/N)'
     A            MSG555        24A  O 19 22MSGID(DIV 2120 SYMSGF)
     A            WSANT          3Y 0B 19 48COLOR(YLW)
     A                                      EDTCDE(4)
     A            MSG109        24A  O 21 22MSGID(DIV 0227 SYMSGF)
     A            WSPRT         10A  B 21 48DSPATR(UL)
     A                                      COLOR(YLW)
     A            MSG110        18A  O 23 22MSGID(DIV 0020 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
