*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P06XXA* 01 YBC PTF6 FETESKRIFT PÅ FLYFRAKTBREV
P0601A* 02 JOV PTF6 F4 / FRIT.KODE OGSÅ FOR F.BREV
*****A**************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('VEDLAVD2' 'HELPNU' 'HLP400')
     A                                      ALTHELP
     A                                      HELP
     A          R CPYWND
     A                                      WINDOW(*DFT 10 57 *NOMSGLIN)
     A                                      CF12(12 'AVBRYT')
     A                                  1  2'SYFA28'
     A                                      COLOR(BLU)
     A                                  1 13MSGCON(035 JOV1376 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(050 JOV1377 *LIBL/SYMSGF)
     A                                  4  2MSGCON(050 JOV1378 *LIBL/SYMSGF)
     A                                  6  2MSGCON(030 JOV1382 *LIBL/SYMSGF)
     A                                  7  2MSGCON(020 JOV1380 *LIBL/SYMSGF)
     A            WSAVDF         4Y 0B  7 23EDTCDE(4)
     A                                  8  2MSGCON(020 JOV1381 *LIBL/SYMSGF)
     A            WSAVDT         4Y 0B  8 23EDTCDE(4)
     A                                 10  2'Enter=Utfør valg'
     A                                      COLOR(BLU)
     A                                 10 34MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
