     A*%%TS  SD  20160907  064343  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYFA09PNL)
     A                                      HLPTITLE('VEDL. AV INNHOLD AV GEBYR-
     A                                      AVTALE (KUNDE)')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A*%%TS  SD  20160907  064343  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'PROMT')
     A                                      CF12(12 'CANCEL')
     A          H                           HLPPNLGRP(SYFA09020 SYFA09PNL)
     A                                      HLPARA(01 001 04 080)
     A          H                           HLPPNLGRP(SYFA09025 SYFA09PNL)
     A                                      HLPARA(05 001 05 080)
     A          H                           HLPPNLGRP(SYFA09030 SYFA09PNL)
     A                                      HLPARA(06 001 07 080)
     A          H                           HLPPNLGRP(SYFA09035 SYFA09PNL)
     A                                      HLPARA(08 001 08 080)
     A          H                           HLPPNLGRP(SYFA09040 SYFA09PNL)
     A                                      HLPARA(09 001 09 080)
     A          H                           HLPPNLGRP(SYFA09045 SYFA09PNL)
     A                                      HLPARA(10 001 10 080)
     A          H                           HLPPNLGRP(SYFA09050 SYFA09PNL)
     A                                      HLPARA(11 001 12 080)
     A          H                           HLPPNLGRP(SYFA09055 SYFA09PNL)
     A                                      HLPARA(13 001 14 080)
     A          H                           HLPPNLGRP(SYFA09060 SYFA09PNL)
     A                                      HLPARA(15 001 16 132)
     A          H                           HLPPNLGRP(SYFA09065 SYFA09PNL)
     A                                      HLPARA(17 001 19 132)
     A          H                           HLPPNLGRP(SYFA09070 SYFA09PNL)
     A                                      HLPARA(20 001 21 132)
     A          H                           HLPPNLGRP(SYFA09075 SYFA09PNL)
     A                                      HLPARA(22 001 23 132)
     A          H                           HLPPNLGRP(SYFA09076 SYFA09PNL)
     A                                      HLPARA(24 001 24 132)
     A          H                           HLPPNLGRP(SYFA09999 SYFA09PNL)
     A                                      HLPARA(25 001 25 132)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYFA09A'
     A                                      COLOR(BLU)
     A  31                              1 20MSGCON(030 DIV1183 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  32                              1 20MSGCON(030 SHU1463 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(015 DIV1184 *LIBL/SYMSGF)
     A            WSKNR          8Y 0O  2 18DSPATR(UL)
     A                                      EDTCDE(4)
     A            KNAVN         30A  O  2 27
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(015 DIV1185 *LIBL/SYMSGF)
     A            WSAVTN         1A  O  3 18DSPATR(UL)
     A                                  4  2MSGCON(012 DIV1189 *LIBL/SYMSGF)
     A            WSGEBY         3A  B  4 15DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            KGENOT        20A  O  4 23DSPATR(UL)
     A                                  5  2MSGCON(012 DIV1190 *LIBL/SYMSGF)
     A            WSAVTT         1A  B  5 15DSPATR(UL)
     A  40
     AO 98                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'T' 'B' 'P' 'X' 'Y' 'G' -
     A                                      'H')
     A                                  5 23'(T,B,P,X,Y,G)'
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(012 DIV1191 *LIBL/SYMSGF)
     A            WSTNR          1A  B  6 15DSPATR(UL)
     A  97                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                  6 23MSGCON(015 DIV1192 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  7  2MSGCON(012 DIV1193 *LIBL/SYMSGF)
     A            WSMVA          1A  B  7 15DSPATR(UL)
     A  96                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N' 'I')
     A                                  7 23'(J/N)'
     A                                      COLOR(BLU)
     A                                  7 29MSGCON(020 JOV1621 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  8  2MSGCON(012 DIV1194 *LIBL/SYMSGF)
     A            WSINT          5Y 0B  8 15DSPATR(UL)
     A  60                                  DSPATR(RI)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9  2MSGCON(012 DIV1195 *LIBL/SYMSGF)
     A            WSBELØ        10Y 3B  9 15DSPATR(UL)
     A  59                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A                                  9 30MSGCON(030 DIV1196 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 10  2MSGCON(012 DIV1197 *LIBL/SYMSGF)
     A            WSPPR          5Y 0B 10 15DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 10 30MSGCON(017 DIV1198 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            WSKOLL         1A  B 10 61DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X' 'B' 'L' 'D' '0' '1' -
     A                                      '2' '3' '4' '5' '6' '7' '8' '9' 'V'-
     A                                       'M' 'F' 'T' 'E' 'I')
     A                                 11  2MSGCON(018 DIV1200 *LIBL/SYMSGF)
     A            WSTEGN         1A  B 11 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 25MSGCON(015 DIV1201 *LIBL/SYMSGF)
     A            WSJUST        10Y 3B 11 41DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 11 54MSGCON(006 DIV1202 *LIBL/SYMSGF)
     A            WSFVAL         3A  B 11 61DSPATR(UL)
     A  58                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(015 SHU0298 *LIBL/SYMSGF)
     A            WSSAMM         1A  B 12 21COLOR(YLW)
     A                                 12 25MSGCON(040 SHU0299 *LIBL/SYMSGF)
     A                                 13  2MSGCON(020 DIV1172 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 14  2MSGCON(015 DIV1173 *LIBL/SYMSGF)
     A            WSDT           6Y 0B 14 19DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 14 31MSGCON(025 DIV1174 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 15  2MSGCON(060 DIV1175 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 16  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WSURIO         1A  B 16  7DSPATR(UL)
     A  94                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O')
     A                                 16  9MSGCON(010 DIV1177 *LIBL/SYMSGF)
     A            WSUR01         1A  B 16 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR02         1A  B 16 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR03         1A  B 16 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR04         1A  B 16 38DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR05         1A  B 16 44DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR06         1A  B 16 50DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR07         1A  B 16 56DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR08         1A  B 16 62DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR09         1A  B 16 68DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSUR10         1A  B 16 74DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WSFRIO         1A  B 17  7DSPATR(UL)
     A  57                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O')
     A                                 17  9MSGCON(010 DIV1203 *LIBL/SYMSGF)
     A            WSFR01         3A  B 17 20DSPATR(UL)
     A  56                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR02         3A  B 17 26DSPATR(UL)
     A  55                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR03         3A  B 17 32DSPATR(UL)
     A  54                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR04         3A  B 17 38DSPATR(UL)
     A  53                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR05         3A  B 17 44DSPATR(UL)
     A  52                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR06         3A  B 17 50DSPATR(UL)
     A  51                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR07         3A  B 17 56DSPATR(UL)
     A  50                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR08         3A  B 17 62DSPATR(UL)
     A  49                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR09         3A  B 17 68DSPATR(UL)
     A  48                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR10         3A  B 17 74DSPATR(UL)
     A  47                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 18  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WSOTIO         1A  B 18  7DSPATR(UL)
     A  46                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O')
     A                                 18  9MSGCON(010 DIV1204 *LIBL/SYMSGF)
     A            WSOT01         2A  B 18 20DSPATR(UL)
     A  45                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT02         2A  B 18 26DSPATR(UL)
     A  44                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT03         2A  B 18 32DSPATR(UL)
     A  43                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT04         2A  B 18 38DSPATR(UL)
     A  42                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT05         2A  B 18 44DSPATR(UL)
     A  41                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT06         2A  B 18 50DSPATR(UL)
     A  39                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT07         2A  B 18 56DSPATR(UL)
     A  38                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT08         2A  B 18 62DSPATR(UL)
     A  37                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT09         2A  B 18 68DSPATR(UL)
     A  36                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSOT10         2A  B 18 74DSPATR(UL)
     A                                      COLOR(YLW)
     A  35                                  DSPATR(RI)
     A                                 19  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WSLKIO         1A  B 19  7DSPATR(UL)
     A                                      VALUES(' ' 'I' 'O')
     A                                      COLOR(YLW)
     A  93                                  DSPATR(HI)
     A                                 19  9MSGCON(010 DIV1178 *LIBL/SYMSGF)
     A            WSLK01         2A  B 19 20DSPATR(UL)
     A  92                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK02         2A  B 19 26DSPATR(UL)
     A  91                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK03         2A  B 19 32DSPATR(UL)
     A  90                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK04         2A  B 19 38DSPATR(UL)
     A  89                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK05         2A  B 19 44DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK06         2A  B 19 50DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK07         2A  B 19 56DSPATR(UL)
     A  86                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK08         2A  B 19 62DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK09         2A  B 19 68DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLK10         2A  B 19 74DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 20  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WSFSIO         1A  B 20  7DSPATR(UL)
     A  82                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O')
     A                                 20  9MSGCON(010 DIV1179 *LIBL/SYMSGF)
     A            WSFS01         5A  B 20 20DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS02         5A  B 20 26DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS03         5A  B 20 32DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS04         5A  B 20 38DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS05         5A  B 20 44DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS06         5A  B 20 50DSPATR(UL)
     A  76                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS07         5A  B 20 56DSPATR(UL)
     A  75                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS08         5A  B 20 62DSPATR(UL)
     A  74                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS09         5A  B 20 68DSPATR(UL)
     A  73                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFS10         5A  B 20 74DSPATR(UL)
     A  72                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 21  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WSTSIO         1A  B 21  7DSPATR(UL)
     A  71                                  DSPATR(HI)
     A                                      VALUES(' ' 'I' 'O')
     A                                      COLOR(YLW)
     A                                 21  9MSGCON(010 DIV1180 *LIBL/SYMSGF)
     A            WSTS01         5A  B 21 20DSPATR(UL)
     A  70                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS02         5A  B 21 26DSPATR(UL)
     A  69                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS03         5A  B 21 32DSPATR(UL)
     A  68                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS04         5A  B 21 38DSPATR(UL)
     A  67                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS05         5A  B 21 44DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS06         5A  B 21 50DSPATR(UL)
     A  65                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS07         5A  B 21 56DSPATR(UL)
     A  64                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS08         5A  B 21 62DSPATR(UL)
     A  63                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS09         5A  B 21 68DSPATR(UL)
     A  62                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSTS10         5A  B 21 74DSPATR(UL)
     A  61                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 22  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WSLSIO         1A  B 22  7COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O')
     A  28                                  DSPATR(HI)
     A            WSLS01        20A  B 22 20CHECK(LC)
     A  28                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A            WSLS02        20A  B 22 41CHECK(LC)
     A                                      COLOR(YLW)
     A            WSLS03        20A  B 22 62CHECK(LC)
     A                                      COLOR(YLW)
     A            WSLS04        20A  B 22 83CHECK(LC)
     A                                      COLOR(YLW)
     A            WSLS05        20A  B 22104CHECK(LC)
     A                                      COLOR(YLW)
     A                                 23  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WSL2IO         1A  B 23  7COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O')
     A  28                                  DSPATR(HI)
     A            WSL201        20A  B 23 20CHECK(LC)
     A  28                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A            WSL202        20A  B 23 41CHECK(LC)
     A                                      COLOR(YLW)
     A            WSL203        20A  B 23 62CHECK(LC)
     A                                      COLOR(YLW)
     A            WSL204        20A  B 23 83CHECK(LC)
     A                                      COLOR(YLW)
     A            WSL205        20A  B 23104CHECK(LC)
     A                                      COLOR(YLW)
     A                                 24  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            WTRAIO         1A  B 24  7DSPATR(UL)
     A  17                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 24  9MSGCON(010 SHU1175 *LIBL/SYMSGF)
     A            WTRA01         4A  B 24 20DSPATR(UL)
     A  18                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA02         4A  B 24 26DSPATR(UL)
     A  19                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA03         4A  B 24 32DSPATR(UL)
     A  20                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA04         4A  B 24 38DSPATR(UL)
     A  21                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA05         4A  B 24 44DSPATR(UL)
     A  22                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA06         4A  B 24 50DSPATR(UL)
     A  23                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA07         4A  B 24 56DSPATR(UL)
     A  24                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA08         4A  B 24 62DSPATR(UL)
     A  25                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA09         4A  B 24 68DSPATR(UL)
     A  26                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WTRA10         4A  B 24 74DSPATR(UL)
     A  27                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N30                             25  2MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 25  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             25 22MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22  9MSGCON(010 SHU1514 *LIBL/SYMSGF)
     A                                 23  9MSGCON(010 SHU1515 *LIBL/SYMSGF)
     A                                 24 80MSGCON(052 SHU1523 *LIBL/SYMSGF)
     A                                 20 80MSGCON(040 SHU1524 *LIBL/SYMSGF)
     A                                 21 80MSGCON(040 SHU1524 *LIBL/SYMSGF)
     A                                 25 80MSGCON(020 SHU1688 *LIBL/SYMSGF)
     A          R BILDE02
     A*%%TS  SD  20150313  133330  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'CANCEL')
     A            PKDT           8Y 0H
     A                                  1  2MSGCON(045 DIV1205 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                  2  2MSGCON(015 DIV1184 *LIBL/SYMSGF)
     A            WSKNR          8Y 0O  2 18DSPATR(UL)
     A                                      EDTCDE(4)
     A            KNAVN         30A  O  2 27
     A                                  3  2MSGCON(015 DIV1185 *LIBL/SYMSGF)
     A            WSAVTN         1A  O  3 18DSPATR(UL)
     A                                  4  2MSGCON(012 DIV1189 *LIBL/SYMSGF)
     A            PKGEBY         3A  O  4 15DSPATR(UL)
     A                                      COLOR(WHT)
     A            KGENOT        20A  O  4 23DSPATR(UL)
     A                                  5  2MSGCON(012 DIV1190 *LIBL/SYMSGF)
     A            PKAVTT         1A  O  5 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 23'(T,B,P,X,Y)'
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(012 DIV1191 *LIBL/SYMSGF)
     A            PKTNR          1A  O  6 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6 23MSGCON(015 DIV1192 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  7  2MSGCON(012 DIV1193 *LIBL/SYMSGF)
     A            PKMVA          1A  O  7 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7 23'(J/N)'
     A                                      COLOR(BLU)
     A                                  7 29MSGCON(020 JOV1621 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  8  2MSGCON(012 DIV1194 *LIBL/SYMSGF)
     A            PKINT          5Y 0O  8 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8 32MSGCON(012 DIV1199 *LIBL/SYMSGF)
     A            PKKOLL         1A  O  8 45DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(012 DIV1195 *LIBL/SYMSGF)
     A            PKBELØ        10Y 3O  9 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(M)
     A                                  9 32MSGCON(030 DIV1196 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 10  2MSGCON(012 DIV1197 *LIBL/SYMSGF)
     A            PKPPR          5Y 0O 10 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 10 32MSGCON(030 DIV1198 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 11  2MSGCON(018 DIV1200 *LIBL/SYMSGF)
     A            PKTEGN         1A  O 11 21DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 11 25MSGCON(015 DIV1201 *LIBL/SYMSGF)
     A            PKJUST        10Y 3O 11 41DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 11 54MSGCON(006 DIV1202 *LIBL/SYMSGF)
     A            PKFVAL         3A  O 11 61DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(015 SHU0298 *LIBL/SYMSGF)
     A            PKSAMM         1A  O 12 21COLOR(WHT)
     A                                 12 25MSGCON(040 SHU0299 *LIBL/SYMSGF)
     A                                 13  2MSGCON(020 DIV1172 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 14  2MSGCON(015 DIV1173 *LIBL/SYMSGF)
     A            WKDT           6Y 0O 14 19DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 14 31MSGCON(025 DIV1174 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 15  2MSGCON(060 DIV1175 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 16  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PKURIO         1A  O 16  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 16  9MSGCON(010 DIV1177 *LIBL/SYMSGF)
     A            PKUR01         1A  O 16 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR02         1A  O 16 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR03         1A  O 16 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR04         1A  O 16 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR05         1A  O 16 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR06         1A  O 16 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR07         1A  O 16 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR08         1A  O 16 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR09         1A  O 16 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR10         1A  O 16 74DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 17  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PKFRIO         1A  O 17  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 17  9MSGCON(010 DIV1203 *LIBL/SYMSGF)
     A            PKFR01         3A  O 17 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR02         3A  O 17 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR03         3A  O 17 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR04         3A  O 17 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR05         3A  O 17 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR06         3A  O 17 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR07         3A  O 17 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR08         3A  O 17 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR09         3A  O 17 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR10         3A  O 17 74DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 18  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PKOTIO         1A  O 18  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 18  9MSGCON(010 DIV1204 *LIBL/SYMSGF)
     A            PKOT01         2A  O 18 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT02         2A  O 18 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT03         2A  O 18 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT04         2A  O 18 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT05         2A  O 18 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT06         2A  O 18 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT07         2A  O 18 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT08         2A  O 18 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT09         2A  O 18 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT10         2A  O 18 74DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 19  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PKLKIO         1A  O 19  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 19  9MSGCON(010 DIV1178 *LIBL/SYMSGF)
     A            PKLK01         2A  O 19 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK02         2A  O 19 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK03         2A  O 19 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK04         2A  O 19 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK05         2A  O 19 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK06         2A  O 19 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK07         2A  O 19 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK08         2A  O 19 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK09         2A  O 19 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK10         2A  O 19 74DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 20  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PKFSIO         1A  O 20  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 20  9MSGCON(010 DIV1179 *LIBL/SYMSGF)
     A            PKFS01         5A  O 20 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS02         5A  O 20 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS03         5A  O 20 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS04         5A  O 20 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS05         5A  O 20 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS06         5A  O 20 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS07         5A  O 20 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS08         5A  O 20 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS09         5A  O 20 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS10         5A  O 20 74DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 21  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PKTSIO         1A  O 21  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 21  9MSGCON(010 DIV1180 *LIBL/SYMSGF)
     A            PKTS01         5A  O 21 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS02         5A  O 21 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS03         5A  O 21 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS04         5A  O 21 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS05         5A  O 21 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS06         5A  O 21 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS07         5A  O 21 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS08         5A  O 21 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS09         5A  O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS10         5A  O 21 74DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PKLSIO         1A  O 22  7COLOR(WHT)
     A                                 22  9MSGCON(009 JOV0041 *LIBL/SYMSGF)
     A            PKLS01        20A  O 22 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLS02        20A  O 22 41DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLS03        20A  O 22 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLS04        20A  O 22 83DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLS05        20A  O 22104DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PKL2IO         1A  O 23  7COLOR(WHT)
     A                                 23  9MSGCON(009 JOV0041 *LIBL/SYMSGF)
     A            PKL201        20A  O 23 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKL202        20A  O 23 41DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKL203        20A  O 23 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKL204        20A  O 23 83DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKL205        20A  O 23104DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 24  2MSGCON(004 DIV1176 *LIBL/SYMSGF)
     A            PTRAIO         1A  O 24  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 24  9MSGCON(010 SHU1175 *LIBL/SYMSGF)
     A            PTRA01         4A  O 24 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA02         4A  O 24 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA03         4A  O 24 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA04         4A  O 24 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA05         4A  O 24 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA06         4A  O 24 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA07         4A  O 24 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA08         4A  O 24 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA09         4A  O 24 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PTRA10         4A  O 24 74DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 25  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 80MSGCON(052 SHU1523 *LIBL/SYMSGF)
     A                                 21 80MSGCON(040 SHU1524 *LIBL/SYMSGF)
     A                                 20 80MSGCON(040 SHU1524 *LIBL/SYMSGF)
