     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/FAK3)
     A                                      PRINT
     A                                      CF03(03 'Exit')
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 6 68 *NOMSGLIN)
     A                                      OVERLAY
     A          R BILDE
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      CF12(12)
     A                                  1  2'SYSPED/SYFAKDV'
     A                                      COLOR(BLU)
     A                                  1 20'Vedlikeholde av ledetekst'
     A                                      COLOR(WHT)
     A                                  3  2'Norsk tekst  :'
     A            WSTXTN        50   B  3 17DSPATR(UL)
     A  99                                  DSPATR(PR)
     A  99                                  COLOR(WHT)
     A                                  4  2'Engelsk tekst:'
     A            WSTXTE        50   B  4 17DSPATR(UL)
     A  98                                  DSPATR(PR)
     A  98                                  COLOR(WHT)
     A                                  5  2'F12=Avbryt'
     A                                      COLOR(BLU)
     A  30        ZMSGTX        65A  O  6  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
     A            ZMSGNO         7A  P
