     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A            WSAVD          4Y 0B  7 32DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A            WSSG           3A  B  9 32DSPATR(UL)
     A                                      COLOR(YLW)
     A  98                                  DSPATR(RI)
     A            WSPRT         10A  B 14 40DSPATR(ND)
     A                                      DSPATR(PR)
     A                                      COLOR(YLW)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A                                  2 19MSGCON(040 SHU0537 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 22  3MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  7  3MSGCON(024 DIV1497 *LIBL/SYMSGF)
     A                                  9  3MSGCON(024 DIV1498 *LIBL/SYMSGF)
     A                                  2  3'SYSPED/SYFABF'
     A                                      COLOR(BLU)
     A                                  4 69TIME
     A                                      COLOR(BLU)
     A                                  3 69DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
