N01   * TILLATET LENGER URL
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      HELP
     A                                      ALTHELP(CA01)
     A          R WEBSOK
     A                                      CA03(03 'Avslutt program')
     A                                      CA12(03 'Avslutt program')
     A                                  1  2'SYSPED/SYFA64B'
     A                                      COLOR(BLU)
     A                                  1 22'Skjermbilde for web-link på mer en-
     A                                      n 70 tegn.'
     A                                      COLOR(WHT)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                 10  1'Tast på hyperkobling for å søke på-
     A                                      WEB.'
S01  A*           LINK         140A  O 13  1COLOR(BLU)
N01  A            LINK         300A  O 13  1COLOR(BLU)
     A                                      DSPATR(UL)
     A                                 22 61'F3=avslutt'
     A                                      COLOR(BLU)
