     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
     A          R SUBFIL                    SFL
     A            STGR           2A  H
     A            WSÅR           2D 0O  4  2
     A  35                                  COLOR(WHT)
     A            WSTYPE        18A  O  4  5
     A  35                                  COLOR(WHT)
     A            WSBL01         9Y 0O  4 24EDTCDE(L)
     A  35                                  COLOR(WHT)
     A            WSBL02         9Y 0O  4 35EDTCDE(L)
     A  35                                  COLOR(WHT)
     A            WSBL03         9Y 0O  4 46EDTCDE(L)
     A  35                                  COLOR(WHT)
     A            WSBL04         9Y 0O  4 57EDTCDE(L)
     A  35                                  COLOR(WHT)
     A            STBL13         9Y 0O  4 68EDTCDE(L)
     A  35                                  COLOR(WHT)
     A            STBL01         9Y 0H
     A            STBL02         9Y 0H
     A            STBL03         9Y 0H
     A            STBL04         9Y 0H
     A            STBL05         9Y 0H
     A            STBL06         9Y 0H
     A            STBL07         9Y 0H
     A            STBL08         9Y 0H
     A            STBL09         9Y 0H
     A            STBL10         9Y 0H
     A            STBL11         9Y 0H
     A            STBL12         9Y 0H
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      OVERLAY
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A                                      CA03(03 'Forrige')
     A                                      CA04(04 'SØK')
     A                                      CA05(05 'Frisk')
     A                                      CA11(11 'RES./DEKN.B.')
     A                                      CA12(12 'Forrige')
     A                                      CA13(13 'TIL VALGKODE')
     A            ZRECNO         4S 0O  1 75SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYFA29A'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(30 DIV0441 SYMSGF)
     A                                      COLOR(WHT)
     A  40                              1 42MSGCON(27 DIV4191 SYMSGF)
     A                                      COLOR(WHT)
     A  41                              1 42MSGCON(27 DIV0454 SYMSGF)
     A                                      COLOR(WHT)
     A  42                              1 42MSGCON(27 DIV0459 SYMSGF)
     A                                      COLOR(WHT)
     A  43                              1 42MSGCON(27 DIV0485 SYMSGF)
     A                                      COLOR(WHT)
     A  44                              1 42MSGCON(27 DIV0460 SYMSGF)
     A                                      COLOR(WHT)
     A  45                              1 42MSGCON(27 DIV0462 SYMSGF)
     A                                      COLOR(WHT)
     A  46                              1 42MSGCON(27 DIV0464 SYMSGF)
     A                                      COLOR(WHT)
     A  47                              1 42MSGCON(27 DIV0466 SYMSGF)
     A                                      COLOR(WHT)
     A  48                              1 42MSGCON(27 DIV0468 SYMSGF)
     A                                      COLOR(WHT)
     A  49                              1 42MSGCON(27 DIV0470 SYMSGF)
     A                                      COLOR(WHT)
     A  50                              1 42MSGCON(27 DIV0471 SYMSGF)
     A                                      COLOR(WHT)
     A  51                              1 42MSGCON(27 DIV4194 SYMSGF)
     A                                      COLOR(WHT)
     A  52                              1 42MSGCON(27 DIV4195 SYMSGF)
     A                                      COLOR(WHT)
     A  53                              1 42MSGCON(27 JOV0072 SYMSGF)
     A                                      COLOR(WHT)
     A  54                              1 42MSGCON(27 JOV0073 SYMSGF)
     A                                      COLOR(WHT)
     A  55                              1 42MSGCON(27 DIV4180 SYMSGF)
     A                                      COLOR(WHT)
     A  56                              1 42MSGCON(27 DIV4181 SYMSGF)
     A                                      COLOR(WHT)
     A  57                              1 42MSGCON(27 DIV4182 SYMSGF)
     A                                      COLOR(WHT)
     A  58                              1 42MSGCON(27 DIV4183 SYMSGF)
     A                                      COLOR(WHT)
     A  59                              1 42MSGCON(27 DIV4192 SYMSGF)
     A                                      COLOR(WHT)
     A  61                              1 42MSGCON(27 YBC0307 SYMSGF)
     A                                      COLOR(WHT)
     A  62                              1 42MSGCON(27 YBC0308 SYMSGF)
     A                                      COLOR(WHT)
     A  63                              1 42MSGCON(27 YBC0309 SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(20 YBC0319 SYMSGF)
     A                                  2 23'A'
     A            W2GRA          1A  B  2 25DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 27'B'
     A            W2GRB          1A  B  2 29DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 31'C'
     A            W2GRC          1A  B  2 33DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 35'D'
     A            W2GRD          1A  B  2 37DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 39'E'
     A            W2GRE          1A  B  2 41DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 43'F'
     A            W2GRF          1A  B  2 45DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 47'G'
     A            W2GRG          1A  B  2 49DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 51'H'
     A            W2GRH          1A  B  2 53DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 55'I'
     A            W2GRI          1A  B  2 57DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 59'J'
     A            W2GRJ          1A  B  2 61DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 65MSGCON(10 YBC0327 SYMSGF)
     A            W2SORT         1A  B  2 76DSPATR(UL)
     A                                      VALUES('1' '2' '3' '4')
     A                                      COLOR(YLW)
     A  37                              3  2MSGCON(78 YBC0316 SYMSGF)
     A                                      COLOR(BLU)
     A  38                              3  2MSGCON(78 YBC0317 SYMSGF)
     A                                      COLOR(BLU)
     A  39                              3  2MSGCON(78 YBC0318 SYMSGF)
     A                                      COLOR(BLU)
     A*
     A          R BUNN
     A                                      SLNO(17)
     A                                      CLRL(08)
     A                                      OVERLAY
     A            WSDTÅ          2D 0O  1  2
     A                                  1  5MSGCON(15 YBC0324 SYMSGF)
     A            WS4101         9Y 0O  1 24EDTCDE(L)
     A            WS4102         9Y 0O  1 35EDTCDE(L)
     A            WS4103         9Y 0O  1 46EDTCDE(L)
     A            WS4104         9Y 0O  1 57EDTCDE(L)
     A            B4113          9Y 0O  1 68EDTCDE(L)
     A            WSDTÅ2         2D 0O  2  2
     A                                  2  5MSGCON(15 YBC0325 SYMSGF)
     A            WS4201         9Y 0O  2 24EDTCDE(L)
     A            WS4202         9Y 0O  2 35EDTCDE(L)
     A            WS4203         9Y 0O  2 46EDTCDE(L)
     A            WS4204         9Y 0O  2 57EDTCDE(L)
     A            B4213          9Y 0O  2 68EDTCDE(L)
     A N36        WSDTÅ3         2D 0O  3  2
     A N36                              3  5MSGCON(15 YBC0326 SYMSGF)
     A N36        WSP101         7Y 3O  3 25EDTCDE(L)
     A N36        WSP102         7Y 3O  3 36EDTCDE(L)
     A N36        WSP103         7Y 3O  3 47EDTCDE(L)
     A N36        WSP104         7Y 3O  3 58EDTCDE(L)
     A N36        P0113          7Y 3O  3 69EDTCDE(L)
     A  36        WSDTÅ4         2D 0O  3  2
     A  36                              3  5MSGCON(15 YBC0328 SYMSGF)
     A  36        WSD101         9Y 0O  3 24EDTCDE(L)
     A  36        WSD102         9Y 0O  3 35EDTCDE(L)
     A  36        WSD103         9Y 0O  3 46EDTCDE(L)
     A  36        WSD104         9Y 0O  3 57EDTCDE(L)
     A  36        D0113          9Y 0O  3 68EDTCDE(L)
     A            XDTÅ           2D 0O  4  2COLOR(WHT)
     A                                  4  5MSGCON(15 YBC0324 SYMSGF)
     A                                      COLOR(WHT)
     A            WS4301         9Y 0O  4 24EDTCDE(L)
     A                                      COLOR(WHT)
     A            WS4302         9Y 0O  4 35EDTCDE(L)
     A                                      COLOR(WHT)
     A            WS4303         9Y 0O  4 46EDTCDE(L)
     A                                      COLOR(WHT)
     A            WS4304         9Y 0O  4 57EDTCDE(L)
     A                                      COLOR(WHT)
     A            B4313          9Y 0O  4 68EDTCDE(L)
     A                                      COLOR(WHT)
     A            XDTÅ2          2D 0O  5  2COLOR(WHT)
     A                                  5  5MSGCON(15 YBC0325 SYMSGF)
     A                                      COLOR(WHT)
     A            WS4401         9Y 0O  5 24EDTCDE(L)
     A                                      COLOR(WHT)
     A            WS4402         9Y 0O  5 35EDTCDE(L)
     A                                      COLOR(WHT)
     A            WS4403         9Y 0O  5 46EDTCDE(L)
     A                                      COLOR(WHT)
     A            WS4404         9Y 0O  5 57EDTCDE(L)
     A                                      COLOR(WHT)
     A            B4413          9Y 0O  5 68EDTCDE(L)
     A                                      COLOR(WHT)
     A N36        XDTÅ3          2D 0O  6  2COLOR(WHT)
     A N36                              6  5MSGCON(15 YBC0326 SYMSGF)
     A                                      COLOR(WHT)
     A N36        WSP201         7Y 3O  6 25EDTCDE(L)
     A                                      COLOR(WHT)
     A N36        WSP202         7Y 3O  6 36EDTCDE(L)
     A                                      COLOR(WHT)
     A N36        WSP203         7Y 3O  6 47EDTCDE(L)
     A                                      COLOR(WHT)
     A N36        WSP204         7Y 3O  6 58EDTCDE(L)
     A                                      COLOR(WHT)
     A N36        P0213          7Y 3O  6 69EDTCDE(L)
     A                                      COLOR(WHT)
     A  36        XDTÅ4          2D 0O  6  2COLOR(WHT)
     A  36                              6  5MSGCON(15 YBC0328 SYMSGF)
     A                                      COLOR(WHT)
     A  36        WSD201         9Y 0O  6 24EDTCDE(L)
     A                                      COLOR(WHT)
     A  36        WSD202         9Y 0O  6 35EDTCDE(L)
     A                                      COLOR(WHT)
     A  36        WSD203         9Y 0O  6 46EDTCDE(L)
     A                                      COLOR(WHT)
     A  36        WSD204         9Y 0O  6 57EDTCDE(L)
     A                                      COLOR(WHT)
     A  36        D0213          9Y 0O  6 68EDTCDE(L)
     A                                      COLOR(WHT)
     A N30                              7  2MSGCON(78 YBC0320 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  8  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R NYWRK
     A                                      CA03(03 'Forrige')
     A                                      CA04(04 'SØK')
     A                                      CA05(05 'FORNY')
     A                                      CA11(11 'RES./DEKN.B')
     A                                      CA12(12 'Forrige')
     A                                      CA13(13 'TIL VALGKODE')
     A                                  1  2'SYFA29A'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(30 DIV0441 SYMSGF)
     A                                      COLOR(WHT)
     A  40                              1 42MSGCON(27 DIV4191 SYMSGF)
     A                                      COLOR(WHT)
     A  41                              1 42MSGCON(27 DIV0454 SYMSGF)
     A                                      COLOR(WHT)
     A  42                              1 42MSGCON(27 DIV0459 SYMSGF)
     A                                      COLOR(WHT)
     A  43                              1 42MSGCON(27 DIV0485 SYMSGF)
     A                                      COLOR(WHT)
     A  44                              1 42MSGCON(27 DIV0460 SYMSGF)
     A                                      COLOR(WHT)
     A  45                              1 42MSGCON(27 DIV0462 SYMSGF)
     A                                      COLOR(WHT)
     A  46                              1 42MSGCON(27 DIV0464 SYMSGF)
     A                                      COLOR(WHT)
     A  47                              1 42MSGCON(27 DIV0466 SYMSGF)
     A                                      COLOR(WHT)
     A  48                              1 42MSGCON(27 DIV0468 SYMSGF)
     A                                      COLOR(WHT)
     A  49                              1 42MSGCON(27 DIV0470 SYMSGF)
     A                                      COLOR(WHT)
     A  50                              1 42MSGCON(27 DIV0471 SYMSGF)
     A                                      COLOR(WHT)
     A  51                              1 42MSGCON(27 DIV4194 SYMSGF)
     A                                      COLOR(WHT)
     A  52                              1 42MSGCON(27 DIV4195 SYMSGF)
     A                                      COLOR(WHT)
     A  53                              1 42MSGCON(27 JOV0072 SYMSGF)
     A                                      COLOR(WHT)
     A  54                              1 42MSGCON(27 JOV0073 SYMSGF)
     A                                      COLOR(WHT)
     A  55                              1 42MSGCON(27 DIV4180 SYMSGF)
     A                                      COLOR(WHT)
     A  56                              1 42MSGCON(27 DIV4181 SYMSGF)
     A                                      COLOR(WHT)
     A  57                              1 42MSGCON(27 DIV4182 SYMSGF)
     A                                      COLOR(WHT)
     A  58                              1 42MSGCON(27 DIV4183 SYMSGF)
     A                                      COLOR(WHT)
     A  59                              1 42MSGCON(27 DIV4192 SYMSGF)
     A                                      COLOR(WHT)
     A  61                              1 42MSGCON(27 YBC0307 SYMSGF)
     A                                      COLOR(WHT)
     A  62                              1 42MSGCON(27 YBC0308 SYMSGF)
     A                                      COLOR(WHT)
     A  63                              1 42MSGCON(27 YBC0309 SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(20 YBC0319 SYMSGF)
     A                                  2 23'A'
     A            W2GRA          1A  B  2 25DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 27'B'
     A            W2GRB          1A  B  2 29DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 31'C'
     A            W2GRC          1A  B  2 33DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 35'D'
     A            W2GRD          1A  B  2 37DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 39'E'
     A            W2GRE          1A  B  2 41DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 43'F'
     A            W2GRF          1A  B  2 45DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 47'G'
     A            W2GRG          1A  B  2 49DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 51'H'
     A            W2GRH          1A  B  2 53DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 55'I'
     A            W2GRI          1A  B  2 57DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 59'J'
     A            W2GRJ          1A  B  2 61DSPATR(UL)
     A                                      VALUES(' ' 'J')
     A                                      COLOR(YLW)
     A                                  2 65MSGCON(10 YBC0327 SYMSGF)
     A            W2SORT         1A  B  2 76DSPATR(UL)
     A                                      VALUES('1' '2' '3' '4')
     A                                      COLOR(YLW)
     A  37                              3  2MSGCON(78 YBC0316 SYMSGF)
     A                                      COLOR(BLU)
     A  38                              3  2MSGCON(78 YBC0317 SYMSGF)
     A                                      COLOR(BLU)
     A  39                              3  2MSGCON(78 YBC0318 SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(30 YBC0321 SYMSGF)
     A                                      COLOR(RED)
     A N30                             23  2MSGCON(78 YBC0320 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
