     A*****************************************************************
     A*             G E B Y R T A B E L L E R   L I S T E             *
     A* ANTALL LINJE=48,  ANTALL TEGN PR. LINJE=132, OVERFLOW=48      *
     A*****************************************************************
     A          R HEADER
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A  88                              2 90'¤&l'
     A  88        COPY           2  0   2 93
     A  88                              2 95'X'
     A  88                              2 96'¤&a-3R'
     A  88                              2102'¤&l1O'
     A  88                              3  1'¤(12U¤(s0p12h0s3b4099T'
     A  88                              4  1'¤*c3300A¤*c170B¤*c11G¤*c2P'
     A            MSG101        35A     5  2
     A            MSG102        10A     5 56
     A            PRTNR          1A     5 67
     A            MSG103         5A     5 73
     A                                  5 79DATE EDTCDE(Y)
     A            MSG104         5A     5 97
     A                                  5104PAGNBR
     A            MSG105       130A     6  2
     A N88                              7  1'-------------------------'
     A N88                              7 26'-------------------------'
     A N88                              7 51'-------------------------'
     A N88                              7 76'-------------------------'
     A N88                              7101'-------------------------'
     A N88                              7126'-------'
     A  88                              7  1' '
     A*
     A          R DETALJ                    SPACEB(1)
     A            PRGEBY         3A        5
     A            PRINT          5  0     17EDTCDE(4)
     A            PRBELØ        10  3     28EDTCDE(4)
     A            PRANT          5  0     43EDTCDE(4)
     A            PRKOLL         1A       58
     A            PRTEGN         1A       67
     A            PRJUST        10  3     72EDTCDE(4)
