     A*%%TS  SD  20150818  074609  JOVO        REL-V7R1M0  5770-WDS
     A* BRINGTMS-PROSJEKT
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYFI10A010' 'SYFI10A' 'SY40-
     A                                      0LO/FELLES')
     A                                      HELP
     A                                      ALTHELP
     A          R FA10AB10
     A*%%TS  SD  20150818  074609  JOVO        REL-V7R1M0  5770-WDS
     A  89                                  CF11(11 'DELETE')
     A                                      CF12(12 'CANCEL')
     A                                      CF04(04 'SØK')
     A                                      SLNO(23)
     A                                      CLRL(05)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2MSGCON(130 JOV1649 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            FVLINR         2Y 0O  2  4EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSMRKA        12A  B  2  7
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVANT          7Y 0B  2 20EDTCDE(4)
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVPAKN         7A  B  2 28
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVVT          35A  B  2 36
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVVKT          9Y 0B  2 72EDTCDE(4)
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVLEN          4Y 0B  2 82EDTCDE(4)
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVBRD          4Y 0B  2 87EDTCDE(4)
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVHOY          4Y 0B  2 92EDTCDE(4)
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVVOL          7Y 3B  2 97EDTCDE(4)
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVLM           4Y 2B  2106EDTCDE(4)
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            FVLM2          4Y 2B  2112EDTCDE(4)
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  3  7'Gm..'
     A                                      COLOR(WHT)
     A            WSMRKB        23A  B  3 12
     A  88                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  3 41'UnNr/EmbG:'
     A                                      COLOR(WHT)
     A            WSUNNR    R        B  3 52REFFLD(DOKUFVFR/FFUNNR *LIBL/DOKUFV-
     A                                      F)
     A  88                                  DSPATR(PR)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSEMBG    R        B  3 57REFFLD(DOKUFVFR/FFEMBG *LIBL/DOKUFV-
     A                                      F)
     A  88                                  DSPATR(PR)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  3 63'Kli:'
     A                                      COLOR(WHT)
     A            WSANTK    R        B  3 68REFFLD(DOKUFVFR/FFANTK *LIBL/DOKUFV-
     A                                      F)
     A                                      EDTCDE(4)
     A  88                                  DSPATR(PR)
     A  79                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  3 75'Men/Enh:'
     A                                      COLOR(WHT)
     A            WSANTE    R        B  3 84REFFLD(DOKUFVFR/FFANTE *LIBL/DOKUFV-
     A                                      F)
     A                                      EDTCDE(4)
     A  88                                  DSPATR(PR)
     A  78                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSENH     R        B  3 92REFFLD(DOKUFVFR/FFENH *LIBL/DOKUFVF)
     A  88                                  DSPATR(PR)
     A  77                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  3 96'L/K'
     A                                      COLOR(WHT)
     A                                  3101'Fakt:'
     A                                      COLOR(WHT)
     A            WSFAKT    R        O  3107REFFLD(DOKUFVFR/FFFAKT *LIBL/DOKUFV-
     A                                      F)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSPOEN    R        O  3112REFFLD(DOKUFVFR/FFPOEN *LIBL/DOKUFV-
     A                                      F)
     A                                      EDTCDE(4)
     A                                      COLOR(RED)
     A            WMODE          5A  O  4  1COLOR(WHT)
     A  89                              4  7MSGCON(021 TRO0003 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 29MSGCON(012 TRO0004 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            UNBESK        89A  O  4 43COLOR(WHT)
     A  30        MSGTXT        78A  O  5  5MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            SFFARL    R        O  3119REFFLD(DOKUFVFR/FFPOEN *LIBL/DOKUFV-
     A                                      F)
     A                                      EDTCDE(4)
     A                                      COLOR(RED)
     A  70                                  DSPATR(RI)
     A            WSINDX         1   B  3 61COLOR(YLW)
     A  80                                  DSPATR(RI)
     A  88                                  DSPATR(PR)
     A          R FA10AB20
     A*%%TS  SD  20140217  120932  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF03(03 'EXIT')
     A                                      CF06(06 'NEW')
     A                                      CF12(12 'CANCEL')
     A                                      CF13(13 'KOLLI-IDS')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3'SYFA10A'
     A                                  1 20MSGCON(021 TRO0005 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  2  3USER
     A                                  2 63TIME
     A                                  3  2MSGCON(009 TRO0012 *LIBL/SYMSGF)
     A            SFAVD          4Y 0O  3 12EDTCDE(4)
     A                                      DSPATR(HI)
     A                                  3 17MSGCON(006 TRO0013 *LIBL/SYMSGF)
     A            SFOPD          7Y 0O  3 24EDTCDE(4)
     A                                      DSPATR(HI)
     A                                  3 32MSGCON(012 TRO0014 *LIBL/SYMSGF)
     A            SFFBNR         3Y 0O  3 45EDTCDE(4)
     A                                      DSPATR(HI)
     A                                  3 49MSGCON(007 TRO0049 *LIBL/SYMSGF)
     A            UANT           7Y 0O  3 57EDTCDE(4)
     A                                      DSPATR(HI)
     A                                  3 65MSGCON(005 TRO0048 *LIBL/SYMSGF)
     A            UVKT           9Y 0O  3 71EDTCDE(4)
     A                                      DSPATR(HI)
     A                                 10 25MSGCON(018 TRO0011 *LIBL/SYMSGF)
     A                                 26  3MSGCON(008 TRO0002 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 37MSGCON(019 TRO0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 64MSGCON(012 JOV1627 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R FA10AB40
     A*%%TS  SD  20150211  114600  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'REFRESH')
     A                                      CF06(06 'NEW')
     A                                      CF12(12 'CANCEL')
     A                                      CF13(13 'KOLLI-IDS')
     A                                      SLNO(23)
     A                                      CLRL(05)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3MSGCON(008 TRO0002 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 17MSGCON(012 TRO0015 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 37MSGCON(019 TRO0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A                                  1 62MSGCON(018 JOV1627 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A* MEGET PRIMITIV METODE FOR Å HINDRE AT INPUT FRA VARELINJE'HENGER IGJEN'
     A          R FA10AH50                  SFL
     A*%%TS  SD  20150304  144605  JOVO        REL-V7R1M0  5770-WDS
     A            SFRRN         10S 0H
     A            WSNR           1A  I  8  3VALUES(' ' '2' '3' '4' '5' '6' '8' -
     A                                      '9')
     A            SFLINR         2Y 0O  8  5EDTCDE(4)
     A            SFMERK        12A  O  8  8
     A            SFANT          7Y 0O  8 21EDTCDE(4)
     A            SFPAKN         7A  O  8 29
     A            SFVT          35A  O  8 37
     A            SFVKT          9Y 0O  8 73EDTCDE(4)
     A            FVLEN     R        O  8 83REFFLD(DOKUFVR/FVLEN *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A            FVBRD     R        O  8 88REFFLD(DOKUFVR/FVBRD *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A            FVHOY     R        O  8 93REFFLD(DOKUFVR/FVHOY *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A            SFVOL          7Y 3O  8 98EDTCDE(4)
     A            FVLM      R        O  8107REFFLD(DOKUFVR/FVLM *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A            FVLM2     R        O  8113REFFLD(DOKUFVR/FVLM2 *LIBL/DOKUFV)
     A                                      EDTCDE(4)
     A            SFFARL         5Y 0O  8119EDTCDE(4)
     A                                      COLOR(RED)
     A  70                                  DSPATR(RI)
     A            SFTILL         1A  O  8125COLOR(WHT)
     A          R FA10AK60                  SFLCTL(FA10AH50)
     A*%%TS  SD  20150304  134610  JOVO        REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A          H                           HLPDOC('SYFI10A210' 'SYFI10A' 'SY40-
     A                                      0LO/FELLES')
     A                                      HLPARA(01 001 20 080)
     A                                  1  3'SYFA10A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(021 TRO0005 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1114DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  3USER
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2114TIME
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(009 TRO0012 *LIBL/SYMSGF)
     A            SFAVD          4Y 0O  3 12EDTCDE(4)
     A                                      DSPATR(HI)
     A                                  3 17MSGCON(006 TRO0013 *LIBL/SYMSGF)
     A            SFOPD          7Y 0O  3 24EDTCDE(4)
     A                                      DSPATR(HI)
     A                                  3 32MSGCON(012 TRO0014 *LIBL/SYMSGF)
     A            SFFBNR         3Y 0O  3 45EDTCDE(4)
     A                                      DSPATR(HI)
     A                                  3 49MSGCON(007 TRO0049 *LIBL/SYMSGF)
     A            UANT           7Y 0O  3 57DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  3 65MSGCON(005 TRO0048 *LIBL/SYMSGF)
     A            UVKT           9Y 0O  3 71DSPATR(HI)
     A                                      EDTCDE(4)
     A                                  4  2MSGCON(070 JOV1629 *LIBL/SYMSGF)
     A                                  5  3MSGCON(025 TRO0006 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N69                              6  5MSGCON(007 TRO0007 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N69                              6 14MSGCON(008 TRO0008 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N69                              6 24MSGCON(009 TRO0009 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6 34MSGCON(007 TRO0010 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6 42MSGCON(007 TRO0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6 51MSGCON(020 JOV1650 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  7  3MSGCON(130 JOV1649 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  4 76MSGCON(050 JOV1651 *LIBL/SYMSGF)
     A                                  5 76MSGCON(050 JOV1660 *LIBL/SYMSGF)
