     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                  1  2'SYSPED/SYFAKP'
     A                                      COLOR(BLU)
     A                                  1 20'D O K U M E N T U T S K R I F T'
     A                                      COLOR(WHT)
     A                                  1 57DATE
     A                                      EDTCDE(Y)
     A                                  1 68TIME
     A                                  2 20'OPPDRAGSFORMULAR  I M P O R T  '
     A                                      COLOR(WHT)
     A                                  3 20'FERDIGMELDTE  F A K T U R A E R'
     A                                      COLOR(WHT)
     A                                  8  2'Tast inn kostnadssted.....'
     A            WSAVD          4Y 0B  8 31DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A                                      COLOR(GRN)
     A                                 10  2'Tast inn signatur.........'
     A            WSSG           3A  B 10 31DSPATR(UL)
     A  98                                  DSPATR(RI PC)
     A                                      COLOR(GRN)
V10  A*                                12  2MSGCON(24 DIV1499 SYMSGF)
V10  A                                 12  2MSGCON(024 YBC1956 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B 12 31DSPATR(UL)
     A                                      EDTCDE(4)
V10  A                                 13  2MSGCON(024 YBC1957 *LIBL/SYMSGF)
V10  A            WSOPD          7Y 0B 13 29DSPATR(UL)
V10  A                                      EDTCDE(4)
     A                                 14  2'Arbeidsordre / fra dato...'
     A            WSAO           1A  B 14 31DSPATR(UL)
     A                                      VALUES(' ' 'N' 'J')
     A                                      COLOR(GRN)
     A            WSDT           6Y 0B 14 34DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(GRN)
     A                                 14 45'(J=Ja)'
     A                                 16  2'Skal ferdige fakt. skrives'
     A            WSFAK          1A  B 16 31DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                      COLOR(GRN)
     A                                 16 45'(J=Ja)'
     A                                 18  2'Skal jobbkø benyttes......'
     A            WSJBKØ         1A  B 18 31DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                      COLOR(GRN)
     A                                 18 45'(J=Ja)'
     A                                 20  2'Avvikende printer.........'
     A            WSPRT         10A  B 20 31DSPATR(UL)
     A                                      COLOR(GRN)
     A                                 23  2'F3 = Avslutt'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
