     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('SYKS020010' 'SYKS02' 'SY400-
     A                                      LO/TRANS')
     A                                      HELP
     A                                      ALTHELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
     A          R WINDOW1
     A                                      WINDOW(*DFT 10 45 *NOMSGLIN)
     A                                      CF12(12 'Avslutt')
     A                                      CF03(12)
     A                                  1  2'SYFA18T'
     A                                      COLOR(BLU)
     A                                  1 11MSGCON(032 JOV1311 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2'Turnr:'
     A            UPRO           8Y 0O  3 11COLOR(WHT)
     A                                  6  2MSGCON(024 DIV0387 *LIBL/SYMSGF)
     A            WSGNA          4A  B  6 27
     A            WSGNB          5A  B  6 32DSPATR(PC)
     A            WSGNC          6A  B  6 38
     A                                  8  2MSGCON(040 JOV1312 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  9 25MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        40A  O 10  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
