     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                  1  3'SYSPED/SYFA62I'
     A                                      COLOR(BLU)
     A                                  1 22'Merking av internkonteringer'
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(GRN)
     A                                  1 73TIME
     A                                      COLOR(GRN)
     A                                  7  3'Velg høyeste periode som skal merk-
     A                                      es'
     A                                      COLOR(WHT)
     A                                  9  3'Tast dag..'
     A            WSDAG          2Y 0B  9 16EDTCDE(4)
     A                                  9 22'(0 = merk HELE perioden)'
     A                                 11  3'Tast måned'
     A            WSMND          2Y 0B 11 16EDTCDE(4)
     A                                 13  3'Tast år...'
     A            WSAAR          2Y 0B 13 16EDTCDE(4)
     A                                 23  3'F3=avbryt dette program'
     A                                      COLOR(BLU)
     A                                 16  3'OBS!! Når en merker en FULL PERIOD-
     A                                      E (0 i dag) sjekkes det mot TURENS -
     A                                      PERIODE.'
     A                                 17  3'      Hvis dag er utfylt sjekkes d-
     A                                      et mot TURENS DATO (fradato ved inn-
     A                                      land og '
     A                                 18  3'      ved eksport, tildato ved imp-
     A                                      ort).                              -
     A                                            '
     A                                 19  3'      Hvis oppdrag IKKE er på tur -
     A                                      (og avd.param. tillater dette) sjek-
     A                                      kes det '
     A                                 20  3'      mot oppdragets dato (eller p-
     A                                      eriodedel av dato) etter samme prin-
     A                                      sipp.   '
