     A*****************************************************************
     A*           PURRING AV UFAKTURERTE OPPDRAG - SAMMENDRAG         *
     A* ANTALL LINJE=72,  ANTALL TEGN PR. LINJE=120, OVERFLOW=72      *
     A*****************************************************************
     A          R SHEAD1
     A  91                                  CPI(15)
     A            MSG01         70A     4 27
     A                                  4 87'T.O.M'
     A            WUDTD          2  0O  4 94
     A                                  4 96'.'
     A            WUDTM          2  0O  4 97
     A                                  4 99'.'
     A            WUDTÅ          2  0O  4100
     A                                  4104MSGCON(5 DIV0062 SYMSGF)
     A            UTDT           6  0O  4110EDTCDE(Y)
     A                                  5  1' Sign.  Avd.  Antall    '
     A                                  5 25' Beløp                  '
     A                                  6  1'------------------------'
     A                                  6 25'------------------------'
     A                                  6 49'------------------------'
     A                                  6 73'------------------------'
     A                                  6 97'------------------------'
     A                                  6120'------------------------'
     A          R STOTAL                    SPACEB(1)
     A  91                                  CPI(15)
     A            WWSG           3A  O     3
     A  40        WWAVD          4  0O     9EDTCDE(4)
     A            XNTOPD         5  0O    15EDTCDE(4)
     A            XBLOPD        11  2O    23EDTCDE(J)
     A          R SGRAND                    SPACEB(2)
     A  91                                  CPI(15)
     A                                     3'* TOTALER *'
     A            XNTTOT         5  0O    15EDTCDE(4)
     A            XBLTOT        11  2O    23EDTCDE(J)
