     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                  4 14MSGCON(040 DIV2531 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 58'Copyright: SYSTEMA A/S'
     A                                      COLOR(TRQ)
     A                                  7 14MSGCON(024 DIV1497 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  7 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A                                  9 14MSGCON(024 DIV1498 *LIBL/SYMSGF)
     A            WSSG           3A  B  9 40DSPATR(UL)
     A                                      COLOR(YLW)
     A  98                                  DSPATR(RI)
     A                                 14 14MSGCON(024 DIV1510 *LIBL/SYMSGF)
     A            WSPRT         10A  B 14 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23 14MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
