     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYFA20'
     A                                      COLOR(BLU)
     A            MSG001        40A  O  1 19MSGID(DIV 1621 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
S17  A*                                 2  2MSGCON(016 SHU1025 *LIBL/SYMSGF)
S17  A*           UEMAIL         1   O  2 19COLOR(RED)
     A                                  3  2MSGCON(012 DIV0050 *LIBL/SYMSGF)
     A            UAVD           4Y 0O  3 19EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(020 DIV1626 *LIBL/SYMSGF)
     A            WSK            1A  B  5 24
     A                                  6 48MSGCON(015 SHU0246 *LIBL/SYMSGF)
     A                                  7  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B  7  9DSPATR(UL)
     A                                      EDTCDE(4)
     A                                  7 19MSGCON(015 DIV1623 *LIBL/SYMSGF)
     A            WSGN          15A  B  7 36DSPATR(UL)
     A            WSAGRF        15A  B  7 64
     A            WSPRCO         8Y 0B  8  9DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A            WSGNCO        15A  B  8 36DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A            WSAGCO        15A  B  8 64COLOR(WHT)
     A                                      DSPATR(PR)
     A                                  9  2MSGCON(060 DIV1622 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 10  7'01'
     A                                 10 15'02'
     A                                 10 23'03'
     A                                 10 31'04'
     A                                 10 39'05'
     A                                 10 47'06'
     A                                 10 55'07'
     A            WSOP1          7Y 0B 11  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP2          7Y 0B 11 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP3          7Y 0B 11 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP4          7Y 0B 11 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP5          7Y 0B 11 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP6          7Y 0B 11 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP7          7Y 0B 11 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12  7'08'
     A                                 12 15'09'
     A                                 12 23'10'
     A                                 12 31'11'
     A                                 12 39'12'
     A                                 12 47'13'
     A                                 12 55'14'
     A            WSOP8          7Y 0B 13  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP9          7Y 0B 13 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP10         7Y 0B 13 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP11         7Y 0B 13 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP12         7Y 0B 13 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP13         7Y 0B 13 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP14         7Y 0B 13 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 14  7'15'
     A                                 14 15'16'
     A                                 14 23'17'
     A                                 14 31'18'
     A                                 14 39'19'
     A                                 14 47'20'
     A                                 14 55'21'
     A            WSOP15         7Y 0B 15  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP16         7Y 0B 15 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP17         7Y 0B 15 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP18         7Y 0B 15 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP19         7Y 0B 15 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP20         7Y 0B 15 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP21         7Y 0B 15 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 16  7'22'
     A                                 16 15'23'
     A                                 16 23'24'
     A                                 16 31'25'
     A                                 16 39'26'
     A                                 16 47'27'
     A                                 16 55'28'
     A            WSOP22         7Y 0B 17  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP23         7Y 0B 17 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP24         7Y 0B 17 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP25         7Y 0B 17 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP26         7Y 0B 17 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP27         7Y 0B 17 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP28         7Y 0B 17 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  7'29'
     A                                 18 15'30'
     A                                 18 23'31'
     A                                 18 31'32'
     A                                 18 39'33'
     A                                 18 47'34'
     A                                 18 55'35'
     A            WSOP29         7Y 0B 19  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP30         7Y 0B 19 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP31         7Y 0B 19 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP32         7Y 0B 19 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP33         7Y 0B 19 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP34         7Y 0B 19 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP35         7Y 0B 19 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 21  2MSGCON(048 DIV1624 *LIBL/SYMSGF)
     A            WSMM≈≈         4Y 0B 21 54DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                 21 60MSGCON(005 DIV0062 *LIBL/SYMSGF)
     A            WSFDAT         6Y 0B 21 67EDTCDE(4)
     A                                      COLOR(YLW)
     A            UIKKE          1A  B 22  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A                                 22  5MSGCON(038 DIV1625 *LIBL/SYMSGF)
     A            MSG009        18A  O 23  2MSGID(DIV 0020 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        70A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A  30        YOPD           7Y 0O 24 73COLOR(RED)
