     A          R SYFA51P1
     A                                  2  2MSGCON(30 YBC0500 SYMSGF)
     A                                      HIGHLIGHT
     A                                  2 50'UTSKRIFT DATO:'
     A                                  2 70DATE EDTCDE(Y)
N01  A                                  3  2'Kunde:'
N01  A            KUNDNR         8  0   3  8EDTCDE(Z)
N01  A            KNAVN         30      3 17
     A                                  4  2MSGCON(18 YBC0501 SYMSGF)
     A            WSDTF          6  0   4 22EDTCDE(Y)
     A                                  4 36MSGCON(18 YBC0502 SYMSGF)
     A            WSDTT          6  0   4 56EDTCDE(Y)
     A                                  5  2MSGCON(18 JOV1370 SYMSGF)
     A            WSSAML         1      5 22
     A N27                              6  2MSGCON(66 YBC0504 SYMSGF)
     A  27                              6  2MSGCON(75 YBC0852 SYMSGF)
     A                                  7  2'-------------------------'
     A                                  7 27'-------------------------'
     A                                  7 52'-------------------------'
     A                                  8  2' '
     A          R SYFA51P2
     A            XAVD           4  0      2EDTCDE(Z)
     A            XANT           9  0     22EDTCDE(Z)
     A            XDAG           5  2     42EDTCDE(3)
     A  27        KOSFNV        16A       57
     A                                    75' '
     A                                      SPACEA(1)
     A          R SYFA51P3
     A                                     2'-------------------------'
     A                                    27'-------------------------'
     A                                    52'-------------------------'
     A                                      SPACEA(1)
     A                                     2MSGCON(18 YBC0505 SYMSGF)
     A            XANTT          9  0     22EDTCDE(Z)
     A            XDAGT          5  2     42EDTCDE(3)
