     A*%%TS  SD  20160526  064759  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE
     A*%%TS  SD  20160526  064759  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYFASA'
     A                                      COLOR(BLU)
     A                                  1 25MSGCON(033 DIV0222 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 25MSGCON(033 DIV0274 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 73TIME
     A                                  4  2'Velg og trykk Enter:'
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(024 DIV0225 *LIBL/SYMSGF)
     A            WSAVD          4D 0B  6 29
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                  6 36MSGCON(045 DIV0275 *LIBL/SYMSGF)
     A                                  7 36MSGCON(045 DIV0276 *LIBL/SYMSGF)
     A                                  8  2MSGCON(024 DIV0226 *LIBL/SYMSGF)
     A            WSSG           3A  B  8 29
     A  98                                  DSPATR(PC)
     A  98                                  DSPATR(RI)
     A                                  8 36MSGCON(045 DIV0277 *LIBL/SYMSGF)
     A                                 12  2MSGCON(024 DIV0227 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A                                 13  2MSGCON(024 SHU0726 *LIBL/SYMSGF)
     A            WSPRT         10A  B 13 29
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                 15  2MSGCON(024 SHU0727 *LIBL/SYMSGF)
     A            WSPRT2        10A  B 15 29
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 51'(C) Copyright Systema A/S 1990'
     A                                      COLOR(WHT)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
