     A*%%TS  SD  20160902  130808  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A          R BILDE
     A*%%TS  SD  20160902  130808  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt')
     A                                      CF12(03)
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYFA67C'
     A                                      COLOR(BLU)
     A                                  1 12'Endring KUN av gebyr m/%-sats (VAL-
     A                                      /OLJ mm) '
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 72TIME
     A                                  6  5'Gebyrkode..:'
     A            WSGEB          3A  B  6 28
     A  85                                  DSPATR(PC)
     A  85                                  DSPATR(RI)
     A  85                                  ERRMSG('Gebyrkode ugyldig')
     A                                  8  5'Endring i %:'
     A                                  8 19'(+/-)'
     A            PLUMIN         1A  B  8 25
     A  86                                  DSPATR(RI)
     A  86                                  DSPATR(PC)
     A  86                                  ERRMSG('VELG + ELLER -')
S01  A*           WSNYSA         4Y 2B 17 25EDTCDE(M)
     A            WSNYSA         5Y 3B  8 28EDTCDE(J)
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A  88                                  ERRMSG('Ny sats kan ikke være 0')
     A                                      COMP(GT ,000)
     A                                 10  5'Avtaletype.:   '
     A            WSAVTY         1A  B 10 28
     A  87                                  DSPATR(RI)
     A  87                                  DSPATR(PC)
     A  87                                  ERRMSG('Ugyldig avtaletype')
     A                                 10 33'( K = Kun Kundeavtaler )'
     A                                 11 33'( B = Kun Brutto/Hvem belastes hva-
     A                                       )      '
     A                                 12 33'( Blank = Alle linjer )           -
     A                                              '
     A                                 15  5'Utelat kunder fra til:'
     A            KUNDFR         8Y 0B 15 28EDTCDE(4)
     A  89                                  DSPATR(RI)
     A  89                                  DSPATR(PC)
     A  89                                  ERRMSG('Fra/til kunde ugyldig')
     A                                      CHECK(RB)
     A                                 15 38'->'
     A            KUNDTI         8Y 0B 15 42EDTCDE(4)
     A  89                                  DSPATR(RI)
     A                                      CHECK(RB)
     A            ANTLIN         5  0O 18 41EDTCDE(4)
     A                                      COLOR(RED)
     A                                 18  5'Linjer ble endret i siste kjøring:'
     A                                 23  2'F3=Avslutt   Enter = Kjør endring'
     A                                      COLOR(BLU)
