     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'SØK KUNDE')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYFA51R'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 YBC0500 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                  2 10MSGCON(050 JOV1372 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(018 YBC0501 *LIBL/SYMSGF)
     A            WSDTF          6D 0B  5 22DSPATR(UL)
     A  99
     AO 98                                  DSPATR(PC)
     A  99
     AO 98                                  DSPATR(HI)
     A                                  7  2MSGCON(018 YBC0502 *LIBL/SYMSGF)
     A            WSDTT          6D 0B  7 22DSPATR(UL)
     A  97                                  DSPATR(PC)
     A  97                                  DSPATR(HI)
     A                                  9  2MSGCON(018 JOV1370 *LIBL/SYMSGF)
     A            WSSAML         1A  B  9 22
     A                                  9 32MSGCON(030 JOV1371 *LIBL/SYMSGF)
     A                                 11  2MSGCON(018 YBC0851 *LIBL/SYMSGF)
     A            WSSGJA         1A  B 11 22DSPATR(UL)
     A                                      VALUES('J' 'N')
     A                                 11 32'(J/N)'
     A                                 17  2MSGCON(018 YBC0503 *LIBL/SYMSGF)
     A            WSPRT         10A  B 17 22DSPATR(UL)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        70A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                 13  2MSGCON(016 SHU1263 *LIBL/SYMSGF)
     A            WSKUND         8Y 0B 13 22EDTCDE(Z)
     A  96                                  DSPATR(PC)
     A  96                                  DSPATR(HI)
     A                                 23 21MSGCON(018 SHU1264 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
