     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                  1  5'SYSPED/SYFALA'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(040 DIV1402 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 20MSGCON(040 SHU0206 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A                                  8  3MSGCON(024 DIV1497 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  8 42DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  99                                  ERRMSG('DEPARTMENT NOT VALID' 99)
     A                                 10  3MSGCON(024 DIV1498 *LIBL/SYMSGF)
     A            WSSG           3A  B 10 42COLOR(YLW)
     A  98                                  ERRMSG('INITIALS NOT VALID.' 98)
     A
     A                                      DSPATR(UL)
     A                                 12  3MSGCON(024 DIV1544 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B 12 42DSPATR(UL)
     A  97                                  ERRMSG('TRIPNO.  NOT VALID.' 97)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 14  3MSGCON(024 SHU0293 *LIBL/SYMSGF)
     A            BRUDDA         1   B 14 42COLOR(YLW)
     A                                 14 55'(J = ja)'
     A                                 16  3MSGCON(024 DIV1509 *LIBL/SYMSGF)
     A            WSJBK          1A  B 16 42DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N')
     A                                 16 55'(J = ja)'
     A                                 18  3MSGCON(024 DIV1510 *LIBL/SYMSGF)
     A            WSPRT         10A  B 18 42DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23 18'F3 = END JOB'
     A                                      COLOR(BLU)
