     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                      CF02(02 'HENT PL')
     A                                  1  3'SYSPED/SYFAGI'
     A                                      COLOR(BLU)
     A                                  1 20'Utskrift GODSLISTE innland'
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A            NATTXT        30A  O  2 20COLOR(RED)
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A                                  6  3MSGCON(024 DIV1544 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B  6 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  97                                  ERRMSG('Ugyldig turnummer' 97)
     A                                  6 39'Kopi J/N:'
     A            WSKOPI         1A  B  6 50COLOR(YLW)
     A  96                                  ERRMSG('J=KOPI/Behold versj.nr, N=O-
     A                                      riginal/ny versjon.' 96)
     A                                  6 54MSGCON(026 SHU0736 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A                                      COLOR(BLU)
     A                                  7  3MSGCON(024 CBA0100 *LIBL/SYMSGF)
     A            LISJN          1A  B  7 29COLOR(YLW)
     A                                  7 31MSGCON(006 DIV0430 *LIBL/SYMSGF)
     A                                  7 38MSGCON(011 TRO0496 *LIBL/SYMSGF)
     A            BELJN          1A  B  7 50COLOR(YLW)
     A                                  7 54MSGCON(025 SHU0733 *LIBL/SYMSGF)
     A                                  8 54MSGCON(025 SHU0734 *LIBL/SYMSGF)
     A                                  9  3MSGCON(024 SHU0590 *LIBL/SYMSGF)
     A            FAXJN          1A  B  9 29COLOR(YLW)
     A                                  9 31MSGCON(006 DIV0430 *LIBL/SYMSGF)
     A                                  9 38MSGCON(011 TRO0496 *LIBL/SYMSGF)
     A            BELJN2         1A  B  9 50COLOR(YLW)
     A                                  9 54MSGCON(025 SHU0735 *LIBL/SYMSGF)
     A                                 10  3MSGCON(024 JOV1275 *LIBL/SYMSGF)
     A            EDIJN          1A  B 10 29COLOR(YLW)
     A                                 10 31MSGCON(012 DIV0430 *LIBL/SYMSGF)
     A                                 11  3MSGCON(024 SHU0293 *LIBL/SYMSGF)
     A            BRUDDA         1A  B 11 29COLOR(YLW)
     A                                 11 31MSGCON(012 DIV0430 *LIBL/SYMSGF)
     A                                 12  3MSGCON(024 JOV1276 *LIBL/SYMSGF)
     A            EDITR          1A  B 12 29COLOR(YLW)
     A                                 12 31MSGCON(012 DIV0430 *LIBL/SYMSGF)
     A                                 14  3MSGCON(024 JOV1263 *LIBL/SYMSGF)
     A            PLLOPD         2Y 0B 14 29EDTCDE(4)
     A                                      DSPATR(HI)
     A                                      DSPATR(PR)
     A                                 15  3MSGCON(024 JOV1264 *LIBL/SYMSGF)
     A            PLLEXT         2Y 0B 15 29DSPATR(UL)
     A N50                                  COLOR(YLW)
     A  50                                  COLOR(WHT)
     A  50                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A                                 17  3MSGCON(024 SHU0739 *LIBL/SYMSGF)
     A            WSSAML         1A  B 17 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17 31MSGCON(012 DIV0430 *LIBL/SYMSGF)
     A                                 19  3MSGCON(024 DIV1510 *LIBL/SYMSGF)
     A            WSPRT         10A  B 19 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19 41MSGCON(015 JOV1277 *LIBL/SYMSGF)
     A                                 20  3MSGCON(025 SHU0742 *LIBL/SYMSGF)
     A            WSFRBR         1A  B 20 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 21  3MSGCON(024 DIV1510 *LIBL/SYMSGF)
     A            WSPRT2        10A  B 21 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 21 41MSGCON(015 JOV1278 *LIBL/SYMSGF)
     A                                 23  3'F2=Hent verdier fra tur'
     A                                      COLOR(BLU)
     A                                 23 59'F3 = Avbryt'
     A                                      COLOR(BLU)
