     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R BILDE01
     A                                      CF12(12 'Forrige')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYFA80'
     A                                      COLOR(BLU)
     A                                  1 22'Standardverdier for CASS Avregning'
     A                                      COLOR(WHT)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  4  2'Leverandørsnummer . :'
     A            WODTCALN  R     D  B  4 25REFFLD(SRR/LEVN *LIBL/SR)
     A                                  5  2'Signatur  . . . . . :'
     A            WODTCASG       3A  B  5 25
     A                                  6  2'Gebyrkod, Eksport . :'
     A            WODTCAFE       3A  B  6 25
     A                                  7  4'Innland . . . . . :'
     A            WODTCAFN       3A  B  7 25
     A                                  8  4'Moms  . . . . . . :'
     A            WODTCAMV       3A  B  8 25
     A                                  9  4'Overskudd, EXW  . :'
     A            WODTCAOV       3A  B  9 25
     A                                 10  2'Utskriftskø . . . . :'
     A            WODTCAP1      10A  B 10 25
     A                                 11  4'Bibliotek . . . . :'
     A            WODTCAP2      10A  B 11 25
     A                                 12  4'Hold ?  . . . . . :'
     A            WODTCAP3       1A  B 12 25
     A                                 13  4'Save ?  . . . . . :'
     A            WODTCAP4       1A  B 13 25
     A                                 23  2MSGCON(018 TBR0015 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 50'(c) Copyright Systema A/S 1990'
     A                                      COLOR(WHT)
