     A          R SYFA27WR
      * SORTBEGREP
     A            WA01          35          COLHDG('S0004')
     A            WA02          35          COLHDG('S0010')
     A            WA03           6S         COLHDG('XFN')
     A            WA04           8          COLHDG('FORMATNAVN')
      * SYFA27PF,  FHEAD
     A            WB01          30          COLHDG('KNAVN')
     A            WB02          30          COLHDG('ADR1')
     A            WB03          30          COLHDG('ADR2')
     A            WB04           4S 0       COLHDG('POSTNR')
     A            WB05          24          COLHDG('ADR3')
     A            WB06           6S 0       COLHDG('XFN')
     A            WB07           8S 0       COLHDG('KUNDNR')
     A            WB08           6S 0       COLHDG('IDAGX')
     A            WB09           6S 0       COLHDG('XFFDT')
      * SYFA27PF, FDET
     A            WC01           9S 0       COLHDG('HEFBV')
     A            WC02           9S 0       COLHDG('HEVKT')
     A            WC03           7S 0       COLHDG('HENT')
     A            WC04           4S 0       COLHDG('HEAVD')
     A            WC05           7S 0       COLHDG('HEOPD')
     A            WC06          13S 2       COLHDG('XBRUTT')
     A            WC07          15          COLHDG('FSSOK')
      * SYFA27PF, FTOT
     A            WD01           4S 2       COLHDG('MVAPRO')
     A            WD02           9S 2       COLHDG('XMVGR')
     A            WD03           8S 2       COLHDG('XMOM')
      * SYFA27PF,  FTOT2 ELLER FTOT2B
     A            WE01          13S 2       COLHDG('XBRUT')
      * KEY
     A          K WA03
