     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('FELLES' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A          H                           HLPDOC('FELLES' 'HELPNU' 'HLP400')
     A                                      HLPARA(02 001 24 080)
     A                                  1  2'SYSPED/SYFAPS'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(040 DIV2129 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 71TIME
     A                                  6  2MSGCON(024 DIV1497 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  6 29DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A                                  8  2MSGCON(024 DIV1498 *LIBL/SYMSGF)
     A            WSSG           3A  B  8 29DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                 20  2MSGCON(024 DIV1509 *LIBL/SYMSGF)
     A            WSJBK          1A  B 20 29DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 20 51MSGCON(010 DIV0259 *LIBL/SYMSGF)
     A                                 21  2MSGCON(024 DIV1510 *LIBL/SYMSGF)
     A            WSPRT         10A  B 21 29DSPATR(UL)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
