********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SØK KUN EN KUNDE AV GANGEN
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R BILDE1
     A                                      CF03(03 'Avslutt')
     A                                      CF12(03)
     A                                  1  2'SYSPED/SYFA29'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 DIV0441 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(033 DIV0443 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(033 DIV0444 *LIBL/SYMSGF)
     A                                  4 42MSGCON(033 DIV4168 *LIBL/SYMSGF)
     A                                  5  2MSGCON(033 DIV0445 *LIBL/SYMSGF)
     A                                  5 42MSGCON(033 DIV0448 *LIBL/SYMSGF)
     A                                  6  2MSGCON(033 DIV4169 *LIBL/SYMSGF)
     A                                  6 42MSGCON(033 JOV0070 *LIBL/SYMSGF)
     A                                  7  2MSGCON(033 DIV4170 *LIBL/SYMSGF)
     A                                  7 42MSGCON(033 JOV0071 *LIBL/SYMSGF)
     A                                  8  2MSGCON(033 YBC1907 *LIBL/SYMSGF)
     A                                  8 42MSGCON(033 DIV4172 *LIBL/SYMSGF)
     A                                  9  2MSGCON(033 YBC0304 *LIBL/SYMSGF)
     A                                  9 42MSGCON(033 DIV0449 *LIBL/SYMSGF)
     A                                 10  2MSGCON(033 YBC0305 *LIBL/SYMSGF)
     A                                 10 42MSGCON(033 DIV0450 *LIBL/SYMSGF)
     A                                 11  2MSGCON(033 YBC0624 *LIBL/SYMSGF)
     A                                 11 42MSGCON(033 DIV0451 *LIBL/SYMSGF)
     A                                 12  2MSGCON(033 YBC0625 *LIBL/SYMSGF)
     A                                 12 42MSGCON(033 DIV0452 *LIBL/SYMSGF)
     A                                 13  2MSGCON(033 YBC0306 *LIBL/SYMSGF)
     A                                 13 42MSGCON(033 DIV0453 *LIBL/SYMSGF)
     A                                 14  2MSGCON(033 DIV0446 *LIBL/SYMSGF)
     A                                 14 42MSGCON(033 DIV4178 *LIBL/SYMSGF)
     A                                 15  2MSGCON(033 DIV0447 *LIBL/SYMSGF)
     A                                 15 42MSGCON(033 DIV5087 *LIBL/SYMSGF)
     A                                 16  2MSGCON(033 DIV4179 *LIBL/SYMSGF)
     A                                 16 42MSGCON(033 DIV5088 *LIBL/SYMSGF)
     A                                 17 42MSGCON(030 YBC0449 *LIBL/SYMSGF)
     A                                 19  2MSGCON(010 DIV0442 *LIBL/SYMSGF)
     A            WSRI           1A  B 19 34DSPATR(UL)
     A                                      COLOR(YLW)
     A N27                             20  2MSGCON(030 JOV0123 *LIBL/SYMSGF)
     A N27        WSPRO     R        B 20 34REFFLD(KOVR/KOVPRO *LIBL/KODTV)
     A                                      COLOR(YLW)
     A                                      VALUES('F' 'O')
     A N27                             20 37MSGCON(024 DIV4208 *LIBL/SYMSGF)
     A N27                             21 37MSGCON(024 DIV4209 *LIBL/SYMSGF)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R BILDE2
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'SØK')
     A                                      CF12(12 'FORRIGE BILDE')
     A                                      CF10(10 'GRAFISK')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYFA29'
     A                                      COLOR(BLU)
     A N27N28                           1 20MSGCON(018 DIV4211 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A N27 28                           1 20MSGCON(018 DIV4212 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                  1 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  3 11MSGCON(030 DIV0441 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  40                              3 42MSGCON(027 DIV4191 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  41                              3 42MSGCON(027 DIV0454 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  42                              3 42MSGCON(027 DIV0459 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  43                              3 42MSGCON(027 DIV0485 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  44                              3 42MSGCON(027 DIV0460 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  45                              3 42MSGCON(027 DIV0462 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  46                              3 42MSGCON(027 DIV0464 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  47                              3 42MSGCON(027 DIV0466 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  48                              3 42MSGCON(027 DIV0468 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  49                              3 42MSGCON(027 DIV0470 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  50                              3 42MSGCON(027 DIV0471 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  51                              3 42MSGCON(027 DIV4194 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  52                              3 42MSGCON(027 DIV4195 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  53                              3 42MSGCON(027 DIV4184 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  54                              3 42MSGCON(027 DIV4185 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  55                              3 42MSGCON(027 DIV4180 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  56                              3 42MSGCON(027 DIV4181 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  57                              3 42MSGCON(027 DIV4182 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  58                              3 42MSGCON(027 DIV4183 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  59                              3 42MSGCON(027 DIV4192 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  61                              3 42MSGCON(027 YBC0307 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  62                              3 42MSGCON(027 YBC0308 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  63                              3 42MSGCON(027 YBC0309 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  64                              3 42MSGCON(027 YBC0626 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  65                              3 42MSGCON(027 YBC0627 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  66                              3 42MSGCON(027 YBC1908 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  8 11MSGCON(015 DIV0455 *LIBL/SYMSGF)
     A            WSDTÅ          2Y 0B  8 28DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 10 11MSGCON(015 DIV0456 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B 10 28DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 10 37MSGCON(024 DIV0457 *LIBL/SYMSGF)
     A  40                             12 11MSGCON(015 DIV4193 *LIBL/SYMSGF)
     A  40        WSRUND         8Y 0B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  42                             12 11MSGCON(016 TBR0246 *LIBL/SYMSGF)
     A  42        WSAVDG         7A  B 12 28DSPATR(UL)
     A  97                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  44                             12 11MSGCON(015 DIV0461 *LIBL/SYMSGF)
     A  44        WSLKF          2A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  45                             12 11MSGCON(015 DIV0463 *LIBL/SYMSGF)
     A  45        WSOT           2A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  46                             12 11MSGCON(015 DIV0465 *LIBL/SYMSGF)
     A  46        WSSG           3A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  51                             12 11MSGCON(015 DIV4196 *LIBL/SYMSGF)
     A  51        WSBILN         8A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  52                             12 11MSGCON(015 DIV4197 *LIBL/SYMSGF)
     A  52        WSBILK         3A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  53
     AO 54                             12 11MSGCON(015 JOV0074 *LIBL/SYMSGF)
     A  53
     AO 54        WSSTED         5A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  53
     AO 54                             12 35MSGCON(010 JOV0173 *LIBL/SYMSGF)
     A  53
     AO 54        WSSTLK         2A  B 12 46DSPATR(UL)
     A                                      COLOR(YLW)
     A  41
     AO 66                             12 11MSGCON(015 DIV0458 *LIBL/SYMSGF)
     A  47                             12 11MSGCON(015 DIV0467 *LIBL/SYMSGF)
     A  43
     AO 48
     AO 49
     AO 57
     AO 62
     AO 64
     AO 65
     AO 59                             12 11MSGCON(015 DIV0469 *LIBL/SYMSGF)
     A  50                             12 11MSGCON(015 DIV0472 *LIBL/SYMSGF)
     A  63                             12 11MSGCON(015 YBC0311 *LIBL/SYMSGF)
     A  41
     AO 43
     AO 47
     AO 48
     AO 49
     AO 50
     AO 57
     AO 59        WSKN           8Y 0B 12 28DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  62
     AO 64
     AO 65
     AO 66
     AO 63        W2KN           8Y 0B 12 28DSPATR(UL)
     A  29                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  55                             12 11MSGCON(015 DIV0461 *LIBL/SYMSGF)
     A  55        WSLKFS         2A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  55                             12 41MSGCON(015 DIV4186 *LIBL/SYMSGF)
     A  55        WSSDF          5A  B 12 58DSPATR(UL)
     A                                      COLOR(YLW)
     A  56                             12 11MSGCON(015 DIV4188 *LIBL/SYMSGF)
     A  56        WSTUR          8Y 0B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  58                             12 11MSGCON(015 DIV4189 *LIBL/SYMSGF)
     A  58        WSRGF          2A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  61                             12 11MSGCON(015 YBC0310 *LIBL/SYMSGF)
     A  61        WSFR           3A  B 12 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  44                             14 11MSGCON(015 DIV4165 *LIBL/SYMSGF)
     A  44        WSLKT          2A  B 14 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  48                             14 11MSGCON(015 DIV0461 *LIBL/SYMSGF)
     A  48        WSLK1          2A  B 14 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  49                             14 11MSGCON(015 DIV0454 *LIBL/SYMSGF)
     A  49        WSKNA          8Y 0B 14 28DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  64                             14 11MSGCON(015 DIV0461 *LIBL/SYMSGF)
     A  65
     AO 55                             14 11MSGCON(015 DIV4165 *LIBL/SYMSGF)
     A  64
     AO 65
     AO 55        WSLKTS         2A  B 14 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  64                             14 41MSGCON(015 DIV4186 *LIBL/SYMSGF)
     A  65
     AO 55                             14 41MSGCON(015 DIV4187 *LIBL/SYMSGF)
     A  64
     AO 65
     AO 55        WSSDT          5A  B 14 58DSPATR(UL)
     A                                      COLOR(YLW)
     A  57                             14 11MSGCON(015 DIV4189 *LIBL/SYMSGF)
     A  57        WSRG1          2A  B 14 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  58                             14 11MSGCON(015 DIV4190 *LIBL/SYMSGF)
     A  58        WSRGT          2A  B 14 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  59                             14 11MSGCON(015 DIV0463 *LIBL/SYMSGF)
     A  59        WSOT2          2A  B 14 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  62
     AO 66                             14 11MSGCON(015 YBC0310 *LIBL/SYMSGF)
     A  62
     AO 66        WSFR2          3A  B 14 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  48                             16 11MSGCON(015 DIV4165 *LIBL/SYMSGF)
     A  48        WSLK2          2A  B 16 28DSPATR(UL)
     A                                      COLOR(YLW)
     A  57                             16 11MSGCON(015 DIV4190 *LIBL/SYMSGF)
     A  57        WSRG2          2A  B 16 28DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18 11MSGCON(015 YBC0322 *LIBL/SYMSGF)
     A            WSMNDF         2Y 0B 18 28DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      RANGE(1 12)
     A                                 18 31'-'
     A            WSMNDT         2Y 0B 18 33DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      RANGE(1 12)
     A                                 23 11MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 31MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 51MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R BILDE3
     A                                      CF03(03 'Avslutt')
     A                                      CF07(07 'SE PÅ DETALJER')
     A                                      CF12(12 'FORRIGE BILDE')
     A                                      CF13(13 'KODE VALGBILDE')
     A                                      CF10(10 'grafisk')
     A                                  1  2MSGCON(030 DIV0441 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  40                              1 33MSGCON(027 DIV4191 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  41                              1 33MSGCON(027 DIV0454 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  42                              1 33MSGCON(027 DIV0459 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  43                              1 33MSGCON(027 DIV0485 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  44                              1 33MSGCON(027 DIV0460 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  45                              1 33MSGCON(027 DIV0462 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  46                              1 33MSGCON(027 DIV0464 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  47                              1 33MSGCON(027 DIV0466 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  48                              1 33MSGCON(027 DIV0468 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  49                              1 33MSGCON(027 DIV0470 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  50                              1 33MSGCON(027 DIV0471 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  51                              1 33MSGCON(027 DIV4194 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  52                              1 33MSGCON(027 DIV4195 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  53                              1 33MSGCON(027 JOV0072 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  54                              1 33MSGCON(027 JOV0073 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  55                              1 33MSGCON(027 DIV4180 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  56                              1 33MSGCON(027 DIV4181 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  57                              1 33MSGCON(027 DIV4182 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  58                              1 33MSGCON(027 DIV4183 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  59                              1 33MSGCON(027 DIV4192 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  61                              1 33MSGCON(27 YBC0307 SYMSGF)
     A                                      COLOR(WHT)
     A  62                              1 33MSGCON(27 YBC0308 SYMSGF)
     A                                      COLOR(WHT)
     A  63                              1 33MSGCON(27 YBC0309 SYMSGF)
     A                                      COLOR(WHT)
     A  64                              1 33MSGCON(27 YBC0626 SYMSGF)
     A                                      COLOR(WHT)
     A  65                              1 33MSGCON(27 YBC0627 SYMSGF)
     A                                      COLOR(WHT)
     A  66                              1 33MSGCON(27 YBC1908 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 61MSGCON(015 DIV0455 *LIBL/SYMSGF)
     A            WSDTÅ          2Y 0O  1 77DSPATR(UL)
     A                                      COLOR(BLU)
     A  40                              2  2MSGCON(015 DIV4193 *LIBL/SYMSGF)
     A  40        WSRUND         8Y 0O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  42                              2  2MSGCON(015 DIV0456 *LIBL/SYMSGF)
     A  44                              2  2MSGCON(015 DIV0461 *LIBL/SYMSGF)
     A  44        WSLKF          2A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  44                              2 22MSGCON(015 DIV4165 *LIBL/SYMSGF)
     A  44        WSLKT          2A  O  2 39DSPATR(UL)
     A                                      COLOR(BLU)
     A  45                              2  2MSGCON(015 DIV0463 *LIBL/SYMSGF)
     A  45        WSOT           2A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  46                              2  2MSGCON(015 DIV0465 *LIBL/SYMSGF)
     A  46        WSSG           3A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  51                              2  2MSGCON(015 DIV4196 *LIBL/SYMSGF)
     A  51        WSBILN         8A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  52                              2  2MSGCON(015 DIV4197 *LIBL/SYMSGF)
     A  52        WSBILK         3A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  53
     AO 54                              2  2MSGCON(015 JOV0074 *LIBL/SYMSGF)
     A  53
     AO 54        WSSTED         5A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  55                              2  2MSGCON(015 DIV4186 *LIBL/SYMSGF)
     A  55        WSLKFS         2A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  55        WSSDF          5A  O  2 23DSPATR(UL)
     A                                      COLOR(BLU)
     A  64
     AO 65
     AO 55                              2 32MSGCON(015 DIV4187 *LIBL/SYMSGF)
     A  64
     AO 65
     AO 55        WSLKTS         2A  O  2 49DSPATR(UL)
     A                                      COLOR(BLU)
     A  64
     AO 65
     AO 55        WSSDT          5A  O  2 53DSPATR(UL)
     A                                      COLOR(BLU)
     A  56                              2  2MSGCON(015 DIV4188 *LIBL/SYMSGF)
     A  56        WSTUR          8Y 0O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  58                              2  2MSGCON(015 DIV4189 *LIBL/SYMSGF)
     A  58        WSRGF          2A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  58                              2 22MSGCON(015 DIV4190 *LIBL/SYMSGF)
     A  58        WSRGT          2A  O  2 39DSPATR(UL)
     A                                      COLOR(BLU)
     A  61                              2  2MSGCON(015 YBC0310 *LIBL/SYMSGF)
     A  61        WSFR           3A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  41                              2  2MSGCON(015 DIV0458 *LIBL/SYMSGF)
     A  47                              2  2MSGCON(015 DIV0467 *LIBL/SYMSGF)
     A  43
     AO 48
     AO 49
     AO 57
     AO 62
     AO 64
     AO 65
     AO 66
     AO 59                              2  2MSGCON(015 DIV0469 *LIBL/SYMSGF)
     A  50                              2  2MSGCON(015 DIV0463 *LIBL/SYMSGF)
     A  63                              2  2MSGCON(015 YBC0311 *LIBL/SYMSGF)
     A  41
     AO 43
     AO 47
     AO 48
     AO 49
     AO 50
     AO 57
     AO 59        WSKN           8Y 0O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  62
     AO 64
     AO 65
     AO 66
     AO 63        W2KN           8Y 0O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  48                              2 28MSGCON(015 YBC0432 *LIBL/SYMSGF)
     A  48        WSLK1          2A  O  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A  48                              2 48'-'
     A  48        WSLK2          2A  O  2 50DSPATR(UL)
     A                                      COLOR(BLU)
     A  49                              2 28MSGCON(015 DIV0454 *LIBL/SYMSGF)
     A  49        WSKNA          8Y 0O  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  57                              2 28MSGCON(015 YBC0433 *LIBL/SYMSGF)
     A  57        WSRG1          2A  O  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A  57                              2 48'-'
     A  57        WSRG2          2A  O  2 50DSPATR(UL)
     A                                      COLOR(BLU)
     A  59                              2 28MSGCON(015 DIV0463 *LIBL/SYMSGF)
     A  59        WSOT2          2A  O  2 45DSPATR(UL)
     A                                      COLOR(YLW)
     A  62
     AO 66                              2 28MSGCON(015 YBC0310 *LIBL/SYMSGF)
     A  62
     AO 66        WSFR2          3A  O  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A  71        WSNA          30A  O  2 28DSPATR(UL)
     A                                      COLOR(BLU)
     A                                  2 61MSGCON(015 DIV0456 *LIBL/SYMSGF)
     A            WSAVD          4Y 0O  2 77DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  37                              3  2MSGCON(078 DIV0473 *LIBL/SYMSGF)
     A  38                              3  2MSGCON(078 DIV0474 *LIBL/SYMSGF)
     A  39                              3  2MSGCON(078 DIV5093 *LIBL/SYMSGF)
     A                                  4  2MSGCON(009 YBC0313 *LIBL/SYMSGF)
     A  37        WSIN01        11Y 0O  4 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN02        11Y 0O  4 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN03        11Y 0O  4 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN04        11Y 0O  4 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN05        11Y 0O  4 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN06        11Y 0O  4 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN07        11Y 0O  4 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN08        11Y 0O  4 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN09        11Y 0O  4 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN10        11Y 0O  4 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN11        11Y 0O  4 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN12        11Y 0O  4 56COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSIN13        11Y 0O  4 69COLOR(YLW)
     A                                      EDTCDE(L)
     A                                  5  2MSGCON(009 YBC0314 *LIBL/SYMSGF)
     A  37        WSKS01        11Y 0O  5 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS02        11Y 0O  5 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS03        11Y 0O  5 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS04        11Y 0O  5 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS05        11Y 0O  5 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS06        11Y 0O  5 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS07        11Y 0O  5 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS08        11Y 0O  5 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS09        11Y 0O  5 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS10        11Y 0O  5 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS11        11Y 0O  5 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS12        11Y 0O  5 56COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSKS13        11Y 0O  5 69COLOR(YLW)
     A                                      EDTCDE(L)
     A                                  6  2MSGCON(009 DIV2048 *LIBL/SYMSGF)
     A  37        WSDI01        11Y 0O  6 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI02        11Y 0O  6 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI03        11Y 0O  6 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI04        11Y 0O  6 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI05        11Y 0O  6 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI06        11Y 0O  6 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI07        11Y 0O  6 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI08        11Y 0O  6 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI09        11Y 0O  6 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI10        11Y 0O  6 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI11        11Y 0O  6 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI12        11Y 0O  6 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSDI13        11Y 0O  6 69
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A                                  7  2MSGCON(009 DIV0478 *LIBL/SYMSGF)
     A  37        WSFB01        11Y 0O  7 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSFB02        11Y 0O  7 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSFB03        11Y 0O  7 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSFB04        11Y 0O  7 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSFB05        11Y 0O  7 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSFB06        11Y 0O  7 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSFB07        11Y 0O  7 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSFB08        11Y 0O  7 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSFB09        11Y 0O  7 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSFB10        11Y 0O  7 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSFB11        11Y 0O  7 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSFB12        11Y 0O  7 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFB13        11Y 0O  7 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  8  2MSGCON(009 DIV0479 *LIBL/SYMSGF)
     A  37        WSV01         11Y 0O  8 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV02         11Y 0O  8 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV03         11Y 0O  8 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV04         11Y 0O  8 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV05         11Y 0O  8 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV06         11Y 0O  8 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV07         11Y 0O  8 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV08         11Y 0O  8 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV09         11Y 0O  8 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV10         11Y 0O  8 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV11         11Y 0O  8 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV12         11Y 0O  8 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSV13         11Y 0O  8 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9  2MSGCON(009 DIV0480 *LIBL/SYMSGF)
     A  37        WSA01         11Y 0O  9 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA02         11Y 0O  9 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA03         11Y 0O  9 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA04         11Y 0O  9 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA05         11Y 0O  9 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA06         11Y 0O  9 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA07         11Y 0O  9 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA08         11Y 0O  9 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA09         11Y 0O  9 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA10         11Y 0O  9 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA11         11Y 0O  9 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA12         11Y 0O  9 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSA13         11Y 0O  9 69COLOR(YLW)
     A                                      EDTCDE(4)
     A    N32                          10  2MSGCON(009 YBC0312 *LIBL/SYMSGF)
     A  37N32     KOVK1          5Y 0O 10 20EDTCDE(4)
     A  37N32     KOVK2          5Y 0O 10 34EDTCDE(4)
     A  37N32     KOVK3          5Y 0O 10 48EDTCDE(4)
     A  37N32     KOVK4          5Y 0O 10 62EDTCDE(4)
     A  38N32     KOVK5          5Y 0O 10 20EDTCDE(4)
     A  38N32     KOVK6          5Y 0O 10 34EDTCDE(4)
     A  38N32     KOVK7          5Y 0O 10 48EDTCDE(4)
     A  38N32     KOVK8          5Y 0O 10 62EDTCDE(4)
     A  39N32     KOVK9          5Y 0O 10 20EDTCDE(4)
     A  39N32     KOVK10         5Y 0O 10 34EDTCDE(4)
     A  39N32     KOVK11         5Y 0O 10 48EDTCDE(4)
     A  39N32                          10 62'99999'
     A    N32                          11  2MSGCON(009 DIV0481 *LIBL/SYMSGF)
     A  37N32     WSAV01        11Y 0O 11 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37N32     WSAV02        11Y 0O 11 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37N32     WSAV03        11Y 0O 11 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37N32     WSAV04        11Y 0O 11 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38N32     WSAV05        11Y 0O 11 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38N32     WSAV06        11Y 0O 11 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38N32     WSAV07        11Y 0O 11 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38N32     WSAV08        11Y 0O 11 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39N32     WSAV09        11Y 0O 11 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39N32     WSAV10        11Y 0O 11 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39N32     WSAV11        11Y 0O 11 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39N32     WSAV12        11Y 0O 11 56COLOR(YLW)
     A                                      EDTCDE(4)
     A    N32     WSAV13        11Y 0O 11 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 13  2MSGCON(010 DIV0482 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                 14  2MSGCON(009 YBC0313 *LIBL/SYMSGF)
     A  37        WSIN21        11Y 0O 14 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN22        11Y 0O 14 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN23        11Y 0O 14 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN24        11Y 0O 14 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN25        11Y 0O 14 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN26        11Y 0O 14 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN27        11Y 0O 14 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN28        11Y 0O 14 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN29        11Y 0O 14 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN30        11Y 0O 14 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN31        11Y 0O 14 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN32        11Y 0O 14 56COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSIN33        11Y 0O 14 69COLOR(YLW)
     A                                      EDTCDE(L)
     A                                 15  2MSGCON(009 YBC0314 *LIBL/SYMSGF)
     A  37        WSKS21        11Y 0O 15 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS22        11Y 0O 15 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS23        11Y 0O 15 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS24        11Y 0O 15 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS25        11Y 0O 15 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS26        11Y 0O 15 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS27        11Y 0O 15 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS28        11Y 0O 15 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS29        11Y 0O 15 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS30        11Y 0O 15 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS31        11Y 0O 15 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS32        11Y 0O 15 56COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSKS33        11Y 0O 15 69COLOR(YLW)
     A                                      EDTCDE(L)
     A                                 16  2MSGCON(009 DIV2048 *LIBL/SYMSGF)
     A  37        WSDI21        11Y 0O 16 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI22        11Y 0O 16 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI23        11Y 0O 16 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI24        11Y 0O 16 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI25        11Y 0O 16 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI26        11Y 0O 16 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSDI27        11Y 0O 16 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSDI28        11Y 0O 16 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI29        11Y 0O 16 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI30        11Y 0O 16 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI31        11Y 0O 16 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI32        11Y 0O 16 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSDI33        11Y 0O 16 69
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A                                 17  2MSGCON(009 DIV0478 *LIBL/SYMSGF)
     A  37        WSFB21        11Y 0O 17 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSFB22        11Y 0O 17 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSFB23        11Y 0O 17 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSFB24        11Y 0O 17 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSFB25        11Y 0O 17 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSFB26        11Y 0O 17 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSFB27        11Y 0O 17 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSFB28        11Y 0O 17 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSFB29        11Y 0O 17 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSFB30        11Y 0O 17 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSFB31        11Y 0O 17 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSFB32        11Y 0O 17 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSFB33        11Y 0O 17 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  2MSGCON(009 DIV0479 *LIBL/SYMSGF)
     A  37        WSV21         11Y 0O 18 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV22         11Y 0O 18 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV23         11Y 0O 18 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV24         11Y 0O 18 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV25         11Y 0O 18 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV26         11Y 0O 18 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV27         11Y 0O 18 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV28         11Y 0O 18 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV29         11Y 0O 18 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV30         11Y 0O 18 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV31         11Y 0O 18 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV32         11Y 0O 18 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSV33         11Y 0O 18 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 19  2MSGCON(009 DIV0480 *LIBL/SYMSGF)
     A  37        WSA21         11Y 0O 19 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA22         11Y 0O 19 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA23         11Y 0O 19 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA24         11Y 0O 19 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA25         11Y 0O 19 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA26         11Y 0O 19 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA27         11Y 0O 19 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA28         11Y 0O 19 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA29         11Y 0O 19 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA30         11Y 0O 19 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA31         11Y 0O 19 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA32         11Y 0O 19 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSA33         11Y 0O 19 69COLOR(YLW)
     A                                      EDTCDE(4)
     A    N32                          20  2MSGCON(009 YBC0312 *LIBL/SYMSGF)
     A  37N32     WSVK1          5Y 0O 20 20EDTCDE(4)
     A  37N32     WSVK2          5Y 0O 20 34EDTCDE(4)
     A  37N32     WSVK3          5Y 0O 20 48EDTCDE(4)
     A  37N32     WSVK4          5Y 0O 20 62EDTCDE(4)
     A  38N32     WSVK5          5Y 0O 20 20EDTCDE(4)
     A  38N32     WSVK6          5Y 0O 20 34EDTCDE(4)
     A  38N32     WSVK7          5Y 0O 20 48EDTCDE(4)
     A  38N32     WSVK8          5Y 0O 20 62EDTCDE(4)
     A  39N32     WSVK9          5Y 0O 20 20EDTCDE(4)
     A  39N32     WSVK10         5Y 0O 20 34EDTCDE(4)
     A  39N32     WSVK11         5Y 0O 20 48EDTCDE(4)
     A  39N32                          20 62'99999'
     A    N32                          21  2MSGCON(009 DIV0481 *LIBL/SYMSGF)
     A  37N32     WSAV21        11Y 0O 21 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37N32     WSAV22        11Y 0O 21 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37N32     WSAV23        11Y 0O 21 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37N32     WSAV24        11Y 0O 21 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38N32     WSAV25        11Y 0O 21 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38N32     WSAV26        11Y 0O 21 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38N32     WSAV27        11Y 0O 21 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38N32     WSAV28        11Y 0O 21 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39N32     WSAV29        11Y 0O 21 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39N32     WSAV30        11Y 0O 21 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39N32     WSAV31        11Y 0O 21 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39N32     WSAV32        11Y 0O 21 56COLOR(YLW)
     A                                      EDTCDE(4)
     A    N32     WSAV33        11Y 0O 21 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(078 YBC0315 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BILDE3SJ
N01  A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt')
     A                                      CF07(07 'SE PÅ DETALJER')
     A                                      CF12(12 'FORRIGE BILDE')
     A                                      CF13(13 'KODE VALGBILDE')
     A                                      CF10(10 'grafisk')
N01  A            LINNBR         3S 0H
N01  A            POSNBR         3S 0H
     A                                  1  2MSGCON(030 DIV0441 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  40                              1 33MSGCON(027 DIV4191 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  41                              1 33MSGCON(027 DIV0454 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  42                              1 33MSGCON(027 DIV0459 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  43                              1 33MSGCON(027 DIV0485 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  44                              1 33MSGCON(027 DIV0460 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  45                              1 33MSGCON(027 DIV0462 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  46                              1 33MSGCON(027 DIV0464 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  47                              1 33MSGCON(027 DIV0466 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  48                              1 33MSGCON(027 DIV0468 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  49                              1 33MSGCON(027 DIV0470 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  50                              1 33MSGCON(027 DIV0471 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  51                              1 33MSGCON(027 DIV4194 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  52                              1 33MSGCON(027 DIV4195 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  53                              1 33MSGCON(027 JOV0072 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  54                              1 33MSGCON(027 JOV0073 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  55                              1 33MSGCON(027 DIV4180 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  56                              1 33MSGCON(027 DIV4181 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  57                              1 33MSGCON(027 DIV4182 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  58                              1 33MSGCON(027 DIV4183 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  59                              1 33MSGCON(027 DIV4192 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  61                              1 33MSGCON(27 YBC0307 SYMSGF)
     A                                      COLOR(WHT)
     A  62                              1 33MSGCON(27 YBC0308 SYMSGF)
     A                                      COLOR(WHT)
     A  63                              1 33MSGCON(27 YBC0309 SYMSGF)
     A                                      COLOR(WHT)
     A  66                              1 33MSGCON(27 YBC1908 SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 61MSGCON(015 DIV0455 *LIBL/SYMSGF)
     A            WSDTÅ          2Y 0O  1 77DSPATR(UL)
     A                                      COLOR(BLU)
     A  40                              2  2MSGCON(015 DIV4193 *LIBL/SYMSGF)
     A  40        WSRUND         8Y 0O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  42                              2  2MSGCON(015 DIV0456 *LIBL/SYMSGF)
     A  44                              2  2MSGCON(015 DIV0461 *LIBL/SYMSGF)
     A  44        WSLKF          2A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  44                              2 22MSGCON(015 DIV4165 *LIBL/SYMSGF)
     A  44        WSLKT          2A  O  2 39DSPATR(UL)
     A                                      COLOR(BLU)
     A  45                              2  2MSGCON(015 DIV0463 *LIBL/SYMSGF)
     A  45        WSOT           2A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  46                              2  2MSGCON(015 DIV0465 *LIBL/SYMSGF)
     A  46        WSSG           3A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  51                              2  2MSGCON(015 DIV4196 *LIBL/SYMSGF)
     A  51        WSBILN         8A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  52                              2  2MSGCON(015 DIV4197 *LIBL/SYMSGF)
     A  52        WSBILK         3A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  53
     AO 54                              2  2MSGCON(015 JOV0074 *LIBL/SYMSGF)
     A  53
     AO 54        WSSTED         5A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  55                              2  2MSGCON(015 DIV4186 *LIBL/SYMSGF)
     A  55        WSLKFS         2A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  55        WSSDF          5A  O  2 23DSPATR(UL)
     A                                      COLOR(BLU)
     A  55                              2 32MSGCON(015 DIV4187 *LIBL/SYMSGF)
     A  55        WSLKTS         2A  O  2 49DSPATR(UL)
     A                                      COLOR(BLU)
     A  55        WSSDT          5A  O  2 53DSPATR(UL)
     A                                      COLOR(BLU)
     A  56                              2  2MSGCON(015 DIV4188 *LIBL/SYMSGF)
     A  56        WSTUR          8Y 0O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  58                              2  2MSGCON(015 DIV4189 *LIBL/SYMSGF)
     A  58        WSRGF          2A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  58                              2 22MSGCON(015 DIV4190 *LIBL/SYMSGF)
     A  58        WSRGT          2A  O  2 39DSPATR(UL)
     A                                      COLOR(BLU)
     A  61                              2  2MSGCON(015 YBC0310 *LIBL/SYMSGF)
     A  61        WSFR           3A  O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A  41                              2  2MSGCON(015 DIV0458 *LIBL/SYMSGF)
     A  47                              2  2MSGCON(015 DIV0467 *LIBL/SYMSGF)
     A  43
     AO 48
     AO 49
     AO 57
     AO 62
     AO 66
     AO 59                              2  2MSGCON(015 DIV0469 *LIBL/SYMSGF)
     A  50                              2  2MSGCON(015 DIV0463 *LIBL/SYMSGF)
     A  63                              2  2MSGCON(015 YBC0311 *LIBL/SYMSGF)
     A  41
     AO 43
     AO 47
     AO 48
     AO 49
     AO 50
     AO 57
     AO 59        WSKN           8Y 0O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  62
     AO 66
     AO 63        W2KN           8Y 0O  2 19DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  48                              2 28MSGCON(015 YBC0432 *LIBL/SYMSGF)
     A  48        WSLK1          2A  B  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A  48                              2 48'-'
     A  48        WSLK2          2A  B  2 50DSPATR(UL)
     A                                      COLOR(BLU)
     A  49                              2 28MSGCON(015 DIV0454 *LIBL/SYMSGF)
     A  49        WSKNA          8Y 0B  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  57                              2 28MSGCON(015 YBC0433 *LIBL/SYMSGF)
     A  57        WSRG1          2A  B  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A  57                              2 48'-'
     A  57        WSRG2          2A  B  2 50DSPATR(UL)
     A                                      COLOR(BLU)
     A  59                              2 28MSGCON(015 DIV0463 *LIBL/SYMSGF)
     A  59        WSOT2          2A  O  2 45DSPATR(UL)
     A                                      COLOR(YLW)
     A  62
     AO 66                              2 28MSGCON(015 YBC0310 *LIBL/SYMSGF)
     A  62
     AO 66        WSFR2          3A  O  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A N44N48N49
     AAN55N57N58
     AAN59N62N66  WSNA          30A  O  2 28DSPATR(UL)
     A                                      COLOR(BLU)
     A                                  2 61MSGCON(015 DIV0456 *LIBL/SYMSGF)
     A            WSAVD          4Y 0O  2 77DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A  37                              3  2MSGCON(078 DIV0473 *LIBL/SYMSGF)
     A  38                              3  2MSGCON(078 DIV0474 *LIBL/SYMSGF)
     A  39                              3  2MSGCON(078 DIV5093 *LIBL/SYMSGF)
     A                                  4  2MSGCON(009 YBC0313 *LIBL/SYMSGF)
     A  37        WSIN01        11Y 0O  4 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN02        11Y 0O  4 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN03        11Y 0O  4 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN04        11Y 0O  4 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN05        11Y 0O  4 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN06        11Y 0O  4 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN07        11Y 0O  4 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN08        11Y 0O  4 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN09        11Y 0O  4 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN10        11Y 0O  4 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN11        11Y 0O  4 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN12        11Y 0O  4 56COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSIN13        11Y 0O  4 69COLOR(YLW)
     A                                      EDTCDE(L)
     A                                  5  2MSGCON(009 YBC0314 *LIBL/SYMSGF)
     A  37        WSKS01        11Y 0O  5 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS02        11Y 0O  5 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS03        11Y 0O  5 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS04        11Y 0O  5 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS05        11Y 0O  5 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS06        11Y 0O  5 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS07        11Y 0O  5 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS08        11Y 0O  5 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS09        11Y 0O  5 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS10        11Y 0O  5 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS11        11Y 0O  5 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS12        11Y 0O  5 56COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSKS13        11Y 0O  5 69COLOR(YLW)
     A                                      EDTCDE(L)
     A                                  6  2MSGCON(009 DIV2048 *LIBL/SYMSGF)
     A  37        WSDI01        11Y 0O  6 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI02        11Y 0O  6 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI03        11Y 0O  6 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI04        11Y 0O  6 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI05        11Y 0O  6 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI06        11Y 0O  6 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI07        11Y 0O  6 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI08        11Y 0O  6 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI09        11Y 0O  6 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI10        11Y 0O  6 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI11        11Y 0O  6 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI12        11Y 0O  6 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSDI13        11Y 0O  6 69
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A                                  7  2MSGCON(009 DIV3875 *LIBL/SYMSGF)
     A  37        WSAT01        11Y 0O  7 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSAT02        11Y 0O  7 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSAT03        11Y 0O  7 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSAT04        11Y 0O  7 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSAT05        11Y 0O  7 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSAT06        11Y 0O  7 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSAT07        11Y 0O  7 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSAT08        11Y 0O  7 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSAT09        11Y 0O  7 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSAT10        11Y 0O  7 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSAT11        11Y 0O  7 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSAT12        11Y 0O  7 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSAT13        11Y 0O  7 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  8  2MSGCON(009 DIV0479 *LIBL/SYMSGF)
     A  37        WSV01         11Y 0O  8 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV02         11Y 0O  8 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV03         11Y 0O  8 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV04         11Y 0O  8 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV05         11Y 0O  8 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV06         11Y 0O  8 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV07         11Y 0O  8 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV08         11Y 0O  8 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV09         11Y 0O  8 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV10         11Y 0O  8 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV11         11Y 0O  8 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV12         11Y 0O  8 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSV13         11Y 0O  8 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9  2MSGCON(009 DIV0480 *LIBL/SYMSGF)
     A  37        WSA01         11Y 0O  9 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA02         11Y 0O  9 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA03         11Y 0O  9 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA04         11Y 0O  9 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA05         11Y 0O  9 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA06         11Y 0O  9 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA07         11Y 0O  9 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA08         11Y 0O  9 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA09         11Y 0O  9 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA10         11Y 0O  9 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA11         11Y 0O  9 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA12         11Y 0O  9 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSA13         11Y 0O  9 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 10  2MSGCON(009 YBC0462 *LIBL/SYMSGF)
     A  37        WSSS01        11Y 0O 10 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSSS02        11Y 0O 10 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSSS03        11Y 0O 10 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSSS04        11Y 0O 10 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSSS05        11Y 0O 10 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSSS06        11Y 0O 10 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSSS07        11Y 0O 10 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSSS08        11Y 0O 10 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSSS09        11Y 0O 10 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSSS10        11Y 0O 10 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSSS11        11Y 0O 10 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSSS12        11Y 0O 10 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSSS13        11Y 0O 10 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 11  2MSGCON(009 YBC0707 *LIBL/SYMSGF)
     A  37        WSVS01        11Y 0O 11 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSVS02        11Y 0O 11 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSVS03        11Y 0O 11 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSVS04        11Y 0O 11 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSVS05        11Y 0O 11 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSVS06        11Y 0O 11 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSVS07        11Y 0O 11 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSVS08        11Y 0O 11 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSVS09        11Y 0O 11 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSVS10        11Y 0O 11 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSVS11        11Y 0O 11 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSVS12        11Y 0O 11 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS13        11Y 0O 11 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12  2MSGCON(009 YBC0708 *LIBL/SYMSGF)
     A  37        WSMS01        10Y 3O 12 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSMS02        10Y 3O 12 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSMS03        10Y 3O 12 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSMS04        10Y 3O 12 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSMS05        10Y 3O 12 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSMS06        10Y 3O 12 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSMS07        10Y 3O 12 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSMS08        10Y 3O 12 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSMS09        10Y 3O 12 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSMS10        10Y 3O 12 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSMS11        10Y 3O 12 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSMS12        10Y 3O 12 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSMS13        10Y 3O 12 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 13  2MSGCON(010 DIV0482 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                 14  2MSGCON(009 YBC0313 *LIBL/SYMSGF)
     A  37        WSIN21        11Y 0O 14 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN22        11Y 0O 14 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN23        11Y 0O 14 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSIN24        11Y 0O 14 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN25        11Y 0O 14 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN26        11Y 0O 14 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN27        11Y 0O 14 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSIN28        11Y 0O 14 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN29        11Y 0O 14 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN30        11Y 0O 14 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN31        11Y 0O 14 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSIN32        11Y 0O 14 56COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSIN33        11Y 0O 14 69COLOR(YLW)
     A                                      EDTCDE(L)
     A                                 15  2MSGCON(009 YBC0314 *LIBL/SYMSGF)
     A  37        WSKS21        11Y 0O 15 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS22        11Y 0O 15 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS23        11Y 0O 15 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSKS24        11Y 0O 15 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS25        11Y 0O 15 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS26        11Y 0O 15 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS27        11Y 0O 15 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSKS28        11Y 0O 15 56COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS29        11Y 0O 15 14COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS30        11Y 0O 15 28COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS31        11Y 0O 15 42COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSKS32        11Y 0O 15 56COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSKS33        11Y 0O 15 69COLOR(YLW)
     A                                      EDTCDE(L)
     A                                 16  2MSGCON(009 DIV2048 *LIBL/SYMSGF)
     A  37        WSDI21        11Y 0O 16 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI22        11Y 0O 16 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI23        11Y 0O 16 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  37        WSDI24        11Y 0O 16 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI25        11Y 0O 16 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  38        WSDI26        11Y 0O 16 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSDI27        11Y 0O 16 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSDI28        11Y 0O 16 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI29        11Y 0O 16 14
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI30        11Y 0O 16 28
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI31        11Y 0O 16 42
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A  39        WSDI32        11Y 0O 16 56
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A            WSDI33        11Y 0O 16 69
     A                                      COLOR(YLW)
     A                                      EDTCDE(L)
     A                                 17  2MSGCON(009 DIV3875 *LIBL/SYMSGF)
     A  37        WSAT21        11Y 0O 17 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSAT22        11Y 0O 17 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSAT23        11Y 0O 17 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSAT24        11Y 0O 17 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSAT25        11Y 0O 17 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSAT26        11Y 0O 17 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSAT27        11Y 0O 17 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSAT28        11Y 0O 17 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSAT29        11Y 0O 17 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSAT30        11Y 0O 17 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSAT31        11Y 0O 17 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSAT32        11Y 0O 17 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSAT33        11Y 0O 17 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  2MSGCON(009 DIV0479 *LIBL/SYMSGF)
     A  37        WSV21         11Y 0O 18 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV22         11Y 0O 18 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV23         11Y 0O 18 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSV24         11Y 0O 18 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV25         11Y 0O 18 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV26         11Y 0O 18 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV27         11Y 0O 18 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSV28         11Y 0O 18 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV29         11Y 0O 18 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV30         11Y 0O 18 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV31         11Y 0O 18 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSV32         11Y 0O 18 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSV33         11Y 0O 18 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 19  2MSGCON(009 DIV0480 *LIBL/SYMSGF)
     A  37        WSA21         11Y 0O 19 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA22         11Y 0O 19 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA23         11Y 0O 19 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSA24         11Y 0O 19 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA25         11Y 0O 19 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA26         11Y 0O 19 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA27         11Y 0O 19 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSA28         11Y 0O 19 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA29         11Y 0O 19 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA30         11Y 0O 19 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA31         11Y 0O 19 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSA32         11Y 0O 19 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSA33         11Y 0O 19 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 20  2MSGCON(009 YBC0462 *LIBL/SYMSGF)
     A  37        WSSS21        11Y 0O 20 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSSS22        11Y 0O 20 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSSS23        11Y 0O 20 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSSS24        11Y 0O 20 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSSS25        11Y 0O 20 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSSS26        11Y 0O 20 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSSS27        11Y 0O 20 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSSS28        11Y 0O 20 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSSS29        11Y 0O 20 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSSS30        11Y 0O 20 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSSS31        11Y 0O 20 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSSS32        11Y 0O 20 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSSS33        11Y 0O 20 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 21  2MSGCON(009 YBC0707 *LIBL/SYMSGF)
     A  37        WSVS21        11Y 0O 21 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSVS22        11Y 0O 21 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSVS23        11Y 0O 21 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSVS24        11Y 0O 21 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSVS25        11Y 0O 21 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSVS26        11Y 0O 21 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSVS27        11Y 0O 21 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSVS28        11Y 0O 21 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSVS29        11Y 0O 21 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSVS30        11Y 0O 21 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSVS31        11Y 0O 21 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSVS32        11Y 0O 21 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVS33        11Y 0O 21 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(009 YBC0708 *LIBL/SYMSGF)
     A  37        WSMS21        10Y 3O 22 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSMS22        10Y 3O 22 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSMS23        10Y 3O 22 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  37        WSMS24        10Y 3O 22 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSMS25        10Y 3O 22 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSMS26        10Y 3O 22 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSMS27        10Y 3O 22 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  38        WSMS28        10Y 3O 22 56COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSMS29        10Y 3O 22 14COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSMS30        10Y 3O 22 28COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSMS31        10Y 3O 22 42COLOR(YLW)
     A                                      EDTCDE(4)
     A  39        WSMS32        10Y 3O 22 56COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSMS33        10Y 3O 22 69COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(078 YBC0315 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R GRAFIKK
     A                                      INVITE
     A                                      SLNO(01)
     A                                      CLRL(*ALL)
     A                                      ALWROL
     A                                      CF03(03 'Avslutt')
     A                                      CF12(12 'FORRIGE BILDE')
     A                                      HELP
     A                                  1  2'SYSPED/SYFA29'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 DIV0441 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 58MSGCON(22 DIV0047 SYMSGF)
     A                                      COLOR(TRQ)
     A N27N28                           2  2MSGCON(18 DIV4211 SYMSGF)
     A                                      COLOR(RED)
     A N27 28                           2  2MSGCON(18 DIV4212 SYMSGF)
     A                                      COLOR(RED)
     A                                  3  7MSGCON(40 DIV1300 SYMSGF)
     A                                  5  7MSGCON(40 YBC0329 SYMSGF)
     A                                  6  7MSGCON(40 YBC0330 SYMSGF)
     A                                  7  7MSGCON(40 DIV1303 SYMSGF)
     A                                  8  7MSGCON(40 DIV1304 SYMSGF)
     A                                  9  7MSGCON(40 DIV1305 SYMSGF)
     A                                 10  7MSGCON(40 DIV1306 SYMSGF)
     A                                 12  7MSGCON(40 DIV2050 SYMSGF)
     A            GRAFNR         1Y 0B 16  7CHECK(ER)
     A                                      DSPATR(MDT)
     A                                 16 11MSGCON(40 DIV1307 SYMSGF)
     A                                 23  7MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
