********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 KIDLIN V 8 LPT LØFTET
10XXX * 02 SH  PTF10 LITT ENDRING
10XXX * 25 SH  PTF10 FINPUSS
10XXX * 31 SH  PTF10 FINPUSS
10XXX * 44 SH  PTF10 LAYOUT MVANR
********************************************************************
     A                                      REF(HEADF)
      *_________________________________
      * Format for markering av ny side.
      *"""""""""""""""""""""""""""""""""
     A          R KJØP1                     SPACEB(2)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  70                                65'** Continues **'
     A N70N79                             65MSGCON(15 DIV1673 SYMSGF)
     A  79                                65'* Fortsetzung *'
      *_____________________________________________
      * Format for hovedopplysninger vanlig faktura.
      *"""""""""""""""""""""""""""""""""""""""""""""
     A          R KJØP
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
     A  63                              1  1'¤&a-3R'
     A  63                              1  1'¤(12U¤(s0p10h0s3b4099T'
     A  46        HP1           80      1  1
     A  46        HP2           80      2  1
     A  46        HP3           80      3  1
     A  46        HP4           80      4  1
     A  46        HP5           80      5  1
     A  46        HP6           80      6  1
     A  46        HP7           80      7  1
     A* RYDDET LITT I PARAMETERE - TH. KUN DATOMRK.
     A  63                              8  1'¤(12U¤(s0p10h1s0b4099T'
     A* START BOKS 1
     A  63                              9  1'¤&a1C¤*c1238A¤*c5B¤*c11G¤*c0P'
     A  63 60                           9  1'¤&a1C¤*c5A¤*c229B¤*c11G¤*c0P'
     A  63 60                           9  1'¤&a42C¤*c5A¤*c229B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a1C¤*c5A¤*c300B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a42C¤*c5A¤*c300B¤*c11G¤*c0P'
     A* START BOKS 2
     A  63 60                           9  1'¤&a47C¤*c900A¤*c5B¤*c11G¤*c0P'
     A  63 60                           9  1'¤&a47C¤*c5A¤*c156B¤*c11G¤*c0P'
     A  63 60                           9  1'¤&a77C¤*c5A¤*c156B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a47C¤*c900A¤*c5B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a47C¤*c5A¤*c206B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a77C¤*c5A¤*c206B¤*c11G¤*c0P'
     A  57 70 63                       10 48'    CREDIT OF INV:'
     A  63
     AA 57N70N79                       10 48MSGCON(24 DIV1675 SYMSGF)
     A  57 79 63                       10 48'    GUTSCHRIFT VON:'
     A  57 63     YKREDA         7S 0  10 71EDTCDE(Z)
     A N48        KNAVN     R          11 11REFFLD(KNAVN CUNDF)
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A  48        XDINV         30     11 11
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A N64
     AAN88N51N63                       11 48'******************************'
     A N64
     AAN88N63 65                       11 48'******************************'
     A N64
     AAN88N63N65
     AA 51N70N79                       11 48MSGCON(30 DIV1674 SYMSGF)
     A N88 63N64
     AA 51N70N79                       11 48MSGCON(30 SHU0684 SYMSGF)
     A N88N63N65
     AA 51N70N79                       11 48MSGCON(30 SHU0684 SYMSGF)
     A N63N65N64
     AAN88 51 70                       11 48'*** COPY  OF   ***************'
     A  63N64
     AAN88 51 70                       11 48'    COPY  OF                  '
     A N63N65N64
     AAN88 51 79                       11 48'*** KOPI  VON  ***************'
     A  63N64
     AAN88 51 79                       11 48'    KOPI  VON                 '
     A  63N64
     AAN88 51 79                       11 48'    KOPI  VON                 '
     A  70 88N63                       11 48'********  P A G E '
     A  70 88 63                       11 48'          P A G E '
     A N63
     AAN70N79 88                       11 48MSGCON(24 DIV1676 SYMSGF)
     A N63
     AAN70N79 88                       11 48MSGCON(24 SHU0685 SYMSGF)
     A  63
     AAN70N79 88                       11 48MSGCON(24 SHU0685 SYMSGF)
     A N63
     AA 79 88N63                       11 48'********  S E I T E'
     A  63
     AA 79 88N63                       11 48'          S E I T E'
     A  88        XSIDE          2  0  11 71EDTCDE(Z)
     A                                      HIGHLIGHT
     A  88N63                          11 75'***'
     A  88N63                          11 75'***'
     A N48        ADR1      R          12 11REFFLD(ADR1 CUNDF)
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A  48        XDIAD1        30     12 11
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A N73N63N64                       12 48'*'
     A N63N64                          12 77'*'
     A N64
     AAN70N73N79  KO2NTX    R          12 54REFFLD(KO2NTX KODTOT2)
     A                                      HIGHLIGHT
     A  64
     AAN70N73N79  KO2NTXP   R          12 48REFFLD(KO2NTX KODTOT2)
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A  70N73N64  KO2ETX    R          12 54REFFLD(KO2ETX KODTOT2)
     A                                      HIGHLIGHT
     A  70N73 64  KO2ETXP   R          12 48REFFLD(KO2ETX KODTOT2)
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A N63N64
     AAN70 73N79                       12 48MSGCON(24 DIV1677 SYMSGF)
     A N63 64
     AAN70 73N79                       12 48MSGCON(24 SHU1540 SYMSGF)
N54  A  64                                  FONT(428 (*POINTSIZE 15))
     A* 64                                  FNTCHRSET(C0H400B0 +
     A*                                     T1V10277)
     A  63
     AAN70 73N79                       12 48MSGCON(24 SHU0686 SYMSGF)
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A N64
     AA 70 73N63                       12 48'    C R E D I T N O T E '
     A  64
     AA 70 73N63                       12 48'C R E D I T N O T E '
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A N64
     AA 73 79N63                       12 48'    G U T S C H R I F T '
     A  64
     AA 73 79N63                       12 48'G U T S C H R I F T '
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A N64
     AAN73 79N63                       12 48'    R E C H N U N G     '
     A  64
     AAN73 79N63                       12 48'R E C H N U N G     '
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A  70 73 63                       12 48'    C R E D I T N O T E '
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A  73 79 63                       12 48'    G U T S C H R I F T '
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A N73 79 63                       12 48'    R E C H N U N G     '
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
     A N48        ADR2      R          13 11REFFLD(ADR2 CUNDF)
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A  48        XDIAD2        30     13 11
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A N57N63N64                       13 48'******************************'
     A  57 70N63                       13 48'*   CREDIT OF INV:'
     A N63
     AA 57N70N79                       13 48MSGCON(24 DIV1675 SYMSGF)
     A  57 79N63                       13 48'*   GUTSCHRIFT VON:'
     A  57N63     XKREDA         7S 0  13 71EDTCDE(Z)
     A  63                             13  1'¤&a47C¤*c900A¤*c8B¤*c11G¤*c0P'
     A N37N48     POSTNR    R          14 11REFFLD(POSTNR CUNDF)
     A                                      DLTEDT
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A N37N48     ADR3      R          14 17REFFLD(ADR3 CUNDF)
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A N38N48 37  SYPOGE         9     14 11
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A N38N48 37  ADR3B     R          14 22REFFLD(ADR3 CUNDF)
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A  37 38N48  ADR3C     R          14 11REFFLD(ADR3 CUNDF)
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A  48        XDIAD3        30     14 11
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*7                                    T1V10277)
     A N70N79                          14 48MSGCON(15 DIV1667 SYMSGF)
     A                                      HIGHLIGHT
     A  70                             14 48'Invoice No....:'
     A                                      HIGHLIGHT
     A  79                             14 48'Rechnungsnr...:'
     A                                      HIGHLIGHT
     A N64        XFN            7S 0  14 71EDTCDE(Z)
     A                                      HIGHLIGHT
     A  64        YFN            7S 0  14 67EDTCDE(Z)
     A                                      HIGHLIGHT
N54  A  64                                  FONT(428 (*POINTSIZE 15))
S54  A* 64                                  FNTCHRSET(C0H400B0 +
S54  A*                                     T1V10277)
S54  A* 64                                  COLOR(RED)
S37  A*           KLKNVN    R          15 11REFFLD(KLKNVN KODTLK)
N37  A N70N79     KLKNVN    R          15 11REFFLD(KLKNVN KODTLK)
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
N37  A  70        KLKNVE    R          15 11REFFLD(KLKNVN KODTLK)
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
N37  A  79        KLKNVT    R          15 11REFFLD(KLKNVN KODTLK)
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S54  A* 64                                  FNTCHRSET(C0N400B0 +
S54  A*                                     T1V10277)
     A N70N79                          15 48MSGCON(15 DIV1668 SYMSGF)
     A  70                             15 48'Customer No...:'
     A  79                             15 48'Kunden Nr.....:'
     A            KUNDNR    R          15 70REFFLD(KUNDNR CUNDF)
     A                                      EDTCDE(Z)
     A  63                             15  1'¤&a1C¤*c1238A¤*c5B¤*c11G¤*c0P'
     A  63                             15  1'¤&a5C'
N44  A N55
E44  AAN70N79 75                       16 11MSGCON(13 SHU0828 SYMSGF)
E44  A  70N55 75                       16 11'Customer VAT#'
E44  A  79N55 75                       16 11'Kundens Taxn:'
S23  A*       75  SYLAND         2     16 16
S23  A*       75  SYRG          14     16 18
N44  A    N55 75  KUTAX         25     16 25
     A N70N79                          16 48MSGCON(15 DIV1666 SYMSGF)
     A  70                             16 48'Date of invoice'
     A  79                             16 48'Rechn.datum...:'
     A            IDAGX          6S 0  16 70EDTCDE(Y)
N44  A  55
N44  AAN70N79 75                       17 11MSGCON(13 SHU0828 SYMSGF)
N44  A  70 55 75                       17 11'Customer VAT#'
N44  A  79 55 75                       17 11'Kundens Taxn:'
N44  A     55 75  KUTAX2        25     17 25
     A N70N79N55                       17  2MSGCON(13 DIV1651 SYMSGF)
     A  70N55                          17  2'Shipper.....:'
     A  79N55                          17  2'Absender....:'
     A N55        HENAS     R          17 16
     A N70N79                          17 48MSGCON(15 DIV1665 SYMSGF)
     A  70                             17 48'Date due......:'
     A  79                             17 48'Verfallstag...:'
     A N39        XFFDT          6S 0  17 70EDTCDE(Y)
     A  39N70                          17 71'Kontant'
     A  39 70                          17 71'   Cash'
     A N70N79N55                       18  2MSGCON(13 DIV1652 SYMSGF)
     A  70N55                          18  2'Consignee...:'
     A  79N55                          18  2'Empfanger...:'
     A N55        HENAK     R          18 16
     A N70N79                          18 48MSGCON(13 DIV1669 SYMSGF)
     A  70                             18 48'Our ref.....:'
     A  79                             18 48'Unsere Ref..:'
     A            HEAVD     R          18 62EDTCDE(Z)
     A                                 18 66'/'
     A            HEOPD     R          18 67
     A                                 18 74'/'
     A            HESG      R          18 75
     A N55
     AAN52N70N79                       19  2MSGCON(13 DIV1653 SYMSGF)
     A N52 70N55                       19  2'Unloaded....:'
     A N52 79N55                       19  2'Entladen....:'
     A N55
     AA 52N70N79                       19  2MSGCON(13 DIV1654 SYMSGF)
     A  52 70N55                       19  2'Loadingplace:'
     A  52 79N55                       19  2'Ladenplatz..:'
     A N55        HESDL     R          19 16
N34  A N70N79 55                       19  2MSGCON(12 DIV1672 SYMSGF)
N34  A  70 55                          19  2'FROM - TO..:'
N34  A  79 55                          19  2'VON - NACH.:'
N34  A  55        HELKA          2     19 16
N34  A  55        HESDFP         5     19 19
N34  A  55                             19 24'-'
N34  A  55        HETRIP         2     19 25
N34  A  55        HESDTP         5     19 28
     A N70N79                          19 48MSGCON(15 DIV1670 SYMSGF)
     A  70                             19 48'Date of disp..:'
     A  79                             19 48'Auftrag vom...:'
     A            XDT            6S 0  19 70EDTCDE(Y)
     A N70N79N53                       20  2MSGCON(13 DIV1659 SYMSGF)
     A  70N53                          20  2'Agentref....:'
     A  79N53                          20  2'Agentref....:'
     A N52 53                          20  2MSGCON(13 DIV1655 SYMSGF)
     A  52 53N70
     A N79                             20  2MSGCON(13 DIV1659 SYMSGF)
     A  52 53 70                       20  2'Agentref....:'
     A  52 53 79                       20  2'Agentref....:'
     A*           HERFA     R          20 16
     A            HERFA15       15     20 16
     A N70N79                          20 48MSGCON(15 DIV1671 SYMSGF)
     A  70                             20 48'Tripno........:'
     A  79                             20 48'Tournr........:'
     A            HEPRO     R          20 70
     A N70N79N52                       21  2MSGCON(13 DIV1663 SYMSGF)
     A  70N52                          21  2'Shipped pr..:'
     A  79N52                          21  2'Mit.........:'
     A  52 53N70
     AAN79                             21  2MSGCON(13 DIV1657 SYMSGF)
     A  52 53 70                       21  2'Hawb.no.....:'
     A  52 53 79                       21  2'Hawb.no.....:'
     A N55        HEHAWB    R          21 16
     A  55        TUBILN        10     21 16
     A N56N55     HETRI     R          21 26
     A N55
     AAN56N70N79                       21 32MSGCON(9 DIV1678 SYMSGF)
     A N56 70N55                       21 32'Trsp.type'
     A N56 79N55                       21 32'Tr.type:'
     A N56N55     HETRM     R          21 42EDTCDE(Z)
     A N70N79 55                       21 48MSGCON(15 DIV5021 SYMSGF)
E25  A N70N79N55                       21 48MSGCON(10 DIV1672 SYMSGF)
E25  A  70N55                          21 48'From-to..:'
E25  A  79N55                          21 48'Von-nach.:'
E25  A N55        HESDFF    R          21 58
E25  A N55        HESDF     R          21 63
E25  A N55                             21 68'-'
E25  A N55        HESDT     R          21 69
E25  A N55        HESDVT    R          21 74
E31  A  55        TRRUND         8  0  21 70
     A N70                             22  2MSGCON(13 DIV1661 SYMSGF)
     A  70                             22  2'Terms of del:'
     A  79                             22  2'Frankatur...:'
     A N70        KFRNTX    R          22 16REFFLD(KFRNTX KODTFR)
     A  70        KFRTTX    R          22 16REFFLD(KFRTTX KODTFR)
     A N53N70N79
     AAN52                             22 48MSGCON(15 DIV1656 SYMSGF)
     A  70N53N52                       22 48'Billno........:'
     A  79N53N52                       22 48'Reg.nr........:'
     A  52 53N70
     AAN79                             22 48MSGCON(15 DIV1664 SYMSGF)
     A  52 53 70                       22 48'AWB.no........:'
     A  52 53 79                       22 48'AWB.no........:'
     A N52 53N70
     AAN79                             22 48MSGCON(15 DIV1660 SYMSGF)
     A N52 53 70                       22 48'AWB/HAWB-no...:'
     A N52 53 79                       22 48'AWB/HAWB-no...:'
E25  A            HEGN      R          22 63
     A N79
     AAN52N56N70                       23  2MSGCON(13 DIV1662 SYMSGF)
     A N52N56 70                       23  2'Container...:'
     A N52N56 79                       23  2'Container...:'
     A N52N56     HETRC     R          23 16
     A N52N56     HETRCN    R          23 20
     A N52                             23 48'Pos...........:'
     A N52        HEPOS1    R          23 64
     A N52 47                          23 71'-'
     A N52 47     HEPOS2    R          23 72EDTCDE(Z)
     A N60 61 63                       23  1'¤*c2330A¤*c55B¤*c11G¤*c2P'
E31  A N60N63N55                       23  1' _______________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
E31  A N60N63N55                       23 25'________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
E31  A N60N63N55                       23 49'________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
E31  A N60N63N55                       23 73'_____'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A  60N63                          24  1' -----------------------'
     A  60N63                          24 25'------------------------'
     A  60N63                          24 49'------------------------'
E25  A  60N63                          24 73'-----'
     A  60 61 63                       24  1'¤*c2330A¤*c55B¤*c11G¤*c2P'
     A          R KJØPD
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
     A  63                              1  1'¤&a-3R'
     A  63                              1  1'¤(12U¤(s0p10h0s3b4099T'
     A  46        HP1           80      1  1
     A  46        HP2           80      2  1
     A  46        HP3           80      3  1
     A  46        HP4           80      4  1
     A  46        HP5           80      5  1
     A  46        HP6           80      6  1
     A  46        HP7           80      7  1
     A  63                              8  1'¤(12U¤(s0p10h1s0b4099T'
     A* START BOKS 1
     A  63                              9  1'¤&a5C¤*c1110A¤*c5B¤*c11G¤*c0P'
     A  63 60                           9  1'¤&a5C¤*c5A¤*c263B¤*c11G¤*c0P'
     A  63 60                           9  1'¤&a42C¤*c5A¤*c263B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a5C¤*c5A¤*c353B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a42C¤*c5A¤*c353B¤*c11G¤*c0P'
     A* START BOKS 2
     A  63                              9  1'¤&a47C¤*c900A¤*c8B¤*c11G¤*c0P'
     A  63 60                           9  1'¤&a47C¤*c8A¤*c150B¤*c11G¤*c0P'
     A  63 60                           9  1'¤&a77C¤*c8A¤*c150B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a47C¤*c8A¤*c206B¤*c11G¤*c0P'
     A  63N60                           9  1'¤&a77C¤*c8A¤*c206B¤*c11G¤*c0P'
     A N48        KNAVN     R          11 11REFFLD(KNAVN CUNDF)
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A  48        XDINV         30     11 11
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A N64
     AAN88N51N63                       11 48'******************************'
     A N88N63
     AA 51N70N79                       11 48MSGCON(30 DIV1674 SYMSGF)
     A N88 63
     AA 51N70N79                       11 48MSGCON(30 SHU0684 SYMSGF)
     A N88N63
     AA 51N70N79                       11 48MSGCON(30 SHU0684 SYMSGF)
     A N63N64
     AAN88 51 70                       11 48'*** COPY  OF   ***************'
     A N63N64
     AAN88 51 70                       11 48'    COPY  OF                  '
     A  63N64
     AAN88 51 70                       11 48'    COPY  OF                  '
     A  63N64
     AAN88 51 70                       11 48'*** COPY  OF   ***************'
     A N63N64
     AAN88 51 79                       11 48'*** KOPI  VON  ***************'
     A  63N64
     AAN88 51 79                       11 48'    KOPI  VON                 '
     A  70 88N63                       11 48'********  P A G E '
     A  70 88 63                       11 48'          P A G E '
     A N63
     AAN70N79 88                       11 48MSGCON(24 DIV1676 SYMSGF)
     A N63
     AAN70N79 88                       11 48MSGCON(24 DIV1676 SYMSGF)
     A  63
     AAN70N79 88                       11 48MSGCON(24 SHU0685 SYMSGF)
     A  63
     AAN70N79 88                       11 48MSGCON(24 SHU0685 SYMSGF)
     A N63
     A  79 88N63                       11 48'********  S E I T E'
     A  63
     AA 79 88N63                       11 48'          S E I T E'
     A  88        XSIDE          2  0  11 71EDTCDE(Z)
     A                                      HIGHLIGHT
     A  88N63                          11 75'***'
     A  88N63                          11 75'***'
     A N48        ADR1      R          12 11REFFLD(ADR1 CUNDF)
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A  48        XDIAD1        30     12 11
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A N73N63N64                       12 48'*'
     A N63N64                          12 77'*'
     A N70N73N79  KO2NTX    R          12 54REFFLD(KO2NTX KODTOT2)
     A                                      HIGHLIGHT
     A  64                                  FNTCHRSET(C0H400B0 +
     A                                      T1V10277)
     A  70N73     KO2ETX    R          12 54REFFLD(KO2ETX KODTOT2)
     A                                      HIGHLIGHT
     A  64                                  FNTCHRSET(C0H400B0 +
     A                                      T1V10277)
     A N63
     AAN70 73N79                       12 48MSGCON(24 DIV1677 SYMSGF)
     A N63
     AAN70 73N79                       12 48MSGCON(24 DIV1677 SYMSGF)
     A  63
     AAN70 73N79                       12 48MSGCON(24 SHU0686 SYMSGF)
     A  70 73N63                       12 48'*   C R E D I T N O T E '
     A  70 73N63                       12 48'*   C R E D I T N O T E '
     A  73 79N63                       12 48'*   G U T S C H R I F T '
     A  73 79N63                       12 48'*   G U T S C H R I F T '
     A N73 79N63                       12 48'*   R E C H N U N G     '
     A N73 79N63                       12 48'*   R E C H N U N G     '
     A  70 73 63                       12 48'    C R E D I T N O T E '
     A  70 73 63                       12 48'    C R E D I T N O T E '
     A  73 79 63                       12 48'    G U T S C H R I F T '
     A  73 79 63                       12 48'    G U T S C H R I F T '
     A N73 79 63                       12 48'    R E C H N U N G     '
     A N73 79 63                       12 48'    R E C H N U N G     '
     A N48        ADR2      R          13 11REFFLD(ADR2 CUNDF)
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A  48        XDIAD2        30     13 11
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A N57N63N64                       13 48'******************************'
     A  57 70N63                       13 48'*   CREDIT OF INV:'
     A N63
     AA 57N70N79                       13 48MSGCON(24 DIV1675 SYMSGF)
     A N63
     AA 57N70N79                       13 48MSGCON(24 DIV1675 SYMSGF)
     A  57 79N63                       13 48'*   GUTSCHRIFT VON:'
     A  57 79N63                       13 48'*   GUTSCHRIFT VON:'
     A  57N63     XKREDA         7S 0  13 71EDTCDE(Z)
     A  63                             13  1'¤&a47C¤*c900A¤*c8B¤*c11G¤*c0P'
     A N37N48     POSTNR    R          14 11REFFLD(POSTNR CUNDF)
     A                                      DLTEDT
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A N37N48     ADR3      R          14 17REFFLD(ADR3 CUNDF)
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A N38N48 37  SYPOGE         9     14 11
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A N38N48 37  ADR3B     R          14 22REFFLD(ADR3 CUNDF)
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A  37 38N48  ADR3C     R          14 11REFFLD(ADR3 CUNDF)
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A  48        XDIAD3        30     14 11
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
     A N70N79                          14 48MSGCON(15 DIV1667 SYMSGF)
     A  70                             14 48'Invoice No....:'
     A  79                             14 48'Rechnungsnr...:'
     A            XFN            7S 0  14 71EDTCDE(Z)
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
S37  A*           KLKNVN    R          15 11REFFLD(KLKNVN KODTLK)
N37  A N70N79     KLKNVN    R          15 11REFFLD(KLKNVN KODTLK)
     A  64                                  FNTCHRSET(C0N400B0 +
     A                                      T1V10277)
N37  A  70        KLKNVE    R          15 11REFFLD(KLKNVN KODTLK)
N37  A  64                                  FNTCHRSET(C0N400B0 +
N37  A                                      T1V10277)
N37  A  79        KLKNVT    R          15 11REFFLD(KLKNVN KODTLK)
N37  A  64                                  FNTCHRSET(C0N400B0 +
N37  A                                      T1V10277)
     A N70N79                          15 48MSGCON(15 DIV1668 SYMSGF)
     A  70                             15 48'Customer No...:'
     A  79                             15 48'Kunden Nr.....:'
     A            KUNDNR    R          15 70REFFLD(KUNDNR CUNDF)
     A                                      EDTCDE(Z)
     A  63                             16  1'¤&a5C¤*c1110A¤*c5B¤*c11G¤*c0P'
     A  63                             16  1'¤&a5C'
     A N70N79                          16 48MSGCON(15 DIV1666 SYMSGF)
     A  70                             16 48'Date of invoice'
     A  79                             16 48'Rechn.datum...:'
     A            IDAGX          6S 0  16 70EDTCDE(Y)
     A N70N79                          17 48MSGCON(15 DIV1665 SYMSGF)
     A  70                             17 48'Date due......:'
     A  79                             17 48'Verfallstag...:'
     A N39        XFFDT          6S 0  17 70EDTCDE(Y)
     A N70N79                          18 48MSGCON(13 DIV1669 SYMSGF)
     A  70                             18 48'Our ref.....:'
     A  79                             18 48'Unsere Ref..:'
     A            HEAVD     R          18 62EDTCDE(Z)
     A                                 18 66'/'
     A            HEOPD     R          18 67
     A                                 18 74'/'
     A            HESG      R          18 75
     A          R KJØPFS                    SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A            KFSOTX        30         2
     A                                    32':'
     A            FSSOK         35        35
     A          R UFB20P                    SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A                                     2MSGCON(24 YBC0491 SYMSGF)
     A                                      HIGHLIGHT
     A                                    32':'
     A                                      HIGHLIGHT
     A            HEFT1A        30        35HIGHLIGHT
     A            HEFT1B        15        66HIGHLIGHT
     A          R FRIEL                     SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A            FRTTXT        70         2
     A          R HEAT
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  63                                 1'¤(12U¤(s0p10h0s3b4099T'
     A N64
     AAN63                                 1' _______________________'
     A N64
     AAN63                                25'________________________'
     A N64
     AAN63                                49'________________________'
     A N64
E25  AAN63                                73'_____'
     A N70N79                              2MSGCON(13 DIV1651 SYMSGF)
     A                                      SPACEB(1)
     A  70                                 2'Shipper:     '
     A                                      SPACEB(1)
     A  79                                 2'Absender:    '
     A                                      SPACEB(1)
S39  A*N70N79                             42MSGCON(13 DIV1652 SYMSGF)
S39  A* 70                                42'Consignee:   '
S39  A* 79                                42'Empfanger:   '
N39  A N70N79                             48MSGCON(15 DIV1652 SYMSGF)
N39  A  70                                48'Consignee:     '
N39  A  79                                48'Empfanger:     '
     A  63                                 1'¤*c20A¤*c260B¤*c11G¤*c2P'
     A  63                                 1'¤&a38C¤*c20A¤*c260B¤*c11G¤*c2P'
     A  63                                 1'¤&a77C¤*c20A¤*c260B¤*c11G¤*c2P'
     A                                      SPACEA(1)
E31  A N63                                 2' '
     A                                      SPACEB(1)
     A            HENAS         30         2
S31  A*N63                                41'!'
     A            HENAK         30        48
S31  A*N63                                78'!'
E31  A N63                                 2' '
     A                                      SPACEB(1)
     A  63                                 2' '
     A                                      SPACEB(1)
     A            HEADS1        30         2
S31  A*N63                                41'!'
     A            HEADK1        30        48
S31  A*N63                                78'!'
E31  A N63                                 2' '
     A                                      SPACEB(1)
     A  63                                 2' '
     A                                      SPACEB(1)
     A            HEADS2        30         2
S31  A*N63                                41'!'
     A            HEADK2        30        48
S31  A*N63                                78'!'
E31  A N63                                 2' '
     A                                      SPACEB(1)
     A  63                                 2' '
     A                                      SPACEB(1)
     A            HEADS3        30         2
S31  A*N63                                41'!'
     A            HEADK3        30        48
S31  A*N63                                78'!'
E31  A N63                                 2' '
     A                                      SPACEB(1)
     A  63                                 2' '
     A                                      SPACEB(1)
     A            SLAND         30         2
S31  A*N63                                41'!'
     A            KLAND         30        48
S31  A*N63                                78'!'
     A N64
     AAN63                                 1' _______________________'
     A N64
     AAN63                                25'________________________'
     A N64
     AAN63                                49'________________________'
     A N64
E25  AAN63                                73'_____'
     A  63                                 1'¤(12U¤(s0p10h1s0b4099T'
     A  63                                 1'¤*c2330A¤*c60B¤*c11G¤*c2P'
     A          R HEAD22                    SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
s33  A*N70N79                              1MSGCON(77 DIV1679 SYMSGF)
N33  A N70N79                              1MSGCON(77 SHU1374 SYMSGF)
     A  70                                 1' No.psc Desc.of goods'
E33  A* 70                                36'  Weight     M3    Ch.weight '
N33  A  70                                36'  Weight     M3  Ch.weight  '
s33  A* 70                                66'Marks'
n33  A  70                                64'Marks'
     A  79                                 1' Anzahl Warenart'
S33  A* 79                                36' Gewicht     M3      Fr.Gew. '
N33  A  79                                36' Gewicht     M3    Fr.Gew.  '
s33  A* 79                                66'Zeichen'
N33  A  79                                64'Zeichen'
     A N60N63                              1' _______________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A N60N63                             25'________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A N60N63                             49'________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
E25  A N60N63                             73'_____'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A  60N63                              1' -----------------------'
     A  60N63                               SPACEB(1)
     A  60N63                             25'------------------------'
     A  60N63                             49'------------------------'
E25  A  60N63                             73'-----'
     A  60 63                              1' '
     A  60 63                               SPACEB(1)
     A            HENT      R              1EDTCDE(Z)
     A                                      SPACEB(1)
     A            HEVS1     R              9
     A            HEVKT     R             35EDTCDE(Z)
     A            HEM3      R             46EDTWRD('   0,   ')
S33  A*           HEFBV     R             55EDTCDE(Z)
N33  A            HEFBV     R             54EDTCDE(Z)
S33  A*           HEGM1     R             66
E33  A            HEGM1     R             64
     A  49
     AO 58                                  SPACEA(1)
     A  49        HEVS2     R              9
     A  58                                44'LM:'
     A  58        HELM      R             48EDTWRD(' 0,  ')
S33  A* 49        HEGM2     R             66
N33  A  49        HEGM2     R             64
N51  A          R HEAD22B                   SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  60 63                              1'¤*c2330A¤*c35B¤*c11G¤*c2P'
S51  A*                                     SPACEB(1)
     A N60 63                              1'¤*c2330A¤*c50B¤*c11G¤*c2P'
     A                                      SPACEB(1)
     A N70N79                             17MSGCON(30 DIV1680 SYMSGF)
S39  A*                                     SPACEB(1)
N39  A                                      SPACEB(1)
     A N70N79                             69MSGCON(12 DIV1681 SYMSGF)
     A  70                                32'D E S C R I P T I O N'
S39  A*                                     SPACEB(1)
N39  A                                      SPACEB(1)
     A  70                                71'AMOUNT'
     A  79                                22'K O S T E N B E R E C H N U N G'
S39  A*                                     SPACEB(1)
N39  A                                      SPACEB(1)
     A  79                                71'KOSTEN'
     A N60N63                              1' _______________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A N60N63                             25'________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A N60N63                             49'________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
E25  A N60N63                             73'_____'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
N51  A          R VARELI0                   SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
N51  A N70N79                              2MSGCON(77 SHU1529 SYMSGF)
N51  A  70                                 2'Marks/No            NO PSC'
N51  A  79                                 2'Marks               Anzahl'
N51  A  70                                28' Goods type/description'
N51  A  79                                28' Typ Warenart'
N51  A  70                                55'  Weight     DM3   Loadm'
N51  A  79                                55'  Gewicht    DM3   Loadm'
N51  A          R VARELI1
N54  A  64                                  FONT(428 (*POINTSIZE 12))
N51  A N60N63                              1' _______________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
N51  A N60N63                             25'________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
N51  A N60N63                             49'________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
N51  A N60N63                             73'_____'
N51  A          R VARELI                    SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
N51  A            R33MRK        18         2
N51  A            R34ANT         7  0     21EDTCDE(Z)
N51  A            R35VSL        23        29
N51  A            R36VKT         9  0     54EDTCDE(Z)
N51  A            R37DM3         7  0     64EDTCDE(4)
N51  A            R37LM          4  2     73EDTCDE(4)
N51   *
N51  A          R VARELIT                   SPACEB(1)
     A            HENT      R             21EDTCDE(Z)
N51  A            HEVKT     R             54EDTCDE(Z)
N51  A            HEM3DM         7  0     64EDTCDE(4)
N51  A            HELM      R             73EDTCDE(4)
     A          R HEA222                    SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  61 63                              1'¤*c2330A¤*c35B¤*c11G¤*c2P'
     A N70N79                             17MSGCON(30 DIV1680 SYMSGF)
     A                                      SPACEB(1)
     A N70N79                             69MSGCON(12 DIV1681 SYMSGF)
     A  70                                32'D E S C R I P T I O N'
     A                                      SPACEB(1)
     A  70                                71'AMOUNT'
     A  79                                22'K O S T E N B E R E C H N U N G'
     A                                      SPACEB(1)
     A  79                                71'KOSTEN'
     A                                     1' '
     A                                      SPACEB(1)
     A N55                                 1' '
     A                                      SPACEB(1)
      *_______________________________
      * FORMAT FOR FRITEKST
      *"""""""""""""""""""""""""""""""
     A          R DETTXT                    SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A            FXVT          40        17
      *_______________________________
      * Format for faktura-varelinjer.
      *"""""""""""""""""""""""""""""""
     A          R DET                       SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  89        DFNT      R              1REFFLD(DFNT DOKUF)
     A                                      EDTCDE(Z)
     A  89        WWVKT          8  0      8EDTCDE(Z)
     A            FAVT      R             17REFFLD(FAVT FAKT)
     A N70N79     KGENOT    R             38REFFLD(KGENOT KODTGE)
     A  70        KGEENT    R             38REFFLD(KGEENT KODTGE)
     A  79        KG2TYT    R             38REFFLD(KG2TYT KODTG2)
     A  36 70     XVAL           3        58
     A  36 79     XVALB          3        58
     A  36N70 79  XVALC          3        58
     A  36        XPFNOK        13  2     60EDTCDE(J)
     A  34 36     XMVAK          1        78
      *__________________________________
      * Format for faktura-total. IND: 72
      *""""""""""""""""""""""""""""""""""
     A          R TOTA0
N54  A  64                                  FONT(428 (*POINTSIZE 10))
SXX  A*                                   41'______________________________'
SXX  A*                                   71'________'
NXX  A                                    38'______________________________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S39  A*                                   68'___________'
N39  A                                    68'__________'
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A                                      SPACEA(1)
     A N70N79                             38MSGCON(22 SHU1122 SYMSGF)
     A  79                                38'Taxfree total:  '
     A  70                                38'Taxfree total:  '
     A            XMVAFR        13  2     60EDTCDE(J)
     A          R TOTA                      SPACEB(1)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  72N70N79                          38MSGCON(22 SHU1123 SYMSGF)
     A  72 70                             38'VAT  OF AMOUNT'
     A  72 79                             38'MWS VON:'
     A  72                                59'('
     A  72        TVATK          1        60
     A  72                                61')'
     A  72        XMVAGR        13  2     60EDTCDE(J)
     A                                      SPACEA(1)
N02  A  71                                 2'('
N02  A N70N79 71                           3MSGCON(10 SHU1220 SYMSGF)
S41  A* 79 71                              3'MWS im NOK:'
S41  A* 70 71                              3'VAT in NOK:'
S41  A*    71     MVANOK        11  2     13EDTCDE(J)
S41  A*    71                             27')'
N41  A  79 71                              3'MWS im'
N41  A  70 71                              3'VAT in'
N41  A     71     FICURR         3        10
N41  A     71                             13':'
N41  A*    71     MVANOK        11  2     14EDTCDE(J)
N41  A*    71                             28')'
S02  A*N70N79                             20MSGCON(18 SHU1124 SYMSGF)
S02  A* 70                                20'VAT of ( ) lines'
S02  A* 79                                20'Tax von( ) linen'
S02  A*           TVATK2         1        28
N02  A N70N79                             38MSGCON(10 SHU1124 SYMSGF)
N02  A  70                                38'VAT of ( )'
N02  A  79                                38'Tax von( )'
N02  A            TVATK2         1        46
S02  A*N70N79                             38MSGCON(20 DIV1683 SYMSGF)
S02  A* 70                                38'VAT Domestic:     %'
S02  A* 79                                38'Kosten stat:      %'
     A            PRITAX         4  2     51EDTCDE(J)
N02  A                                    56'%'
     A  70        XVAL           3        58
     A  79        XVALB          3        58
     A N70 71     XVALC          3        58
     A            XPMOMS        13  2     60EDTCDE(J)
      *___________________________________
      * Format for faktura-total. IND: N35
      *"""""""""""""""""""""""""""""""""""
     A          R TOTB
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A N63                                 1' '
     A N63                                  SPACEA(1)
     A  63                                 1'¤(12U¤(s0p10h1s3b4099T'
     A N60N61                              1' '
     A                                      SKIPB(44)
     A  61N60                              1' '
     A                                      SKIPB(37)
     A  60        BLANK1         1         1SKIPB(49)
     A N44 61N60                           1' '
     A                                      SPACEB(2)
     A N70N73N79                           2MSGCON(24 DIV1684 SYMSGF)
     A  70N73N79                           2'Terms of payment'
     A  79N73N70                           2'Zahlungbedingungen'
     A N70N79                             38MSGCON(13 SHU1125 SYMSGF)
     A  70                                38'Invoice-total:'
     A  79                                38'Gesamtbetrag:'
     A            XVAL           3        58
     A            XBRUTT        13  2     60EDTCDE(J)
     A                                     2' '
     A                                      SPACEB(1)
     A N39N73     BETTXT        30         2
     A  39N70N73                           2'Kontant'
     A  39 70N73                           2'Cash '
     A                                    41'=============================='
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S33  A*                                   71'========'
N33  A                                    71'======='
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A  63                                45'¤(12U¤(s0p10h1s0b4099T'
     A  44        HP8           80         1SPACEB(1)
S64  A* 64                                  FNTCHRSET(C0N300B0 +
S64  A*                                     T1V10277)
     A  44        HP9           80         1SPACEB(1)
S64  A* 64                                  FNTCHRSET(C0N300B0 +
S64  A*                                     T1V10277)
     A  44        HP10          80         1SPACEB(1)
S64  A* 64                                  FNTCHRSET(C0N300B0 +
S64  A*                                     T1V10277)
     A  61N60     CBRUTT        13  2     28SKIPB(45)
     A                                      EDTCDE(J)
      *_________________________________________________
      * Format for faktura-total. without Norwegian giro.
      *""""""""""""""""""""""""""""""""""""""""""""""""""
     A          R TOTC                      SPACEB(4)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  63                                 1'¤(12U¤(s0p10h1s3b4099T'
     A N70N73N79                           2MSGCON(24 DIV1684 SYMSGF)
     A  70N73N79                           2'Terms of payment'
     A N70N79                             38MSGCON(13 SHU1125 SYMSGF)
     A  70                                38'Invoice-total:'
     A  79                                38'Gesamtbetrag:'
     A            XVAL           3        58
     A            XBRUTT        13  2     60EDTCDE(J)
     A                                     2' '
     A                                      SPACEB(1)
     A N39N73     BETTXT        30         2
     A  39N70N73                           2'Kontant'
     A  39 70N73                           2'Cash '
     A                                    38'=============================='
N54  A  64                                  FONT(428 (*POINTSIZE 12))
S02  A*                                   68'========'
S33  A*                                   68'==========='
N33  A                                    68'=========='
N54  A  64                                  FONT(428 (*POINTSIZE 12))
     A  63                                45'¤(12U¤(s0p10h1s0b4099T'
     A  44        HP8           80         1SPACEB(1)
S54  A* 64                                  FNTCHRSET(C0N300B0 +
S54  A*                                     T1V10277)
     A  44        HP9           80         1SPACEB(1)
S54  A* 64                                  FNTCHRSET(C0N300B0 +
S54  A*                                     T1V10277)
     A  44        HP10          80         1SPACEB(1)
S54  A* 64                                  FNTCHRSET(C0N300B0 +
S54  A*                                     T1V10277)
     A*** SKRIVER KIDLINJE PÅ SELVE FAKTURABLANKETT
     A          R KIDLIN
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A N60                                 1' '
S39  A*                                     SKIPB(62)
N39  A                                      SKIPB(56)
     A  60                                 1' '
S01  A*                                     SKIPB(86)
S39  A*                                     SKIPB(80)
N39  A                                      SKIPB(76)
     A  61 63                              1'¤*c2330A¤*c60B¤*c11G¤*c2P'
     A  63                                40'¤(12U¤(s0p10h0s5b24579T'
     A            KIDTXT         4         4
     A                                       SPACEB(1)
     A                                      HIGHLIGHT
     A                                    30'TOTAL:'
     A                                      HIGHLIGHT
     A            XVAL2          3        37HIGHLIGHT
     A            IBATXT         8        52
     A                                      HIGHLIGHT
     A            LIN20         20         4HIGHLIGHT
     A                                      SPACEB(2)
     A            KTOTKR        11  0     30EDTCDE(3)
     A                                      HIGHLIGHT
     A                                    41','
     A                                      HIGHLIGHT
     A            KTOTØR         2  0     42
     A                                      HIGHLIGHT
S20  A*           GIRO20        20        52
S20  A            GIRO25        25        52
     A                                      HIGHLIGHT
     A  63                                50'¤(12U¤(s0p10h1s0b4099T'
     A                                      SPACEB(1)
     A          R CVRPA2
     A*                                     BOX(2.7 0.5 4 7.0 0.01)
     A* 2.7 ER LINJE PÅ SIDEN FOR FØRSTE BOKS, 4 ER HØYDEN PÅ BOKSEN 7.0 ER
     A* BREDDEN
N54  A  55                                  BOX(3.82 0.1 4.82 3.82 0.02)
N54  A  55                                  BOX(3.82 3.82 4.82 7.83 0.02)
S39  A*                                     BOX(10  0.2 11.0 7.5 0.01)
N39  A*                                     LINE(3.82 0.25 1.0 *VRT 0.01)
N39  A*                                     LINE(3.82 4.1 1.0 *VRT 0.01)
N39  A*                                     LINE(3.82 7.83 1.0 *VRT 0.01)
N39  A                                      BOX(9.1  0.2 10.0 7.5 0.02)
      * START TOMME 9 0,2 TOMMER MARG
      * BREDDE 7.5 TOMMER SLUTT TOMME 10
      *
     A* BREDDEN  (FUNGERER OGSÅ MED 10.8 OG 7.0)
      *________________________________
      * Format for Ordinary giro Norway
      *""""""""""""""""""""""""""""""""
     A          R BGIR
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  61N60                              1' '
     A                                      SKIPB(47)
     A N60N61                              1' '
     A                                      SKIPB(49)
     A  60                                 1' '
     A                                      SKIPB(58)
     A
     A* STORE ENDRINGER PÅ GIROEN
     A* DA LINJENUMMER ER TATT BORT
     A  60 59     KTOTKR        11  0     30EDTCDE(3)
     A  60 59                             41','
     A  60 59     KTOTØR         2  0     42
     A  60                                80 ' '
     A                                       SPACEA(004)
     A            BLANK1         1        77 SPACEA(001)
     A N39 59     KFFDT          6  0     67 EDTCDE(Y)
     A  60                                80 ' '
     A                                       SPACEA(2)
     A N70N79                              7'Faktura nummer:'
     A  70                                 7'Invoice number:'
     A  79                                 7'Rechnungsnr...:'
     A            XFN            7  0     29 EDTCDE(3)
     A                                       SPACEA(1)
     A N70N79                              7'Kundenummer...:'
     A  70                                 7'Customer No...:'
     A  79                                 7'Kunden nr.....:'
     A            KUNDNR    R             28 REFFLD(KUNDNR CUNDF)
     A                                       EDTCDE(3)
     A                                       SPACEA(1)
     A N70N79                              7'Faktura dato..:'
     A  70                                 7'Invoice date..:'
     A  79                                 7'Rechnungsdatum'
     A            IDAGX          6  0     28 EDTCDE(Y)
     A                                       SPACEA(1)
     A N70N79                              7'Forfallsdato..:'
     A  70                                 7'Date due......:'
     A  79                                 7'Verfallstag...:'
     A N39        XFFDT          6  0     28 EDTCDE(Y)
     A                                       SPACEA(1)
     A  39N70                             28'Kontant'
     A                                       SPACEA(1)
     A  39 70                             28'Cash'
     A                                       SPACEA(1)
     A N70N79                              7'Vår Referanse.:'
     A  70                                 7'Our reference.:'
     A  79                                 7'Unsere Ref....:'
     A            HEAVD     R             22
     A                                    26'/'
     A            HEOPD     R             27
     A                                    34'/'
     A            HESG      R             35
     A                                       SPACEA(4)
     A  60                                 1 ' '
     A                                       SPACEA(2)
     A N48        KNAVN     R              7REFFLD(KNAVN CUNDF)
     A  48        XDINV         30         7
     A            XFNAVN        30        46
     A                                       SPACEA(1)
     A N48        ADR1      R              7REFFLD(ADR1 CUNDF)
     A  48        XDIAD1        30         7
     A            XFADR1        30        46
     A                                       SPACEA(1)
     A N48        ADR2      R              7REFFLD(ADR2 CUNDF)
     A  48        XDIAD2        30         7
     A            XFADR2        30        46
     A                                       SPACEA(1)
     A N37N48     POSTNR    R              7REFFLD(POSTNR CUNDF)
     A                                      DLTEDT
     A N37N48     ADR3      R             13REFFLD(ADR3 CUNDF)
     A N38N48     SYPOGE         9         7
     A N38N48     ADR3B     R             18REFFLD(ADR3 CUNDF)
     A  37 38N48  ADR3C     R              7REFFLD(ADR3 CUNDF)
     A  48        XDIAD3        30         7
     A            XFPONR         4  0     46
     A            XFADR3        24        52
     A  60                                 1' '
     A                                      SPACEA(2)
      *_________________________________________
      * Format for H-line giro, OCR    5224/5225
      *"""""""""""""""""""""""""""""""""""""""""
     A          R BGIR2A
     A                                      CPI(10)
     A                                      DFNCHR( +
     A                                      X'F0' X'7E818181817E000000' +
     A                                      X'F1' X'00004000FF00000000' +
     A                                      X'F2' X'438589819161000000' +
     A                                      X'F3' X'818191A1D18E000000' +
     A                                      X'F4' X'040C1424448F040000' +
     A                                      X'F5' X'E1A1A1A1928C000000' +
     A                                      X'F6' X'1E2949890906000000' +
     A                                      X'F7' X'80808F90A0C0800000' +
     A                                      X'F8' X'066991919169060000' +
     A                                      X'F9' X'609091929478000000')
     A  59        BANKGK        24        17HIGHLIGHT
     A                                      SPACEB(2)
     A                                      SPACEA(1)
     A N59        BANKG         15        13HIGHLIGHT
     A                                      SPACEB(3)
     A  60                                 1' '
     A                                      SPACEB(1)
     A N65        OCRF          75         1SPACEB(1)
     A                                     1'H'
     A                                      SPACEB(2)
     A N59N62     XWKID         19        11HIGHLIGHT
     A N59N62     XBAK           1  0     30HIGHLIGHT
     A N59 62     KID8           8        16HIGHLIGHT
     A N59        XTOTKR        11  0     31EDTCDE(3)
     A                                      HIGHLIGHT
     A N59                                31'<'
     A                                      HIGHLIGHT
     A N59        XTOTØR         2  0     46HIGHLIGHT
     A  59N62     KWKID         19         9HIGHLIGHT
     A  59N62     KBAK           1        28HIGHLIGHT
     A  59 62     KID8B          8        14HIGHLIGHT
     A  59        KTOTKR        11  0     29EDTCDE(3)
     A                                      HIGHLIGHT
     A  59        KTOTØR         2  0     42HIGHLIGHT
     A  59        KNYMOD         1        47HIGHLIGHT
     A            XFBANK        15        52HIGHLIGHT
     A N65        OCRE          75         1SPACEB(1)
     A          R BGIR2D
     A                                      CPI(10)
     A                                      DFNCHR( +
     A                                      X'F0' X'7E818181817E000000' +
     A                                      X'F1' X'00004000FF00000000' +
     A                                      X'F2' X'438589819161000000' +
     A                                      X'F3' X'818191A1D18E000000' +
     A                                      X'F4' X'040C1424448F040000' +
     A                                      X'F5' X'E1A1A1A1928C000000' +
     A                                      X'F6' X'1E2949890906000000' +
     A                                      X'F7' X'80808F90A0C0800000' +
     A                                      X'F8' X'066991919169060000' +
     A                                      X'F9' X'609091929478000000')
     A            BANKG         15        13HIGHLIGHT
     A                                      SPACEB(3)
     A  60                                 1' '
     A                                      SPACEB(1)
     A N65        OCRF          75         1SPACEB(1)
     A                                     1'H'
     A                                      SPACEB(2)
     A                                      HIGHLIGHT
     A            XTOTKR        11  0     31EDTCDE(3)
     A                                      HIGHLIGHT
     A            XTOTØR         2  0     46HIGHLIGHT
     A            XFBANK        15        52HIGHLIGHT
     A N65        OCRE          75         1SPACEB(1)
      *___________________________________________
      * Format for H-line giro, OCR    4224(*IPDS)
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R BGIR2B                    SPACEB(2)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  59        BANKGK        24        17HIGHLIGHT
     A                                      SPACEA(1)
     A                                      CHRID
     A                                      FONT(011)
     A N59        BANKG         15        13HIGHLIGHT
     A                                      SPACEB(1)
     A                                      CHRID
     A  60                                 1' '
     A                                      SPACEB(1)
     A N65        OCRF          75         1SPACEB(1)
     A                                     1'H'
     A                                      SPACEB(2)
     A                                      HIGHLIGHT
     A N59N62     XWKID         19        11HIGHLIGHT
     A                                      CHRID
     A N59N62     ABAK           1        30HIGHLIGHT
     A                                      CHRID
     A N59 62     KID8           8        16HIGHLIGHT
     A                                      CHRID
     A N59        ATOTKR        11        31HIGHLIGHT
     A                                      CHRID
     A N59        HAKE           1        31HIGHLIGHT
     A                                      CHRID
     A N59        ATOTØR         2        46HIGHLIGHT
     A                                      CHRID
     A  59N62     KWKID         19         9HIGHLIGHT
     A                                      CHRID
     A  59N62     KBAK           1        28HIGHLIGHT
     A                                      CHRID
     A  59 62     KID8B          8        14HIGHLIGHT
     A                                      CHRID
     A  59        ATOTKK        11        29HIGHLIGHT
     A                                      CHRID
     A  59        ATOTØK         2        42HIGHLIGHT
     A                                      CHRID
     A  59        KNYMOD         1        47HIGHLIGHT
     A                                      CHRID
     A            XFBANK        15        52HIGHLIGHT
     A                                      CHRID
     A N65        OCRE          75         1SPACEB(1)
      *___________________________________________
      * Format for H-line giro, OCR    E
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R BGIR2E                    SPACEB(3)
     A                                      FONT(011)
     A N59        BANKG         15        13HIGHLIGHT
     A                                      CHRID
     A  60                                 1' '
     A                                      SPACEB(1)
     A N65        OCRF          75         1SPACEB(1)
     A                                     1'H'
     A                                      SPACEB(2)
     A                                      HIGHLIGHT
     A N59        ATOTKR        11        31HIGHLIGHT
     A                                      CHRID
     A N59        ATOTØR         2        46HIGHLIGHT
     A                                      CHRID
     A  59        ATOTKK        11        29HIGHLIGHT
     A                                      CHRID
     A  59        ATOTØK         2        42HIGHLIGHT
     A                                      CHRID
     A  59        KNYMOD         1        47HIGHLIGHT
     A                                      CHRID
     A            XFBANK        15        52HIGHLIGHT
     A                                      CHRID
     A N65        OCRE          75         1SPACEB(1)
      *_____________________________________________
      * Format for H-line giro, OCR    BELTESSKRIVER
      *"""""""""""""""""""""""""""""""""""""""""""""
     A          R BGIR2C                    SPACEB(2)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  59        BANKGK        24        17HIGHLIGHT
     A                                      SPACEA(1)
     A N59        BANKG         15        13HIGHLIGHT
     A                                      SPACEB(1)
     A  60                                 1' '
     A                                      SPACEB(1)
     A N65        OCRF          75         1SPACEB(1)
     A                                     1'H'
     A                                      SPACEB(2)
     A                                      HIGHLIGHT
     A N59N62     XWKID         19        11HIGHLIGHT
     A N59N62     XBAK           1  0     30HIGHLIGHT
     A N59 62     KID8           8        16HIGHLIGHT
     A N59        XTOTKR        11  0     31EDTCDE(3)
     A                                      HIGHLIGHT
     A N59                                31'<'
     A                                      HIGHLIGHT
     A N59        XTOTØR         2  0     46HIGHLIGHT
     A  59N62     KWKID         19         9HIGHLIGHT
     A  59N62     KBAK           1        28HIGHLIGHT
     A  59 62     KID8B          8        14HIGHLIGHT
     A  59        KTOTKR        11  0     29EDTCDE(3)
     A                                      HIGHLIGHT
     A  59        KTOTØR         2  0     42HIGHLIGHT
     A  59        KNYMOD         1        47HIGHLIGHT
     A            XFBANK        15        52HIGHLIGHT
     A N63N65     OCRE          75         1SPACEB(1)
     A  63                                 1'¤(12U¤(s0p10h0s3b4099T'
     A                                      SPACEB(1)
      *_____________________________________________
      * Format for H-line giro, OCR    BELTESSKRIVER
      * LE*2391(4214-2)  ¤1=DRAFT, ¤2=LOUVIER 10, ¤3=OCR-B(KODESETT877)
      *"""""""""""""""""""""""""""""""""""""""""""""
     A          R BGIR2F                    SPACEB(2)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  59        BANKGK        24        17HIGHLIGHT
     A                                      SPACEA(1)
     A N59        BANKG         15        13HIGHLIGHT
     A                                      SPACEB(1)
     A N65        OCRF          75         1SPACEB(2)
     A  60                                 1' '
     A                                      SPACEB(1)
     A                                     1'H'
     A                                      SPACEB(1)
     A                                      HIGHLIGHT
     A N59N62     XWKID         19        11HIGHLIGHT
     A N59N62     XBAK           1  0     30HIGHLIGHT
     A N59 62     KID8           8        16HIGHLIGHT
     A N59        XTOTKR        11  0     31EDTCDE(3)
     A                                      HIGHLIGHT
     A N59                                31'<'
     A                                      HIGHLIGHT
     A N59        XTOTØR         2  0     46HIGHLIGHT
     A  59N62     KWKID         19         9HIGHLIGHT
     A  59N62     KBAK           1        28HIGHLIGHT
     A  59 62     KID8B          8        14HIGHLIGHT
     A  59        KTOTKR        11  0     29EDTCDE(3)
     A                                      HIGHLIGHT
     A  59        KTOTØR         2  0     42HIGHLIGHT
     A  59        KNYMOD         1        47HIGHLIGHT
     A            XFBANK        15        52HIGHLIGHT
     A N63N65     OCRE          75         1
     A                                      SPACEB(1)
     A  63                                 1'¤(12U¤(s0p10h0s3b4099T'
     A                                      SPACEB(1)
      *________________________________
      * Format for H-line giro, Not OCR
      *""""""""""""""""""""""""""""""""
     A          R BGIR3                     SPACEB(5)
N54  A  64                                  FONT(428 (*POINTSIZE 10))
     A  60                                 1' '
     A                                      SPACEB(1)
     A N60 63                              1'¤(12U¤(s0p10h0s3b4099T'
     A                                      SPACEB(1)
     A N60N63                              1' '
     A                                      SPACEB(1)
     A                                     1'H'
     A                                      HIGHLIGHT
     A            XTOTKR        11  0     29EDTCDE(3)
     A                                      HIGHLIGHT
     A            XTOTØR         2  0     42HIGHLIGHT
     A            XFBANK        15        52HIGHLIGHT
     A N60 63                              1'¤(12U¤(s0p10h1s0b4099T'
     A                                      SPACEB(1)
