     A*****************************************************************
     A*           UTSKRIFT AV MERKING AV NULLFAKTURAER (N)            *
     A* ANTALL LINJE=48,  ANTALL TEGN PR. LINJE=130, OVERFLOW=48      *
     A*****************************************************************
     A          R HEADER
     A                                  4  1MSGCON(110 DIV0431 SYMSGF)
     A                                  6 29MSGCON(12 DIV0432 SYMSGF)
     A            KOVAVD         4  0   6 43
     A                                  6 53MSGCON(8 DIV0433 SYMSGF)
     A                                  6 62DATE EDTCDE(Y)
     A                                  6117MSGCON(8 DIV0434 SYMSGF)
     A                                  6127PAGNBR
     A                                  8  3MSGCON(130 DIV0435 SYMSGF)
     A                                  9  3'------------------------'
     A                                  9 27'------------------------'
     A                                  9 51'------------------------'
     A                                  9 75'------------------------'
     A                                  9 99'------------------------'
     A                                  9123'--------'
     A          R DET                       SPACEB(1)
     A            HEOPD          7  0      8EDTCDE(3)
     A            HESG           3A       16
     A            HEFR           3A       22
     A            HEOT           2A       31
     A            HEGN          15A       35
     A*           HERFA         15A       52
     A            HERFA15       15A       52
     A            HENAK         30A       74
     A            HENT           7  0    105EDTCDE(4)
     A            HEVKT          9  0    113EDTCDE(4)
SV5  A*           HEDT           6S 0    123
NV5  A            XEDTOP         6S 0    123
