F7   A*  FAKTURANUMMER
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt')
     A            MSGF01        22A  O  1 58MSGID(DIV0047 SYMSGF)
     A                                      COLOR(TRQ)
     A            MSGF02        60A  O  3 15MSGID(DIV0393 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF03        24A  O  7 15MSGID(DIV0394 SYMSGF)
SF7  A*           WSFNF          6Y 0B  7 41DSPATR(UL)
NF7  A            WSFNF          7Y 0B  7 41DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            MSGF04        24A  O  9 15MSGID(DIV0395 SYMSGF)
SF7  A*           WSFNT          6Y 0B  9 41DSPATR(UL)
NF7  A            WSFNT          7Y 0B  9 41DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            MSGF05        24A  O 14 15MSGID(DIV0396 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF06        66A  O 16 15MSGID(DIV0397 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF07        66A  O 17 15MSGID(DIV0398 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF08        24A  O 19 15MSGID(DIV0396 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF09        18A  O 23 15MSGID(DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R BILDE02
     A                                      CF03(03 'Avslutt')
     A            MSGF01        22A  O  1 58MSGID(DIV0047 SYMSGF)
     A                                      COLOR(TRQ)
     A            MSGF02        60A  O  3 15MSGID(DIV0393 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF03        24A  O  7 15MSGID(DIV0394 SYMSGF)
SF7  A*           WSFNF          6Y 0O  7 41DSPATR(UL)
NF7  A            WSFNF          7Y 0O  7 41DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A            MSGF04        24A  O  9 15MSGID(DIV0395 SYMSGF)
SF7  A*           WSFNT          6Y 0O  9 41DSPATR(UL)
NF7  A            WSFNT          7Y 0O  9 41DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A            MSGF05        60A  O 14 15MSGID(DIV0399 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF06        24A  O 16 15MSGID(DIV0400 SYMSGF)
SF7  A*           WSFN           6Y 0O 16 41DSPATR(UL)
NF7  A            WSFN           7Y 0O 16 41DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A            MSGF07        30A  O 18 50MSGID(DIV0401 SYMSGF)
     A            MSGF08        60A  O 23 15MSGID(DIV0402 SYMSGF)
     A                                      COLOR(BLU)
