     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE
     A                                      CF03(03 'EXIT')
     A                                      CF12(12 'CANCEL')
     A            MSG501        45A  O  1  2MSGID(DIV1315 SYMSGF)
     A                                      COLOR(WHT)
     A            MSG502        15A  O  2  2MSGID(DIV1184 SYMSGF)
     A            XKNR           8  0O  2 18DSPATR(UL)
     A                                      EDTCDE(4)
     A            MSG503        15A  O  2 32MSGID(DIV1185 SYMSGF)
     A            UAVTN          1A  O  2 48DSPATR(UL)
     A            MSG504        12A  O  4  2MSGID(DIV1189 SYMSGF)
     A            PKGEBY         3A  O  4 15DSPATR(UL)
     A                                      COLOR(WHT)
     A            KGENOT        20A  O  4 23DSPATR(UL)
     A            MSG505        12A  O  5  2MSGID(DIV1190 SYMSGF)
     A            PKAVTT         1A  O  5 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 23'(T,B,P,X,Y)'
     A                                      COLOR(BLU)
     A            MSG506        12A  O  6  2MSGID(DIV1191 SYMSGF)
     A            PKTNR          1A  O  6 15DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG507        15A  O  6 23MSGID(DIV1192 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG508        12A  O  7  2MSGID(DIV1193 SYMSGF)
     A            PKMVA          1A  O  7 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7 22'(J/N)'
     A                                      COLOR(BLU)
     A            MSG509        12A  O  8  2MSGID(DIV1194 SYMSGF)
     A            PKINT          5  0O  8 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            MSG510        12A  O  8 32MSGID(DIV1199 SYMSGF)
     A            PKKOLL         1A  O  8 45DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG511        12A  O  9  2MSGID(DIV1195 SYMSGF)
     A            PKBELØ        10  3O  9 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            MSG512        30A  O  9 32MSGID(DIV1196 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG513        12A  O 10  2MSGID(DIV1197 SYMSGF)
     A            PKPPR          5  0O 10 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            MSG514        30A  O 10 32MSGID(DIV1198 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG515        18A  O 11  2MSGID(DIV1200 SYMSGF)
     A            PKTEGN         1A  O 11 21DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG516        15A  O 11 25MSGID(DIV1201 SYMSGF)
     A            PKJUST        10  3O 11 41DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            MSG517         6A  O 11 54MSGID(DIV1202 SYMSGF)
     A            PKFVAL         3A  O 11 61DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG518        20A  O 13  2MSGID(DIV1172 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG519        15A  O 14  2MSGID(DIV1173 SYMSGF)
     A            PKDT           8Y 0H
     A            WKDT           6Y 0O 14 19DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG520        25A  O 14 31MSGID(DIV1174 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG521        60A  O 15  2MSGID(DIV1175 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG522         4A  O 16  2MSGID(DIV1176 SYMSGF)
     A            PKURIO         1A  O 16  7DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG523        10A  O 16  9MSGID(DIV1177 SYMSGF)
     A            PKUR01         1A  O 16 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR02         1A  O 16 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR03         1A  O 16 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR04         1A  O 16 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR05         1A  O 16 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR06         1A  O 16 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR07         1A  O 16 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR08         1A  O 16 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR09         1A  O 16 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKUR10         1A  O 16 74DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG524         4A  O 17  2MSGID(DIV1176 SYMSGF)
     A            PKFRIO         1A  O 17  7DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG525        10A  O 17  9MSGID(DIV1203 SYMSGF)
     A            PKFR01         3A  O 17 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR02         3A  O 17 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR03         3A  O 17 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR04         3A  O 17 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR05         3A  O 17 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR06         3A  O 17 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR07         3A  O 17 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR08         3A  O 17 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR09         3A  O 17 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFR10         3A  O 17 74DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG526         4A  O 18  2MSGID(DIV1176 SYMSGF)
     A            PKOTIO         1A  O 18  7DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG527        10A  O 18  9MSGID(DIV1204 SYMSGF)
     A            PKOT01         2A  O 18 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT02         2A  O 18 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT03         2A  O 18 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT04         2A  O 18 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT05         2A  O 18 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT06         2A  O 18 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT07         2A  O 18 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT08         2A  O 18 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT09         2A  O 18 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKOT10         2A  O 18 74DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG528         4A  O 19  2MSGID(DIV1176 SYMSGF)
     A            PKLKIO         1A  O 19  7DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG529        10A  O 19  9MSGID(DIV1178 SYMSGF)
     A            PKLK01         2A  O 19 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK02         2A  O 19 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK03         2A  O 19 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK04         2A  O 19 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK05         2A  O 19 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK06         2A  O 19 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK07         2A  O 19 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK08         2A  O 19 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK09         2A  O 19 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKLK10         2A  O 19 74DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG530         4A  O 20  2MSGID(DIV1176 SYMSGF)
     A            PKFSIO         1A  O 20  7DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG531        10A  O 20  9MSGID(DIV1179 SYMSGF)
     A            PKFS01         5A  O 20 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS02         5A  O 20 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS03         5A  O 20 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS04         5A  O 20 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS05         5A  O 20 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS06         5A  O 20 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS07         5A  O 20 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS08         5A  O 20 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS09         5A  O 20 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKFS10         5A  O 20 74DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG532         4A  O 21  2MSGID(DIV1176 SYMSGF)
     A            PKTSIO         1A  O 21  7DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG533        10A  O 21  9MSGID(DIV1180 SYMSGF)
     A            PKTS01         5A  O 21 20DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS02         5A  O 21 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS03         5A  O 21 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS04         5A  O 21 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS05         5A  O 21 44DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS06         5A  O 21 50DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS07         5A  O 21 56DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS08         5A  O 21 62DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS09         5A  O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A            PKTS10         5A  O 21 74DSPATR(UL)
     A                                      COLOR(WHT)
     A            MSG534        18A  O 23  2MSGID(DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG535        18A  O 23 22MSGID(DIV0024 SYMSGF)
     A                                      COLOR(BLU)
