     A*****************************************************************
     A*               S T E D S R E G I S T E R                       *
     A* ANTALL LINJE=48,  ANTALL TEGN PR. LINJE=130, OVERFLOW=48      *
     A*****************************************************************
     A          R HEADER
     A                                  2 21MSGCON(60 DIV0738 SYMSGF)
     A  96                              3 21MSGCON(60 DIV2143 SYMSGF)
     A                                  4 21MSGCON(6 DIV0739 SYMSGF)
     A N98        ST2LK          2A     4 29
     A N98                              4 32'='
     A N98N99     KLKNVN        30A     4 34
     A N98 99                           4 34MSGCON(20 DIV2142 SYMSGF)
     A  98                              4 29MSGCON(24 DIV0737 SYMSGF)
     A                                  6  1MSGCON(73 DIV0740 SYMSGF)
     A                                  7  1'------------------------'
     A                                  7 25'------------------------'
     A                                  7 49'------------------------'
     A                                  7 73'--------'
     A          R DETALJ                    SPACEB(1)
     A N97        ST2KO2         5A        1
     A            ST2KOD         5A       10
     A            ST2NVN        30A       23
     A            ST2SON         1  0     58
