     A          R LHEAD
     A                                  2  2MSGCON(40 DIV3848 SYMSGF)
     A                                      HIGHLIGHT
     A                                  2 52MSGCON(15 DIV3849 SYMSGF)
     A            XDTF           6  0   2 68EDTCDE(Y)
     A                                      HIGHLIGHT
     A                                  2 82MSGCON(15 DIV3850 SYMSGF)
     A            XDTT           6  0   2 98EDTCDE(Y)
     A                                      HIGHLIGHT
     A                                  2112MSGCON(6 DIV3851 SYMSGF)
     A            XSIDE          5  0   2119EDTCDE(4)
     A                                      HIGHLIGHT
     A                                  3  1MSGCON(132 DIV3361 SYMSGF)
     A                                  4  2MSGCON(130 DIV3852 SYMSGF)
     A                                  5  1MSGCON(132 DIV3361 SYMSGF)
      *
     A          R LDETALJ                   SPACEB(1)
     A            HEAVD          4  0      2EDTCDE(4)
     A            HEOPD          7  0      7EDTCDE(4)
     A            HEUR           1        15
     A            HESG           3        18
SV5  A*           XDTR           6  0     22EDTCDE(4)
NV5  A            XDTOP          6  0     22EDTCDE(4)
     A            HEPRO          8  0     29EDTCDE(4)
     A            XNAS          27        38
     A            XNAK          27        66
     A            HEOB           5        94
     A            HEOT           2       100
     A            HEFR           3       103
     A            HENT           7  0    107EDTCDE(4)
     A            HEVKT          9  0    115EDTCDE(4)
     A            HEM3           7  3    125EDTCDE(4)
