     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/TURER)
     A                                      PRINT
     A                                      CF03(03 'Avslutt')
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  6  3VALUES(' ' '5')
     A            TUAVD     R    4  0O  6  6EDTCDE(4)
     A            TUPRO     R    8  0O  6 11EDTCDE(4)
     A            WSDT           6  0O  6 20
     A            TUSDF     R   20   O  6 27
     A            TUSDT     R   20   O  6 48
     A            TULK      R    2   O  6 69
     A            TUAO      R    5  0O  6 72EDTCDE(4)
     A            TUKNA     R    8  0O  7  7EDTCDE(4)
     A                                      DSPATR(UL)
     A            TUNAT     R   30   O  7 18DSPATR(UL)
     A            TUAD1T    R   30   O  7 49DSPATR(UL)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0008)
     A                                      SFLPAG(0007)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A            MSG001        30A  O  1 28MSGID(DIV 1525 SYMSGF)
     A                                      DSPATR(HI)
     A            MSG002        12A  O  2  2MSGID(DIV 1528 SYMSGF)
     A            UBILN         10   O  2 16COLOR(BLU)
     A            MSG003        12A  O  2 30MSGID(DIV 1529 SYMSGF)
     A            WSDT2          6  0O  2 45EDTCDE(Y)
     A                                      COLOR(BLU)
     A            MSG004        30A  O  3  2MSGID(DIV 0016 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG005        15A  O  3 40MSGID(DIV 0048 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG006        79A  O  4  2MSGID(DIV 1532 SYMSGF)
     A                                      DSPATR(HI)
     A            MSG007        79A  O  5  2MSGID(DIV 1533 SYMSGF)
     A                                      DSPATR(HI)
     A          R BUNN
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF05(05 'Frisk')
     A                                      CF12(12 'Forrige')
     A                                      SLNO(22)
     A                                      CLRL(03)
     A                                      OVERLAY
     A            MSG027        18A  O  2 10MSGID(DIV 0020 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG028        18A  O  2 30MSGID(DIV 0021 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG029        18A  O  2 50MSGID(DIV 0024 SYMSGF)
     A                                      COLOR(BLU)
     A          R NYWRK
     A                                      CF05(05 'Frisk')
     A                                      CF12(12 'Forrige')
     A            MSG001        30A  O  1 28MSGID(DIV 1525 SYMSGF)
     A                                      DSPATR(HI)
     A            MSG002        12A  O  2  2MSGID(DIV 1528 SYMSGF)
     A            UBILN         10   O  2 16COLOR(BLU)
     A            MSG003        12A  O  2 30MSGID(DIV 1529 SYMSGF)
     A            WSDT2          6  0O  2 35EDTCDE(Y)
     A                                      COLOR(BLU)
     A            MSG004        30A  O  3  2MSGID(DIV 0030 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG005        15A  O  3 40MSGID(DIV 0048 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG006        79A  O  4  2MSGID(DIV 1532 SYMSGF)
     A                                      DSPATR(HI)
     A            MSG007        79A  O  5  2MSGID(DIV 1533 SYMSGF)
     A                                      DSPATR(HI)
     A            MSG027        18A  O 23 10MSGID(DIV 0020 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG028        18A  O 23 30MSGID(DIV 0021 SYMSGF)
     A                                      COLOR(BLU)
     A            MSG029        18A  O 23 50MSGID(DIV 0024 SYMSGF)
     A                                      COLOR(BLU)
