     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE1
     A                                      WINDOW(*DFT 15 74)
     A                                      CF12(12 'Returner uten oppdatering')
     A                                      CF04(04 'Søking')
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      OVRDTA
     A                                      OVRATR
     A          H                           HLPDOC('SYFI10A200' 'SYFI10A' 'SY40-
     A                                      0LO/FELLES')
     A                                      HLPARA(01 001 15 074)
     A                                  1  1'SYFI10V'
     A                                      COLOR(BLU)
     A                                  1 66DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  1USER
     A                                      COLOR(BLU)
     A                                  2 66TIME
     A                                      COLOR(BLU)
     A            KOD01          2A  B  4  1
     A  88                                  DSPATR(PR)
     A            TXT01         70A  B  4  5
     A  88                                  DSPATR(PR)
     A            KOD02          2A  B  5  1
     A  88                                  DSPATR(PR)
     A            TXT02         70A  B  5  5
     A  88                                  DSPATR(PR)
     A            KOD03          2A  B  6  1
     A  88                                  DSPATR(PR)
     A            TXT03         70A  B  6  5
     A  88                                  DSPATR(PR)
     A            KOD04          2A  B  7  1
     A  88                                  DSPATR(PR)
     A            TXT04         70A  B  7  5
     A  88                                  DSPATR(PR)
     A            KOD05          2A  B  8  1
     A  88                                  DSPATR(PR)
     A            TXT05         70A  B  8  5
     A  88                                  DSPATR(PR)
     A            KOD06          2A  B  9  1
     A  88                                  DSPATR(PR)
     A            TXT06         70A  B  9  5
     A  88                                  DSPATR(PR)
     A            KOD07          2A  B 10  1
     A  88                                  DSPATR(PR)
     A            TXT07         70A  B 10  5
     A  88                                  DSPATR(PR)
     A            KOD08          2A  B 11  1
     A  88                                  DSPATR(PR)
     A            TXT08         70A  B 11  5
     A  88                                  DSPATR(PR)
     A            KOD09          2A  B 12  1
     A  88                                  DSPATR(PR)
     A            TXT09         70A  B 12  5
     A  88                                  DSPATR(PR)
     A            KOD10          2A  B 13  1
     A  88                                  DSPATR(PR)
     A            TXT10         70A  B 13  5
     A  88                                  DSPATR(PR)
     A                                 14  5MSGCON(030 BBA0138 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 14 43MSGCON(012 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 14 63MSGCON(012 BBA0015 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 15'Ekstra R38 informasjon-MELDING TIL-
     A                                       TRANSPORTØR  '
     A                                      COLOR(WHT)
     A                                  2 15'(også lin m/kode G i OPPDR.notis e-
     A                                      r mld til trans)'
     A          R ASSUME
     A                                      ASSUME
     A                                  1  3' '
