     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE1
     A                                      WINDOW(*DFT 20 70)
     A                                      CF12(12 'Returner uten oppdatering')
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      OVRDTA
     A                                      OVRATR
     A          H                           HLPDOC('SYFI10A190' 'SYFI10A' 'SY40-
     A                                      0LO/FELLES')
     A                                      HLPARA(01 001 20 046)
     A                                  1 18'Farlig gods'
     A                                      COLOR(WHT)
     A                                  1 61'SYFI10Y'
     A                                  3  1'Hazard code id / Page no / Code V -
     A                                      no :'
     A            WGS8351        7A  B  3 42
     A  88                                  DSPATR(PR)
     A            WGS8078        7A  B  3 50
     A  88                                  DSPATR(PR)
     A            WGS8092       10A  B  3 58
     A  88                                  DSPATR(PR)
     A                                  4  1'UNDG number / Flashpoint . . . . .-
     A                                       . :'
     A            WGS7124        4Y 0B  4 42EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            WGS7088        8A  B  4 50
     A  88                                  DSPATR(PR)
     A                                  5  1'Shipment flashpoint / Qualifier  .-
     A                                       . :'
     A            WGS7106        3Y 0B  5 42EDTCDE(4)
     A  88                                  DSPATR(PR)
     A            WGS6411        3A  B  5 50
     A  88                                  DSPATR(PR)
     A                                  6  1'Packing group / EMS number . . . .-
     A                                       . :'
     A            WGS8339        3A  B  6 42
     A  88                                  DSPATR(PR)
     A            WGS8364        6A  B  6 50
     A  88                                  DSPATR(PR)
     A                                  7  1'MFAG / Trem card number  . . . . .-
     A                                       . :'
     A            WGS8410        4A  B  7 42
     A  88                                  DSPATR(PR)
     A            WGS8126       10A  B  7 50
     A  88                                  DSPATR(PR)
     A                                  8  1'Hazard id no, upper part / Lower p-
     A                                      art:'
     A            WGS8158        4A  B  8 42
     A  88                                  DSPATR(PR)
     A            WGS8186        5A  B  8 50
     A  88                                  DSPATR(PR)
     A                                 10  1'          Technical name          -
     A                                          '
     A                                      DSPATR(UL)
     A            WGS4440F      70A  B 11  1
     A  88                                  DSPATR(PR)
     A                                 12  1'       Additional information     -
     A                                          '
     A                                      DSPATR(UL)
     A            WGS4440A      70A  B 13  1
     A  88                                  DSPATR(PR)
     A            WGS4440B      70A  B 14  1
     A  88                                  DSPATR(PR)
     A            WGS4440C      70A  B 15  1
     A  88                                  DSPATR(PR)
     A            WGS4440D      70A  B 16  1
     A  88                                  DSPATR(PR)
     A            WGS4440E      70A  B 17  1
     A  88                                  DSPATR(PR)
     A                                 19  1MSGCON(012 BBA0015 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R ASSUME
     A                                      ASSUME
     A                                  1  4' '
