     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A            MSGF01        22A  O  2 58MSGID(DIV0047 SYMSGF)
     A                                      COLOR(TRQ)
     A            MSGF02        33A  O  4 22MSGID(DIV0221 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF03        33A  O  5 22MSGID(DIV0222 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF04        33A  O  6 22MSGID(DIV0223 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF05        33A  O  7 22MSGID(DIV0224 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF06        24A  O 10 22MSGID(DIV0225 SYMSGF)
     A            WSAVD          4Y 0B 10 48DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            MSGF07        24A  O 12 22MSGID(DIV0226 SYMSGF)
     A            WSSG           3A  B 12 48DSPATR(UL)
     A  98                                  DSPATR(PC)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            MSGF08        24A  O 14 22MSGID(DIV0227 SYMSGF)
     A            WSPRT         10A  B 14 48DSPATR(UL)
     A                                      COLOR(YLW)
     A            MSGF09        18A  O 23 22MSGID(DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
