     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A            MSGF01        22A  O  2 58MSGID(DIV0047 SYMSGF)
     A                                      COLOR(TRQ)
     A            MSGF02        33A  O  4 22MSGID(DIV0221 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF03        33A  O  5 22MSGID(DIV0262 SYMSGF)
     A                                      COLOR(WHT)
     A            MSGF04        24A  O  8 22MSGID(DIV0225 SYMSGF)
     A            WSAVD          4Y 0B  8 48DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            MSGF05        24A  O 10 22MSGID(DIV0226 SYMSGF)
     A            WSSG           3A  B 10 48DSPATR(UL)
     A  98                                  DSPATR(PC)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            MSGF06        24A  O 12 22MSGID(DIV0256 SYMSGF)
     A            WSOPD          7Y 0B 12 48DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 56'/'
     A            WSFBNR         3Y 0B 12 58DSPATR(UL)
     A                                      COLOR(YLW)
     A            MSGF07        24A  O 14 22MSGID(DIV0257 SYMSGF)
     A            WSVALG         1A  B 14 48DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N')
     A            MSGF08        10A  O 14 56MSGID(DIV0259 SYMSGF)
     A            MSGF09        24A  O 17 22MSGID(DIV0258 SYMSGF)
     A            WSLG           1A  B 17 48DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'L')
     A            MSGF10        18A  O 17 56MSGID(DIV0260 SYMSGF)
     A            MSGF11        24A  O 19 22MSGID(DIV0227 SYMSGF)
     A            WSPRT         10A  B 19 48DSPATR(UL)
     A                                      COLOR(YLW)
     A            MSGF12        18A  O 23 22MSGID(DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
