********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 JOV PTF10 FEIL INNH/UTKJ OPD ..FA / LEDETEKST KORTET 13-6 I ALLE
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A                                      CA20(20 'Send fax')
     A          R BILDEFA
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A N55                                  CF16(16 'Se tur')
     A                                      CF17(17 'Innland oppd.')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV0586 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 59MSGCON(004 DIV0588 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  1 65TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  1 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEPLAN         1A  O  2 17TEXT('PLANLEGGINSKODE')
     A                                      COLOR(WHT)
     A                                  2 19'P'
     A            HEPOS1         7A  O  2 21TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 29TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 34'D'
     A            WSDT           6Y 0O  2 36COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 43MSGCON(005 DIV0587 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 49TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A            HEGNN     R        O  2 65REFFLD(HEADFR/HEGNN *LIBL/HEADF)
     A                                      DSPATR(HI)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A            HEVALT         3A  O  3 23TEXT('V.KODE TILLEGG')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 28TEXT('PROSENT TILLEGG')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 34MSGCON(003 DIV0590 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  3 38TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('KUBIKK')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 14 67TEXT('LASTEMETER')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('FORFRAKT FRA')
     A                                      COLOR(WHT)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('VIDEREFRAKT FRA')
     A                                      COLOR(WHT)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 16  9COLOR(WHT)
     A            HEKFT1         1A  O 16 12COLOR(WHT)
     A            HEFT1A        30A  O 16 15COLOR(WHT)
     A            HEFT1B        15A  O 16 46COLOR(WHT)
     A            WSUSR         10A  O 16 62COLOR(PNK)
     A                                 17  2MSGCON(012 DIV0595 *LIBL/SYMSGF)
     A                                 17 15MSGCON(010 DIV2119 *LIBL/SYMSGF)
     A            HEPK1          1A  O 18  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            HEPK2          1A  O 18  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 18  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 18 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HETLE     R        O 18 21REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      DSPATR(HI)
     A            HETLL     R        O 18 35REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      DSPATR(HI)
     A            W2TOLL         2Y 0O 19  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 19 20TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 19 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 19 40TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 19 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 19 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 21 21'/'
     A            HEKLMO         4Y 0O 21 24COLOR(WHT)
     A                                      EDTWRD('  :  ')
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
S01  A*                                21 68'/'
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27                             22 42MSGCON(018 TRO0162 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(012 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 36MSGCON(013 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 50MSGCON(010 TRO0164 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  55                                  DSPATR(ND)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 18 15MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 18 28MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A          R BILDEEX
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A N55                                  CF16(16 'Se tur')
     A                                      CF17(17 'Import oppd.')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV0726 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  1 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  1 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 17MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2 20COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 27MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A            HETLE          6A  O  2 33COLOR(WHT)
     A                                  2 45MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLL         10A  O  2 52COLOR(WHT)
     A                                  2 65MSGCON(008 DIV0620 *LIBL/SYMSGF)
     A            HETLKU         1A  O  2 75COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 23MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  3 32TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 37COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0786 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 57'Bil'
     A            HEHAWB    R        O  4 61REFFLD(HEADFR/HEHAWB SYSPEDF/HEADF)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  5  8TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRN2        30A  O  5 18COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 14 67TEXT('Lastemeter')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 15  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 15  9COLOR(WHT)
     A            HEKFT1         1A  O 15 12COLOR(WHT)
     A            HEFT1A        30A  O 15 15COLOR(WHT)
     A            HEFT1B        15A  O 15 46COLOR(WHT)
     A            WSUSR         10A  O 15 62COLOR(PNK)
     A                                 16  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 16 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 16 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 16 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 16 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 16 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 16 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 16 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 17  2MSGCON(048 YBC0202 *LIBL/SYMSGF)
     A            HEPK3          1A  O 18  6TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 18 16TEXT('Printerkode-6')
     A                                      COLOR(WHT)
     A            HEPK7          1   O 18 28TEXT('Printerkode-7')
     A                                      COLOR(WHT)
     A            HEPK1          1A  O 18 42TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A                                 19  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 19 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 19 32MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 19 42TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 19 51'/'
     A            HEKLMO         4Y 0O 19 54COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 19 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 19 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 19 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 20  2MSGCON(006 SHU0325 *LIBL/SYMSGF)
     A            TRFA11         7A  O 20 12COLOR(WHT)
     A                                 20 20'-'
     A            TRFA12         4A  O 20 22COLOR(WHT)
     A                                 20 28MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A            TRFLP1         3Y 0O 20 34COLOR(WHT)
     A                                      EDTCDE(M)
     A                                 20 42MSGCON(006 SHU0332 *LIBL/SYMSGF)
     A            TRFA21         7A  O 20 49COLOR(WHT)
     A            TRFA22         4A  O 20 57COLOR(WHT)
     A                                 20 63MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A            TRFLP2         3Y 0O 20 69COLOR(WHT)
     A                                      EDTCDE(M)
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 24MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 34COLOR(WHT)
     A                                      EDTCDE(4)
     A N27                             22 42MSGCON(018 TRO0163 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(012 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 36MSGCON(013 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 50MSGCON(010 TRO0164 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  55                                  DSPATR(ND)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDEFI
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV0070 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 60MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  1 63COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 17'P'
     A            HEPOS1         7A  O  2 19TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 27TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 38MSGCON(006 DIV0077 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 45TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A                                  2 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  2 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  2 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 18MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 23TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 34MSGCON(003 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  3 38TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0098 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEFBV          9Y 0O 13 70TEXT('Fraktberegn.vekt')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 16  9COLOR(WHT)
     A            HEKFT1         1A  O 16 12COLOR(WHT)
     A            HEFT1A        30A  O 16 15COLOR(WHT)
     A            HEFT1B        15A  O 16 46COLOR(WHT)
     A            WSUSR         10A  O 16 62COLOR(PNK)
     A                                 17  2MSGCON(015 DIV0101 *LIBL/SYMSGF)
     A            HEPK1          1A  O 18  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            HEPK2          1A  O 18  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 18  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 18 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 18 15TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A            HETLE     R        O 18 24REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      DSPATR(HI)
     A            HETLL     R        O 18 38REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      DSPATR(HI)
     A            W2TOLL         2Y 0O 19  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19  6MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 19 20TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 19 22MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 19 40TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 19 42MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 19 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 19 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 19'/'
     A            HEKLMO         4Y 0O 22 22COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 18 18MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 18 31MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HEGNN     R        O 18 50REFFLD(HEADFR/HEGNN *LIBL/HEADF)
     A                                      COLOR(WHT)
     A          R BILDEEF
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2'SYSPED/SYFM21A'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(020 DIV0123 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2  2MSGCON(005 DIV0062 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  2  8COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  2 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 61MSGCON(004 DIV0117 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2 66TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 19TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 25MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 30TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 33MSGCON(006 DIV0124 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 40TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  3 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            HEGN          15A  O  3 66COLOR(WHT)
     A                                  4  2MSGCON(004 DIV0118 *LIBL/SYMSGF)
     A            HEKNF          3Y 0O  4  8COLOR(WHT)
     A                                      EDTCDE(4)
     A            KFSNAV        30A  O  4 17COLOR(WHT)
     A                                  4 61MSGCON(004 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  4 66TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0119 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 61MSGCON(004 DIV0120 *LIBL/SYMSGF)
     A            HESAML         6A  O  5 66TEXT('SAMLASTNR')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0125 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  7TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13 18TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 35MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 52TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(017 DIV0122 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  3TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 17  6TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A            HEPK8          1A  O 17 10TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A            HEPK1          1A  O 17 14COLOR(WHT)
     A                                 19  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 19 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 14  2MSGCON(010 SHU0514 *LIBL/SYMSGF)
     A            HEGM1         15A  O 14 13COLOR(WHT)
     A            HEGM2         15A  O 15 13COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 20 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 20 21'/'
     A            HEKLMO         4Y 0O 20 23COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(010 DIV0102 *LIBL/SYMSGF)
     A            HEFNS          6Y 0O 21 13TEXT('Fakturanr Selger')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(010 DIV0103 *LIBL/SYMSGF)
     A            HEFNK          6Y 0O 22 13TEXT('Fakturanr Kjøper')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                 22 24MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 34COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                 17 21MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 17 34MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLE     R        O 17 27REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HETLL     R        O 17 41REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HEPK7          1A  O 17 18COLOR(WHT)
     A          R BILDEIN
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV0115 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2'Dato:'
     A            WSDT           6Y 0O  2  8COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 16MSGCON(009 DIV0116 *LIBL/SYMSGF)
     A            HEPK9          1A  O  2 26TEXT('Printerkode-9')
     A                                      COLOR(WHT)
     A                                  2 61MSGCON(004 DIV0117 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2 66TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(004 DIV0079 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14MSGCON(004 DIV0080 *LIBL/SYMSGF)
     A            HESDT          5A  O  3 19TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  3 25MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 30TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 33MSGCON(006 DIV0613 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 40TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  3 61MSGCON(004 DIV0078 *LIBL/SYMSGF)
     A            HEGN          15A  O  3 66COLOR(WHT)
     A                                  4  2MSGCON(005 DIV0118 *LIBL/SYMSGF)
     A            HEKNF          3Y 0O  4  8COLOR(WHT)
     A                                      EDTCDE(4)
     A            KFSNAV        30A  O  4 17COLOR(WHT)
     A                                  4 61MSGCON(004 DIV0081 *LIBL/SYMSGF)
     A            HEHAWB         9A  O  4 66TEXT('House Airway Billno')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0119 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 61MSGCON(004 DIV0120 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  5 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  5 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A N99                                  COLOR(WHT)
     A  99                                  COLOR(RED)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A N98                                  COLOR(WHT)
     A  98                                  COLOR(RED)
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(075 DIV0121 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 71TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15 27MSGCON(016 DIV0099 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 44TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 54MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 60TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(017 DIV5101 *LIBL/SYMSGF)
     A            HEPK3          1A  O 17  5TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 17 15TEXT('Printerkode-5')
     A                                      COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 21 21'/'
     A            HEKLMO         4  0O 21 23COLOR(WHT)
     A                                      EDTWRD('  :  ')
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R BILDETR
     A N27                                  CF03(03 'Avslutt')
     A N27                                  CF11(11 'Til rekv./budsj.')
     A N27                                  CF12(12 'Til rullbilde')
     A                                      CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF10(10 'SE TUR.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                      CF24(24 'FLERE FTASTER')
     A            TRSDFD         8Y 0H
     A            TRSDTD         8Y 0H
     A            TRSFFD         8Y 0H
     A            TRSVTD         8Y 0H
N03  A            MSGLN1         7A  P
N03  A            MSGLN2         7A  P
N03  A            MSGLN3         7A  P
N03  A            MSGLN4         7A  P
     A                                  1  2'SYSPED/SYFM21A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(039 DIV4082 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 69TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2  8TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            HEOPD          7Y 0O  2 13TEXT('Oppdragsnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                  2 21MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 25TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 29MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 34TEXT('Kostnadssted')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 39'Tur'
     A            HEPRO          8Y 0O  2 43TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 52'Rundt'
     A            TRRUND         8Y 0O  2 58TEXT('Prosjektnummer')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  2 67MSGCON(003 JOV0169 *LIBL/SYMSGF)
     A            HEHAWB    R        O  2 71REFFLD(HEADFR/HEHAWB *LIBL/HEADF)
     A                                      COLOR(WHT)
     A                                  3  2'Opdgi'
     A            TRKDAK         1A  O  3  8COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRKNFA         8Y 0O  3 10TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  3 19TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEADA         30A  O  3 50COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  4  2'Fmott'
     A            TRKDFF         1A  O  4  8COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEKNSF         8Y 0O  4 10TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            HENASF        30A  O  4 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADSF        30A  O  4 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2'Søref'
NRFA A*           HERFA         15A  O  5  8TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  5  8TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 24'LS'
     A            WSSDL         15A  O  5 27TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 43MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  5 47TEXT('Avtalenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 49MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  5 52TEXT('Fakturakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 54MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  5 58TEXT('Valutakode Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5 62'T.'
     A            HEVALT         3A  O  5 65TEXT('V.kode tillegg')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  5 69DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 74'T-st'
     A            TRTSTA         1A  O  5 79COLOR(WHT)
     A                                      DSPATR(UL)
      * LINJE 6-7, STED FRA -TIL (+ VIA VIA) BØR GJØRES LIKT SOM I SYTR10FM
     A                                  6  2'Fra'
     A            HESDF          5A  O  6  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSDFD         6Y 0O  6 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSDFK         4Y 0O  6 21EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSLANF         2A  O  6 28COLOR(WHT)
     A            WSSONF         3A  O  6 31COLOR(WHT)
     A            WSPNRF         5Y 0O  6 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 44'Til'
     A            HESDT          5A  O  6 48TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSDTD         6Y 0O  6 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSDTK         4Y 0O  6 61EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSLANT         2A  O  6 68COLOR(WHT)
     A            WSSONT         3A  O  6 71COLOR(WHT)
     A            WSPNRT         5Y 0O  6 75COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7  2'Forf'
     A            HESDFF         5A  O  7  8TEXT('Forfrakt fra')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSFFD         6Y 0O  7 14DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSFFK         4Y 0O  7 21EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRSTAF         1A  O  7 26DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLAN1         2A  O  7 28COLOR(WHT)
     A            WSSON1         3A  O  7 31COLOR(WHT)
     A            WSPNR1         5Y 0O  7 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7 44'Vid'
     A            HESDVT         5A  O  7 48TEXT('Viderefrakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSSVTD         6Y 0O  7 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            TRSVTK         4Y 0O  7 61EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRSTAE         1A  O  7 66DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSLAN2         2A  O  7 68COLOR(WHT)
     A            WSSON2         3A  O  7 71COLOR(WHT)
     A            WSPNR2         5Y 0O  7 75COLOR(WHT)
     A                                      EDTCDE(4)
      *
     A                                  8  2MSGCON(005 DIV2299 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  8  8COLOR(WHT)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSNAFA        30A  O  8 19COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSADFA        30A  O  8 50COLOR(WHT)
     A                                      DSPATR(UL)
     A                                  9  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  9  8TEXT('Kundenr Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMS        30A  O  9 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRS        30A  O  9 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2'Henteadresse'
     A            HENAS         30A  O 10 19TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS1        30A  O 10 50TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS2        30A  O 11 19TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADS3        30A  O 11 50TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O 12  8TEXT('Kundenr Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAMK        30A  O 12 19TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADRK        30A  O 12 50TEXT('Navn Kjøp.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 13  2'Leveringsadr'
     A            HENAK         30A  O 13 19TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 13 50TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 14 19TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 14 50TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A            HEOT           2A  O 16  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEFR           3A  O 16  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 16  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 16 25TEXT('Antall')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 16 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 16 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 16 73TEXT('KUBIKK')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            HEGM2         15A  O 17  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 17 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HELM           4Y 2O 17 68TEXT('Lastemeter')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 18  9COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEKFT1         1A  O 18 12COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEFT1A        30A  O 18 15COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEFT1B        15A  O 18 46COLOR(WHT)
     A                                      DSPATR(UL)
     A            WSUSR         10A  O 18 62COLOR(PNK)
     A                                 19  2'Verdi.'
     A            TRVERV         3A  O 19  9COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRVERB        13Y 2O 19 13EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 19 28'E'
     A            TRETTV         3A  O 19 30COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRETTB        13Y 2O 19 34EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 19 49'Frakt'
     A            TRFRAK         1A  O 19 55COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFRAV         3A  O 19 57COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFRAB        13Y 2O 19 61COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 19 76'M'
     A            TRMVA          1A  O 19 78COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20  2'Far(I)'
     A            TRFA11         7A  O 20  9COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 17'-'
     A            TRFA12         4A  O 20 19COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 24'Fl.p'
     A            TRFLP1         3Y 0O 20 29COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 20 33'Far(A)'
     A            TRFA21         7A  O 20 40COLOR(WHT)
     A                                      DSPATR(UL)
     A            TRFA22         4A  O 20 48COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 20 53'Fl.p'
     A            TRFLP2         3Y 0O 20 58COLOR(WHT)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2'Godsn'
     A            HEGN          15A  O 21  9COLOR(WHT)
     A                                      DSPATR(UL)
     A                                 21 25'P'
     A            HEPOS1         7A  O 21 27COLOR(WHT)
     A                                      DSPATR(UL)
     A            HEPOS2         4Y 0O 21 35EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2'Ar.or'
     A            HEPK3          1A  O 22  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HEPK5          1A  O 22 11TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 13'Told '
     A            HEPK6          1A  O 22 19TEXT('Printerkode-6')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 21'CMR/BL'
     A            HEPK7          1A  O 22 28TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 30'Frab'
     A            HEPK1          1A  O 22 35TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 22 37'Forp'
     A            HEPK2          1A  O 22 42TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            HENTVS         3Y 0O 22 44EDTCDE(4)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 23 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A  29                             23 22MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 25MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 23 35TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 23 44'/'
     A            HEKLMO         4Y 0O 23 46COLOR(WHT)
     A                                      EDTWRD('  :  ')
     A                                 23 52'R.dat'
     A            WSDTR          6Y 0O 23 58DSPATR(UL)
     A                                      COLOR(WHT)
S03  A*                                24  2MSGCON(018 DIV4098 *LIBL/SYMSGF)
S03  A*                                     COLOR(BLU)
S03  A*N29                             24 22MSGCON(018 DIV0037 *LIBL/SYMSGF)
S03  A*                                     COLOR(BLU)
S03  A*                                24 42MSGCON(018 SHU0209 *LIBL/SYMSGF)
S03  A*                                     COLOR(BLU)
S03  A*N27                             24 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
S03  A*                                     COLOR(BLU)
N03  A            MSGL1         18A  O 24  2MSGID(&MSGLN1 SYMSGF)
N03  A                                      COLOR(BLU)
N03  A            MSGL2         18A  O 24 22MSGID(&MSGLN2 SYMSGF)
N03  A                                      COLOR(BLU)
N03  A            MSGL3         18A  O 24 42MSGID(&MSGLN3 SYMSGF)
N03  A                                      COLOR(BLU)
N03  A            MSGL4         18A  O 24 62MSGID(&MSGLN4 SYMSGF)
N03  A                                      COLOR(BLU)
     A                                 22 48MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 22 61MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLE     R        O 22 54REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HETLL     R        O 22 68REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HETLKU    R        O 22 79REFFLD(HEADFR/HETLKU *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HEGNN     R        O 23 65REFFLD(HEADFR/HEGNN *LIBL/HEADF)
     A                                      COLOR(WHT)
     A          R BILDESJ
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV3285 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 23MSGCON(004 DIV0071 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  1 28TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  1 33TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 41MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  1 45TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  1 49MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  1 54TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  1 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  1 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  2  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEPLAN         1A  O  2 17TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                  2 19'P'
     A            HEPOS1         7A  O  2 21TEXT('Posisjon-1')
     A                                      COLOR(WHT)
     A            HEPOS2         4Y 0O  2 29TEXT('Posisjon-2')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 34'D'
     A            WSDT           6Y 0O  2 36COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 43MSGCON(005 DIV0587 *LIBL/SYMSGF)
     A            HEGN          15A  O  2 49TEXT('Godsnummer')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  3  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  3 14'-'
     A            HESDT          5A  O  3 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A            HEVALT         3A  O  3 23TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  3 28COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 34MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            HELB           5A  O  3 40TEXT('LOKAL BÅT')
     A                                      COLOR(WHT)
     A                                  3 48MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  3 53TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  3 57MSGCON(003 DIV0083 *LIBL/SYMSGF)
     A            HESDL         20A  O  3 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(005 DIV3284 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  4  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  4 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  4 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  4 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  4 63COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0086 *LIBL/SYMSGF)
     A            HETRM          2Y 0O  5  8TEXT('Transportmåte')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 12MSGCON(008 DIV0087 *LIBL/SYMSGF)
     A            HETRI          2A  O  5 21TEXT('Lankode Transport')
     A                                      COLOR(WHT)
     A                                  5 25MSGCON(005 DIV0088 *LIBL/SYMSGF)
     A            HETRC          1Y 0O  5 31TEXT('Transport cont')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  5 34MSGCON(008 DIV0089 *LIBL/SYMSGF)
     A            HETRCN        17A  O  5 43TEXT('Transport cnr')
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  6  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  6 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  6 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  6 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  6 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  6 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  6 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  6 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  7  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  7 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O  8  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O  8 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O  9  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O  9 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  9 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O  9 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O  9 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                  9 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O  9 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O  9 51TEXT('Navn Kjøp.fakm')
     A                                 10  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 10  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 10 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 11  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 11 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(078 DIV3282 *LIBL/SYMSGF)
     A            HEOT           2A  O 13  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 13  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 13  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 13 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 13 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 13 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 13 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 14  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 14 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 15 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 15 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 15 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 15 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 15 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 15 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 15 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A            HEKF           2A  O 16  9COLOR(WHT)
     A            HEKFT1         1A  O 16 12COLOR(WHT)
     A            HEFT1A        30A  O 16 15COLOR(WHT)
     A            HEFT1B        15A  O 16 46COLOR(WHT)
     A            WSUSR         10A  O 16 62COLOR(PNK)
     A                                 17  2MSGCON(012 DIV0595 *LIBL/SYMSGF)
     A            HEPK1          1A  O 18  2TEXT('Printerkode-1')
     A                                      COLOR(WHT)
     A            W2TOLL         2Y 0O 18  2TEXT('Tollsted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEPK2          1A  O 18  6TEXT('Printerkode-2')
     A                                      COLOR(WHT)
     A            HEPK3          1A  O 18  9TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK4          1A  O 18 12TEXT('Printerkode-4')
     A                                      COLOR(WHT)
     A                                 18 16MSGCON(011 DIV0104 *LIBL/SYMSGF)
     A            W2KDME         1A  O 18 28TEXT('Merkelapp  /X')
     A                                      COLOR(WHT)
     A                                 18 30MSGCON(011 DIV0105 *LIBL/SYMSGF)
     A            W2KDE          1A  O 18 42TEXT('Etterkrav  /X')
     A                                      COLOR(WHT)
     A                                 18 44MSGCON(011 DIV0106 *LIBL/SYMSGF)
     A            HENTVS         3Y 0O 18 56TEXT('Antall varepos SAD')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 18 60MSGCON(011 DIV0107 *LIBL/SYMSGF)
     A                                 19 19MSGCON(005 DIV3209 *LIBL/SYMSGF)
     A            BLLSTY         3A  O 19 25COLOR(WHT)
     A                                 19 30MSGCON(005 DIV3240 *LIBL/SYMSGF)
     A            BLOB           5A  O 19 36COLOR(WHT)
     A                                 19 43MSGCON(005 DIV3192 *LIBL/SYMSGF)
     A            BLREIS        14A  O 19 49COLOR(WHT)
     A                                 20  2MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 12TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 20 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 20 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A                                 21  2MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 21 12TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 21 21'/'
     A            HEKLMO         4Y 0O 21 23COLOR(WHT)
     A                                      EDTWRD('  :  ')
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22 62MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            HEGNN     R        O  2 65REFFLD(HEADFR/HEGNN *LIBL/HEADF)
     A                                      COLOR(WHT)
     A                                 17 16MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A                                 17 30MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLE     R        O 17 22REFFLD(HEADFR/HETLE *LIBL/HEADF)
     A                                      COLOR(WHT)
     A            HETLL     R        O 17 37REFFLD(HEADFR/HETLL *LIBL/HEADF)
     A                                      COLOR(WHT)
     A          R BILDESE
     A N27N28                               CF01(01 'Bytt avdelinger')
     A N27                                  CF02(02 'Til valgbilde')
     A N27                                  CF03(03 'Avslutt')
     A                                      CF05(05 'VIDERE/BEKR.SLETT')
     A N27                                  CF12(12 'Til rullbilde')
     A N29                                  CF14(14 'Vise opplysning til OPPDRA-
     A                                      G')
     A                                      CF08(08 'HENDELSESLOGG.')
     A                                      CF09(09 'TIDSLOGG LEVERING MM.')
     A                                      CF15(15 'FRIE SØKEV.')
     A                                      CF18(18 'NOTIS')
     A                                  1  2MSGCON(020 DIV3286 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            HEAVD          4Y 0O  2  8TEXT('Avdeling')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEOPD          7Y 0O  2 13TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 22MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            HESG           3A  O  2 26TEXT('Signatur')
     A                                      COLOR(WHT)
     A                                  2 33MSGCON(004 DIV0073 *LIBL/SYMSGF)
     A            HESTD          4Y 0O  2 38TEXT('Kostnadssted')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 61MSGCON(004 DIV0588 *LIBL/SYMSGF)
NRFA A*           HERFA         15A  O  2 66TEXT('Referanse Agent')
NRFA A            HERFA15       15A  O  2 66TEXT('Referanse Agent')
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(005 DIV0074 *LIBL/SYMSGF)
     A            HEPRO          8Y 0O  3  8TEXT('Prosjektnummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 17MSGCON(002 DIV0076 *LIBL/SYMSGF)
     A            WSDT           6Y 0O  3 20COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 27MSGCON(005 DIV0618 *LIBL/SYMSGF)
     A            HETLE          6A  O  3 33COLOR(WHT)
     A                                  3 47MSGCON(006 DIV0619 *LIBL/SYMSGF)
     A            HETLL         10A  O  3 55COLOR(WHT)
     A                                  3 68MSGCON(008 DIV0620 *LIBL/SYMSGF)
     A            HETLKU         1A  O  3 77COLOR(WHT)
     A                                  4  2MSGCON(004 DIV0589 *LIBL/SYMSGF)
     A            HESDF          5A  O  4  8TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                  4 14'-'
     A            HESDT          5A  O  4 16TEXT('Frakt til')
     A                                      COLOR(WHT)
     A                                  4 23MSGCON(008 DIV0617 *LIBL/SYMSGF)
     A            HEVALT         3A  O  4 32TEXT('V.kode tillegg')
     A                                      COLOR(WHT)
     A            WSVALP         3Y 1O  4 37DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4 46MSGCON(004 DIV0082 *LIBL/SYMSGF)
     A            HELKA          2A  O  4 51TEXT('Landkode')
     A                                      COLOR(WHT)
     A                                  4 57MSGCON(003 DIV0786 *LIBL/SYMSGF)
     A            HESDL         20A  O  4 61TEXT('Lossested')
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(005 DIV0084 *LIBL/SYMSGF)
     A            HEKNA          8Y 0O  5  8TEXT('Kundenr Agent')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAA         30A  O  5 17TEXT('Navn Agent')
     A                                      COLOR(WHT)
     A                                  5 48MSGCON(005 DIV0085 *LIBL/SYMSGF)
     A            HEKNT          8Y 0O  5 54TEXT('Kundenr Transportør')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSTRNV        18A  O  5 63COLOR(WHT)
     A                                  6  2MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            HELB           5A  O  6  8TEXT('LOKAL BÅT')
     A                                      COLOR(WHT)
     A                                  6 19MSGCON(005 DIV3209 *LIBL/SYMSGF)
     A            BLLSTY         3A  O  6 25COLOR(WHT)
     A                                  6 30MSGCON(005 DIV3240 *LIBL/SYMSGF)
     A            BLOB           5A  O  6 36COLOR(WHT)
     A                                  6 43MSGCON(005 DIV3192 *LIBL/SYMSGF)
     A            BLREIS        14A  O  6 49COLOR(WHT)
     A                                  8  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A            HEKNS          8Y 0O  8  8TEXT('Kundenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANS          1Y 0O  8 22TEXT('Avtalenr Selger')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  8 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFS         1A  O  8 27TEXT('Fakturakode Selger')
     A                                      COLOR(WHT)
     A                                  8 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALS         3A  O  8 33TEXT('Valutakode Selger')
     A                                      COLOR(WHT)
     A                                  8 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNSF         8Y 0O  8 42TEXT('Kundenr Selg.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENASF        30A  O  8 51TEXT('Navn Selg.fakm')
     A                                      COLOR(WHT)
     A                                  9  2MSGCON(004 DIV0095 *LIBL/SYMSGF)
     A            HENAS         30A  O  9  8TEXT('Navn Selger')
     A                                      COLOR(WHT)
     A            HEADS1        30A  O  9 42TEXT('Adresse-1 Selger')
     A                                      COLOR(WHT)
     A            HEADS2        30A  O 10  8TEXT('Adresse-3 Selger')
     A                                      COLOR(WHT)
     A            HEADS3        30A  O 10 42TEXT('Adresse-2 Selger')
     A                                      COLOR(WHT)
     A                                 11  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A            HEKNK          8Y 0O 11  8TEXT('Kundenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 11 18MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A            HEANK          1Y 0O 11 22TEXT('Avtalenr Kjøper')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 11 24MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A            HEKDFK         1A  O 11 27TEXT('Fakturakode Kjøper')
     A                                      COLOR(WHT)
     A                                 11 29MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A            HEVALK         3A  O 11 33TEXT('Valutakode Kjøper')
     A                                      COLOR(WHT)
     A                                 11 37MSGCON(004 DIV0094 *LIBL/SYMSGF)
     A            HEKNKF         8Y 0O 11 42TEXT('Kundenr Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HENAKF        30A  O 11 51TEXT('Navn Kjøp.fakm')
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(004 DIV0097 *LIBL/SYMSGF)
     A            HENAK         30A  O 12  8TEXT('Navn Kjøper')
     A                                      COLOR(WHT)
     A            HEADK1        30A  O 12 42TEXT('Adresse-1 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK2        30A  O 13  8TEXT('Adresse-2 Kjøper')
     A                                      COLOR(WHT)
     A            HEADK3        30A  O 13 42TEXT('Adresse-3 Kjøper')
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(078 DIV3282 *LIBL/SYMSGF)
     A            HEOT           2A  O 16  2TEXT('Oppdragstype')
     A                                      COLOR(WHT)
     A            HEFR           3A  O 16  5TEXT('Frankatur')
     A                                      COLOR(WHT)
     A            HEGM1         15A  O 16  9TEXT('Godsmerking-1')
     A                                      COLOR(WHT)
     A            HENT           7Y 0O 16 25TEXT('Antall')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEVS1         25A  O 16 33TEXT('Vareslag-1')
     A                                      COLOR(WHT)
     A            HEVKT          9Y 0O 16 60TEXT('Vekt')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEM3           7Y 3O 16 70TEXT('Kubikk')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            HEGM2         15A  O 17  9TEXT('Godsmerking-2')
     A                                      COLOR(WHT)
     A            HEVS2         25A  O 17 33TEXT('Vareslag-2')
     A                                      COLOR(WHT)
     A                                 18  2MSGCON(012 DIV0592 *LIBL/SYMSGF)
     A            HESDFF         5A  O 18 15TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                 18 22MSGCON(015 DIV0593 *LIBL/SYMSGF)
     A            HESDVT         5A  O 18 38TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                 18 45MSGCON(008 DIV0594 *LIBL/SYMSGF)
     A            HEKDPL         1A  O 18 54TEXT('Planleggingskode')
     A                                      COLOR(WHT)
     A                                 18 57MSGCON(005 DIV0100 *LIBL/SYMSGF)
     A            HEKDL         15A  O 18 63TEXT('Lagerkode')
     A                                      COLOR(WHT)
     A                                 19  2MSGCON(022 YBC0205 *LIBL/SYMSGF)
     A                                 19 60MSGCON(007 JOV0168 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A  41                                  DSPATR(ND)
     A            TRAVD0    R        O 19 68REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            TROPD0    R        O 19 73REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A                                      COLOR(WHT)
     A  41                                  DSPATR(ND)
     A            HEPK3          1A  O 20  6TEXT('Printerkode-3')
     A                                      COLOR(WHT)
     A            HEPK6          1A  O 20 12TEXT('Printerkode-6')
     A                                      COLOR(WHT)
     A            HEPK7          1A  O 20 18TEXT('Printerkode-7')
     A                                      COLOR(WHT)
     A            HEPK1          1A  O 20 22TEXT('Printerkode-7')
     A                                      COLOR(WHT)
     A                                 20 27MSGCON(009 DIV0110 *LIBL/SYMSGF)
     A            HESGM         10A  O 20 37TEXT('Signatur Mottat')
     A                                      COLOR(WHT)
     A                                 20 48MSGCON(009 DIV0111 *LIBL/SYMSGF)
     A            HEDTMO         8A  O 20 58TEXT('Dato Mottat')
     A                                      COLOR(WHT)
     A                                 20 67'/'
     A            HEKLMO         4  0O 20 69COLOR(WHT)
     A                                      EDTWRD('  :  ')
S01  A*                                21 40MSGCON(013 JOV0167 *LIBL/SYMSGF)
N01  A                                 21 45MSGCON(006 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 53DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         7Y 0O 21 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 66'/'
     A            TRAVD2         4Y 0O 21 68DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         7Y 0O 21 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(008 DIV0112 *LIBL/SYMSGF)
     A            WSDTR          6Y 0O 22 12COLOR(WHT)
     A                                      EDTCDE(4)
     A N27N28                          23  2MSGCON(018 JOV0907 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(022 DIV0438 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 22MSGCON(018 DIV0113 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 62MSGCON(018 DIV0114 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N29                             24  2MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 22MSGCON(018 SHU0127 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 42MSGCON(018 SHU0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
