     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                  2 58'Copyright SYSTEMA A/S'
     A                                      COLOR(TRQ)
     A                                  3  5'UTSKRIFT AV FRAKTBREV FOR ENKELOPP-
     A                                      DRAG'
     A                                      COLOR(WHT)
     A                                  4  5'Standard eller ekspress blankettyp-
     A                                      e'
     A                                      COLOR(WHT)
     A                                  3 58'Telefon:  02-33 10 86'
     A                                      COLOR(TRQ)
     A                                  6  5'Avdeling:'
     A            UAVD           4Y 0O  6 17DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  9  5'Tast de ønskede oppdragsnummer'
     A                                      COLOR(WHT)
     A                                 10  7'01'
     A                                 10 15'02'
     A                                 10 23'03'
     A                                 10 31'04'
     A                                 10 39'05'
     A                                 10 47'06'
     A                                 10 55'07'
     A            WSOP1          7Y 0B 11  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP2          7Y 0B 11 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP3          7Y 0B 11 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP4          7Y 0B 11 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP5          7Y 0B 11 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP6          7Y 0B 11 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP7          7Y 0B 11 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12  7'08'
     A                                 12 15'09'
     A                                 12 23'10'
     A                                 12 31'11'
     A                                 12 39'12'
     A                                 12 47'13'
     A                                 12 55'14'
     A            WSOP8          7Y 0B 13  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP9          7Y 0B 13 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP10         7Y 0B 13 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP11         7Y 0B 13 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP12         7Y 0B 13 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP13         7Y 0B 13 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP14         7Y 0B 13 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 14  7'15'
     A                                 14 15'16'
     A                                 14 23'17'
     A                                 14 31'18'
     A                                 14 39'19'
     A                                 14 47'20'
     A                                 14 55'21'
     A            WSOP15         7Y 0B 15  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP16         7Y 0B 15 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP17         7Y 0B 15 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP18         7Y 0B 15 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP19         7Y 0B 15 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP20         7Y 0B 15 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP21         7Y 0B 15 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 16  7'22'
     A                                 16 15'23'
     A                                 16 23'24'
     A                                 16 31'25'
     A                                 16 39'26'
     A                                 16 47'27'
     A                                 16 55'28'
     A            WSOP22         7Y 0B 17  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP23         7Y 0B 17 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP24         7Y 0B 17 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP25         7Y 0B 17 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP26         7Y 0B 17 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP27         7Y 0B 17 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP28         7Y 0B 17 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  7'29'
     A                                 18 15'30'
     A                                 18 23'31'
     A                                 18 31'32'
     A                                 18 39'33'
     A                                 18 47'34'
     A                                 18 55'35'
     A            WSOP29         7Y 0B 19  5DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP30         7Y 0B 19 13DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP31         7Y 0B 19 21DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP32         7Y 0B 19 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP33         7Y 0B 19 37DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP34         7Y 0B 19 45DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSOP35         7Y 0B 19 53DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 22  5'F3=Avslutt'
     A                                      COLOR(BLU)
     A            WSMSG         60   O 23  5
     A  30                                  DSPATR(RI)
     A N30                                  DSPATR(ND)
