     A          R HEAD
     A                                  1  5'GJELDS- OG BEHOLDNINGS'
     A                                  1 27'OPPGAVE FOR PERIODE'
     A            PFPER          4  0   1 47
     A                                  1 52'-'
     A            PTPER          4  0   1 54
     A                                  1117'Side:'
     A            USIDE          4  0   1123EDTCDE(Z)
     A                                  2  5'Detaljliste'
     A                                  2 60'Kjørt av/dato/tid:'
     A            PUSER         10      2 79
     A                                  2 89'/'
     A            PDATO          6      2 90
     A                                  2 96'/'
     A            PTID           4      2 97
     A                                  3  5'Avdeling:'
     A            PAVD           5  0   3 15EDTCDE(Z)
     A                                  3 60'OBS! * Negativt beløp = '
     A                                  3 84'inntektsavsetning *'
     A                                  5  5'Tekstkode'
     A                                  5 17'Konto'
     A                                  5 25'Turnr'
     A                                  5 35'Oppdr.nr.'
     A                                  5 45'Sign'
     A                                  5 56'Forv.fakt.'
     A                                  5 68'Bokf.fakt.'
     A                                  5 80'Forv.kost.'
     A                                  5 92'Bokf.kost.'
     A                                  5104'Avsetning'
     A                                  5117'Avsetn. type'
     A          R DETALJ                    SPACEB(1)
     A            PAVK           3         8
     A            PKONTO         5  0     17EDTCDE(Z)
     A            PTURNR         8  0     25EDTCDE(Z)
     A            POPD           7  0     35EDTCDE(Z)
     A            PSIGN          3        45
     A            PFFAKT        11  2     51EDTCDE(J)
     A            PBFAKT        11  2     63EDTCDE(J)
     A            PFKOST        11  2     75EDTCDE(J)
     A            PBKOST        11  2     87EDTCDE(J)
     A            PAVS          11  2     99EDTCDE(J)
     A            PTEXT         15       117
     A*
     A          R SUM1                      SPACEB(1)
     A                                      SPACEA(2)
     A  40        KGVK           3         8
     A  40        KGONTO         5  0     17EDTCDE(Z)
     A  40                                27' ** AVGIFTSPLIKTIG ** '
     A  40                                80'Sum for kode'
     A  40        KGSUM         11  2     99EDTCDE(J)
     A  40                               117'GJELDSAVSETNING'
     A  40                                  SPACEA(1)
     A          R SUM11                     SPACEB(1)
     A  41        KB1VK          3         8
     A  41        KB1KTO         5  0     17EDTCDE(Z)
     A  41                                27' ** AVGIFTSPLIKTIG ** '
     A  41                                80'Sum for kode'
     A  41        KB1SUM        11  2     99EDTCDE(J)
     A  41                               117'BEH. AVSETN. I '
     A  41                                  SPACEA(1)
     A          R SUM12                     SPACEB(1)
     A  42        KB2VK          3         8
     A  42        KB2KTO         5  0     17EDTCDE(Z)
     A  42                                27' ** AVGIFTSPLIKTIG ** '
     A  42                                80'Sum for kode'
     A  42        KB2SUM        11  2     99EDTCDE(J)
     A  42                               117'BEH. AVSETN. II'
     A  42                                  SPACEA(1)
     A          R SUM13                     SPACEB(1)
     A  43        LGVK           3         8
     A  43        LGONTO         5  0     17EDTCDE(Z)
     A  43                                27' ** AVGIFTSFRITT ** '
     A  43                                80'Sum for kode'
     A  43        LGSUM         11  2     99EDTCDE(J)
     A  43                               117'GJELDSAVSETNING'
     A  43                                  SPACEA(1)
     A          R SUM14                     SPACEB(1)
     A  44        LB1VK          3         8
     A  44        LB1KTO         5  0     17EDTCDE(Z)
     A  44                                27' ** AVGIFTSFRITT ** '
     A  44                                80'Sum for kode'
     A  44        LB1SUM        11  2     99EDTCDE(J)
     A  44                               117'BEH. AVSETN. I '
     A  44                                  SPACEA(1)
     A          R SUM15                     SPACEB(1)
     A  45        LB2VK          3         8
     A  45        LB2KTO         5  0     17EDTCDE(Z)
     A  45                                27' ** AVGIFTSFRITT ** '
     A  45                                80'Sum for kode'
     A  45        LB2SUM        11  2     99EDTCDE(J)
     A  45                               117'BEH. AVSETN. II'
     A*
     A          R SUM2                      SPACEB(1)
     A                                      SPACEA(2)
     A  30                                50' ** AVGIFTSPLIKTIG ** '
     A  30                                80'Sum for avdeling'
     A  30        PGSUM         11  2     99EDTCDE(J)
     A  30                               117'GJELDSAVSETNING'
     A  30                                  SPACEA(1)
     A          R SUM21                     SPACEB(1)
     A  31                                50' ** AVGIFTSPLIKTIG ** '
     A  31                                80'Sum for avdeling'
     A  31        PB1SUM        11  2     99EDTCDE(J)
     A  31                               117'BEH. AVSETN. I '
     A  31                                  SPACEA(1)
     A          R SUM22                     SPACEB(1)
     A  32                                50' ** AVGIFTSPLIKTIG ** '
     A  32                                80'Sum for avdeling'
     A  32        PB2SUM        11  2     99EDTCDE(J)
     A  32                               117'BEH. AVSETN. II'
     A  32                                  SPACEA(1)
     A          R SUM23                     SPACEB(1)
     A  33                                50' ** AVGIFTSFRITT ** '
     A  33                                80'Sum for avdeling'
     A  33        FGSUM         11  2     99EDTCDE(J)
     A  33                               117'GJELDSAVSETNING'
     A  33                                  SPACEA(1)
     A          R SUM24                     SPACEB(1)
     A  34                                50' ** AVGIFTSFRITT ** '
     A  34                                80'Sum for avdeling'
     A  34        FB1SUM        11  2     99EDTCDE(J)
     A  34                               117'BEH. AVSETN. I '
     A  34                                  SPACEA(1)
     A          R SUM25                     SPACEB(1)
     A  35                                50' ** AVGIFTSFRITT ** '
     A  35                                80'Sum for avdeling'
     A  35        FB2SUM        11  2     99EDTCDE(J)
     A  35                               117'BEH. AVSETN. II'
     A*
     A          R SUM3                      SPACEB(1)
     A                                    78'Totalsum for firma'
     A            PAVST         11  2     99EDTCDE(J)
