     A*____________________________
     A* KUNDES PRISTABELL
     A*""""""""""""""""""""""""""""
     A          R AVFRDR
     A            AFCDE1         1          TEXT('CODE F/H/V')
     A            AFAVNR         9P 0       TEXT('AGREENBR')
     A            AFVEKT         9P 0       TEXT('WEIGHTGROUP')
     A            AFPRPR         5P 0       TEXT('PRICE PR.')
     A            AFADJU         5P 0       TEXT('AJUST TO')
     A            AFPRIA        13P 2       TEXT('PRICE MAIN FREIGHT')
     A            AMIMAP        13P 2       TEXT('MINMAX PRIS')
     A            AMIMAC         1          TEXT('KODE')
     A            AFCOBE         1          TEXT('BEREGNINGSKODE')
     A          K AFAVNR
     A          K AFCDE1
     A          K AFVEKT
