     A*____________________________
     A* GEBYRERS GRUPPE
     A*""""""""""""""""""""""""""""
     A          R SYGE103FR
     A            GEBKO          3          TEXT('GEBYRKODE')
     A            GRUPPE         1S 0       TEXT('GRUPPE')
     A          K GEBKO
