*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P8068A* 01 TH  PTF8 NY HELPFUNKSJON  KUN DDS
*****A**************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A                                      HLPPNLGRP(HLPSCR SYFA63PNL)
     A                                      HLPTITLE('VEDLIKEHOLD AV AVDELINGER-
     A                                      S HODE PÅ FAKTURA')
     A          R BILDE01
     A                                      CF12(12 'Avslutt program')
     A                                      CF23(23 'KJØR RUTINE')
     A                                  1  2'SYSPED/SYGE63'
     A                                      COLOR(BLU)
     A                                  1 17MSGCON(040 SHU1352 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 72TIME
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(015 SHU1353 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A            TXT01         60A  O  6 19COLOR(WHT)
     A            TXT02         60A  O  7 19COLOR(WHT)
     A            TXT03         60A  O  8 19COLOR(WHT)
     A                                 12 18MSGCON(060 SHU1355 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 14 18MSGCON(040 SHU1356 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
