     A*%%TS  SD  20140408  123235  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A          R BILDE01
     A*%%TS  SD  20140408  123235  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt')
     A                                  6  2'avd'
     A            KBAVD     R        B  6 11REFFLD(KOSTBR/KBAVD *LIBL/KOSTB)
     A            KBOPD     R        B  7 11REFFLD(KOSTBR/KBOPD *LIBL/KOSTB)
     A            KBVK      R        B  8 11REFFLD(KOSTBR/KBVK *LIBL/KOSTB)
     A            KBBLHB    R        B  9 11REFFLD(KOSTBR/KBBLHB *LIBL/KOSTB)
     A                                      EDTCDE(J)
     A            KBBUDS    R        B 10 11REFFLD(KOSTBR/KBBUDS *LIBL/KOSTB)
     A                                      EDTCDE(J)
     A            KBBLF     R        B 11 11REFFLD(KOSTBR/KBBLF *LIBL/KOSTB)
     A                                      EDTCDE(J)
     A            UPROS          3  1B 12 11EDTWRD('  . ')
     A            FEIL1          1   B 13 11
     A            KBDIFF         5  2B 14 11EDTCDE(J)
     A                                  7  2'opd'
     A                                  8  2'GEBYR'
     A                                  9  2'belhb'
     A                                 10  2'budsj'
     A                                 11  2'fakt'
     A                                 12  2'pros'
     A                                 13  2'feil'
     A                                 14  2'DIFF %'
