     A*%%TS  SD  20151027  120936  SVEIN       REL-V7R1M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFNRA*SEK SIG VERS  BESKRIVELSE...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
11XXXA* 01 YBC PTF11 OPSJON 4 = SLETT OPPLASTET DOKUMENT
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      HELP
     A*
     A          R NYWRK
     A*%%TS  SD  20151027  120936  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'EXIT')
     A            DATA1        512   B  4  3
     A            DATA2        512   B 11  3
     A                                 21  2'F3=AVSLUTT'
     A                                      COLOR(BLU)
