     A          R SYGE07WR
     A            HEAVD          4S 0       COLHDG('AVD')
     A            HEOPD          7S 0       COLHDG('OPD')
     A            FASUM         15S 2       COLHDG('SUM')
     A            HEPRO          8S 0       COLHDG('PRO')
     A            HEDTOP         8S 0       COLHDG('DATO')
     A          K HEAVD
     A          K HEOPD
