     A*%%TS  SD  20160118  081709  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYFA09PNL)
     A                                      HLPTITLE('VEDLIKEHOLD AV GEBYRAVTAL-
     A                                      ER (KUNDER)')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A*%%TS  SD  20160118  081709  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'PROMT')
     A          H                           HLPPNLGRP(SYFA09010 SYFA09PNL)
     A  *DS3                                HLPARA(01 001 24 080)
     A  *DS4                                HLPARA(01 001 24 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYGE100'
     A                                      COLOR(BLU)
     A                                  1 19'Teste modulus10'
     A                                      COLOR(WHT)
     A                                  1 66DATE
     A                                      EDTCDE(Y)
     A                                  2 66TIME
     A                                  9  2'Innverdi.......'
     A            INN           21   B  9 20
     A                                 11  2'Modulussiffer..'
     A            MOD            1   B 11 20
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
