********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P5112 * 01 JOV PTF5 VIS OPT 1 KUN DERSOM TILLATT
P8068 * 02 TH PTF8 NY HELP - FUNKSJON
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
N02  A                                      HLPPNLGRP(HLPSCR SYHU10PNL)
N02  A                                      HLPTITLE('HURTIGBOOKING/NOTISBLOKK')
     A                                      ALTHELP
     A                                      HELP
     A          R BILDE01
     A                                      CA03(03 'avslutt')
     A                                      CF17(17 'Start')
     A                                      CF07(07)
     A                                      CF08(08)
     A                                      ROLLUP(08)
     A                                      ROLLDOWN(07)
     A                                      CF18(18 'slutt')
     A                                      CF10(10 'Avv. USERID')
S02  A*         H                           HLPDOC('SYHU10010' 'SYHU10' 'SY400L-
S02  A*                                     O/FELLES')
S02  A*                                     HLPARA(01 001 20 080)
     A            RECN1         10S 0H
     A            RECN2         10S 0H
     A            RECN3         10S 0H
     A                                  1  2'SYSPED/SYHU10'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 BBA0063 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 57DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 68TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(060 BBA0064 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  2 66USER
     A                                      COLOR(BLU)
E01  A  52                              3  4MSGCON(060 BBA0065 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
N01  A N52                              3  4MSGCON(060 JOV1022 *LIBL/SYMSGF)
N01  A                                      COLOR(BLU)
     A  50        ZUSER         10A  O  3 66COLOR(WHT)
     A            DSOPT1         1Y 0B  4  2EDTCDE(4)
     A                                  4  4MSGCON(008 BBA0066 *LIBL/SYMSGF)
     A            OPDG1         10A  B  4 13
     A  41                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  4 24MSGCON(003 BBA0067 *LIBL/SYMSGF)
     A            AM1            1A  B  4 28COLOR(YLW)
     A                                  4 30MSGCON(003 BBA0068 *LIBL/SYMSGF)
     A            FRA1           8A  B  4 34COLOR(YLW)
     A                                  4 43MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            FDATO1         6Y 0B  4 48EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  4 55MSGCON(003 BBA0069 *LIBL/SYMSGF)
     A            TIL1           8A  B  4 59COLOR(YLW)
     A                                  4 68MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            TDATO1         6Y 0B  4 73EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  5  4MSGCON(003 BBA0071 *LIBL/SYMSGF)
     A            ANT1           4Y 0B  5  8EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  5 13MSGCON(005 BBA0072 *LIBL/SYMSGF)
     A            VAREB1        25A  B  5 19COLOR(YLW)
     A                                  5 45MSGCON(002 BBA0073 *LIBL/SYMSGF)
     A            M31            7Y 3B  5 48EDTWRD('    .   ')
     A                                      COLOR(YLW)
     A                                  5 57MSGCON(002 BBA0074 *LIBL/SYMSGF)
     A            LM1            4Y 2B  5 60EDTWRD('  .  ')
     A                                      COLOR(YLW)
     A                                  5 66MSGCON(004 BBA0075 *LIBL/SYMSGF)
     A            VEKT1          7Y 1B  5 71EDTWRD('      . ')
     A                                      COLOR(YLW)
     A                                  6  4MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            DATE1          6S 0O  6  9DSPATR(HI)
     A            FRI11         30A  B  6 17COLOR(YLW)
     A            FRI21         30A  B  6 49COLOR(YLW)
     A                                  7  4MSGCON(004 BBA0078 *LIBL/SYMSGF)
     A            TIME1          6S 0O  7  9DSPATR(HI)
     A            FRI31         30A  B  7 17COLOR(YLW)
     A            FRI41         30A  B  7 49COLOR(YLW)
     A            DSOPT2         1Y 0B  9  2EDTCDE(4)
     A                                  9  4MSGCON(008 BBA0066 *LIBL/SYMSGF)
     A            OPDG2         10A  B  9 13
     A  42                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 24MSGCON(003 BBA0067 *LIBL/SYMSGF)
     A            AM2            1A  B  9 28COLOR(YLW)
     A                                  9 30MSGCON(003 BBA0068 *LIBL/SYMSGF)
     A            FRA2           8A  B  9 34COLOR(YLW)
     A                                  9 43MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            FDATO2         6Y 0B  9 48EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  9 55MSGCON(003 BBA0069 *LIBL/SYMSGF)
     A            TIL2           8A  B  9 59COLOR(YLW)
     A                                  9 68MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            TDATO2         6Y 0B  9 73EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 10  4MSGCON(003 BBA0071 *LIBL/SYMSGF)
     A            ANT2           4Y 0B 10  8EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 10 13MSGCON(005 BBA0072 *LIBL/SYMSGF)
     A            VAREB2        25A  B 10 19COLOR(YLW)
     A                                 10 45MSGCON(002 BBA0073 *LIBL/SYMSGF)
     A            M32            7Y 3B 10 48EDTWRD('    .   ')
     A                                      COLOR(YLW)
     A                                 10 57MSGCON(002 BBA0074 *LIBL/SYMSGF)
     A            LM2            4Y 2B 10 60EDTWRD('  .  ')
     A                                      COLOR(YLW)
     A                                 10 66MSGCON(004 BBA0075 *LIBL/SYMSGF)
     A            VEKT2          7Y 1B 10 71EDTWRD('      . ')
     A                                      COLOR(YLW)
     A                                 11  4MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            DATE2          6S 0O 11  9DSPATR(HI)
     A            FRI12         30A  B 11 17COLOR(YLW)
     A            FRI22         30A  B 11 49COLOR(YLW)
     A                                 12  4MSGCON(004 BBA0078 *LIBL/SYMSGF)
     A            TIME2          6S 0O 12  9DSPATR(HI)
     A            FRI32         30A  B 12 17COLOR(YLW)
     A            FRI42         30A  B 12 49COLOR(YLW)
     A            DSOPT3         1Y 0B 14  2EDTCDE(4)
     A                                 14  4MSGCON(008 BBA0066 *LIBL/SYMSGF)
     A            OPDG3         10A  B 14 13COLOR(YLW)
     A  43                                  DSPATR(PC)
     A                                 14 24MSGCON(003 BBA0067 *LIBL/SYMSGF)
     A            AM3            1A  B 14 28COLOR(YLW)
     A                                 14 30MSGCON(003 BBA0068 *LIBL/SYMSGF)
     A            FRA3           8A  B 14 34COLOR(YLW)
     A                                 14 43MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            FDATO3         6Y 0B 14 48EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 14 55MSGCON(003 BBA0069 *LIBL/SYMSGF)
     A            TIL3           8A  B 14 59COLOR(YLW)
     A                                 14 68MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            TDATO3         6Y 0B 14 73EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 15  4MSGCON(003 BBA0071 *LIBL/SYMSGF)
     A            ANT3           4Y 0B 15  8EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 15 13MSGCON(005 BBA0072 *LIBL/SYMSGF)
     A            VAREB3        25A  B 15 19COLOR(YLW)
     A                                 15 45MSGCON(002 BBA0073 *LIBL/SYMSGF)
     A            M33            7Y 3B 15 48EDTWRD('    .   ')
     A                                      COLOR(YLW)
     A                                 15 57MSGCON(002 BBA0074 *LIBL/SYMSGF)
     A            LM3            4Y 2B 15 60EDTWRD('  .  ')
     A                                      COLOR(YLW)
     A                                 15 66MSGCON(004 BBA0075 *LIBL/SYMSGF)
     A            VEKT3          7Y 1B 15 71EDTWRD('      . ')
     A                                      COLOR(YLW)
     A                                 16  4MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            DATE3          6S 0O 16  9DSPATR(HI)
     A            FRI13         30A  B 16 17COLOR(YLW)
     A            FRI23         30A  B 16 49COLOR(YLW)
     A                                 17  4MSGCON(004 BBA0078 *LIBL/SYMSGF)
     A            TIME3          6S 0O 17  9DSPATR(HI)
     A            FRI33         30A  B 17 17COLOR(YLW)
     A            FRI43         30A  B 17 49COLOR(YLW)
     A                                 18  2MSGCON(078 BBA0086 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A                                      DSPATR(HI)
     A            DSOPT4         1Y 0B 19  2EDTCDE(4)
     A                                      DSPATR(ND)
     A                                      DSPATR(PR)
     A                                 19  4MSGCON(008 BBA0066 *LIBL/SYMSGF)
     A            OPDG4         10A  B 19 13
     A  44                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                 19 24MSGCON(003 BBA0067 *LIBL/SYMSGF)
     A            AM4            1A  B 19 28COLOR(YLW)
     A                                 19 30MSGCON(003 BBA0068 *LIBL/SYMSGF)
     A            FRA4           8A  B 19 34COLOR(YLW)
     A                                 19 43MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            FDATO4         6Y 0B 19 48EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 19 55MSGCON(003 BBA0069 *LIBL/SYMSGF)
     A            TIL4           8A  B 19 59COLOR(YLW)
     A                                 19 68MSGCON(004 BBA0070 *LIBL/SYMSGF)
     A            TDATO4         6Y 0B 19 73EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 20  4MSGCON(003 BBA0071 *LIBL/SYMSGF)
     A            ANT4           4Y 0B 20  8EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 20 13MSGCON(005 BBA0072 *LIBL/SYMSGF)
     A            VAREB4        25A  B 20 19COLOR(YLW)
     A                                 20 45MSGCON(002 BBA0073 *LIBL/SYMSGF)
     A            M34            7Y 3B 20 48EDTWRD('    .   ')
     A                                      COLOR(YLW)
     A                                 20 57MSGCON(002 BBA0074 *LIBL/SYMSGF)
     A            LM4            4Y 2B 20 60EDTWRD('  .  ')
     A                                      COLOR(YLW)
     A                                 20 66MSGCON(004 BBA0075 *LIBL/SYMSGF)
     A            VEKT4          7Y 1B 20 71EDTWRD('      . ')
     A                                      COLOR(YLW)
     A            DATE4          6S 0O 21  9DSPATR(HI)
     A                                      DSPATR(ND)
     A            FRI14         30A  B 21 17COLOR(YLW)
     A            FRI24         30A  B 21 49COLOR(YLW)
     A            TIME4          6S 0O 22  9DSPATR(HI)
     A                                      DSPATR(ND)
     A            FRI34         30A  B 22 17COLOR(YLW)
     A            FRI44         30A  B 22 49COLOR(YLW)
     A                                 23  2MSGCON(008 BBA0014 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 17MSGCON(018 JOV0680 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 BBA0084 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 61MSGCON(018 BBA0085 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R WINDOW1
     A                                      CA03(03 'Avslutt')
     A*                                     BLINK
     A                                      WINDOW(*DFT 6 26 *NOMSGLIN)
     A*                                     WDWBORDER((*DSPATR HI) (*CHAR '...:-
     A*                                     ::.:'))
     A                                  1  4MSGCON(022 BBA0080 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  4MSGCON(015 BBA0081 *LIBL/SYMSGF)
     A            WSSIGN         3   B  3 21
     A  51                              4  2MSGCON(025 BBA0083 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  6  2MSGCON(008 BBA0014 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6 14MSGCON(012 BBA0082 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R WINDOW2
     A                                      CA03(03 'Avslutt')
     A*                                     BLINK
     A                                      WINDOW(*DFT 6 26 *NOMSGLIN)
     A*                                     WDWBORDER((*DSPATR HI) (*CHAR '...:-
     A*                                     ::.:'))
     A                                  1  4MSGCON(022 JOV0681 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  4MSGCON(010 JOV0682 *LIBL/SYMSGF)
     A            ZUSER         10   B  3 15
     A                                  4  2MSGCON(025 JOV0683 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  6  2MSGCON(008 BBA0014 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6 14MSGCON(012 BBA0082 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
