     A                                      REF(HEADF)
     A          R SYIM03FR
     A            HEGN16        16          COLHDG('Godsnr')
     A            HEPOS1    R               REFFLD(HEPOS1)
     A            HEPOS2    R               REFFLD(HEPOS2)
     A            HEDTOP    R               REFFLD(HEDTOP)
     A            HETLE     R               REFFLD(HETLE)
     A            HETLL     R               REFFLD(HETLL)
     A            SIDTG         10          COLHDG('Fort.Dato')
     A            EXTREF        15          COLHDG('Ekst.ref')
     A            SIST           1          COLHDG('STATUS')
     A            HEGNN     R               REFFLD(HEGNN)
     A            HEAVD     R               REFFLD(HEAVD)
     A            HEOPD     R               REFFLD(HEOPD)
     A            HESG      R               REFFLD(HESG)
     A            HEOT      R               REFFLD(HEOT)
     A            HENT      R               REFFLD(HENT)
     A            HEVS1     R               REFFLD(HEVS1)
     A            HEVKT     R               REFFLD(HEVKT)
     A            HEPRO     R               REFFLD(HEPRO)
     A            ZFNAS         30          COLHDG('Avsender navn')
     A            ZFADS1        30          COLHDG('Avsender adr')
N13  A            HEKNK          8S 0       COLHDG('Mottager kunr')
N13  A            SYRG          14          COLHDG('Mottager Foret.nr')
     A            ZFNAK         30          COLHDG('Mottager navn')
     A            ZFADK1        30          COLHDG('Mottager adr1')
     A            ZFADK3        30          COLHDG('Mottager adr3')
     A            TRVERV         3          COLHDG('Valkod vareverdi')
     A            TRVERB        13S 2       COLHDG('Vareverdi')
     A            SITRM          2S 0       COLHDG('Transportmåte')
     A            SILKT          2          COLHDG('Land TransporID')
     A            SITRID        17          COLHDG('TransportID')
     A            SIKDLS         2          COLHDG('Lagerkode')
     A            SILS          16          COLHDG('lagertekst')
     A            HESDL         20          COLHDG('lossested')
     A            HEKF           2          COLHDG('Utl.kode')
     A            HEKFT1         1          COLHDG('Utl.stat')
     A            HEFT1         51          COLHDG('Utl.tekst')
