      *________
      * Forside
      *""""""""
     A          R HEAD                      SKIPB(01)
     A                                     2'UFOTOLLEDE'
     A            FIFT          45        20
     A                                    70DATE EDTCDE(Y)
     A                                     2'FRA GODSNUMMER.:'
     A                                      SPACEB(1)
     A            WSGNFA         4        20
     A            WSGNFB         5        25
     A            WSGNFC         3        31
     A            WSGNFD         3        35
     A                                     2'TIL GODSNUMMER.:'
     A                                      SPACEB(1)
     A            WSGNTA         4        20
     A            WSGNTB         5        25
     A            WSGNTC         3        31
     A            WSGNTD         3        35
      *
     A                                     2'KUN KUNDENUMMER:'
     A                                      SPACEB(1)
     A            WSKUND         8  0     20
     A            KNAVNS        30        29
     A                                     1'.'
     A                                      SPACEB(1)
     A                                     2'INT REF/GODSN'
     A                                      SPACEB(1)
     A                                    18'POSISJON'
     A                                    35'KUNDENR'
     A                                    44'MOTTAGER'
     A                                    76'ANT DAG'
     A                                    84'DATO SAD'
     A                                    93'NYTT GODSNR'
     A                                   110'ANT'
     A                                   116'VEKT'
     A                                     2'----------------------------------+
     A                                      -----------------------------------+
     A                                      -----------------------------------+
     A                                      ----------------'
     A                                      SPACEB(1)
      *________
      * DUMMY Heading
      *""""""""
     A          R HEAD2                     SKIPB(01)
     A                                     1'.'
     A*                                     SPACEB(1)
      *_____________
      * Detaljlinjer
      *"""""""""""""
     A          R DET                       SPACEB(1)
     A            HEAVD          4  0      2
     A                                     6'/'
     A            HEOPD          7  0      7
     A                                    14'/'
     A            HESG           3        15
     A            HEGN          15         2SPACEB(1)
     A            HEPOS1         7        18
     A            KUNDNR         8  0     35EDTCDE(Z)
     A            SINAK         30        44
     A            DIFF           9  0     74EDTCDE(Z)
     A N34        SIDT           8  0     84
     A  34                                84'IKKE SAD'
     A            HEGNN         15        93
     A            ANT            5  0    108EDTCDE(Z)
     A            VEKT           7  0    114EDTCDE(Z)
