      *________
      *""""""""
     A                                      REF(SR)
     A          R SYIM50FR
     A            TLUNIK         9S 0       COLHDG('UNIK')
     A            HEAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            HEOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            HESG      R               REFFLD(SG)
     A                                      COLHDG('Signatur')
     A            SISG      R               REFFLD(SG)
     A                                      COLHDG('Signatur')
     A            HEOT      R               REFFLD(OT)
     A                                      COLHDG('OPPDRAGSTYPE')
     A            HEGN          15A         COLHDG('GODSNR')
     A            HEPOS1         7A         COLHDG('Posisjon-1')
     A            HEKNKF    R               REFFLD(KN)
     A                                      COLHDG('FAKTURAMOTTAKER')
     A            HENAKF    R               REFFLD(NA)
     A                                      COLHDG('Navn FAKTURAMOTTAKER')
     A            SINAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Avsender')
     A            SIDTY     R               REFFLD(DTY)
     A            SIADS1    R               REFFLD(AD)
     A                                      COLHDG('Sted Avsender')
     A            KUNDNR    R               REFFLD(KN)
     A                                      COLHDG('Kundenr')
     A            SINAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            SITLE     R               REFFLD(TLE)
     A            SITLL     R               REFFLD(TLL)
     A            SIDTG     R               REFFLD(DTG)
     A            HEGNN     R               REFFLD(GN)
     A            SIKODE         2
     A                                      COLHDG('Nytt godsnr')
     A            ANT            5S 0       COLHDG('Antall kolli')
     A            VEKT           7S 0       COLHDG('Vekt')
     A            TVIDAF         8S 0       COLHDG('FØRSTE TVINNDATO')
     A            TVIDAS         8S 0       COLHDG('SISTE  TVINNDATO')
     A            TVI077         3          COLHDG('ME KODE')
     A            FRITXT         1          COLHDG('FRITEKSTKODE')
     A            FRTTXT        70          COLHDG('FRITEKST')
     A          K TLUNIK
