     A          R RPT1
     A                                  3 20'AVVIKSRAPPORT - TRANSPORTOPPDRAG'
     A                                  4 20'********************************'
     A                                  7  4'SAKSNR:'
     A                                      UNDERLINE
     A            PRTSAK         7  0   7 12EDTCDE(Z)
     A                                  7 24'AVD/OPPD:'
     A                                      UNDERLINE
     A            PRTAVD         4  0   7 34EDTCDE(Z)
     A                                  7 38'/'
     A            PRTOPD         7  0   7 39EDTCDE(Z)
     A                                  7 54'TURNR:'
     A                                      UNDERLINE
     A            PRTTUN         8  0   7 61EDTCDE(Z)
     A                                  9  4'BILNR:'
     A                                      UNDERLINE
     A            PRTBIL        10      9 11
     A                                  9 24'HENGER/TRAILERNR:'
     A                                      UNDERLINE
     A            PRTHEN        10      9 42
     A                                  9 54'SJÅFØR:'
     A                                      UNDERLINE
     A            PRTS1T        15      9 62
     A                                 11  4'UNDERTRANSP:'
     A                                      UNDERLINE
     A            PRTTRN         8  0  11 17EDTCDE(Z)
     A            PRTTRF        30     11 26
     A            PRTTA1        30     12 17
     A            PRTTA2        35     12 48
     A                                 13  4'OPPDRAGSG.:'
     A                                      UNDERLINE
     A            PRTOPN         8  0  13 17EDTCDE(Z)
     A            PRTOPT        25     13 26
     A                                 13 53'REKL. FRA:'
     A                                      UNDERLINE
     A            PRTPFT        17     13 64
     A                                 15  4'**********************************'
     A                                 15 38'**********************************'
     A                                 15 72'*********'
     A                                 17  4'AVSENDER:'
     A                                      UNDERLINE
     A            PRTAS1        30     17 14
     A                                 18  4'STED/BY:'
     A                                      UNDERLINE
     A            PRTAS2        20     18 14
     A                                 18 45'DATO:'
     A                                      UNDERLINE
     A            PRTADA         6  0  18 58EDTCDE(Y)
     A                                 18 70'KL:'
     A                                      UNDERLINE
     A            PRTADK         4  0  18 74EDTWRD('  .  ')
     A                                 20  4'MOTTAKER:'
     A                                      UNDERLINE
     A            PRTMO1        30     20 14
     A                                 21  4'STED/BY:'
     A                                      UNDERLINE
     A            PRTMO2        20     21 14
     A                                 21 45'DATO:'
     A                                      UNDERLINE
     A            PRTAND         6  0  21 58EDTCDE(Y)
     A                                 21 70'KL:'
     A                                      UNDERLINE
     A            PRTANK         4  0  21 74EDTWRD('  .  ')
     A                                 23  4'**********************************'
     A                                 23 38'**********************************'
     A                                 23 72'*********'
     A                                 25  4'GODSSLAG:'
     A                                      UNDERLINE
     A            PRTGDS        30     25 17
     A            PRTGKL         7  0  26 17EDTCDE(Z)
     A                                 26 25'KOLLI'
     A            PRTGKG         9  0  26 33EDTCDE(Z)
     A                                 26 43'KG'
     A            PRTGLM         4  2  26 48EDTWRD('  ,  ')
     A                                 26 54'LM'
     A            PRTGM3         7  3  26 61EDTWRD('    ,   ')
     A                                 26 70'M3'
     A                                 28  4'MOTTATT DATO:'
     A                                      UNDERLINE
     A            PRTMDA         6  0  28 18EDTCDE(Y)
     A                                 28 30'KL:'
     A                                      UNDERLINE
     A            PRTMKL         4  0  28 34EDTWRD('  .  ')
     A                                 28 45'LEVERT DATO:'
     A                                      UNDERLINE
     A            PRTLDA         6  0  28 58EDTCDE(Y)
     A                                 28 70'KL:'
     A                                      UNDERLINE
     A            PRTLKL         4  0  28 74EDTWRD('  .  ')
     A                                 30  4'AVVIKETS ART:'
     A                                      UNDERLINE
     A            PRTAVT        20     30 18
     A                                 32  4'SKADE/MANKO:'
     A                                      UNDERLINE
     A            PRTSKL         7  0  32 17EDTCDE(Z)
     A                                 32 25'KOLLI'
     A            PRTSKG         9  0  32 33EDTCDE(Z)
     A                                 32 43'KG'
     A            PRTSLM         4  2  32 48EDTWRD('  ,  ')
     A                                 32 54'LM'
     A            PRTSM3         7  3  32 61EDTWRD('    ,   ')
     A                                 32 70'M3'
     A                                 34  4'AVVIKETS ÅRSAK:'
     A                                      UNDERLINE
     A            PRTAV1        75     35  4
     A            PRTAV2        75     36  4
     A            PRTAV3        75     37  4
     A                                 39  4'ANSVARLIG PART:'
     A                                      UNDERLINE
     A            PRTANT        20     39 20
     A                                 41  4'KORRIGERENDE TILTAK:'
     A                                      UNDERLINE
     A            PRTKO1        75     42  4
     A            PRTKO2        75     43  4
     A            PRTKO3        75     44  4
     A            PRTKO4        75     45  4
     A                                 47  4'**********************************'
     A                                 47 38'**********************************'
     A                                 47 72'*********'
     A                                 49  4'REGISTRERT DATO      :'
     A                                      UNDERLINE
     A            PRTRDA         6  0  49 27EDTCDE(Y)
     A                                 49 41'SIGN.:'
     A                                      UNDERLINE
     A            PRTRSI         5     49 48
     A                                 50  4'TILTAK GODKJENT DATO :'
     A                                      UNDERLINE
     A            PRTGDA         6  0  50 27EDTCDE(Y)
     A                                 50 41'SIGN.:'
     A                                      UNDERLINE
     A            PRTGSI        15     50 48
     A                                 51  4'FRIST FOR GJ.F. DATO :'
     A                                      UNDERLINE
     A            PRTFDA         6  0  51 27EDTCDE(Y)
     A                                 51 41'SIGN.:'
     A                                      UNDERLINE
     A            PRTFSI        15     51 48
     A                                 52  4'TILTAK GJENNOMF. DATO:'
     A                                      UNDERLINE
     A            PRTUDA         6  0  52 27EDTCDE(Y)
     A                                 52 41'SIGN.:'
     A                                      UNDERLINE
     A            PRTUSI        15     52 48
     A                                 54  4'AVVIKETS DIREKTE KOSTNAD '
     A                                      UNDERLINE
     A                                 54 29'(KRAV)      :'
     A                                      UNDERLINE
     A                                 54 43'NOK'
     A            PRTKRA         9  2  54 47EDTCDE(3)
     A                                 55  4'AVVIKETS DIREKTE KOSTNAD '
     A                                      UNDERLINE
     A                                 55 29'(FORVENTET) :'
     A                                      UNDERLINE
     A                                 55 43'NOK'
     A            PRTFOR         9  2  55 47EDTCDE(3)
     A                                 56  4'AVVIKETS DIREKTE KOSTNAD '
     A                                      UNDERLINE
     A                                 56 29'(ENDELIG)   :'
     A                                      UNDERLINE
     A                                 56 43'NOK'
     A            PRTKOS         9  2  56 47EDTCDE(3)
     A                                 57  4'AVVIKETS DIREKTE KOSTNAD '
     A                                      UNDERLINE
     A                                 57 29'(INTERN)    :'
     A                                      UNDERLINE
     A                                 57 43'NOK'
     A            PRTINT         7  0  57 47EDTCDE(1)
     A                                 59  4'**********************************'
     A                                 59 38'**********************************'
     A                                 59 72'*********'
     A                                 62  4'HUSK: ALLTID AVVIKSRAPPORT FRA '
     A                                      UNDERLINE
     A                                 62 35'SJÅFØR VED REKLAMASJON.'
     A                                      UNDERLINE
     A                                 63  4'DISTRIBUSJON: SYSTEMARKIV - TRAFIK'
     A                                 63 38'KSJEF - (REKLAMASJONSAVD.)'
