     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R B20
     A                                      CF12(12 'AVBRYT')
     A                                      CF04(04 'SØK')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3'SYSPED/SYIS30 '
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(030 TBR0183 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 57'Dato:'
     A                                      COLOR(BLU)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 57'Kl. :'
     A                                      COLOR(BLU)
     A                                  2 63TIME
     A                                      COLOR(BLU)
     A                                  7 10MSGCON(019 TBR0184 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSFORM        10A  B  7 31
     A                                  8 10MSGCON(019 TBR0185 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSPRT         10A  B  8 31
     A                                  9 10MSGCON(019 TBR0186 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSSPLQ        10A  B  9 31
     A                                 10 10MSGCON(019 TBR0187 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSANT          2Y 0B 10 31EDTCDE(4)
     A                                 13 10MSGCON(019 TBR0188 *LIBL/SYMSGF)
     A            WSSAV          1A  B 13 31VALUES(' ' 'J')
     A                                 13 36MSGCON(020 TBR0193 *LIBL/SYMSGF)
     A                                 14 10MSGCON(019 TBR0189 *LIBL/SYMSGF)
     A            WSHLD          1A  B 14 31VALUES(' ' 'J')
     A                                 14 36MSGCON(020 TBR0193 *LIBL/SYMSGF)
     A                                 23 21MSGCON(023 TBR0190 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 63MSGCON(015 TBR0015 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  B 24  2TEXT('FEIL I INNTASTEDE DATA')
     A                                      COLOR(WHT)
     A            EPOST         70A  B  5 10CHECK(LC)
     A                                  4 10MSGCON(050 SHU1090 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
