********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P9XXX * 01 YBC PTF9 FEILDEFINERT VARIABLER
P9XXX * 02 YBC PTF9 VALG AV SAKSNR
10XXX * 03 YBC PTF9 99999999 = ALLE
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('IMFORE09B' 'HELPNU' 'HLP400-
     A                                      ')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A N31                                  CF03(03 'Avslutt')
     A                                      CF04(04 'SØKE')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYIS20 '
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(050 TBR0173 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                  5 13MSGCON(010 TBR0174 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  7 13MSGCON(015 TBR0146 *LIBL/SYMSGF)
S01  A*           WSOPD          8A  B  7 29
N01  A            WSOPG          8Y 0B  7 29EDTCDE(4)
     A  31                                  DSPATR(RI)
S03  A*                                 7 40MSGCON(010 TBR0197 *LIBL/SYMSGF)
N03  A                                  7 40MSGCON(017 YBC1974 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
E03  A                                  7 60MSGCON(015 TBR0204 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  8 20MSGCON(010 TBR0175 *LIBL/SYMSGF)
     A                                  9 13MSGCON(015 TBR0176 *LIBL/SYMSGF)
S01  A*           WSTRA          8A  B  9 29
N01  A            WSTRA          8Y 0B  9 29EDTCDE(4)
     A  31                                  DSPATR(RI)
S03  A*                                 9 40MSGCON(010 TBR0197 *LIBL/SYMSGF)
N03  A                                  9 40MSGCON(017 YBC1974 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
E03  A                                  9 60MSGCON(015 TBR0204 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 10 20MSGCON(010 TBR0175 *LIBL/SYMSGF)
     A                                 11 13MSGCON(015 TBR0177 *LIBL/SYMSGF)
     A            WSOPT          2A  B 11 29
     A  31                                  DSPATR(RI)
     A                                 11 40MSGCON(010 TBR0197 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 11 54MSGCON(015 TBR0204 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 12 20MSGCON(010 TBR0175 *LIBL/SYMSGF)
     A                                 13 13MSGCON(015 TBR0178 *LIBL/SYMSGF)
     A            WSUNI          4A  B 13 29
     A  31                                  DSPATR(RI)
     A                                 13 40MSGCON(010 TBR0197 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 13 54MSGCON(015 TBR0204 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 15 13MSGCON(010 TBR0179 *LIBL/SYMSGF)
     A            WSFDAT         6Y 0B 15 24EDTCDE(Y)
     A  32                                  DSPATR(RI)
     A                                 15 37MSGCON(010 TBR0180 *LIBL/SYMSGF)
     A            WSTDAT         6Y 0B 15 48EDTCDE(Y)
     A  33                                  DSPATR(RI)
N02  A                                 17 13'Eller saksnr:'
N02  A            WSSAKN         7Y 0B 17 29EDTCDE(4)
     A                                 23  2MSGCON(010 TBR0013 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30        UTXT          62A  O 24  2COLOR(WHT)
     A                                 23 57MSGCON(020 TBR0078 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGNR          7A  P
