     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE01
     A                                      CF03(03 'end program')
     A                                      CF04(04 'delete invoice')
     A                                  2 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  4  7MSGCON(045 DIV1842 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  7  7MSGCON(024 DIV1497 *LIBL/SYMSGF)
     A            UAVD           4Y 0O  7 33DSPATR(UL)
     A                                      COLOR(BLU)
     A                                      EDTCDE(4)
     A                                  9  7MSGCON(024 DIV1498 *LIBL/SYMSGF)
     A            WSSG           3A  B  9 33DSPATR(UL)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                  9 41MSGCON(040 DIV1845 *LIBL/SYMSGF)
     A                                 13  7MSGCON(024 DIV1846 *LIBL/SYMSGF)
     A            WSOPD          7Y 0B 13 33
     A  94
     AO 98                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A  98                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 11  7MSGCON(024 DIV2045 *LIBL/SYMSGF)
     A            WSFANR         7Y 0B 11 33DSPATR(UL)
     A  94                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 13 42MSGCON(040 DIV1847 *LIBL/SYMSGF)
     A                                 12  7MSGCON(024 DIV2046 *LIBL/SYMSGF)
     A            WSKUNR         8Y 0B 12 33DSPATR(UL)
     A  94                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 14  7MSGCON(024 DIV1848 *LIBL/SYMSGF)
     A            WSTXT         47A  B 14 33DSPATR(UL)
     A  97                                  DSPATR(RI)
     A  97                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                 15  7MSGCON(024 DIV1849 *LIBL/SYMSGF)
     A            WSSKR          1A  B 15 33DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'N' 'J')
     A                                 15 41MSGCON(040 DIV1850 *LIBL/SYMSGF)
     A                                 16  7MSGCON(024 SHU1216 *LIBL/SYMSGF)
     A N71                                  DSPATR(ND)
     A                                      COLOR(RED)
     A            SLEKRE         1A  B 16 33DSPATR(UL)
     A N71                                  DSPATR(ND PR)
     A                                      COLOR(RED)
     A                                      VALUES(' ' 'S' 'K')
     A                                 20  7MSGCON(024 DIV1853 *LIBL/SYMSGF)
     A            WSSMF          1A  B 20 32DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A                                 20 40MSGCON(040 DIV1854 *LIBL/SYMSGF)
     A                                 21  7MSGCON(070 DIV1855 *LIBL/SYMSGF)
     A                                 23  7MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A                                  1  7'SYKR20'
     A                                      COLOR(BLU)
