     A*__________________________
     A* SYSPED400 REGISTER FOR VEKT/FORV.KOST.  TOTALT PR TUR
     A*""""""""""""""""""""""""""
     A          R SYKS30XR
     A            XTUR           8S 0       COLHDG('TUR.NR')
     A            XVKT          11S 0       COLHDG('TURENS TOT. F.VKT')
     A            XBEL          11S 2       COLHDG('FORV. KOST')
     A            XBP            1          COLHDG('P=INKL.PROS.BER. TUR')
     A          K XTUR
