     A          R SYKS30WR                  PFILE(SYKS30W)
     A          K WSG
     A          K WAVD
     A          K WTUR
     A          K WTURHK
     A          K WTURHO
