     A*%%TS  SD  20160310  065211  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYKS02PNL)
     A                                      HLPTITLE('KOSTNADSFØRINGSSYSTEM FOR-
     A                                      DELING AV KOSTNADER')
     A                                      HELP
     A                                      ALTHELP
     A          R SUBFIL                    SFL
     A*%%TS  SD  20140930  072846  SVEIN       REL-V7R1M0  5770-WDS
     A            RECNUM        10S 0H
     A            KBFREE        37A  H
     A            KBKDPF         1A  H
S09  A*           KBBILT        15A  H
     A            KBBLHB        13S 2H
     A            KBPMN          2S 0H
     A            KBPÅR          2S 0H
     A            KBPCC          2S 0H
     A            KBAVD          4Y 0H
     A            KBOPD          7Y 0H
     A            KBGEBY         1Y 0H
     A            WSOT           2A  H
     A            WSFR           3A  H
     A            WSSK           1A  H
     A            KBKAVD         4Y 0H
     A            KBKKEY        15A  H
     A            KBNØKK         1S 0H
N20  A            KBREFA        35A  H
N20  A            KBREFB        35A  H
N20  A            KBREFC        35A  H
S09  A*           WSNR           1A  I  5  2VALUES(' ' '2' '4' '5' '6' 'V')
     A            WSNR           1A  I  5  2VALUES(' ' '2' '4' '5' '6' 'V' 'R' -
N14  A                                      'S' 'T' 'O')
S14  A*                                     'S' 'T')
     A            WXAVD          4Y 0O  5  5EDTCDE(4)
     A  28                                  DSPATR(RI)
     A            WXTXT         15A  O  5 10
     A  28                                  DSPATR(RI)
     A            WXSK           1A  O  5 26
     A            KBKN           8Y 0O  5 28EDTCDE(4)
     A            KBVK           3A  O  5 37
     A  43                                  COLOR(WHT)
     A            WSVAL          3A  O  5 41
     A            WSBLHB        13Y 2O  5 45EDTCDE(M)
     A            KBKDM          1S 0O  5 61
     A            KBBLF         13Y 2O  5 63EDTCDE(M)
     A            KBKDMV         1A  O  5 79
     A*           KBBILT        15A  O  5 82
     A            VEKT01         5Y 0O  5 82EDTCDE(Z)
     A            VEKT02         5Y 0O  5 88EDTCDE(Z)
     A            WSNT           3Y 0O  5 94EDTCDE(Z)
     A            KBBUDS        13Y 2O  5 99EDTCDE(M)
     A            KBDIFF         5Y 2O  5115EDTCDE(M)
     A  80                                  COLOR(RED)
     A            UPROS          3Y 1O  5124EDTCDE(M)
     A            KBREKL         2A  O  5130COLOR(RED)
     A  79                                  DSPATR(RI)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20140902  212639  SVEIN       REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0013)
     A                                      SFLPAG(0012)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND(*MORE)
     A                                  1  2'SYSPED/SYKS03'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(020 DIV2174 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A            KALNR          8Y 0O  1 44EDTCDE(Z)
     A                                      DSPATR(HI)
     A            LNAVN         30A  O  1 54DSPATR(HI)
     A            ZRECNO         4S 0O  1119SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1100DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1109TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(005 DIV2175 *LIBL/SYMSGF)
     A            UBNR2          7Y 0O  2  8TEXT('Endelig bilagsnr')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 16MSGCON(007 DIV2176 *LIBL/SYMSGF)
     A            WSBDT          6Y 0O  2 24TEXT('BILAGSDATO')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('      ')
     A                                  2 31MSGCON(013 JOV0384 *LIBL/SYMSGF)
     A            UBNR           7Y 0O  2 45TEXT('BILAGSNUMMER')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 53MSGCON(004 DIV2179 *LIBL/SYMSGF)
     A            ULNR           8Y 0O  2 58TEXT('LEVERANDØRSNR.')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 67MSGCON(007 DIV2177 *LIBL/SYMSGF)
     A            UPMN           2Y 0O  2 75TEXT('PERIODE-MÅNED')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            UPÅR           2Y 0O  2 78TEXT('PERIODE-ÅR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
S03  A*                                 3  2MSGCON(078 JOV0352 *LIBL/SYMSGF)
S09  A*                                 3  2MSGCON(078 SHU1261 *LIBL/SYMSGF)
     A                                  3  2MSGCON(131 SHU1261 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N44N39                           4  2MSGCON(131 YBC0844 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  44N39                           4  2MSGCON(131 YBC0845 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A N44 39                           4  2MSGCON(131 YBC0846 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  44 39                           4  2MSGCON(131 YBC0847 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A*
     A          R BUNN
     A*%%TS  SD  20140814  121805  SVEIN       REL-V7R1M0  5770-WDS
     A                                      OVERLAY
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(12 'FORRIGE')
     A N29                                  CF04(04 'Søking')
     A                                      CF05(05 'Frisk')
     A N29                                  CF06(06 'LAGE NY')
     A                                      CF07(07 'SØK OPPDR')
     A                                      CF08(08 'PLUKK REKV.')
     A N29                                  CF09(09 'FORDEL ETTER GEBYRKODE')
     A N29                                  CF10(10 'FERDIGMELD.')
     A N29                                  CF11(11 'FORDEL ETTER VEKT')
     A                                      CF12(12)
     A N29                                  CF13(13 'ENDRE BILNR')
     A  42
     AO 45                                  CF14(14 'VAL/NOK,BRT/NET SWITCH')
     A                                      CF15(15 'FRISØK')
     A                                      CA19(19 'VELG MODULS')
     A                                      CF20(20 '1. GANG')
N16  A N50                                  CF21(21 'AVV.PERI')
     A N29                                  CF23(23 'IKKE FORDEL')
     A                                      CF24(24 'FLERE F-TASTER')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(18)
     A                                      CLRL(07)
     A          H                           HLPPNLGRP(SYKS030010 SYKS03PNL)
     A                                      HLPARA(02 002 02 032)
     A          H                           HLPPNLGRP(SYKS030020 SYKS03PNL)
     A                                      HLPARA(02 034 02 042)
     A          H                           HLPPNLGRP(SYKS030030 SYKS03PNL)
     A                                      HLPARA(02 044 02 048)
     A          H                           HLPPNLGRP(SYKS030040 SYKS03PNL)
     A                                      HLPARA(02 051 02 055)
     A          H                           HLPPNLGRP(SYKS030050 SYKS03PNL)
     A                                      HLPARA(02 058 02 079)
     A          H                           HLPPNLGRP(SYKS030060 SYKS03PNL)
     A                                      HLPARA(03 002 03 079)
     A          H                           HLPPNLGRP(SYKS030075 SYKS03PNL)
     A                                      HLPARA(04 002 04 019)
     A          H                           HLPPNLGRP(SYKS030090 SYKS03PNL)
     A                                      HLPARA(04 020 04 079)
     A          H                           HLPPNLGRP(SYKS030080 SYKS03PNL)
     A                                      HLPARA(05 002 05 018)
     A          H                           HLPPNLGRP(SYKS030100 SYKS03PNL)
     A                                      HLPARA(06 001 06 079)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A            MSGN2K         7A  P
     A            MSGN2L         7A  P
     A            MSGN2M         7A  P
     A                                  2 85MSGCON(010 JOV0342 *LIBL/SYMSGF)
     A            WBVAL          3A  O  2 97DSPATR(HI)
     A            WBBL          13Y 2O  2101EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  3 85MSGCON(008 DIV2183 *LIBL/SYMSGF)
     A            WBBLF         13Y 2O  3101EDTCDE(M)
     A                                      DSPATR(HI)
     A N95                              4 85MSGCON(006 DIV2184 *LIBL/SYMSGF)
     A  95                              4 94MSGCON(006 SHU1165 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                      DSPATR(BL)
     A            WBBLD         13Y 2O  4101EDTCDE(M)
     A                                      DSPATR(HI)
     A  95                                  COLOR(RED)
     A N29                              2  2MSGCON(010 DIV2185 *LIBL/SYMSGF)
     A N29        UVAL           3A  O  2 14COLOR(WHT)
     A N29        WSBLFD        13Y 2B  2 18EDTCDE(M)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  90                                  DSPATR(HI)
     A N29                              2 34MSGCON(005 JOV1330 *LIBL/SYMSGF)
     A N29        WSVK           3A  B  2 40
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  89                                  DSPATR(HI)
     A N29                              2 44MSGCON(003 DIV2187 *LIBL/SYMSGF)
     A N29        WSKDPF         1A  B  2 48
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  88                                  DSPATR(HI)
     A N29                              2 51MSGCON(003 DIV2188 *LIBL/SYMSGF)
     A N29        WSKDM          1A  B  2 55COLOR(YLW)
     A  87                                  DSPATR(HI)
     A N29                              2 58MSGCON(009 JOV0328 *LIBL/SYMSGF)
     A N29        WSPROS         5Y 2B  2 68DSPATR(UL)
     A                                      EDTCDE(4)
     A N96                                  COLOR(YLW)
     A N29                              2 75MSGCON(003 DIV2188 *LIBL/SYMSGF)
     A N29        WSKDMV         1A  B  2 79
     A  82                                  DSPATR(HI)
     A N96                                  COLOR(YLW)
     A N29                              3  2MSGCON(009 DIV2190 *LIBL/SYMSGF)
     A N29                              3 14MSGCON(003 JOV0343 *LIBL/SYMSGF)
     A N29        WSAVD          4Y 0B  3 18DSPATR(UL)
     A  86                                  DSPATR(HI)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A N29        WSOPD          7Y 0B  3 30DSPATR(UL)
     A  85                                  DSPATR(HI)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A N29                              3 38MSGCON(009 JOV0345 *LIBL/SYMSGF)
     A N29        WSPRO          8Y 0B  3 48DSPATR(UL)
     A  84                                  DSPATR(HI)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A N29                              3 57MSGCON(005 JOV0347 *LIBL/SYMSGF)
     A N29        WSGN17        17A  B  3 63DSPATR(UL)
     A  83                                  DSPATR(HI)
     A                                      COLOR(YLW)
     A N29                              5  2'T'
     A N29        WSBILT        15A  B  5  4COLOR(YLW)
     A N29                              4 20MSGCON(003 JOV0348 *LIBL/SYMSGF)
     A N29        WSFRIO         1A  B  4 24COLOR(YLW)
     A N29                              4 26MSGCON(004 JOV0349 *LIBL/SYMSGF)
     A N29        WSFR01         3A  B  4 31COLOR(YLW)
     A N29        WSFR02         3A  B  4 35COLOR(YLW)
     A N29        WSFR03         3A  B  4 39COLOR(YLW)
     A N29                              4 43MSGCON(003 JOV0348 *LIBL/SYMSGF)
     A N29        WSOTIO         1A  B  4 47COLOR(YLW)
     A N29                              4 49MSGCON(004 JOV0350 *LIBL/SYMSGF)
     A N29        WSOT01         2A  B  4 54COLOR(YLW)
     A N29        WSOT02         2A  B  4 57COLOR(YLW)
     A N29        WSOT03         2A  B  4 60COLOR(YLW)
     A N29                              4 66MSGCON(003 JOV0348 *LIBL/SYMSGF)
     A N29        WSSKIO         1A  B  4 70COLOR(YLW)
     A N29                              4 72MSGCON(004 JOV0351 *LIBL/SYMSGF)
     A N29        WSSK01         1A  B  4 77COLOR(YLW)
     A N29        WSSK02         1A  B  4 79COLOR(YLW)
     A N29                              4  2MSGCON(004 SHU1163 *LIBL/SYMSGF)
     A N29        WSPMN          2Y 0B  4  7EDTCDE(4)
     A                                      COLOR(YLW)
     A  97                                  DSPATR(RI)
     A  50                                  DSPATR(PR)
     A N29        WSPÅR          2Y 0B  4 10EDTCDE(4)
     A N29                                  COLOR(YLW)
     A  50                                  DSPATR(PR)
     A N29        MSGT2K        18A  O  6  2MSGID(&MSGN2K SYMSGF)
     A                                      COLOR(BLU)
     A N29        MSGT2L        18A  O  6 22MSGID(&MSGN2L SYMSGF)
     A                                      COLOR(BLU)
     A N29        MSGT2M        18A  O  6 42MSGID(&MSGN2M SYMSGF)
     A                                      COLOR(BLU)
     A N29                              6 62MSGCON(018 DIV0029 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  7  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30 95N29                        7  2MSGCON(078 JOV0148 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A N30N95                           7 40'(C) COPYRIGHT  SYSTEMA A/S  1991  '
     A                                      COLOR(WHT)
     A N29                              3 23MSGCON(006 JOV0344 *LIBL/SYMSGF)
     A          R BUNN2
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(12 'FORRIGE')
     A                                      CF12(12 'FORRIGE')
     A                                      CF04(04 'Søking')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(19)
     A                                      CLRL(06)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2MSGCON(010 JOV0342 *LIBL/SYMSGF)
     A            WBVAL          3A  O  1 14DSPATR(HI)
     A            WBBL          13Y 2O  1 18EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  1 34MSGCON(008 DIV2183 *LIBL/SYMSGF)
     A            WBBLF         13Y 2O  1 43EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  1 59MSGCON(006 DIV2184 *LIBL/SYMSGF)
     A            WBBLD         13Y 2O  1 66EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(078 JOV0382 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(030 DIV2150 *LIBL/SYMSGF)
     A            WSBSR          1A  B  3 42TEXT('BILAGSSERIE')
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                  4  2MSGCON(030 DIV2152 *LIBL/SYMSGF)
     A            WSBNR2         7Y 0B  4 42TEXT('BILAGSNUMMER')
     A                                      COLOR(YLW)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                  5 61MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  6  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A*
     A          R VARELI
     A*%%TS  SD  20140513  152116  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'Søking')
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(19)
     A                                      CLRL(06)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2MSGCON(010 JOV0342 *LIBL/SYMSGF)
     A            WBVAL          3A  O  1 14DSPATR(HI)
     A            WBBL          13Y 2O  1 18EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  1 34MSGCON(008 DIV2183 *LIBL/SYMSGF)
     A            WBBLF         13Y 2O  1 43EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  1 59MSGCON(006 DIV2184 *LIBL/SYMSGF)
     A            WBBLD         13Y 2O  1 66EDTCDE(M)
     A                                      DSPATR(HI)
     A            W2AVD          4Y 0B  3  9DSPATR(UL)
     A                                      COLOR(YLW)
     A  90                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            W2OPD          7Y 0B  3 14DSPATR(UL)
     A                                      COLOR(YLW)
     A  89                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            W2KN           8Y 0B  3 22DSPATR(UL)
     A                                      COLOR(YLW)
     A  88                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            W2VK           3A  B  3 31DSPATR(UL)
     A                                      COLOR(YLW)
     A  87                                  DSPATR(RI)
     A            W2KDPF         1A  B  3 37DSPATR(UL)
     A                                      COLOR(YLW)
     A  86                                  DSPATR(RI)
     A            W2BLHB        13Y 2B  3 40DSPATR(UL)
     A                                      COLOR(YLW)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(M)
     A            W2KDM          1A  B  3 57DSPATR(UL)
     A                                      COLOR(YLW)
     A  84                                  DSPATR(RI)
     A            W2BLF         13Y 2B  3 60DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            W2KDMV         1A  B  3 77COLOR(YLW)
     A                                  5  2MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5 21MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40MSGCON(004 SHU1163 *LIBL/SYMSGF)
     A            W2PMN          2Y 0B  4 45EDTCDE(4)
     A                                      COLOR(YLW)
     A  97                                  DSPATR(RI)
     A  50                                  DSPATR(PR)
     A            W2PÅR          2Y 0B  4 48EDTCDE(4)
     A                                      COLOR(YLW)
     A  50                                  DSPATR(PR)
     A                                  4 51MSGCON(013 SHU0535 *LIBL/SYMSGF)
     A            W2BILT        15A  B  4 65COLOR(YLW)
     A  30        MSGTXT        78A  O  6  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  9MSGCON(070 SHU1458 *LIBL/SYMSGF)
     A                                  3 83MSGCON(013 JOV1642 *LIBL/SYMSGF)
     A            KBREFA    R        O  4 83REFFLD(KOSTBR/KBREFA *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A            KBREFB    R        O  5 83REFFLD(KOSTBR/KBREFB *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A            KBREFC    R        O  6 83REFFLD(KOSTBR/KBREFC *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A*
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(19)
     A                                      CLRL(06)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(010 JOV0342 *LIBL/SYMSGF)
     A            WBVAL          3A  O  1 14DSPATR(HI)
     A            WBBL          13Y 2O  1 18EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  1 34MSGCON(008 DIV2183 *LIBL/SYMSGF)
     A            WBBLF         13Y 2O  1 43EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  1 59MSGCON(006 DIV2184 *LIBL/SYMSGF)
     A            WBBLD         13Y 2O  1 66EDTCDE(M)
     A                                      DSPATR(HI)
     A            KBAVD          4Y 0O  4 10DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            KBOPD          7Y 0O  4 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            KBKN           8Y 0O  4 23DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            KBVK           3A  O  4 32DSPATR(UL)
     A                                      COLOR(WHT)
     A            KBKDPF         1A  O  4 38DSPATR(UL)
     A                                      COLOR(WHT)
     A            KBBLHB        13Y 2O  4 41DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(M)
     A            KBKDM          1Y 0O  4 58DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            KBBLF         13Y 2O  4 61DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(M)
     A            KBKDMV         1A  O  4 78DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 10MSGCON(070 SHU0699 *LIBL/SYMSGF)
     A*
     A          R NYWRK
     A*%%TS  SD  20160310  064929  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(12 'FORRIGE')
     A N29                                  CF04(04 'Søking')
     A                                      CF05(05 'Frisk')
     A N29                                  CF06(06 'LAGE NY')
     A                                      CF07(07 'SØK OPPDR')
     A                                      CF08(08 'PLUKK REKV.')
     A N29                                  CF09(09 'FORDEL ETTER GEBYRKODE')
     A N29                                  CF11(11 'FORDEL ETTER VEKT')
     A                                      CF12(12)
     A N29                                  CF13(13 'ENDRE BILNR')
     A  42
     AO 45                                  CF14(14 'VAL/NOK,BRT/NET SWITCH')
     A                                      CF15(15 'FRISØK')
     A                                      CA19(19 'VELG MODULS')
     A                                      CF20(20 '1.GANG')
     A N50                                  CF21(21 'AVV.PERI')
     A N29                                  CF23(23 'IKKE FORDEL')
     A                                      CF24(24 'FLERE F-TASTER')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A          H                           HLPPNLGRP(SYKS030010 SYKS03PNL)
     A                                      HLPARA(20 002 20 032)
     A          H                           HLPPNLGRP(SYKS030020 SYKS03PNL)
     A                                      HLPARA(20 034 20 042)
     A          H                           HLPPNLGRP(SYKS030030 SYKS03PNL)
     A                                      HLPARA(20 044 20 048)
     A          H                           HLPPNLGRP(SYKS030040 SYKS03PNL)
     A                                      HLPARA(20 051 20 055)
     A          H                           HLPPNLGRP(SYKS030050 SYKS03PNL)
     A                                      HLPARA(20 058 20 079)
     A          H                           HLPPNLGRP(SYKS030060 SYKS03PNL)
     A                                      HLPARA(21 002 21 079)
     A          H                           HLPPNLGRP(SYKS030080 SYKS03PNL)
     A                                      HLPARA(22 002 22 018)
     A          H                           HLPPNLGRP(SYKS030090 SYKS03PNL)
     A                                      HLPARA(22 020 22 079)
     A          H                           HLPPNLGRP(SYKS030100 SYKS03PNL)
     A                                      HLPARA(23 001 23 079)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A            MSGN2K         7A  P
     A            MSGN2L         7A  P
     A            MSGN2M         7A  P
     A                                  1  2'SYSPED/SYKS03'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(020 DIV2174 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A            KALNR          8Y 0O  1 44EDTCDE(Z)
     A                                      DSPATR(HI)
     A            LNAVN         30A  O  1 54DSPATR(HI)
     A                                  1100DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1109TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(005 DIV2175 *LIBL/SYMSGF)
     A            UBNR2          7Y 0O  2  8TEXT('Endelig bilagsnr')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 16MSGCON(007 DIV2176 *LIBL/SYMSGF)
     A            WSBDT          6Y 0O  2 24TEXT('BILAGSDATO')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('      ')
     A                                  2 31MSGCON(013 JOV0384 *LIBL/SYMSGF)
     A            UBNR           7Y 0O  2 45TEXT('BILAGSNUMMER')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 53MSGCON(004 DIV2179 *LIBL/SYMSGF)
     A            ULNR           8Y 0O  2 58TEXT('LEVERANDØRSNR.')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 67MSGCON(007 DIV2177 *LIBL/SYMSGF)
     A            UPMN           2Y 0O  2 75TEXT('PERIODE-MÅNED')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            UPÅR           2Y 0O  2 78TEXT('PERIODE-ÅR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
S03  A*                                 3  2MSGCON(078 JOV0352 *LIBL/SYMSGF)
S09  A*                                 3  2MSGCON(078 SHU1261 *LIBL/SYMSGF)
     A                                  3  2MSGCON(129 SHU1261 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N44N39                           4  2MSGCON(131 YBC0844 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  44N39                           4  2MSGCON(131 YBC0845 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A N44 39                           4  2MSGCON(131 YBC0846 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  44 39                           4  2MSGCON(131 YBC0847 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                 19 85MSGCON(010 JOV0342 *LIBL/SYMSGF)
     A            WBVAL          3A  O 19 97DSPATR(HI)
     A            WBBL          13Y 2O 19101EDTCDE(M)
     A                                      DSPATR(HI)
     A                                 20 85MSGCON(008 DIV2183 *LIBL/SYMSGF)
     A            WBBLF         13Y 2O 20101EDTCDE(M)
     A                                      DSPATR(HI)
     A                                 21 85MSGCON(006 DIV2184 *LIBL/SYMSGF)
     A            WBBLD         13Y 2O 21101EDTCDE(M)
     A                                      DSPATR(HI)
     A N29                             19  2MSGCON(010 DIV2185 *LIBL/SYMSGF)
     A N29        UVAL           3A  O 19 14COLOR(WHT)
     A N29        WSBLFD        13Y 2B 19 18EDTCDE(M)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  90                                  DSPATR(HI)
     A N29                             19 34MSGCON(005 JOV1330 *LIBL/SYMSGF)
     A N29        WSVK           3A  B 19 40
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  89                                  DSPATR(HI)
     A N29                             19 44MSGCON(003 DIV2187 *LIBL/SYMSGF)
     A N29        WSKDPF         1A  B 19 48
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  88                                  DSPATR(HI)
     A N29                             19 51MSGCON(003 DIV2188 *LIBL/SYMSGF)
     A N29        WSKDM          1A  B 19 55
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  87                                  DSPATR(HI)
     A N29                             19 58MSGCON(009 JOV0328 *LIBL/SYMSGF)
     A N29        WSPROS         5Y 2B 19 68DSPATR(UL)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A N29                             19 75MSGCON(003 DIV2188 *LIBL/SYMSGF)
     A N29        WSKDMV         1A  B 19 79
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  82                                  DSPATR(HI)
     A N29                             20  2MSGCON(009 DIV2190 *LIBL/SYMSGF)
     A N29                             20 14MSGCON(003 JOV0343 *LIBL/SYMSGF)
     A N29        WSAVD          4Y 0B 20 18DSPATR(UL)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  86                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A N29                             20 23MSGCON(006 JOV0344 *LIBL/SYMSGF)
     A N29        WSOPD          7Y 0B 20 30DSPATR(UL)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  85                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A N29                             20 38MSGCON(009 JOV0345 *LIBL/SYMSGF)
     A N29        WSPRO          8Y 0B 20 48DSPATR(UL)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  84                                  DSPATR(HI)
     A                                      EDTCDE(4)
     A N29                             20 57MSGCON(005 JOV0347 *LIBL/SYMSGF)
     A N29        WSGN17        17A  B 20 63DSPATR(UL)
     A                                      COLOR(YLW)
     A  83                                  DSPATR(HI)
     A N29                             22  2'T'
     A N29        WSBILT        15A  B 22  4COLOR(YLW)
     A N29                             21  2MSGCON(004 SHU1163 *LIBL/SYMSGF)
     A N29        WSPMN          2Y 0B 21  7EDTCDE(4)
     A                                      COLOR(YLW)
     A  97                                  DSPATR(RI)
     A N29        WSPÅR          2Y 0B 21 10EDTCDE(4)
     A                                      COLOR(YLW)
     A N29                             21 20MSGCON(003 JOV0348 *LIBL/SYMSGF)
     A N29        WSFRIO         1A  B 21 24COLOR(YLW)
     A N29                             21 26MSGCON(004 JOV0349 *LIBL/SYMSGF)
     A N29        WSFR01         3A  B 21 31COLOR(YLW)
     A N29        WSFR02         3A  B 21 35COLOR(YLW)
     A N29        WSFR03         3A  B 21 39COLOR(YLW)
     A N29                             21 43MSGCON(003 JOV0348 *LIBL/SYMSGF)
     A N29        WSOTIO         1A  B 21 47COLOR(YLW)
     A N29                             21 49MSGCON(004 JOV0350 *LIBL/SYMSGF)
     A N29        WSOT01         2A  B 21 54COLOR(YLW)
     A N29        WSOT02         2A  B 21 57COLOR(YLW)
     A N29        WSOT03         2A  B 21 60COLOR(YLW)
     A N29                             21 66MSGCON(003 JOV0348 *LIBL/SYMSGF)
     A N29        WSSKIO         1A  B 21 70COLOR(YLW)
     A N29                             21 72MSGCON(004 JOV0351 *LIBL/SYMSGF)
     A N29        WSSK01         1A  B 21 77COLOR(YLW)
     A N29        WSSK02         1A  B 21 79
     A N29        MSGT2K        18A  O 23  2MSGID(&MSGN2K SYMSGF)
     A                                      COLOR(BLU)
     A N29        MSGT2L        18A  O 23 22MSGID(&MSGN2L SYMSGF)
     A                                      COLOR(BLU)
     A N29        MSGT2M        18A  O 23 42MSGID(&MSGN2M SYMSGF)
     A                                      COLOR(BLU)
     A N29                             23 62MSGCON(018 DIV0029 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30 95N29                       24  2MSGCON(078 JOV0148 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A N30N95                          24 40'(C) COPYRIGHT  SYSTEMA A/S  1991  '
     A                                      COLOR(WHT)
      *
     A          R BEKREFT
     A                                      WINDOW(*DFT 5 40 *NOMSGLIN)
     A                                      CF12(12 'FORRIGE')
     A                                      CF23(23 'BEKREFT')
     A                                  1  2'SYKS03'
     A                                      COLOR(BLU)
     A                                  1 10'Bekreft på sletting'
     A                                      DSPATR(HI)
     A                                  2  2'Konteringsnøkkel:'
     A                                  3  2'Avdeling........:'
     A            WXAVD          4  0O  3 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                  4  2'Oppd/turnr/godnr:'
     A            WXTXT         15A  O  4 20DSPATR(UL)
     A                                  5  2'F12=Avbryt  F23=Bekreft'
     A                                      COLOR(BLU)
N03  A          R VISLIN
N03  A                                      OVERLAY
N03  A                                      SLNO(18)
N03  A                                      CLRL(07)
N03  A                                  1  2MSGCON(010 JOV0342 *LIBL/SYMSGF)
N03  A            WBVAL          3A  O  1 14DSPATR(HI)
N03  A            WBBL          13Y 2O  1 18EDTCDE(M)
N03  A                                      DSPATR(HI)
N03  A                                  1 34MSGCON(008 DIV2183 *LIBL/SYMSGF)
N03  A            WBBLF         13Y 2O  1 43EDTCDE(M)
N03  A                                      DSPATR(HI)
N03  A                                  1 59MSGCON(006 DIV2184 *LIBL/SYMSGF)
N03  A            WBBLD         13Y 2O  1 66EDTCDE(M)
N03  A                                      DSPATR(HI)
N03  A            KBAVD          4Y 0O  4  2DSPATR(UL)
N03  A                                      COLOR(YLW)
N03  A                                      EDTCDE(4)
N03  A            KBOPD          7Y 0O  4  7DSPATR(UL)
N03  A                                      COLOR(YLW)
N03  A                                      EDTCDE(4)
N03  A            KBKN           8Y 0O  4 15DSPATR(UL)
N03  A                                      COLOR(YLW)
N03  A                                      EDTCDE(4)
N03  A            KNAVN         30A  O  4 24DSPATR(UL)
N03  A                                      COLOR(YLW)
N03  A            KBPMN          2  0O  4 56EDTCDE(4)
N03  A                                      COLOR(YLW)
N03  A                                      DSPATR(UL)
N03  A            KBPÅR          2  0O  4 59EDTCDE(4)
N03  A                                      COLOR(YLW)
N03  A                                      DSPATR(UL)
N03  A                                  3 65MSGCON(013 SHU0535 *LIBL/SYMSGF)
N03  A            KBBILT        15   O  4 65COLOR(YLW)
N03  A                                      DSPATR(UL)
N03  A                                  3  2'avd  opd     kundenr  Knavn'
N03  A                                  3 56'Mn'
N03  A                                  3 59'År'
N03  A                                  3 46'Avvikende'
     A                                  3 83MSGCON(013 JOV1642 *LIBL/SYMSGF)
     A            KBREFA    R        O  4 83REFFLD(KOSTBR/KBREFA *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A            KBREFB    R        O  5 83REFFLD(KOSTBR/KBREFB *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A            KBREFC    R        O  6 83REFFLD(KOSTBR/KBREFC *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A*         R VARELI
     A          R VARELIL1
     A*%%TS  SD  20160310  064506  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'Søking')
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(19)
     A                                      CLRL(06)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2MSGCON(010 JOV0342 *LIBL/SYMSGF)
     A            WBVAL          3A  O  1 14DSPATR(HI)
     A            WBBL          13Y 2O  1 18EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  1 34MSGCON(008 DIV2183 *LIBL/SYMSGF)
     A            WBBLF         13Y 2O  1 43EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  1 59MSGCON(006 DIV2184 *LIBL/SYMSGF)
     A            WBBLD         13Y 2O  1 66EDTCDE(M)
     A                                      DSPATR(HI)
     A                                  2  9MSGCON(100 SHU1640 *LIBL/SYMSGF)
     A            WNKONT         5Y 0B  3  9EDTCDE(Z)
     A            WNAVD          4Y 0B  3 15EDTCDE(Z)
     A            WNBAR          4Y 0B  3 20EDTCDE(Z)
     A            WNPRO          8Y 0B  3 25EDTCDE(Z)
     A            W2KDPF         1A  B  3 37DSPATR(UL)
     A                                      COLOR(YLW)
     A  86                                  DSPATR(RI)
     A            W2BLHB        13Y 2B  3 40DSPATR(UL)
     A                                      COLOR(YLW)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(M)
     A            W2KDM          1A  B  3 57DSPATR(UL)
     A                                      COLOR(YLW)
     A  84                                  DSPATR(RI)
     A            W2BLF         13Y 2B  3 60DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(M)
     A            W2KDMV         1A  B  3 77COLOR(YLW)
     A                                  3 83MSGCON(013 JOV1642 *LIBL/SYMSGF)
     A                                  4 40MSGCON(004 SHU1163 *LIBL/SYMSGF)
     A            W2PMN          2Y 0B  4 45EDTCDE(4)
     A                                      COLOR(YLW)
     A  97                                  DSPATR(RI)
     A  50                                  DSPATR(PR)
     A            W2PÅR          2Y 0B  4 48EDTCDE(4)
     A                                      COLOR(YLW)
     A  50                                  DSPATR(PR)
     A                                  4 51MSGCON(013 SHU0535 *LIBL/SYMSGF)
     A            W2BILT        15A  B  4 65COLOR(YLW)
     A            KBREFA    R        O  4 83REFFLD(KOSTBR/KBREFA *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5 21MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            KBREFB    R        O  5 83REFFLD(KOSTBR/KBREFB *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A  30        MSGTXT        78A  O  6  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            KBREFC    R        O  6 83REFFLD(KOSTBR/KBREFC *LIBL/KOSTB)
     A                                      COLOR(WHT)
     A*         R NYWRK
     A          R NYWRKL1
     A*%%TS  SD  20160310  064929  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(12 'FORRIGE')
     A N29                                  CF04(04 'Søking')
     A                                      CF05(05 'Frisk')
     A N29                                  CF06(06 'LAGE NY')
     A                                      CF07(07 'SØK OPPDR')
     A                                      CF08(08 'PLUKK REKV.')
     A N29                                  CF09(09 'FORDEL ETTER GEBYRKODE')
     A N29                                  CF11(11 'FORDEL ETTER VEKT')
     A                                      CF12(12)
     A N29                                  CF13(13 'ENDRE BILNR')
     A  42
     AO 45                                  CF14(14 'VAL/NOK,BRT/NET SWITCH')
     A                                      CF15(15 'FRISØK')
     A                                      CA19(19 'VELG MODULS')
     A                                      CF20(20 '1.GANG')
     A N50                                  CF21(21 'AVV.PERI')
     A N29                                  CF23(23 'IKKE FORDEL')
     A                                      CF24(24 'FLERE F-TASTER')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A          H                           HLPPNLGRP(SYKS030010 SYKS03PNL)
     A                                      HLPARA(20 002 20 032)
     A          H                           HLPPNLGRP(SYKS030020 SYKS03PNL)
     A                                      HLPARA(20 034 20 042)
     A          H                           HLPPNLGRP(SYKS030030 SYKS03PNL)
     A                                      HLPARA(20 044 20 048)
     A          H                           HLPPNLGRP(SYKS030040 SYKS03PNL)
     A                                      HLPARA(20 051 20 055)
     A          H                           HLPPNLGRP(SYKS030050 SYKS03PNL)
     A                                      HLPARA(20 058 20 079)
     A          H                           HLPPNLGRP(SYKS030060 SYKS03PNL)
     A                                      HLPARA(21 002 21 079)
     A          H                           HLPPNLGRP(SYKS030080 SYKS03PNL)
     A                                      HLPARA(22 002 22 018)
     A          H                           HLPPNLGRP(SYKS030090 SYKS03PNL)
     A                                      HLPARA(22 020 22 079)
     A          H                           HLPPNLGRP(SYKS030100 SYKS03PNL)
     A                                      HLPARA(23 001 23 079)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A            MSGN2K         7A  P
     A            MSGN2L         7A  P
     A            MSGN2M         7A  P
     A                                  1  2'SYSPED/SYKS03'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(020 DIV2174 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A            KALNR          8Y 0O  1 44EDTCDE(Z)
     A                                      DSPATR(HI)
     A            LNAVN         30A  O  1 54DSPATR(HI)
     A                                  1100DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1109TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(005 DIV2175 *LIBL/SYMSGF)
     A            UBNR2          7Y 0O  2  8TEXT('Endelig bilagsnr')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 16MSGCON(007 DIV2176 *LIBL/SYMSGF)
     A            WSBDT          6Y 0O  2 24TEXT('BILAGSDATO')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('      ')
     A                                  2 31MSGCON(013 JOV0384 *LIBL/SYMSGF)
     A            UBNR           7Y 0O  2 45TEXT('BILAGSNUMMER')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 53MSGCON(004 DIV2179 *LIBL/SYMSGF)
     A            ULNR           8Y 0O  2 58TEXT('LEVERANDØRSNR.')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 67MSGCON(007 DIV2177 *LIBL/SYMSGF)
     A            UPMN           2Y 0O  2 75TEXT('PERIODE-MÅNED')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            UPÅR           2Y 0O  2 78TEXT('PERIODE-ÅR')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(129 SHU1261 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N44N39                           4  2MSGCON(131 YBC0844 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  44N39                           4  2MSGCON(131 YBC0845 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A N44 39                           4  2MSGCON(131 YBC0846 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  44 39                           4  2MSGCON(131 YBC0847 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A N29        UVAL           3A  O 19 14COLOR(WHT)
     A N29        WSBLFD        13Y 2B 19 18EDTCDE(M)
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  90                                  DSPATR(HI)
     A N29                             19 44MSGCON(003 DIV2187 *LIBL/SYMSGF)
     A N29        WSKDPF         1A  B 19 48
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  88                                  DSPATR(HI)
     A N29                             19 51MSGCON(003 DIV2188 *LIBL/SYMSGF)
     A N29        WSKDM          1A  B 19 55
     A N96                                  COLOR(YLW)
     A  96                                  COLOR(WHT)
     A  87                                  DSPATR(HI)
     A                                 19 85MSGCON(010 JOV0342 *LIBL/SYMSGF)
     A            WBVAL          3A  O 19 97DSPATR(HI)
     A            WBBL          13Y 2O 19101EDTCDE(M)
     A                                      DSPATR(HI)
     A                                 20  9MSGCON(060 SHU1640 *LIBL/SYMSGF)
     A                                 20 85MSGCON(008 DIV2183 *LIBL/SYMSGF)
     A            WBBLF         13Y 2O 20101EDTCDE(M)
     A                                      DSPATR(HI)
     A            WNKONT         5Y 0B 21  9EDTCDE(Z)
     A            WNAVD          4Y 0B 21 15EDTCDE(Z)
     A            WNBAR          4Y 0B 21 20EDTCDE(Z)
     A            WNPRO          8Y 0B 21 25EDTCDE(Z)
     A N29                             21 44MSGCON(004 SHU1163 *LIBL/SYMSGF)
     A N29        WSPMN          2Y 0B 21 50EDTCDE(4)
     A                                      COLOR(YLW)
     A  97                                  DSPATR(RI)
     A N29        WSPÅR          2Y 0B 21 53EDTCDE(4)
     A                                      COLOR(YLW)
     A N29                             21 58'T'
     A N29        WSBILT        15A  B 21 61COLOR(YLW)
     A                                 21 85MSGCON(006 DIV2184 *LIBL/SYMSGF)
     A            WBBLD         13Y 2O 21101EDTCDE(M)
     A                                      DSPATR(HI)
     A N29        MSGT2K        18A  O 23  2MSGID(&MSGN2K SYMSGF)
     A                                      COLOR(BLU)
     A N29        MSGT2L        18A  O 23 22MSGID(&MSGN2L SYMSGF)
     A                                      COLOR(BLU)
     A N29        MSGT2M        18A  O 23 42MSGID(&MSGN2M SYMSGF)
     A                                      COLOR(BLU)
     A N29                             23 62MSGCON(018 DIV0029 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30 95N29                       24  2MSGCON(078 JOV0148 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A N30N95                          24 40'(C) COPYRIGHT  SYSTEMA A/S  1991  '
     A                                      COLOR(WHT)
