     A*__________________________
     A* SYSPED400 REGISTER FOR OMS./KOSTN. DB1 MM. FOR OPPDR/TUR.
     A*""""""""""""""""""""""""""
     A          R SYKS30WR
     A            WAVD           4S 0       COLHDG('AVD')
     A            WOPD           7S 0       COLHDG('OPPDR.NR')
     A            WSG            3          COLHDG('SIGN')
     A            WTUR           8S 0       COLHDG('TUR.NR')
     A            WTURHK         8S 0       COLHDG('HENTEKUNDE')
     A            WTURHO        20          COLHDG('HENTEOPPDR')
     A            WTANT          4S 0       COLHDG('TURENS ANT OPPDR.')
     A            WPER           4S 0       COLHDG('PERIODE')
     A            WFALI         13S 2       COLHDG('INNT FAKTURERT')
     A            WUFLI         13S 2       COLHDG('INNT.U-FAKTURERT')
     A            WIILIN        13S 2       COLHDG('INNT.I-LINJER')
     A            WFKOS         13S 2       COLHDG('KOSTN. FØRTE')
     A            WBKOS         13S 2       COLHDG('KOSTN. OPPD.BUDSJ.')
     A            WBÅ            1          COLHDG('Å=INKL.ÅPENT BILAG')
     A            WBTKOS        13S 2       COLHDG('KOSTN. TUR-BUDSJ.')
     A            WBP            1          COLHDG('P=INKL.PROS.BER. TUR')
     A            WBV            1          COLHDG('V=VEKTAND. AV TOTALL')
     A            WAVRS         13S 2       COLHDG('KOSTN. UFERD.AVREGN')
     A            WKILIN        13S 2       COLHDG('KOSTN. I-LINJER')
     A            WOMS          13S 2       COLHDG('OMSETNING')
     A            WKOS          13S 2       COLHDG('KOSTNAD')
     A            WRES          13S 2       COLHDG('RESULTAT')
     A            WDB1           5S 2       COLHDG('DB1 I %')
     A          K WAVD
     A          K WOPD
