     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A          R SUBFIL                    SFL
     A            WILI           5S 0H
     A*           WIOPD          5S 0H
     A            WIOPD          7S 0H
     A            WSNR           1A  I  5  2
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A                                      VALUES(' ' '4')
     A            WIAVD          4Y 0O  5  4EDTCDE(4)
     A            SFOPD          7Y 0O  5  9EDTCDE(4)
     A  50                                  COLOR(RED)
     A  51                                  COLOR(YLW)
     A            HEOT           2A  O  5 18
     A            HEFR           3A  O  5 21
     A            HESDL         20A  O  5 25
     A            WIVK           3A  O  5 64
     A            WIGRL     R        O  5 68REFFLD(WINTFR/WIGRL *LIBL/WINTF)
     A                                      EDTCDE(4)
     A            WIINT     R        O  5 74REFFLD(WINTFR/WIINT *LIBL/WINTF)
     A                                      EDTCDE(4)
     A            WIPPR     R        O  5 94REFFLD(WINTFR/WIPPR *LIBL/WINTF)
     A                                      EDTCDE(Z)
     A            WIBELØ    R        O  5 80REFFLD(WINTFR/WIBELØ *LIBL/WINTF)
     A                                      EDTCDE(2)
     A*           WITEGN    R        O  5 50REFFLD(WINTFR/WITEGN *LIBL/WINTF)
     A*           WIJUST    R        O  5 52REFFLD(WINTFR/WIJUST *LIBL/WINTF)
     A*                                     EDTCDE(2)
     A            SFTEXT        15A  O  5102
     A            SFBEL         11Y 2O  5120EDTCDE(4)
     A                                      COLOR(WHT)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0022)
     A                                      SFLPAG(0021)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF03(03 'Avslutt')
     A                                      CF05(05 'FORNY')
     A                                      CF07(07 'MODE')
     A                                      CF09(09 'MODE2')
     A                                      CF10(10 'GODKJENN')
     A                                      CF12(12 'Tilbake')
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                  1  2'SYSPED/SYKSIN'
     A                                      COLOR(BLU)
     A                                  1 51'Internoverføringer'
     A                                      DSPATR(HI)
     A            ZRECNO         4S 0O  1117SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 48'Totalbeløp:'
     A            TOTBEL        13Y 2O  2 60EDTCDE(J)
     A                                      COLOR(WHT)
     A                                  2124TIME
     A                                      COLOR(BLU)
     A                                  3  2'Valg'
     A                                      COLOR(BLU)
     A                                  3  8'4=Slette(el oppheve)'
     A                                      COLOR(BLU)
     A                                  3 71'------  Benyttet avtale/formel  ---
     A                                      ----'
     A                                      COLOR(WHT)
     A                                  4  1'Op Avd  OppdrNr  OT Fra Laste/Loss-
     A                                      ested                        Geb Gr-
     A                                      .la Interv    Pris........Per   Jus-
     A                                      t,M=Min/N=Max INTERN-BELAST'
     A                                      COLOR(WHT)
     A          R BUNN
     A            MSGNR          7A  P
     A                                 26  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 26 15'F5=Forny'
     A                                      COLOR(BLU)
     A            F7TXT         17A  O 26 27COLOR(BLU)
     A            F9TXT         17A  O 26 48COLOR(BLU)
     A                                 26 70'F10=Ferdigmeld'
     A                                      COLOR(BLU)
     A                                 26 90'F8/F12=Tilbake til utvalg'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             27 90'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R NYWRK
     A                                      CF03(03 'Avslutt')
     A                                      CF05(05 'FORNY')
     A                                      CF12(12 'Tilbake')
     A                                  1  2'SYSPED/SYKSIN'
     A                                      COLOR(BLU)
     A                                  1 51'Internoverføringer'
     A                                      DSPATR(HI)
     A                                  1124DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 48'Totalbeløp:'
     A            TOTBEL        13Y 2O  2 60EDTCDE(J)
     A                                      COLOR(WHT)
     A                                  2124TIME
     A                                      COLOR(BLU)
     A                                  3  2'Valg'
     A                                      COLOR(BLU)
     A                                  3  8'4=Slette(el oppheve)'
     A                                      COLOR(BLU)
     A                                  3 74'------  Benyttet avtale/formel  ---
     A                                      ----'
     A                                      COLOR(WHT)
     A                                  4  1'Op Avd  OppdrNr  OT Fra Laste/Loss-
     A                                      ested                        Geb Gr-
     A                                      .la Interv    Pris........Per   Jus-
     A                                      t,M=Min/N=Max INTERN-BELAST'
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A                                 26  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                 26 15'F5=Forny'
     A                                      COLOR(BLU)
     A                                 26 90'F8/F12=Tilbake til utvalg'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 27  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             27 90'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
