     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/KODTLK)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP(CA01)
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 11 45 *NOMSGLIN)
     A                                      OVERLAY
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  6  2VALUES(' ' '4')
     A            FSKODE    R        O  6  5REFFLD(FRISKKR/FSKODE *LIBL/FRISKK)
     A            FSSOK     R        O  6  9REFFLD(FRISKKR/FSSOK *LIBL/FRISKK)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      SFLSIZ(0006)
     A                                      SFLPAG(0005)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CA03(03 'Forrige')
     A                                      CF04(04 'SØK')
     A                                      CA05(05 'Frisk')
     A                                      CA12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            ZRECNO         4S 0O  3 20SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYKS64'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(15 YBC0255 SYMSGF)
     A                                      COLOR(WHT)
     A            UBILNR         7Y 0O  2  2EDTCDE(4)
     A                                  2 10'/'
     A            UBDATO         6Y 0O  2 12EDTCDE(Y)
     A                                  3  2MSGCON(20 YBC0253 SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(18 YBC0254 SYMSGF)
     A                                      COLOR(WHT)
     A            W2NR           1A  B  5  2VALUES(' ' '1')
     A                                      DSPATR(UL)
     A            W2KODE         3A  B  5  5DSPATR(UL)
     A  90                                  DSPATR(HI)
     A            W2SOK         15A  B  5  9DSPATR(UL)
     A  89                                  DSPATR(HI)
     A          R BUNN
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(11)
     A                                      CLRL(01)
     A                                      OVERLAY
     A N30                              1  2MSGCON(29 YBC0258 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        28A  O  1  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R NYWRK
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      CA03(03 'Forrige')
     A                                      CF04(04 'SØK')
     A                                      CA05(05 'Frisk')
     A                                      CA12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYKS64'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(15 YBC0255 SYMSGF)
     A                                      COLOR(WHT)
     A            UBILNR         7Y 0O  2  2EDTCDE(4)
     A                                  2 10'/'
     A            UBDATO         6Y 0O  2 12EDTCDE(Y)
     A                                  3  2MSGCON(20 YBC0253 SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(18 YBC0254 SYMSGF)
     A                                      COLOR(WHT)
     A            W2NR           1A  B  5  2VALUES(' ' '1')
     A                                      DSPATR(UL)
     A            W2KODE         3A  B  5  5DSPATR(UL)
     A  90                                  DSPATR(HI)
     A            W2SOK         15A  B  5  9DSPATR(UL)
     A  89                                  DSPATR(HI)
     A N30                             11  2MSGCON(29 YBC0258 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        28A  O 11  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
