     A          R HEAD                      SKIPB(2)
     A                                      HIGHLIGHT
     A                                    25MSGCON(40 JOV1123 SYMSGF)
     A                                      SPACEB(1)
     A            HEPRO          8  0     66
     A N88                                88MSGCON(11 JOV1124 SYMSGF)
     A N88                               100DATE EDTCDE(Y)
     A N88                               109TIME EDTCDE(Y)
     A  88                               100'Side'
     A  88        SIDE           3  0    105EDTCDE(Z)
     A  51                                 3MSGCON(020 SHU0556 *LIBL/SYMSGF)
     A  51                                  SPACEB(2)
     A  51                                  HIGHLIGHT
     A  51        WSGEIO         1A       26HIGHLIGHT
     A  51        WSGE01         3A       38HIGHLIGHT
     A  51        WSGE02         3A       42HIGHLIGHT
     A  51        WSGE03         3A       46HIGHLIGHT
     A  51        WSGE04         3A       50HIGHLIGHT
     A  51        WSGE05         3A       54HIGHLIGHT
     A  51        WSGE06         3A       58HIGHLIGHT
     A  51        WSGE07         3A       62HIGHLIGHT
     A  51        WSGE08         3A       66HIGHLIGHT
     A  51        WSGE09         3A       70HIGHLIGHT
     A  51        WSGE10         3A       74HIGHLIGHT
     A  51        WSGE11         3A       78HIGHLIGHT
     A  51        WSGE12         3A       82HIGHLIGHT
     A  51        WSGE13         3A       86HIGHLIGHT
     A*
     A  52                                 3MSGCON(020 JOV0906 *LIBL/SYMSGF)
     A  52                                  SPACEB(1)
     A  52                                  HIGHLIGHT
     A  52        WSSTIO         1A       26HIGHLIGHT
     A  52        WSSTGR        10A       38HIGHLIGHT
      *
     A          R HEADI                     SPACEB(2)
     A                                     1MSGCON(120 JOV1125 SYMSGF)
     A                                      HIGHLIGHT
     A                                      UNDERLINE
      * DETALJLINJER
     A          R DET                       SPACEB(1)
     A            FABELN        13  2      5EDTCDE(J)
     A            FAVK           3        27
     A            GEBTXT        10        31
     A            FAVAL          3        42
     A  50        FABELV        13  2     45EDTCDE(J)
S01  A*           FAFAKT         7  0     64EDTCDE(Z)
S01  A*           WSDATO         6  0     72EDTCDE(Y)
N01  A            FAFAKT         7  0     63EDTCDE(Z)
N01  A            WSDATO         6  0     71EDTCDE(Y)
     A            KUNLEV        20        80
     A            FAAVD          4  0    102EDTCDE(Z)
     A            FAOPD          7  0    107EDTCDE(Z)
N01  A            FAMND          2  0    115EDTCDE(Z)
N01  A                                   117'/'
N01  A            FAÅR           2  0    118EDTCDE(Z)
     A          R TOTINT                    SPACEB(2)
     A                                     3'SUM'
     A                                      HIGHLIGHT
     A            TOTI          13  2      5EDTCDE(J)
     A                                      HIGHLIGHT
      *
     A          R HEADK                     SPACEB(2)
     A                                     1MSGCON(120 JOV1126 SYMSGF)
     A                                      HIGHLIGHT
     A                                      UNDERLINE
      *
     A          R TOTKOS                    SPACEB(2)
     A                                      HIGHLIGHT
     A                                     3MSGCON(5 JOV1127 SYMSGF)
     A            TOTK          13  2      5EDTCDE(J)
     A          R TOTTOT                    SPACEB(2)
     A                                      HIGHLIGHT
     A                                     3MSGCON(40 JOV1128 SYMSGF)
     A            TOTR          13  2      5EDTCDE(J)
     A            DBPROS         5  2     44EDTCDE(J)
