     A                                      REF(SR)
     A          R SYKS04WR
     A            WFLN           5  0       COLHDG('LINJENR.')
     A            WFAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            WFOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            WFKN      R               REFFLD(KN)
     A                                      COLHDG('KUNDENR.')
     A            WFBL      R               REFFLD(BEL13)
     A                                      COLHDG('BELØP')
     A            WFB2      R               REFFLD(BEL13)
     A                                      COLHDG('BELØP-2')
     A            WFBT      R               REFFLD(BEL13)
     A                                      COLHDG('BELØP-T')
     A            WFVK      R               REFFLD(VKT9)
     A                                      COLHDG('VEKT')
     A          K WFLN
