     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R VARELI
     A                                      CA12(12 'Forrige')
     A                                      OVERLAY
     A                                  1  4'SYSPED/SYKS60'
     A                                      COLOR(BLU)
     A                                  1 22'Print budget without costs receive-
     A                                      d'
     A                                  1 66DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 66TIME
     A                                      COLOR(BLU)
     A                                  6  4'From month/year...........:'
     A            MNDF           2Y 0B  6 33RANGE(1 12)
     A                                      EDTCDE(4)
     A            AARF           2Y 0B  6 36EDTCDE(4)
     A                                  7  4'To month/year.............:'
     A            MNDT           2Y 0B  7 33RANGE(1 12)
     A                                      EDTCDE(4)
     A            AART           2Y 0B  7 36EDTCDE(4)
     A                                  8  4'Include/omit(I/O)'
     A                                  8 22'feecodes:'
     A            IO             1A  B  8 33VALUES('I' 'O' ' ')
     A            FEE01          3A  B  8 36
     A            FEE02          3A  B  8 40
     A            FEE03          3A  B  8 44
     A            FEE04          3A  B  8 48
     A            FEE05          3A  B  8 52
     A            FEE06          3A  B  8 56
     A            FEE07          3A  B  8 60
     A            FEE08          3A  B  8 64
     A            FEE09          3A  B  8 68
     A            FEE10          3A  B  8 72
     A                                 11  4'Printer for output........:'
     A            PRINTE        10   B 11 33
     A                                 23  4'F12=return'
     A                                      COLOR(BLU)
