     A*%%TS  SD  20160318  124145  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R SUBFIL                    SFL
     A*%%TS  SD  20160318  124145  SVEIN       REL-V7R1M0  5770-WDS
     A            WSNR           1A  I  4  4VALUES(' ' '1')
     A            KONTO          5Y 0O  4  6TEXT('KONTO')
     A            KONTNA        30A  O  4 12TEXT('NAVN')
     A            MVAO           1A  O  4 45TEXT('MVA')
     A            MVAOK          9A  O  4 47
     A            STEDK          1A  O  4 60
     A            BARERK         1A  O  4 65
     A            PROSJK         1A  O  4 70
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20160318  124145  SVEIN       REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 57SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYNA09'
     A                                      COLOR(BLU)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 71TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 16MSGCON(040 SHU1661 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  3MSGCON(100 SHU1662 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R BUNN
     A*%%TS  SD  20160318  124145  SVEIN       REL-V7R1M0  5770-WDS
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'Avslutt program')
     A                                      CF08(08 'SØK')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A  98        MSG205        78A  O  4  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R VAREL2
     A*%%TS  SD  20160318  124145  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            WKONT          5  0B  2  2
     A                                      DSPATR(PC)
     A                                  1  2MSGCON(040 SHU1663 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R NYVARE
     A                                  1  2'SYSPED/SYNA09'
     A                                      COLOR(BLU)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 71TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 16MSGCON(040 SHU1661 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
