     A*%%TS  SD  20160309  143116  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R SUBFIL                    SFL
     A*%%TS  SD  20160309  135848  SVEIN       REL-V7R1M0  5770-WDS
     A            NAVKO3         5S 0H
     A            NAVKO4         5S 0H
     A            NAVKO5         5S 0H
     A            NAVKO6         5S 0H
     A            NAVKO7         5S 0H
     A            NAVKO8         5S 0H
     A            NAVAV3         4S 0H
     A            NAVAV4         4S 0H
     A            NAVAV5         4S 0H
     A            NAVAV6         4S 0H
     A            NAVAV7         4S 0H
     A            NAVAV8         4S 0H
     A            NAVBA3         4S 0H
     A            NAVBA4         4S 0H
     A            NAVBA5         4S 0H
     A            NAVBA6         4S 0H
     A            NAVBA7         4S 0H
     A            NAVBA8         4S 0H
     A            NAVPR3         8S 0H
     A            NAVPR4         8S 0H
     A            NAVPR5         8S 0H
     A            NAVPR6         8S 0H
     A            NAVPR7         8S 0H
     A            NAVPR8         8S 0H
     A            WSNR           1A  I  4  4VALUES(' ' '2')
     A            LEVNR          8Y 0O  4 12TEXT('Kundenummer')
     A                                      EDTCDE(4)
     A            LNAVN         30A  O  4 21TEXT('Kundenavn')
     A            NAVKO1         5Y 0O  4 52EDTCDE(Z)
     A            NAVKO2         5Y 0O  4 58EDTCDE(Z)
     A            NAVAV1         4Y 0O  4 64EDTCDE(Z)
     A            NAVAV2         4Y 0O  4 69EDTCDE(Z)
     A            NAVBA1         4Y 0O  4 74EDTCDE(Z)
     A            NAVBA2         4Y 0O  4 79EDTCDE(Z)
     A            NAVPR1         8Y 0O  4 85EDTCDE(Z)
     A            NAVPR2         8Y 0O  4 94EDTCDE(Z)
     A            NAVSG          3A  O  4105
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20160309  132030  SVEIN       REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 57SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYNA03'
     A                                      COLOR(BLU)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 71TIME
     A                                      COLOR(BLU)
     A                                  1 16MSGCON(040 SHU1627 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(125 SHU1628 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R BUNN
     A*%%TS  SD  20160304  071339  SVEIN       REL-V7R1M0  5770-WDS
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF08(08 'SØK')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A  98        MSG205        78A  O  4  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 42MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R VARELI
     A*%%TS  SD  20160309  143116  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A            LEVNR          8Y 0O  2  8TEXT('Kundenummer')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            LNAVN         30A  O  2 21COLOR(WHT)
     A            WSKON1         5Y 0B  2 52EDTCDE(Z)
     A N30
     AO 72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A            WSKON2         5Y 0B  2 58EDTCDE(Z)
     A  73                                  DSPATR(RI)
     A  73                                  DSPATR(PC)
     A            WSKON3         5Y 0B  2 64EDTCDE(Z)
     A  74                                  DSPATR(RI)
     A  74                                  DSPATR(PC)
     A            WSKON4         5Y 0B  2 70EDTCDE(Z)
     A  75                                  DSPATR(RI)
     A  75                                  DSPATR(PC)
     A            WSKON5         5Y 0B  2 76EDTCDE(Z)
     A  76                                  DSPATR(RI)
     A  76                                  DSPATR(PC)
     A            WSKON6         5Y 0B  2 82EDTCDE(Z)
     A  77                                  DSPATR(RI)
     A  77                                  DSPATR(PC)
     A            WSKON7         5Y 0B  2 88EDTCDE(Z)
     A  78                                  DSPATR(RI)
     A  78                                  DSPATR(PC)
     A            WSKON8         5Y 0B  2 94EDTCDE(Z)
     A  79                                  DSPATR(RI)
     A  79                                  DSPATR(PC)
     A            WSSG           3A  B  2105
     A  71                                  DSPATR(RI)
     A  71                                  DSPATR(PC)
     A            WSAVD1         4Y 0B  3 52EDTCDE(Z)
     A            WSAVD2         4Y 0B  3 58EDTCDE(Z)
     A            WSAVD3         4Y 0B  3 64EDTCDE(Z)
     A            WSAVD4         4Y 0B  3 70EDTCDE(Z)
     A            WSAVD5         4Y 0B  3 76EDTCDE(Z)
     A            WSAVD6         4Y 0B  3 82EDTCDE(Z)
     A            WSAVD7         4Y 0B  3 88EDTCDE(Z)
     A            WSAVD8         4Y 0B  3 94EDTCDE(Z)
     A            WSBAR1         4Y 0B  4 52EDTCDE(Z)
     A            WSBAR2         4Y 0B  4 58EDTCDE(Z)
     A            WSBAR3         4Y 0B  4 64EDTCDE(Z)
     A            WSBAR4         4Y 0B  4 70EDTCDE(Z)
     A            WSBAR5         4Y 0B  4 76EDTCDE(Z)
     A            WSBAR6         4Y 0B  4 82EDTCDE(Z)
     A            WSBAR7         4Y 0B  4 88EDTCDE(Z)
     A            WSBAR8         4Y 0B  4 94EDTCDE(Z)
     A            WSPRO1         8Y 0B  5 52EDTCDE(Z)
     A            WSPRO2         8Y 0B  5 61EDTCDE(Z)
     A            WSPRO3         8Y 0B  5 70EDTCDE(Z)
     A            WSPRO4         8Y 0B  5 79EDTCDE(Z)
     A            WSPRO5         8Y 0B  5 88EDTCDE(Z)
     A            WSPRO6         8Y 0B  5 97EDTCDE(Z)
     A            WSPRO7         8Y 0B  5106EDTCDE(Z)
     A            WSPRO8         8Y 0B  5115EDTCDE(Z)
     A                                  1  2MSGCON(120 SHU1636 *LIBL/SYMSGF)
     A                                  3 38MSGCON(011 SHU1637 *LIBL/SYMSGF)
     A                                  4 38MSGCON(011 SHU1638 *LIBL/SYMSGF)
     A                                  5 38MSGCON(011 SHU1639 *LIBL/SYMSGF)
     A          R VAREL2
     A*%%TS  SD  20160304  083553  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                  1  2MSGCON(040 SHU1629 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            SONV          10   B  2  2DSPATR(PC)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R NYVARE
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF08(08 'SØK')
     A                                  1  2'SYSPED/SYNA03'
     A                                      COLOR(BLU)
     A                                  1 71DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 71TIME
     A                                      COLOR(BLU)
     A                                  1 16MSGCON(040 SHU1627 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(078 SHU1628 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
