     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP(CA01)
     A          R BILDE01
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'Søk')
     A                                      CF10(10 'ARKIV')
     A                                      CF12(12 'Forrige')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYOPDO'
     A                                      COLOR(BLU)
     A                                  1 18MSGCON(040 SHU0775 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(018 SHU0785 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 26MSGCON(050 SHU0853 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(015 SHU0776 *LIBL/SYMSGF)
     A            WSSTFB         1A  B  4 18
     A  70                                  DSPATR(ND)
     A  70                                  DSPATR(PR)
     A                                  5  2MSGCON(015 SHU0777 *LIBL/SYMSGF)
     A            WSTDIM         1A  B  5 18
     A  71                                  DSPATR(ND)
     A  71                                  DSPATR(PR)
     A                                  6  2MSGCON(015 SHU0778 *LIBL/SYMSGF)
     A            WSTDEX         1A  B  6 18
     A  72                                  DSPATR(ND)
     A  72                                  DSPATR(PR)
     A                                  7  2MSGCON(015 SHU0779 *LIBL/SYMSGF)
     A            WSTRMA         1A  B  7 18
     A  73                                  DSPATR(ND)
     A  73                                  DSPATR(PR)
     A                                  8  2MSGCON(015 SHU0780 *LIBL/SYMSGF)
     A            WSTRTE         1A  B  8 18
     A  74                                  DSPATR(ND)
     A  74                                  DSPATR(PR)
     A                                  9  2MSGCON(015 SHU0781 *LIBL/SYMSGF)
     A            WSTADL         1A  B  9 18
     A  75                                  DSPATR(ND)
     A  75                                  DSPATR(PR)
     A                                 10  2MSGCON(015 SHU0782 *LIBL/SYMSGF)
     A            WSCMRF         1A  B 10 18
     A  76                                  DSPATR(ND)
     A  76                                  DSPATR(PR)
     A                                 11  2MSGCON(015 SHU0783 *LIBL/SYMSGF)
     A            WSBILS         1A  B 11 18
     A  79                                  DSPATR(ND)
     A  79                                  DSPATR(PR)
     A                                 12  2MSGCON(015 SHU0784 *LIBL/SYMSGF)
     A            WSAWB          1A  B 12 18
     A  78                                  DSPATR(ND)
     A  78                                  DSPATR(PR)
     A            WS01A         15A  O 13  2
     A            WS01B         76A  O 14  2
     A            WS02A         15A  O 15  2
     A            WS02B         76A  O 16  2
     A            WS03A         15A  O 17  2
     A            WS03B         76A  O 18  2
     A            WS04A         15A  O 19  2
     A            WS04B         76A  O 20  2
     A            WS05A         15A  O 21  2
     A            WS05B         76A  O 22  2
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 SHU1038 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            WSBILL         1A  B 11 49
     A  77                                  DSPATR(ND)
     A  77                                  DSPATR(PR)
     A                                 11 22MSGCON(025 JOV1440 *LIBL/SYMSGF)
