     A          R SYPARFR                   PFILE(SYPARF)
     A          K SYKUNR
     A          K SYPAID
N11  A          K SYVRDA
N11  A          K SYVRDN
