     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R BILDE1
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF12(03)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYPA03'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 JOV0594 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                  2 67TIME
     A                                  3  2MSGCON(030 JOV0832 *LIBL/SYMSGF)
     A            WSLØNR    R        B  3 33REFFLD(PALFIRR/PFLØNR *LIBL/PALFIR)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  3 42MSGCON(035 JOV0599 *LIBL/SYMSGF)
     A                                  4  2MSGCON(030 JOV0833 *LIBL/SYMSGF)
     A            WSPKKR    R        B  4 33REFFLD(PALFIRR/PFBTAB *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A                                      TEXT('Krav om pkvitt.nr')
     A                                      VALUES('J' 'N' ' ')
     A                                  4 35'(J/N)'
     A                                  4 42MSGCON(005 JOV0600 *LIBL/SYMSGF)
     A            WSOAVD    R        B  4 48REFFLD(PALFIRR/PFOAVD *LIBL/PALFIR)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  4 53MSGCON(010 JOV0604 *LIBL/SYMSGF)
     A            WSBTAB    R        B  4 64REFFLD(PALFIRR/PFBTAB *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A                                  4 67MSGCON(010 JOV0603 *LIBL/SYMSGF)
     A            WSVK      R        B  4 78REFFLD(PALFIRR/PFVK *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A                                  5  2MSGCON(030 JOV0596 *LIBL/SYMSGF)
     A            WSPUNR    R        B  5 33REFFLD(PALFIRR/PFPUNR *LIBL/PALFIR)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  5 42MSGCON(030 JOV0831 *LIBL/SYMSGF)
     A            WSBUNR    R        B  5 74REFFLD(PALFIRR/PFPUNR *LIBL/PALFIR)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                      TEXT('Neste Buntnr')
     A                                  6  2MSGCON(030 JOV0597 *LIBL/SYMSGF)
     A            WSHT1     R        B  7  2REFFLD(PALFIRR/PFHT1 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSHT2     R        B  8  2REFFLD(PALFIRR/PFHT2 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSHT3     R        B  9  2REFFLD(PALFIRR/PFHT3 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSHT4     R        B 10  2REFFLD(PALFIRR/PFHT4 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSHT5     R        B 11  2REFFLD(PALFIRR/PFHT5 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSHT6     R        B 12  2REFFLD(PALFIRR/PFHT6 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSHT7     R        B 13  2REFFLD(PALFIRR/PFHT7 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A                                 14  2MSGCON(030 JOV0598 *LIBL/SYMSGF)
     A            WSPT1     R        B 15  2REFFLD(PALFIRR/PFPT1 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSPT2     R        B 16  2REFFLD(PALFIRR/PFPT2 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSPT3     R        B 17  2REFFLD(PALFIRR/PFPT3 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSPT4     R        B 18  2REFFLD(PALFIRR/PFPT4 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSPT5     R        B 19  2REFFLD(PALFIRR/PFPT5 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSPT6     R        B 20  2REFFLD(PALFIRR/PFPT6 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A            WSPT7     R        B 21  2REFFLD(PALFIRR/PFPT7 *LIBL/PALFIR)
     A                                      COLOR(YLW)
     A                                 22  2MSGCON(030 JOV0490 *LIBL/SYMSGF)
     A            WSPRIN        10A  B 22 34COLOR(YLW)
     A                                 22 46'Manipulering av partsnr ved auto..-
     A                                      :'
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            WSKSIF         1A  B 23 34COLOR(YLW)
     A                                      VALUES(' ' '1' '2' '3' '4' '5' '6' -
     A                                      '7' '8' '9')
     A                                 23 36'i'
     A            WSKPOS         1A  B 23 38COLOR(YLW)
     A                                      VALUES(' ' '4' '5' '6' '7' '8')
     A                                 23 40'.tegn bakfra'
     A                                 23 54'Transp.:'
     A            WSTSIF         1A  B 23 63COLOR(YLW)
     A                                      VALUES(' ' '1' '2' '3' '4' '5' '6' -
     A                                      '7' '8' '9')
     A                                 23 65'i'
     A            WSTPOS         1A  B 23 67COLOR(YLW)
     A                                      VALUES(' ' '4' '5' '6' '7' '8')
     A                                 23 69'.tegn bakfra'
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                 23 26'Kunde:'
