     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/PAPA)
     A                                      PRINT
     A                                      CF03(03 'Exit')
     A                                      ALTHELP(CA01)
     A                                      HELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
     A          R SEPART
     A                                      WINDOW(*DFT 18 70)
     A                                      CF12(12 'Returner uten oppdatering')
     A                                      OVERLAY
     A                                      PUTOVR
     A                                      OVRDTA
     A                                      OVRATR
     A                                  1  2'SYSPED/SYPA04B'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(040 JOV0989 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(018 JOV0590 *LIBL/SYMSGF)
     A            PPNR      R        O  3 21REFFLD(PPNR)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            PPNAVN    R        O  3 32REFFLD(PPNAVN)
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(018 JOV0605 *LIBL/SYMSGF)
     A            PPKUNR    R        O  4 21REFFLD(PPKUNR)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(018 JOV0947 *LIBL/SYMSGF)
     A            PPTRNR    R        O  5 21REFFLD(PPKUNR)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  6  2MSGCON(018 JOV0625 *LIBL/SYMSGF)
     A            PPKATE    R        O  6 21REFFLD(PAPAR/PPKATE *LIBL/PAPA)
     A                                      COLOR(WHT)
     A                                  8  2MSGCON(018 JOV0951 *LIBL/SYMSGF)
     A                                  9  2MSGCON(018 JOV0949 *LIBL/SYMSGF)
     A            PPSPDT    R        O  9 22REFFLD(PAPAR/PPSPDT *LIBL/PAPA)
     A                                      EDTWRD('    .  .  ')
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(018 JOV0952 *LIBL/SYMSGF)
     A            PPSTDT    R        O 10 22REFFLD(PAPAR/PPSTDT *LIBL/PAPA)
     A                                      EDTWRD('    .  .  ')
     A                                      COLOR(WHT)
     A                                 11  2MSGCON(018 JOV0950 *LIBL/SYMSGF)
     A            PPSALP    R        O 11 21REFFLD(PAPAR/PPSALP *LIBL/PAPA)
     A                                      EDTCDE(J)
     A                                      COLOR(WHT)
     A                                 13  2MSGCON(018 JOV0608 *LIBL/SYMSGF)
     A            PPSALT    R        O 13 21REFFLD(PAPAR/PPSALT *LIBL/PAPA)
     A                                      EDTCDE(J)
     A                                      COLOR(WHT)
     A                                 15  2MSGCON(018 JOV0610 *LIBL/SYMSGF)
     A            PPSADT    R        O 15 22REFFLD(PAPAR/PPSADT *LIBL/PAPA)
     A                                      EDTWRD('    .  .  ')
     A                                      COLOR(WHT)
     A                                 16  2MSGCON(018 JOV0609 *LIBL/SYMSGF)
     A            PPAVRE    R        O 16 21REFFLD(PAPAR/PPAVRE *LIBL/PAPA)
     A                                      EDTCDE(J)
     A                                      COLOR(WHT)
     A                                 17  2MSGCON(012 BBA0015 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
