     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('VEDLGRP1' 'HELPNU' 'HLP400')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'søking i registre')
     A                                  1  2'SYSPED/SYPO03'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0060 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                 11  2MSGCON(025 SHU0031 *LIBL/SYMSGF)
     A            BAKDEP    R        B 11 28REFFLD(BASEKR/BAKDEP *LIBL/BASEK)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  7  3VALUES(' ' '2' '4')
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A            BAKLKF    R        O  7  6REFFLD(BASEKR/BAKLKF *LIBL/BASEK)
     A            BAKPNF    R        O  7  9REFFLD(BASEKR/BAKPNF *LIBL/BASEK)
     A            FLD001        30A  O  7 16
     A            BAKKNR    R        O  7 52REFFLD(BASEKR/BAKKNR *LIBL/BASEK)
     A            BAKALT    R        O  7 66REFFLD(BASEKR/BAKALT *LIBL/BASEK)
     A                                      EDTCDE(4)
     A            BAKALA    R        O  7 73REFFLD(BASEKR/BAKALA *LIBL/BASEK)
     A                                      EDTCDE(4)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A            ZRECNO         4S 0O  3 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYPO03'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0060 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 19MSGCON(012 DIV0050 *LIBL/SYMSGF)
     A            BAKDEP    R        O  2 32REFFLD(BASEKR/BAKDEP *LIBL/BASEK)
     A                                      COLOR(WHT)
     A            KOANVN        33A  O  2 37COLOR(WHT)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(078 SHU0061 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R BUNN
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORRIGE')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  2  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 21MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 40MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 59MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98        MSG206        78A  O  4  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VARELI
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                  1  2MSGCON(078 SHU0061 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSKLKF    R        B  2  8REFFLD(BASEKR/BAKLKF *LIBL/BASEK)
     A                                      DSPATR(UL)
     A  40                                  DSPATR(PR)
     A N40N30
     AO 90                                  DSPATR(PC)
     A  90                                  DSPATR(RI)
     A  40                                  COLOR(WHT)
     A N40                                  COLOR(GRN)
     A            WSKPNF    R        B  2 11REFFLD(BASEKR/BAKPNF *LIBL/BASEK)
     A                                      DSPATR(UL)
     A  40                                  DSPATR(PC)
     A            WSKKNR    R        B  2 52REFFLD(BASEKR/BAKKNR *LIBL/BASEK)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSKALT    R        B  2 66REFFLD(BASEKR/BAKALT *LIBL/BASEK)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSKALA    R        B  2 73REFFLD(BASEKR/BAKALA *LIBL/BASEK)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R VAREL2
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                  2  2MSGCON(012 DIV0026 *LIBL/SYMSGF)
     A            W2KLKF    R        I  2 15REFFLD(BASEKR/BAKLKF *LIBL/BASEK)
     A            W2KPNF    R        I  2 18REFFLD(BASEKR/BAKPNF *LIBL/BASEK)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                  1  2MSGCON(078 SHU0061 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            BAKLKF    R        O  2  6REFFLD(BASEKR/BAKLKF *LIBL/BASEK)
     A            BAKPNF    R        O  2  9REFFLD(BASEKR/BAKPNF *LIBL/BASEK)
     A            BAKKNR    R        O  2 51REFFLD(BASEKR/BAKKNR *LIBL/BASEK)
     A            BAKALT    R        O  2 67REFFLD(BASEKR/BAKALT *LIBL/BASEK)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R NYVARE
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORRIGE')
     A                                  1  2'SYSPED/SYPO03'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0060 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 72DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 19MSGCON(012 DIV0050 *LIBL/SYMSGF)
     A            BAKDEP    R        O  2 32REFFLD(BASEKR/BAKDEP *LIBL/BASEK)
     A                                      COLOR(WHT)
     A            KOANVN        33   O  2 37COLOR(WHT)
     A                                  2 72TIME
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  6  2MSGCON(078 SHU0061 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 40MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 59MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98        MSG206        78A  O 24  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
