     A*****************************************************************
     A*             F R A K T A V T A L E R   L I S T E               *
     A* ANTALL LINJE=72,  ANTALL TEGN PR. LINJE=80,  OVERFLOW=72      *
     A*****************************************************************
     A          R HEADER
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A  88                              3  1'¤&l'
     A  88        COPY           2  0   3  4
     A  88                              3  6'X'
     A  88                              3  7'¤&a-3R'
     A  88                              3 13'¤(12U¤(s0p10h0s3b4099T'
     A            HOHT1         80      4  1
     A            HOHT2         80      5  1
     A            HOHT3         80      6  1
     A            HOHT4         80      7  1
     A            HOHT5         80      8  1
     A            HOHT6         80      9  1
     A            HOHT7         80     10  1
     A                                 13  2'KUNDEAVTALER FRAKTREGISTER'
     A                                 13 41MSGCON(15 DIV0754 SYMSGF)
     A                                 13 58DATE EDTCDE(Y)
     A                                 14  2MSGCON(20 SHU0098 SYMSGF)
     A            AFAVNR         9  0  14 24EDTCDE(3)
     A N27                             15  2MSGCON(12 DIV0751 SYMSGF)
     A N27        AFKUND         8  0  15 16EDTCDE(3)
     A N27        KNAVN         30A    15 26
     A N27        ADR1          30A    16 26
     A N27        XADR3         30A    17 26
     A                                 19  2MSGCON(12 SHU0161 SYMSGF)
     A            AFPROD         1A    19 16
     A                                 19 18MSGCON(12 DIV0050 SYMSGF)
     A            AFAVDE         4  0  19 32
     A                                 19 50MSGCON(20 SHU0094 SYMSGF)
     A            AFTYPE         1     19 72
     A                                 20  2MSGCON(25 SHU0182 SYMSGF)
     A            PRDAT1         6  0  20 32EDTCDE(Y)
     A                                 20 40'-'
     A            PRDAT2         6  0  20 41EDTCDE(Y)
     A                                 21  2MSGCON(13 DIV0752 SYMSGF)
     A            AFFRAN         3A    21 18
     A  40                             21 26MSGCON(54 DIV5029 SYMSGF)
     A  41                             21 26MSGCON(54 DIV5030 SYMSGF)
     A  42                             21 26MSGCON(54 DIV5031 SYMSGF)
     A                                 22  2MSGCON(24 DIV1684 SYMSGF)
     A            BETTXT        30     22 32
     A N43                             23  2MSGCON(13 YBC0062 SYMSGF)
     A N43        AFGEBY         3A    23 18
     A N43        KGENOT        20A    23 26
     A  43                             23  2MSGCON(30 YBC0063 SYMSGF)
     A  88                             24  1'¤*c2800A¤*c220B¤*c11G¤*c2P'
     A N88                             24  2'----------------------------------'
     A N88                             24 36'----------------------------------'
     A N88                             24 70'--------'
     A*
     A                                 25  2MSGCON(5 DIV0777 SYMSGF)
     A            AFLKFR         2A    25  8
     A                                 25 11MSGCON(7 SHU0177 SYMSGF)
     A            AFPNF1         5A    25 19
     A                                 25 24'-'
     A            AFPNF2         5A    25 25
     A                                 25 32MSGCON(5 DIV0778 SYMSGF)
     A            AFLKTI         2A    25 38
     A                                 25 41MSGCON(7 SHU0177 SYMSGF)
     A            AFPNT1         5A    25 49
     A                                 25 54'-'
     A            AFPNT2         5A    25 55
     A N52N53                          26  2MSGCON(17 SHU0181 SYMSGF)
     A N52N53                          26 21MSGCON(16 SHU0178 SYMSGF)
     A N52N53     AFOMRL         5  0  26 41EDTCDE(Z)
     A N52N53                          26 48MSGCON(10 SHU0180 SYMSGF)
     A N52N53                          27 21MSGCON(16 SHU0179 SYMSGF)
     A N52N53     AFOMRM         5  0  27 41EDTCDE(Z)
     A N52N53                          27 48MSGCON(10 SHU0180 SYMSGF)
     A                                 28  7MSGCON(35 DIV0771 SYMSGF)
     A  41                             28 67MSGCON(10 DIV5040 SYMSGF)
     A  42                             28 67MSGCON(10 DIV5039 SYMSGF)
     A N88                             29  2'----------------------------------'
     A N88                             29 36'----------------------------------'
     A N88                             29 70'--------'
     A  88                             29  1' '
     A*
     A          R DETALJ                    SPACEB(1)
     A    N52N53  XINTF          9  0      2EDTCDE(3)
     A  52
     AO 53        XINTFM         7  2      2EDTCDE(3)
     A    N52N53  AFVEKT         9  0     12EDTCDE(3)
     A  52
     AO 53        AFVEKM         7  2     12EDTCDE(3)
     A            AFVALK         3        23
     A            AFPRIA        13  2     26EDTCDE(3)
     A    N55                             48MSGCON(5 DIV0772 SYMSGF)
     A     55                             48MSGCON(3 DIV5044 SYMSGF)
     A  55N52N53  AFPRPR         5  0     52EDTCDE(3)
     A  52 55
     AO 53 55     XPRPR          4  2     52EDTCDE(3)
     A  51 55                             58MSGCON(5 DIV5033 SYMSGF)
     A  52 55                             58MSGCON(5 DIV5034 SYMSGF)
     A  53 55                             58MSGCON(5 DIV5035 SYMSGF)
     A  54 55                             52MSGCON(5 DIV5036 SYMSGF)
     A  41
     AO 42        AMIMAP        13  2     64EDTCDE(4)
     A*
N02  A          R DETALJP                   SPACEB(1)
     A                                     2MSGCON(14 SHU1293 SYMSGF)
N02  A            AFPFRA         5  2     16EDTCDE(J)
N02  A                                    24'%'
     A          R INKLUH1                   SPACEB(2)
     A                                     2MSGCON(40 SHU0163 SYMSGF)
     A                                     2'__________________________________'
     A          R INKLUH2
     A                                    36'_____'
     A*
     A          R INKLUD                    SPACEB(1)
     A            KGENOT        20         2
     A*
     A          R TOTLI1                    SPACEB(3)
     A                                     2MSGCON(70 SHU0197 SYMSGF)
     A          R TOTLI2                    SPACEB(1)
     A                                     2MSGCON(70 SHU0198 SYMSGF)
