     A*%%TS  SD  20130904  105218  SVEIN       REL-V7R1M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P8068A* 04 TH  PTF8 NY HELPFUNKSJON  KUN DDS
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYPO31PNL)
     A                                      HLPTITLE('POSTAL FRAKTBEREGNING - E-
     A                                      NDRING AV PRISER I PROSENT')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A*%%TS  SD  20130904  105218  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'søking kunder')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  3'SYSPED/SYPO31'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(040 SHU0269 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  2  3MSGCON(073 JOV1550 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                  3  8MSGCON(073 JOV1551 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                  5  3MSGCON(020 SHU0270 *LIBL/SYMSGF)
     A            PLUMIN         1A  B  5 25
     A  67                                  DSPATR(HI)
     A            WSPROS         5Y 2B  5 28EDTCDE(J)
     A  99                                  DSPATR(HI)
     A                                      COMP(GT ,00)
     A                                  5 39MSGCON(018 SHU1074 *LIBL/SYMSGF)
     A            WSNULL         1A  B  5 59VALUES(' ' 'J' 'N')
     A                                  6  3MSGCON(020 SHU0496 *LIBL/SYMSGF)
     A            WAFRAV         1Y 0B  6 25EDTCDE(4)
     A  66                                  DSPATR(HI)
     A                                  6 39MSGCON(039 SHU1075 *LIBL/SYMSGF)
     A                                  7  3MSGCON(020 SHU0271 *LIBL/SYMSGF)
     A            WSKUND         8Y 0B  7 25EDTCDE(4)
     A  98                                  DSPATR(HI)
     A                                  7 39MSGCON(039 SHU1076 *LIBL/SYMSGF)
     A            WSIKKE         1A  B  7 79VALUES(' ' 'J' 'N')
     A                                  8  3MSGCON(020 JOV1549 *LIBL/SYMSGF)
     A            WSIKFR         8Y 0B  8 25EDTCDE(4)
     A  64                                  DSPATR(HI)
     A                                  8 34'-'
     A            WSIKTI         8Y 0B  8 36EDTCDE(4)
     A  64                                  DSPATR(HI)
     A                                  9  3MSGCON(020 SHU0272 *LIBL/SYMSGF)
     A            WSLF01         2A  B  9 25
     A  97                                  DSPATR(HI)
     A            WSLF02         2A  B  9 28
     A  96                                  DSPATR(HI)
     A            WSLF03         2A  B  9 31
     A  95                                  DSPATR(HI)
     A            WSLF04         2A  B  9 34
     A  94                                  DSPATR(HI)
     A            WSLF05         2A  B  9 37
     A  93                                  DSPATR(HI)
     A            WSLF06         2A  B  9 40
     A  92                                  DSPATR(HI)
     A            WSLF07         2A  B  9 43
     A  91                                  DSPATR(HI)
     A            WSLF08         2A  B  9 46
     A  90                                  DSPATR(HI)
     A            WSLF09         2A  B  9 49
     A  89                                  DSPATR(HI)
     A            WSLF10         2A  B  9 52
     A  88                                  DSPATR(HI)
     A            WSLF11         2A  B  9 55
     A  87                                  DSPATR(HI)
     A            WSLF12         2A  B  9 58
     A  86                                  DSPATR(HI)
     A                                 10  3MSGCON(020 SHU0978 *LIBL/SYMSGF)
     A            WSTABF         2A  B 10 25
     A                                 11  3MSGCON(020 SHU0273 *LIBL/SYMSGF)
     A            WSLT01         2A  B 11 25
     A  85                                  DSPATR(HI)
     A            WSLT02         2A  B 11 28
     A  84                                  DSPATR(HI)
     A            WSLT03         2A  B 11 31
     A  83                                  DSPATR(HI)
     A            WSLT04         2A  B 11 34
     A  82                                  DSPATR(HI)
     A            WSLT05         2A  B 11 37
     A  81                                  DSPATR(HI)
     A            WSLT06         2A  B 11 40
     A  80                                  DSPATR(HI)
     A            WSLT07         2A  B 11 43
     A  79                                  DSPATR(HI)
     A            WSLT08         2A  B 11 46
     A  78                                  DSPATR(HI)
     A            WSLT09         2A  B 11 49
     A  77                                  DSPATR(HI)
     A            WSLT10         2A  B 11 52
     A  76                                  DSPATR(HI)
     A            WSLT11         2A  B 11 55
     A  75                                  DSPATR(HI)
     A            WSLT12         2A  B 11 58
     A  74                                  DSPATR(HI)
     A                                 12  3MSGCON(020 SHU0978 *LIBL/SYMSGF)
     A            WSTABT         2A  B 12 25
     A                                 13  3MSGCON(020 SHU0274 *LIBL/SYMSGF)
     A            WSHOVE         1A  B 13 25VALUES(' ' 'J' 'N')
     A  65                                  DSPATR(HI)
     A                                 13 28MSGCON(017 SHU1403 *LIBL/SYMSGF)
     A            MFRADT         6Y 0B 13 46EDTCDE(Z)
     A  62                                  DSPATR(RI)
     A                                 13 55MSGCON(009 SHU1404 *LIBL/SYMSGF)
     A            MTILDT         6Y 0B 13 65EDTCDE(Z)
     A  63                                  DSPATR(RI)
     A                                 14  3MSGCON(020 SHU0276 *LIBL/SYMSGF)
     A            WSFORF         1A  B 14 25VALUES(' ' 'J' 'N')
     A                                 15  3MSGCON(020 SHU0275 *LIBL/SYMSGF)
     A            WSVIDE         1A  B 15 25VALUES(' ' 'J' 'N')
     A                                 16  3MSGCON(020 SHU0280 *LIBL/SYMSGF)
     A            WSAVDE         4Y 0B 16 25EDTCDE(4)
     A  73                                  DSPATR(HI)
     A            WSAVD2         1A  B 16 31
     A                                 16 34MSGCON(010 SHU0505 *LIBL/SYMSGF)
     A                                 17  3MSGCON(020 SHU0281 *LIBL/SYMSGF)
     A            WSPROD         1A  B 17 25
     A  72                                  DSPATR(HI)
     A                                 17 29MSGCON(010 SHU0505 *LIBL/SYMSGF)
     A                                 18  3MSGCON(020 SHU0282 *LIBL/SYMSGF)
     A            WSFRAN         3A  B 18 25
     A  71                                  DSPATR(HI)
     A                                 18 29MSGCON(010 SHU0485 *LIBL/SYMSGF)
     A                                 18 41MSGCON(020 YBC0061 *LIBL/SYMSGF)
     A            WSGEBY         3A  B 18 62
     A  70                                  DSPATR(HI)
     A                                 18 67MSGCON(010 SHU0485 *LIBL/SYMSGF)
     A                                 19  3MSGCON(020 JOV1482 *LIBL/SYMSGF)
     A            WSMM           1A  B 19 25
     A                                 19 29MSGCON(045 JOV1481 *LIBL/SYMSGF)
     A                                 20  3MSGCON(020 JOV1478 *LIBL/SYMSGF)
     A            WSFRVG         9Y 0B 20 25EDTCDE(4)
     A                                 20 35'-'
     A            WSTIVG         9Y 0B 20 37EDTCDE(4)
     A                                 20 47MSGCON(034 JOV1479 *LIBL/SYMSGF)
     A                                 21  3MSGCON(020 SHU0277 *LIBL/SYMSGF)
     A            FRADTN         6Y 0B 21 25EDTCDE(4)
     A  69                                  DSPATR(HI)
     A                                 21 33'->'
     A            TILDTN         6Y 0B 21 36EDTCDE(4)
     A  68                                  DSPATR(HI)
     A                                 22  3MSGCON(040 SHU0283 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            ANTJUS         5Y 0B 22 45COLOR(RED)
     A                                      EDTCDE(4)
     A                                 22 52MSGCON(020 SHU0284 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            TOTJUS         5Y 0B 22 73COLOR(RED)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
