     A*%%TS  SD  20151006  151308  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYPO05PNL)
     A                                      HLPTITLE('TILORDNE SONETABELLER TIL-
     A                                       BASESTREKNINGER')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'SØK')
     A                                  1  2'SYSPED/SYPO05'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0039 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  7  2MSGCON(025 SHU0029 *LIBL/SYMSGF)
     A            BASLKF    R        B  7 28REFFLD(STEDIR/STINLK *LIBL/STEDI)
     A  30                                  DSPATR(RI)
     A  30                                  DSPATR(PC)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R SUBFIL                    SFL
     A*%%TS  SD  20151006  151308  SVEIN       REL-V7R1M0  5770-WDS
     A            WSNR           1A  I  5  3VALUES(' ' '2' '4')
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A            BASLKF    R        O  5  8REFFLD(BASESR/BASLKF *LIBL/BASES)
     A            BASPNF    R        O  5 11REFFLD(BASESR/BASPNF *LIBL/BASES)
     A                                  5 19'->'
     A            BASLKT    R        O  5 23REFFLD(BASESR/BASLKT *LIBL/BASES)
     A            BASPNT    R        O  5 26REFFLD(BASESR/BASPNT *LIBL/BASES)
     A            BASSOT    R        O  5 37REFFLD(BASESR/BASSOT *LIBL/BASES)
     A            BASLMT         5S 0O  5 49
     A            BASSOL         5A  O  5 61
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20151006  150907  SVEIN       REL-V7R1M0  5770-WDS
     A  *DS3                                SFLSIZ(0017)
     A  *DS4                                SFLSIZ(0017)
     A  *DS3                                SFLPAG(0016)
     A  *DS4                                SFLPAG(0016)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  3 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYPO05'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0039 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(012 SHU0034 *LIBL/SYMSGF)
     A            BASLKF    R        O  2 16REFFLD(BASESR/BASLKF *LIBL/BASES)
     A                                      COLOR(WHT)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(078 SHU0040 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R BUNN
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORRIGE')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  2  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 21MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 40MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 59MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98        MSG206        78A  O  4  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VARELI
     A*%%TS  SD  20151006  151308  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      CF04(04 'SØK')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPPNLGRP(SYPO05020 SYPO05PNL)
     A  *DS3                                HLPARA(02 001 02 021)
     A  *DS4                                HLPARA(02 001 02 021)
     A          H                           HLPPNLGRP(SYPO05030 SYPO05PNL)
     A  *DS3                                HLPARA(02 022 02 035)
     A  *DS4                                HLPARA(02 022 02 035)
     A          H                           HLPPNLGRP(SYPO05040 SYPO05PNL)
     A  *DS3                                HLPARA(02 036 02 080)
     A  *DS4                                HLPARA(02 036 02 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2MSGCON(078 SHU0040 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSSPNF         5A  B  2  8TEXT('GEBYRKODE')
     A                                      DSPATR(UL)
     A  88                                  DSPATR(RI)
     A  40                                  DSPATR(PR)
     A  40                                  COLOR(WHT)
     A            WSSLKT    R        B  2 23REFFLD(BASESR/BASLKT *LIBL/BASES)
     A                                      DSPATR(UL)
     A  87                                  DSPATR(RI)
     A  40                                  DSPATR(PR)
     A  40                                  COLOR(WHT)
     A            WSSPNT    R        B  2 26REFFLD(BASESR/BASPNT *LIBL/BASES)
     A                                      DSPATR(UL)
     A  89                                  DSPATR(RI)
     A  40                                  DSPATR(PR)
     A  40                                  COLOR(WHT)
     A            WSSSOT    R        B  2 37REFFLD(BASESR/BASSOT *LIBL/BASES)
     A                                      DSPATR(UL)
     A  90                                  DSPATR(RI)
     A            WSSLMT         5  0B  2 49
     A            WSSSOL         5   B  2 61
     A  86                                  DSPATR(RI)
     A                                  3  2MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VAREL2
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(012 DIV0026 *LIBL/SYMSGF)
     A            W2SPNF    R        I  2 15REFFLD(STEDIR/STINPF *LIBL/STEDI)
     A                                      DSPATR(PC)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R VAREL3
     A*%%TS  SD  20151006  151308  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                  1  2MSGCON(078 SHU0040 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            BASPNF    R        O  2  8REFFLD(BASESR/BASPNF *LIBL/BASES)
     A            BASLKT    R        O  2 23REFFLD(BASESR/BASLKT *LIBL/BASES)
     A            BASPNT    R        O  2 26REFFLD(BASESR/BASPNT *LIBL/BASES)
     A            BASSOT    R        O  2 37REFFLD(BASESR/BASSOT *LIBL/BASES)
     A            BASLMT         5  0O  2 49
     A            BASSOL         5   O  2 61
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R NYVARE
     A                                      CF03(03 'Avslutt program')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      CF12(12 'FORRIGE')
     A                                  1  2'SYSPED/SYPO05'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(050 SHU0039 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 70TIME
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(012 SHU0034 *LIBL/SYMSGF)
     A            BASLKF    R        O  2 16REFFLD(BASESR/BASLKF *LIBL/BASES)
     A                                      COLOR(WHT)
     A                                  3 34MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(078 SHU0040 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 22  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 40MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 59MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98        MSG511        78A  O 24  2MSGID(DIV 0012 SYMSGF)
     A                                      COLOR(WHT)
     A N98                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
