     A*____________________________
     A* SYSPED400 PRODUKTER  - ENGELSK TEKST
     A*""""""""""""""""""""""""""""
     A          R SYPRODR                   PFILE(SYPROD)
     A          K PRTX1E
