     A*____________________________
     A* SYSPED / VAREKODERS KOSTNASPROSENT
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R SYPR
     A            SYSTAT         1          TEXT('STATUS')
     A            SYAVD          4S 0       TEXT('AVDELINGSNR')
     A            SYVKOD         3          TEXT('VAREKODE')
     A            SYPROS         5S 2       TEXT('PROSENT')
     A            SYXXX         19          TEXT('LEDIGE')
     A          K SYAVD
     A          K SYVKOD
