     A*____________________________
     A* SYSPED400 PRODUKTER  - NORSK TEKST
     A*""""""""""""""""""""""""""""
     A          R SYPRODR                   PFILE(SYPROD)
     A          K PRTX1
