     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      CF03(03 'Exit')
     A          R NOREC
     A                                      TEXT('Select')
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A                                      CF12(12)
     A N50
     AO 49                                  CF06(06 'LAG NY')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYPROD'
     A                                      COLOR(BLU)
     A                                  1 20'Vedlikehold SYSPED    Moduler/prod-
     A                                      ukt  inst.stat'
     A                                      COLOR(WHT)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  3  2MSGCON(040 DIV2055 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  50N49                           4  2MSGCON(018 JOV0474 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50
     AO 49                              4  2MSGCON(030 JOV0475 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  1MSGCON(078 JOV0471 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            TOPOPT         1A  B  6  2
     A            WSKODE    R        B  6  5REFFLD(SYPRODR/PRKODE *LIBL/SYPROD)
     A                                 23  2MSGCON(010 DIV2056 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50
     AO 49                             23 17MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50N51                          23 61MSGCON(018 JOV0479 *LIBL/SYMSGF)
     A    N51                          23 61MSGCON(018 JOV0479 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R SUBFIL                    SFL
     A                                      TEXT('SUBFILE')
     A            WSNR           1A  B  7  2VALUES(' ' '2' '4' '1')
     A            PRKODE    R        O  7  5REFFLD(SYPRODR/PRKODE *LIBL/SYPROD)
     A            PRTX1     R        O  7 24REFFLD(SYPRODR/PRTX1 *LIBL/SYPROD)
     A            PRINST    R        O  7 66REFFLD(SYPRODR/PRINST *LIBL/SYPROD)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      TEXT('SUBCTL')
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF05(05 'Forny')
     A N50
     AO 49                                  CF06(06 'LAG NY')
     A                                      CF12(12 'Annuller')
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYPROD'
     A                                      COLOR(BLU)
     A                                  1 20'Vedlikehold SYSPED    Moduler/prod-
     A                                      ukt  inst.stat'
     A                                      COLOR(WHT)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  3  2MSGCON(040 DIV2057 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  3 68SFLRCDNBR
     A                                      DSPATR(ND)
     A  50N49                           4  2MSGCON(018 JOV0474 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50
     AO 49                              4  2MSGCON(030 JOV0475 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  1'Op  Modul/Prod.kode    Modul/produ-
     A                                      ktnavn                    Installer-
     A                                      t      '
     A                                      COLOR(WHT)
     A            TOPOPT         1A  B  6  2
     A            WSKODE    R        B  6  5REFFLD(SYPRODR/PRKODE *LIBL/SYPROD)
     A  51                                  DSPATR(PR)
     A  51                                  COLOR(WHT)
     A          R BOTREC
     A                                      TEXT('INFO')
     A                                      OVERLAY
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 21MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50
     AO 49                             23 41MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  50
     AO 49                             23 61MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50N51                          23 61MSGCON(018 JOV0479 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BLANKREC                  TEXT('Message')
     A                                      OVERLAY
     A            ZMSGTX        79A  O 24  2MSGID(&ZMSGNO SYMSGF)
     A N30                                  COLOR(WHT)
     A  30                                  COLOR(RED)
     A            ZMSGNO         7A  P
     A          R CHGREC
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Annuller')
     A                                      TEXT('INFO')
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYPROD'
     A                                      COLOR(BLU)
     A                                  1 20'Vedlikehold SYSPED    Moduler/prod-
     A                                      ukt  inst.stat'
     A                                      COLOR(WHT)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  6  5'Modul/Prod.kode  Modul/Prod.navn (-
     A                                      Norsk / Engelsk)     Innst.ststus (-
     A                                      J/N)'
     A                                      COLOR(WHT)
     A            PRKODE    R        O  7  5REFFLD(SYPRODR/PRKODE *LIBL/SYPROD)
     A                                      COLOR(WHT)
     A            W2INST    R        B  7 66REFFLD(SYPRODR/PRINST *LIBL/SYPROD)
     A                                      DSPATR(UL)
     A            W2TX1     R        B  7 22REFFLD(SYPRODR/PRTX1 *LIBL/SYPROD)
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A            W2TX1E    R        B  8 22REFFLD(SYPRODR/PRTX1E *LIBL/SYPROD)
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A                                 10  5'Modul/Produkt beskrivelse   Norsk '
     A                                      COLOR(WHT)
     A            WSTXA         70A  B 11  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXB         70A  B 12  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXC         70A  B 13  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXD         46A  B 14  5DSPATR(UL)
     A                                      CHECK(LC)
     A                                 16  5'Modul/Produkt beskrivelse   Engels-
     A                                      k    '
     A                                      COLOR(WHT)
     A            WSTXEA        70A  B 17  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXEB        70A  B 18  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXEC        70A  B 19  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXED        46A  B 20  5DSPATR(UL)
     A                                      CHECK(LC)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        ZMSGTX        79A  O 24  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
     A            ZMSGNO         7A  P
     A          R NEWREC
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Annuller')
     A                                      TEXT('INFO')
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            ZMSGNO         7A  P
     A                                  1  2'SYSPED/SYPROD'
     A                                      COLOR(BLU)
     A                                  1 20'Vedlikehold SYSPED    Moduler/prod-
     A                                      ukt  inst.stat'
     A                                      COLOR(WHT)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                  2 73TIME
     A                                  6  5'Modul/Prod.kode  Modul/Prod.navn (-
     A                                      Norsk / Engelsk)     Innst.ststus (-
     A                                      J/N)'
     A                                      COLOR(WHT)
     A            W2KODE    R        B  7  5REFFLD(SYPRODR/PRKODE *LIBL/SYPROD)
     A                                      COLOR(WHT)
     A            W2TX1     R        B  7 22REFFLD(SYPRODR/PRTX1 *LIBL/SYPROD)
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A            W2INST    R        B  7 66REFFLD(SYPRODR/PRINST *LIBL/SYPROD)
     A                                      DSPATR(UL)
     A            W2TX1E    R        B  8 22REFFLD(SYPRODR/PRTX1E *LIBL/SYPROD)
     A                                      DSPATR(UL)
     A                                      CHECK(LC)
     A                                 10  5'Modul/Produkt beskrivelse   Norsk '
     A                                      COLOR(WHT)
     A            WSTXA         70A  B 11  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXB         70A  B 12  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXC         70A  B 13  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXD         46A  B 14  5DSPATR(UL)
     A                                      CHECK(LC)
     A                                 16  5'Modul/Produkt beskrivelse   Engels-
     A                                      k    '
     A                                      COLOR(WHT)
     A            WSTXEA        70A  B 17  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXEB        70A  B 18  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXEC        70A  B 19  5DSPATR(UL)
     A                                      CHECK(LC)
     A            WSTXED        46A  B 20  5DSPATR(UL)
     A                                      CHECK(LC)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        ZMSGTX        79A  O 24  2MSGID(&ZMSGNO SYMSGF)
     A                                      COLOR(WHT)
