     A          R SYPTFR
      * PTFNR. KAN V∆RE F.EKS. SAD00001, TVI00001,,,
     A            PTFNR          8A         COLHDG('PTFNR.')
     A            PTFDT          8S 0       COLHDG('START DATO ≈≈≈≈MMDD')
     A            PTFTXT        70A         COLHDG('BEGRUNNELSE FOR PTF')
     A          K PTFNR
