*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P8068A* 01 TH  PTF8 NY HELPFUNKSJON  KUN DDS
*****A**************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYRU00PNL)
     A                                      HLPTITLE('VEDLIKEHOLD AV PARAETRE R-
     A                                      UCKATTEST')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A                                      CF12(12 'Avbryt')
     A                                  1  2'SYSPED/SYRU00'
     A                                      COLOR(BLU)
     A                                  1 19'Vedlikehold styringsparametre ruck-
     A                                      attestpurring'
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 70TIME
     A                                  4  2'Forutsetninger:  Program for autom-
     A                                      atisk purring på ruckattest vil kjø-
     A                                      re '
     A                                  5  2'EN gang daglig (ved oppstart av SY-
     A                                      SPED) dersom data (dager) er utfylt-
     A                                      .  '
     A                                  7  2'Sjekk saker fra'
     A            WSDGF     R        B  7 18REFFLD(RUCKDFTR/RDDGF *LIBL/RUCKDFT)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  7 22'(eldste) til'
     A            WSDGT     R        B  7 35REFFLD(RUCKDFTR/RDDGT *LIBL/RUCKDFT)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  7 39'(yngste/purrefrekvens) dager gamle-
     A                                      .'
     A                                  9  2'Tips: La første gangs gjennomkjøri-
     A                                      ng gå langt tilbake (f.eks 365 - 7 -
     A                                      dg)'
     A                                 10  8'Deretter kan en endre til f.eks 20-
     A                                      -7 dg, og alle nye vil da bli    '
     A                                 11  8'fanget opp og alle gamle blir re-p-
     A                                      urret, med langt mindre ressursbruk-
     A                                      .'
     A                                 13  2'Inkluder eller overse'
     A            WSOTIO    R        B 13 24REFFLD(RUCKDFTR/RDOTIO *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A                                 13 26'(I/O)'
     A                                 13 33'Oppdragstyper..........:'
     A            WSOT01         2A  B 14  3COLOR(YLW)
     A            WSOT02         2A  B 14  6COLOR(YLW)
     A            WSOT03         2A  B 14  9COLOR(YLW)
     A            WSOT04         2A  B 14 12COLOR(YLW)
     A            WSOT05         2A  B 14 15COLOR(YLW)
     A            WSOT06         2A  B 14 18COLOR(YLW)
     A            WSOT07         2A  B 14 21COLOR(YLW)
     A            WSOT08         2A  B 14 24COLOR(YLW)
     A            WSOT09         2A  B 14 27COLOR(YLW)
     A            WSOT10         2A  B 14 30COLOR(YLW)
     A            WSOT11         2A  B 14 33COLOR(YLW)
     A            WSOT12         2A  B 14 36COLOR(YLW)
     A            WSOT13         2A  B 14 39COLOR(YLW)
     A            WSOT14         2A  B 14 42COLOR(YLW)
     A            WSOT15         2A  B 14 45COLOR(YLW)
     A            WSOT16         2A  B 14 48COLOR(YLW)
     A            WSOT17         2A  B 14 51COLOR(YLW)
     A            WSOT18         2A  B 14 54COLOR(YLW)
     A            WSOT19         2A  B 14 57COLOR(YLW)
     A            WSOT20         2A  B 14 60COLOR(YLW)
     A                                 16  2'Utfør purring kun for tollager bev-
     A                                      illingskodene.......:'
     A            WSBEV1    R        B 17  3REFFLD(RUCKDFTR/RDBEV1 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A            WSBEV2    R        B 17  9REFFLD(RUCKDFTR/RDBEV2 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A            WSBEV3    R        B 17 15REFFLD(RUCKDFTR/RDBEV3 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A            WSBEV4    R        B 17 21REFFLD(RUCKDFTR/RDBEV4 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A            WSBEV5    R        B 17 27REFFLD(RUCKDFTR/RDBEV5 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A            WSBEV6    R        B 17 33REFFLD(RUCKDFTR/RDBEV6 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A            WSBEV7    R        B 17 39REFFLD(RUCKDFTR/RDBEV7 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A            WSBEV8    R        B 17 45REFFLD(RUCKDFTR/RDBEV8 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A            WSBEV9    R        B 17 51REFFLD(RUCKDFTR/RDBEV9 *LIBL/RUCKDF-
     A                                      T)
     A                                      COLOR(YLW)
     A                                 19  2'En standardisert epost sendes auto-
     A                                      matisk dersom kunden (Kjøpers F.mot-
     A                                      ) har'
     A                                 20  2'kontaktperson/epostadresse av type-
     A                                       *RUCKATTEST. Avsender hentes fra a-
     A                                      vdelings'
     A                                 21  2'kundenr/*RUCKATTEST. Om K.pers man-
     A                                      gler legges åpne poster i et regist-
     A                                      er.     '
     A                                 22  2'Dette kan suppleres(meny PRINT pkt-
     A                                       25) og RUCKATTEST sendes. '
     A                                 23  3'Enter=Oppdater      F12=Avbryt  '
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
