     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE
     A                                      TEXT('Parameters for price raise')
     A                                      CF03(03 'End program')
     A                                      CF05(05 'start flytting')
     A                                      CF04(04 'SØK')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYSA90'
     A                                      COLOR(BLU)
     A                                  1 63DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A            WAFRKU         8Y 0B 10 35EDTCDE(4)
     A                                      CHECK(RB)
     A                                 23 58MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            WSTIKU         8Y 0B 11 35EDTCDE(4)
     A                                      CHECK(RB)
     A                                  8 10'Fra fil............:'
     A                                 10 10'Fra kundenummer....:'
     A                                 11 10'Til kundenummer....:'
     A                                  1 22'Kopiere avtaler til arbeidsfil'
     A                                      DSPATR(HI)
     A            WSAKTI         1A  B  8 35VALUES('A' 'W' ' ')
     A                                 23  2'F5=Kopier'
     A                                      COLOR(BLU)
     A                                  8 39'(A=Aktiv, W=Arbeisfil)'
     A                                 18 10'Antall kopiert.....:'
     A            WSKOP          8Y 0O 18 35EDTCDE(4)
     A                                 19 10'Herav oppdatert....:'
     A            WSOPD          8Y 0O 19 35EDTCDE(4)
