********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 RETTE LINJENR
********************************************************************
     A          R LHEAD
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
     A  91        HOHT1N        80      1  1HIGHLIGHT
     A  92        HOHT1E        80      1  1HIGHLIGHT
     A  93        HOHT1T        80      1  1HIGHLIGHT
     A  91        HOHT2N        80      2  1HIGHLIGHT
     A  92        HOHT2E        80      2  1HIGHLIGHT
     A  93        HOHT2T        80      2  1HIGHLIGHT
     A  91        HOHT3N        80      3  1HIGHLIGHT
     A  92        HOHT3E        80      3  1HIGHLIGHT
     A  93        HOHT3T        80      3  1HIGHLIGHT
     A  91        HOHT4N        80      4  1HIGHLIGHT
     A  92        HOHT4E        80      4  1HIGHLIGHT
     A  93        HOHT4T        80      4  1HIGHLIGHT
     A  91        HOHT5N        80      5  1HIGHLIGHT
     A  92        HOHT5E        80      5  1HIGHLIGHT
     A  93        HOHT5T        80      5  1HIGHLIGHT
     A  91        HOHT6N        80      6  1HIGHLIGHT
     A  92        HOHT6E        80      6  1HIGHLIGHT
     A  93        HOHT6T        80      6  1HIGHLIGHT
     A  91        HOHT7N        80      7  1HIGHLIGHT
     A  92        HOHT7E        80      7  1HIGHLIGHT
     A  93        HOHT7T        80      7  1HIGHLIGHT
     A            XNA           30     11 11
     A            XAD1          30     12 11
     A  91                             12 51MSGCON(13 DIV3506 SYMSGF)
     A  92                             12 51MSGCON(13 DIV3507 SYMSGF)
     A  93                             12 51MSGCON(13 DIV3508 SYMSGF)
     A            BLAVD          4  0  12 64EDTCDE(3)
     A                                 12 68'/'
     A            BLOPD          7  0  12 69EDTCDE(3)
     A                                 12 76'/'
     A            BLSG           3     12 77
     A            XAD2          30     13 11
     A  91                             13 51MSGCON(13 DIV3509 SYMSGF)
     A  92                             13 51MSGCON(13 DIV3510 SYMSGF)
     A  93                             13 51MSGCON(13 DIV3511 SYMSGF)
     A            BLPRO          8  0  13 70EDTCDE(3)
     A            XAD3          30     14 11
     A  91                             14 51MSGCON(13 DIV3512 SYMSGF)
     A  92                             14 51MSGCON(13 DIV3513 SYMSGF)
     A  93                             14 51MSGCON(13 DIV3514 SYMSGF)
     A            XIDAGX         6  0  14 70EDTCDE(Y)
     A                                 20  1MSGCON(80 DIV3321 SYMSGF)
     A                                      HIGHLIGHT
     A  91                             21  1MSGCON(80 DIV3516 SYMSGF)
     A                                      UNDERLINE
     A  92                             21  1MSGCON(80 DIV3517 SYMSGF)
     A                                      UNDERLINE
     A  93                             21  1MSGCON(80 DIV3518 SYMSGF)
     A                                      UNDERLINE
     A  91                             23  2MSGCON(48 DIV3519 SYMSGF)
     A  92                             23  2MSGCON(48 DIV3520 SYMSGF)
     A  93                             23  2MSGCON(48 DIV3521 SYMSGF)
     A            XLOHN         30     23 51
     A  91                             25 21MSGCON(5 DIV3522 SYMSGF)
     A  92                             25 21MSGCON(5 DIV3523 SYMSGF)
     A  93                             25 21MSGCON(5 DIV3524 SYMSGF)
     A            BLUKE          2  0  25 28
     A  91                             25 41MSGCON(5 DIV3758 SYMSGF)
     A  92                             25 41MSGCON(5 DIV3759 SYMSGF)
     A  93                             25 41MSGCON(5 DIV3760 SYMSGF)
     A            XDTA           6  0  25 48
     A  91                             28  2MSGCON(12 DIV3525 SYMSGF)
     A  92                             28  2MSGCON(12 DIV3526 SYMSGF)
     A  93                             28  2MSGCON(12 DIV3527 SYMSGF)
     A  91                             28 42MSGCON(12 DIV3528 SYMSGF)
     A  92                             28 42MSGCON(12 DIV3529 SYMSGF)
     A  93                             28 42MSGCON(12 DIV3530 SYMSGF)
     A            BLNAA         30     29  6
     A            XNAM          30     29 46
     A  91                             30  2MSGCON(12 DIV3531 SYMSGF)
     A  92                             30  2MSGCON(14 DIV3532 SYMSGF)
     A  93                             30  2MSGCON(14 DIV3533 SYMSGF)
     A  91                             30 42MSGCON(12 DIV3534 SYMSGF)
     A  92                             30 42MSGCON(12 DIV3535 SYMSGF)
     A  93                             30 42MSGCON(12 DIV3536 SYMSGF)
     A            XOBNA         30     31  6
     A            BLREIS        14     31 46
     A  91                             32  2MSGCON(8 DIV3537 SYMSGF)
     A  92                             32  2MSGCON(8 DIV3538 SYMSGF)
     A  93                             32  2MSGCON(8 DIV3539 SYMSGF)
     A  91                             32 42MSGCON(16 DIV3540 SYMSGF)
     A  92                             32 42MSGCON(16 DIV3541 SYMSGF)
     A  93                             32 42MSGCON(18 DIV3542 SYMSGF)
     A            XLSHN         30     33  6
     A            BLBLNR        16     33 46
     A                                 34  1MSGCON(80 DIV3321 SYMSGF)
     A                                      HIGHLIGHT
     A  91                             35  1MSGCON(80 DIV3543 SYMSGF)
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A  92                             35  1MSGCON(80 DIV3544 SYMSGF)
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A  93                             35  1MSGCON(80 DIV3545 SYMSGF)
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                 36  1' '
      *
      * MODELL 1
      *
     A          R LMOD1                     SPACEB(1)
     A            XMN           17         2
     A            XNT            5  0     21EDTCDE(4)
     A            XVS           25        29
     A            XVKT           9  0     55EDTCDE(2)
     A            XM3            9  3     67EDTCDE(2)
      *
      * MIDTFELT
      *
     A          R LMIDT
S01  A*                                46  1MSGCON(80 DIV3361 SYMSGF)
S01  A* 91                             47  2MSGCON(15 DIV3546 SYMSGF)
S01  A* 92                             47  2MSGCON(15 DIV3547 SYMSGF)
S01  A* 93                             47  2MSGCON(15 DIV3548 SYMSGF)
N01  A                                 47  1MSGCON(80 DIV3361 SYMSGF)
N01  A  91                             48  2MSGCON(15 DIV3546 SYMSGF)
N01  A  92                             48  2MSGCON(15 DIV3547 SYMSGF)
N01  A  93                             48  2MSGCON(15 DIV3548 SYMSGF)
      *
      * MODELL 2
      *
     A          R LMOD2                     SPACEB(1)
     A            XTXT          51        28
      *
      * BUNN
      *
     A          R LBUNN
     A                                 55  1MSGCON(80 DIV3361 SYMSGF)
     A                                      HIGHLIGHT
     A  91                             56  2MSGCON(79 DIV3549 SYMSGF)
     A                                      HIGHLIGHT
     A  92                             56  2MSGCON(79 DIV3550 SYMSGF)
     A                                      HIGHLIGHT
     A  93                             56  2MSGCON(79 DIV3551 SYMSGF)
     A                                      HIGHLIGHT
     A  91                             58  2MSGCON(49 DIV3552 SYMSGF)
     A                                      HIGHLIGHT
     A  92                             58  2MSGCON(49 DIV3553 SYMSGF)
     A                                      HIGHLIGHT
     A  93                             58  2MSGCON(49 DIV3554 SYMSGF)
     A                                      HIGHLIGHT
     A            KOSFNV        16     58 52HIGHLIGHT
     A  91                             60  2MSGCON(19 DIV3555 SYMSGF)
     A                                      HIGHLIGHT
     A  92                             60  2MSGCON(19 DIV3556 SYMSGF)
     A                                      HIGHLIGHT
     A  93                             60  2MSGCON(19 DIV3557 SYMSGF)
     A                                      HIGHLIGHT
     A            XTLF          15     60 22HIGHLIGHT
