     A          R LHEAD
     A                                  5 11MSGCON(12 DIV3833 SYMSGF)
     A            XNA           30      6 11
     A            XAD1          30      7 11
     A            XAD2          30      8 11
     A                                  8 56MSGCON(6 DIV3834 SYMSGF)
     A            BOAVD          4  0   8 63EDTCDE(4)
     A                                  8 67'/'
     A            BOOPD          7  0   8 68EDTCDE(4)
     A                                  8 75'/'
     A            BOSG           3      8 76
     A            XAD3          30      9 11
     A                                 11 50MSGCON(24 DIV3835 SYMSGF)
     A                                      HIGHLIGHT
     A                                 13 38'|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯-
     A                                      ¯¯¯¯¯¯¯¯|'
     A                                 14 38MSGCON(43 DIV3836 SYMSGF)
     A                                      HIGHLIGHT
     A                                 15 38'|'
     A                                 15 80'|'
     A                                 16  2MSGCON(6 DIV3837 SYMSGF)
     A            BOLBN         20     16 13
     A                                 16 38'|'
     A                                 16 40MSGCON(9 DIV3838 SYMSGF)
     A            B2NAS         30     16 50
     A                                 16 80'|'
     A            XDT1           6  0  17 13EDTCDE(Y)
     A                                 17 38'|'
     A                                 17 80'|'
     A                                 18  2MSGCON(6 DIV3834 SYMSGF)
     A            BOREF1        10     18 13
     A                                 18 38'|'
     A                                 18 40MSGCON(9 DIV3839 SYMSGF)
     A            B2ADL         30     18 50
     A                                 18 80'|'
     A                                 19 38'|'
     A                                 19 80'|'
     A                                 20  2MSGCON(10 DIV3840 SYMSGF)
     A            BOLSHN        20     20 13
     A                                 20 38'|'
     A                                 20 40MSGCON(9 DIV3841 SYMSGF)
     A  77        BOKNR          8  0  20 50
     A N77        KNAVN         30     20 50
     A                                 20 80'|'
     A                                 21 38'|'
     A                                 21 80'|'
     A                                 22  2MSGCON(10 DIV3842 SYMSGF)
     A            BOVHN         20     22 13
     A                                 22 38'|_________________________________-
     A                                      ________|'
     A                                 24  2'¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯-
     A                                      ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯-
     A                                      ¯¯¯¯¯¯¯¯¯¯'
     A                                 25  2MSGCON(79 DIV3843 SYMSGF)
     A                                 27  2' '
      *
     A          R DETBL1                    SPACEB(1)
     A            BVMN          17         2
     A            BVNT           5  0     21EDTCDE(4)
     A            BVVS          25        29
     A            BVVKT          9  0     55EDTCDE(3)
     A            BVM3           9  3     68EDTCDE(3)
      *
     A          R TOMLIN                    SPACEB(1)
     A                                     2' '
      *
     A          R DETBL2                    SPACEB(1)
     A            BVMN          17         2
     A            BVFT          51        29
      *
     A          R LBUNN
     A                                 54  2'¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯-
     A                                      ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯-
     A                                      ¯¯¯¯¯¯¯¯¯¯'
     A                                 55  2MSGCON(24 DIV3844 SYMSGF)
     A                                 62 37MSGCON(6 DIV3845 SYMSGF)
     A                                 64 37MSGCON(20 DIV3846 SYMSGF)
     A                                 66 37'..................................'
