     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R BILDE
     A                                      CSRLOC(LINNBR POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF04(04 'SØK')
     A            LINNBR         3  0H
     A            POSNBR         3  0H
     A                                  1  2'SYSPED/SYSJ22'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(40 DIV3662 SYMSGF)
     A                                      DSPATR(HI)
     A                                  5  2MSGCON(15 DIV3663 SYMSGF)
     A            WSAVD          4Y 0B  5 19DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  8  2MSGCON(20 DIV3664 SYMSGF)
     A                                      DSPATR(HI)
     A                                 10  2MSGCON(15 DIV3665 SYMSGF)
     A            WSOPD          7Y 0B 10 19DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12  2MSGCON(15 DIV3666 SYMSGF)
     A            WSOB           5A  B 12 19DSPATR(UL)
     A  97                                  DSPATR(RI)
     A                                 12 40MSGCON(6 DIV3667 SYMSGF)
     A            WSDTB          6Y 0B 12 48DSPATR(UL)
     A  96                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 14  2MSGCON(15 DIV3668 SYMSGF)
     A            WSREIS        14A  B 14 19DSPATR(UL)
     A                                 14 40MSGCON(6 DIV3667 SYMSGF)
     A            WSDTR          6Y 0B 14 48DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 16  2MSGCON(15 DIV3669 SYMSGF)
     A            WSBLNR        16A  B 16 19DSPATR(UL)
     A                                 23  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(18 DIV0032 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
