*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P5074A* 01 YBC PTF5 NYE ADRESSER LINJER PÅ AVSENDRE, MOTTAGER OG NOTIFY
     A*             MYE ENDRINGER. INGEN MERKING
PXXXXA* 02 YBC PTF5 TELEFONNR OG FAXNR TIL AGENT
PXXXXA* 03 YBC PTF5 ANTALL KOPI ER ØKT FRA 1A TIL 2A
P5120A* 04 YBC PTF5 SKRIV UT GEBYR PÅ LOKAL B/L
P5121A* 05 YBC PTF5 SKRIV UT DATO TIL VIAHAVN PÅ LOKAL B/L
P6XXX * 06 JOV PTF6 TILATE SMÅ BOKSTAVER I FASTE FRITEKST-LINJER
P9XXX * 07 YBC PTF9 NYTT FELT FOR LOS.H. (LOKAL BÅT) FELT 97
*****A**************************************************************
      *
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  5  3VALUES(' ' '1' '2' '3' '4')
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A            CF2KDP         5A  O  5  9
     A            CF2FT         30A  O  5 20
     A            CF2PRT        10A  O  5 53
     A            CF2SKF         5A  O  5 66
S03  A*           CF2ANT         1A  O  5 75
N03  A            CF2ANT         2A  O  5 75
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYSJ14'
     A                                      COLOR(BLU)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 19MSGCON(40 DIV3007 SYMSGF)
     A                                      DSPATR(HI)
     A                                  3  2MSGCON(30 DIV0016 SYMSGF)
     A                                      COLOR(BLU)
     A N27                              3 34MSGCON(30 DIV4219 SYMSGF)
     A                                      COLOR(BLU)
     A  27                              3 34MSGCON(15 DIV3895 SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(78 YBC0052 SYMSGF)
     A                                      DSPATR(HI)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A N27                                  CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A N27                                  CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A  27                                  CF12(12 'FORRIGE')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A N27                              1  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  27                              1  2MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(18 DIV0021 SYMSGF)
     A                                      COLOR(BLU)
     A N27                              1 42MSGCON(18 DIV0022 SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 62MSGCON(18 DIV0023 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              2 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VARELI
     A                                      CF12(12 'Forrige')
     A                                  1  2'SYSPED/SYSJ14'
     A                                      COLOR(BLU)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 19MSGCON(040 DIV3007 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  3  1MSGCON(012 DIV3009 *LIBL/SYMSGF)
     A            WSKDP          5A  B  3 14DSPATR(UL)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A  90                                  DSPATR(PC)
     A  90                                  DSPATR(RI)
     A                                  3 21MSGCON(015 DIV3010 *LIBL/SYMSGF)
     A            WSFT          30A  B  3 37DSPATR(UL)
     A  89                                  DSPATR(PC)
     A  89                                  DSPATR(RI)
     A                                  4  1'Printernavn:'
     A            WSPRT         10A  B  4 14DSPATR(UL)
     A                                  4 27'Skuffnr.: '
     A            WSSKF          5A  B  4 39DSPATR(UL)
     A                                  4 47'Antall kopier:'
S03  A*           WSANTK         1Y 0B  4 62DSPATR(UL)
N03  A            WSANTK         2Y 0B  4 62DSPATR(UL)
     A                                      EDTCDE(4)
     A                                  5  1MSGCON(009 DIV3011 *LIBL/SYMSGF)
     A            WSL001         2Y 0B  5 11DSPATR(UL)
     A  88                                  DSPATR(PC)
     A  88                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK001         3Y 0B  5 14DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  5 18MSGCON(011 DIV3012 *LIBL/SYMSGF)
     A            WSL002         2Y 0B  5 30DSPATR(UL)
     A  87                                  DSPATR(PC)
     A  87                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK002         3Y 0B  5 33DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  5 40MSGCON(009 DIV3013 *LIBL/SYMSGF)
     A            WSL003         2Y 0B  5 50DSPATR(UL)
     A  86                                  DSPATR(PC)
     A  86                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK003         3Y 0B  5 53DSPATR(UL)
     A  86                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  7  1MSGCON(009 DIV3014 *LIBL/SYMSGF)
     A            WSL004         2Y 0B  7 11DSPATR(UL)
     A  85                                  DSPATR(PC)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK004         3Y 0B  7 14DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  7 18MSGCON(006 DIV3015 *LIBL/SYMSGF)
     A            WSL005         2Y 0B  7 25DSPATR(UL)
     A  84                                  DSPATR(PC)
     A  84                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK005         3Y 0B  7 28EDTCDE(4)
     A  84                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                  7 32MSGCON(005 DIV3016 *LIBL/SYMSGF)
     A            WSL006         2Y 0B  7 38DSPATR(UL)
     A  83                                  DSPATR(PC)
     A  83                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK006         3Y 0B  7 41DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  7 45MSGCON(005 DIV3017 *LIBL/SYMSGF)
     A            WSL007         2Y 0B  7 51DSPATR(UL)
     A  82                                  DSPATR(PC)
     A  82                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK007         3Y 0B  7 54DSPATR(UL)
     A  82                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  7 58MSGCON(005 DIV3018 *LIBL/SYMSGF)
     A            WSL008         2Y 0B  7 64DSPATR(UL)
     A  81                                  DSPATR(PC)
     A  81                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK008         3Y 0B  7 67DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9  1MSGCON(008 DIV3019 *LIBL/SYMSGF)
     A            WSL009         2Y 0B  9 11DSPATR(UL)
     A  80                                  DSPATR(PC)
     A  80                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK009         3Y 0B  9 14DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9 18MSGCON(006 DIV3020 *LIBL/SYMSGF)
     A            WSL010         2Y 0B  9 25DSPATR(UL)
     A  79                                  DSPATR(PC)
     A  79                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK010         3Y 0B  9 28DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9 32MSGCON(005 DIV3021 *LIBL/SYMSGF)
     A            WSL011         2Y 0B  9 38DSPATR(UL)
     A  78                                  DSPATR(PC)
     A  78                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK011         3Y 0B  9 41DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9 45MSGCON(005 DIV3022 *LIBL/SYMSGF)
     A            WSL012         2Y 0B  9 51DSPATR(UL)
     A  77                                  DSPATR(PC)
     A  77                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK012         3Y 0B  9 54DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9 58MSGCON(005 DIV3023 *LIBL/SYMSGF)
     A            WSL013         2Y 0B  9 64DSPATR(UL)
     A  76                                  DSPATR(PC)
     A  76                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK013         3Y 0B  9 67DSPATR(UL)
     A  76                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 11  1MSGCON(009 DIV3024 *LIBL/SYMSGF)
     A            WSL014         2Y 0B 11 11DSPATR(UL)
     A  75                                  DSPATR(PC)
     A  75                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK014         3Y 0B 11 14DSPATR(UL)
     A  75                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 11 18MSGCON(006 DIV3015 *LIBL/SYMSGF)
     A            WSL015         2Y 0B 11 25DSPATR(UL)
     A  74                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK015         3Y 0B 11 28DSPATR(UL)
     A  74                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 11 32MSGCON(005 DIV3016 *LIBL/SYMSGF)
     A            WSL016         2Y 0B 11 38DSPATR(UL)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK016         3Y 0B 11 41DSPATR(UL)
     A  73                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 11 45MSGCON(005 DIV3017 *LIBL/SYMSGF)
     A            WSL017         2Y 0B 11 51DSPATR(UL)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK017         3Y 0B 11 54DSPATR(UL)
     A  72                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 11 58MSGCON(005 DIV3018 *LIBL/SYMSGF)
     A            WSL018         2Y 0B 11 64DSPATR(UL)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK018         3Y 0B 11 67DSPATR(UL)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 11 71MSGCON(003 DIV3025 *LIBL/SYMSGF)
     A            WSL019         2Y 0B 11 75DSPATR(UL)
     A  70                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK019         3Y 0B 11 78DSPATR(UL)
     A  70                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12 32'Adr0:'
     A            WSL073         2Y 0B 12 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK073         3Y 0B 12 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 12 45'Adr4:'
     A            WSL074         2Y 0B 12 51DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK074         3Y 0B 12 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 13  1MSGCON(009 DIV3026 *LIBL/SYMSGF)
     A            WSL020         2Y 0B 13 11DSPATR(UL)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK020         3Y 0B 13 14DSPATR(UL)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 18MSGCON(006 DIV3015 *LIBL/SYMSGF)
     A            WSL021         2Y 0B 13 25DSPATR(UL)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK021         3Y 0B 13 28DSPATR(UL)
     A  68                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 32MSGCON(005 DIV3016 *LIBL/SYMSGF)
     A            WSL022         2Y 0B 13 38DSPATR(UL)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK022         3Y 0B 13 41DSPATR(UL)
     A  67                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 45MSGCON(005 DIV3017 *LIBL/SYMSGF)
     A            WSL023         2Y 0B 13 51DSPATR(UL)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK023         3Y 0B 13 54DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 58MSGCON(005 DIV3018 *LIBL/SYMSGF)
     A            WSL024         2Y 0B 13 64DSPATR(UL)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK024         3Y 0B 13 67DSPATR(UL)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 71MSGCON(003 DIV3025 *LIBL/SYMSGF)
     A            WSL025         2Y 0B 13 75DSPATR(UL)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK025         3Y 0B 13 78DSPATR(UL)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 14 32'Adr0:'
     A            WSL067         2Y 0B 14 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK067         3Y 0B 14 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 14 45'Adr4:'
     A            WSL068         2Y 0B 14 51DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK068         3Y 0B 14 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 15  1MSGCON(009 DIV3027 *LIBL/SYMSGF)
     A            WSL026         2Y 0B 15 11DSPATR(UL)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK026         3Y 0B 15 14DSPATR(UL)
     A  63                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 18MSGCON(006 DIV3015 *LIBL/SYMSGF)
     A            WSL027         2Y 0B 15 25DSPATR(UL)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK027         3Y 0B 15 28DSPATR(UL)
     A  62                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 32MSGCON(005 DIV3016 *LIBL/SYMSGF)
     A            WSL028         2Y 0B 15 38DSPATR(UL)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK028         3Y 0B 15 41DSPATR(UL)
     A  61                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 45MSGCON(005 DIV3017 *LIBL/SYMSGF)
     A            WSL029         2Y 0B 15 51DSPATR(UL)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK029         3Y 0B 15 54DSPATR(UL)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 58MSGCON(005 DIV3018 *LIBL/SYMSGF)
     A            WSL030         2Y 0B 15 64DSPATR(UL)
     A  59                                  DSPATR(PC)
     A  59                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK030         3Y 0B 15 67DSPATR(UL)
     A  59                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 71MSGCON(003 DIV3025 *LIBL/SYMSGF)
     A            WSL031         2Y 0B 15 75DSPATR(UL)
     A  58                                  DSPATR(PC)
     A  58                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK031         3Y 0B 15 78DSPATR(UL)
     A  58                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 16 32'Adr0:'
     A            WSL069         2Y 0B 16 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK069         3Y 0B 16 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 16 45'Adr4:'
     A            WSL070         2Y 0B 16 51DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK070         3Y 0B 16 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 17  1MSGCON(009 DIV3028 *LIBL/SYMSGF)
     A            WSL032         2Y 0B 17 11DSPATR(UL)
     A  57                                  DSPATR(PC)
     A  57                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK032         3Y 0B 17 14DSPATR(UL)
     A  57                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 17 18MSGCON(009 DIV3029 *LIBL/SYMSGF)
     A            WSL033         2Y 0B 17 29DSPATR(UL)
     A  56                                  DSPATR(PC)
     A  56                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK033         3Y 0B 17 32DSPATR(UL)
     A  56                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 17 40MSGCON(010 DIV3030 *LIBL/SYMSGF)
     A            WSL034         2Y 0B 17 51DSPATR(UL)
     A  55                                  DSPATR(PC)
     A  55                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK034         3Y 0B 17 54DSPATR(UL)
     A  55                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 17 61MSGCON(010 DIV3031 *LIBL/SYMSGF)
     A            WSL035         2Y 0B 17 72DSPATR(UL)
     A  54                                  DSPATR(PC)
     A  54                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK035         3Y 0B 17 75DSPATR(UL)
     A  54                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 18 40MSGCON(010 YBC0121 *LIBL/SYMSGF)
     A            WSL049         2Y 0B 18 51DSPATR(UL)
     A  55                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK049         3Y 0B 18 54DSPATR(UL)
     A  55                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 18 61MSGCON(010 YBC0122 *LIBL/SYMSGF)
     A            WSL048         2Y 0B 18 72DSPATR(UL)
     A  54                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK048         3Y 0B 18 75DSPATR(UL)
     A  54                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 19  1MSGCON(009 DIV3032 *LIBL/SYMSGF)
     A            WSL036         2Y 0B 19 11DSPATR(UL)
     A  53                                  DSPATR(PC)
     A  53                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK036         3Y 0B 19 14DSPATR(UL)
     A  53                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 20  1MSGCON(009 YBC0275 *LIBL/SYMSGF)
     A            WSL050         2Y 0B 20 11DSPATR(UL)
     A  53                                  DSPATR(PC)
     A  53                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK050         3Y 0B 20 14DSPATR(UL)
     A  53                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 19 18MSGCON(010 DIV3033 *LIBL/SYMSGF)
     A            WSL037         2Y 0B 19 29DSPATR(UL)
     A  52                                  DSPATR(PC)
     A  52                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK037         3Y 0B 19 32DSPATR(UL)
     A  52                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 19 40MSGCON(010 DIV3034 *LIBL/SYMSGF)
     A            WSL038         2Y 0B 19 51DSPATR(UL)
     A  51                                  DSPATR(PC)
     A  51                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK038         3Y 0B 19 54DSPATR(UL)
     A  51                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 19 61MSGCON(010 DIV3035 *LIBL/SYMSGF)
     A            WSL039         2Y 0B 19 72DSPATR(UL)
     A  50                                  DSPATR(PC)
     A  50                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK039         3Y 0B 19 75DSPATR(UL)
     A  50                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 21  1MSGCON(009 DIV3036 *LIBL/SYMSGF)
     A            WSL040         2Y 0B 21 11DSPATR(UL)
     A  49                                  DSPATR(PC)
     A  49                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK040         3Y 0B 21 14DSPATR(UL)
     A  49                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 21 18MSGCON(010 DIV3037 *LIBL/SYMSGF)
     A            WSL041         2Y 0B 21 29DSPATR(UL)
     A  48                                  DSPATR(PC)
     A  48                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK041         3Y 0B 21 32DSPATR(UL)
     A  48                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 21 40MSGCON(010 DIV3038 *LIBL/SYMSGF)
     A            WSL042         2Y 0B 21 51DSPATR(UL)
     A  47                                  DSPATR(PC)
     A  47                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK042         3Y 0B 21 54DSPATR(UL)
     A  47                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R VAREL2
     A                                      CF03(03 'AVSLUTT')
     A                                  1  2'SYSPED/SYSJ14'
     A                                      COLOR(BLU)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 19MSGCON(040 DIV3007 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  3  1MSGCON(012 DIV3009 *LIBL/SYMSGF)
     A            WSKDP          5A  O  3 14DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  3 21MSGCON(015 DIV3010 *LIBL/SYMSGF)
     A            WSFT          30A  O  3 37DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  5 14MSGCON(004 DIV3039 *LIBL/SYMSGF)
     A                                  5 21MSGCON(004 DIV3040 *LIBL/SYMSGF)
     A                                  5 41MSGCON(004 DIV3039 *LIBL/SYMSGF)
     A                                  5 48MSGCON(004 DIV3040 *LIBL/SYMSGF)
     A                                  5 67MSGCON(004 DIV3039 *LIBL/SYMSGF)
     A                                  5 74MSGCON(004 DIV3040 *LIBL/SYMSGF)
     A                                  6  1MSGCON(011 DIV3041 *LIBL/SYMSGF)
     A            WSL051         2Y 0B  6 13DSPATR(UL)
     A  90                                  DSPATR(PC)
     A  90                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK051         3Y 0B  6 16EDTCDE(4)
     A  90                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A            WSL052         2Y 0B  6 20DSPATR(UL)
     A  89                                  DSPATR(PC)
     A  89                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK052         3Y 0B  6 23DSPATR(UL)
     A  89                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  6 27MSGCON(012 DIV3042 *LIBL/SYMSGF)
     A            WSL053         2Y 0B  6 40DSPATR(UL)
     A  88                                  DSPATR(PC)
     A  88                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK053         3Y 0B  6 43DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSL054         2Y 0B  6 47DSPATR(UL)
     A  87                                  DSPATR(PC)
     A  87                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK054         3Y 0B  6 50DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  6 54MSGCON(011 DIV3043 *LIBL/SYMSGF)
     A            WSL055         2Y 0B  6 66DSPATR(UL)
     A  86                                  DSPATR(PC)
     A  86                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK055         3Y 0B  6 69DSPATR(UL)
     A  86                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSL056         2Y 0B  6 73DSPATR(UL)
     A  85                                  DSPATR(PC)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK056         3Y 0B  6 76DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  7  1MSGCON(011 DIV3044 *LIBL/SYMSGF)
     A            WSL057         2Y 0B  7 13DSPATR(UL)
     A  84                                  DSPATR(PC)
     A  84                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK057         3Y 0B  7 16EDTCDE(4)
     A  84                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A            WSL058         2Y 0B  7 20DSPATR(UL)
     A  83                                  DSPATR(PC)
     A  83                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK058         3Y 0B  7 23DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  7 27MSGCON(012 DIV3045 *LIBL/SYMSGF)
     A            WSL059         2Y 0B  7 40DSPATR(UL)
     A  82                                  DSPATR(PC)
     A  82                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK059         3Y 0B  7 43DSPATR(UL)
     A  82                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSL060         2Y 0B  7 47DSPATR(UL)
     A  81                                  DSPATR(PC)
     A  81                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK060         3Y 0B  7 50DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  7 54MSGCON(011 DIV3046 *LIBL/SYMSGF)
     A            WSL061         2Y 0B  7 66DSPATR(UL)
     A  80                                  DSPATR(PC)
     A  80                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK061         3Y 0B  7 69DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSL062         2Y 0B  7 73DSPATR(UL)
     A  79                                  DSPATR(PC)
     A  79                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK062         3Y 0B  7 76DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9  1MSGCON(011 DIV3047 *LIBL/SYMSGF)
     A            WSL063         2Y 0B  9 13DSPATR(UL)
     A  78                                  DSPATR(PC)
     A  78                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK063         3Y 0B  9 16DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9 21MSGCON(010 DIV3048 *LIBL/SYMSGF)
     A            WSL064         2Y 0B  9 32DSPATR(UL)
     A  77                                  DSPATR(PC)
     A  77                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK064         3Y 0B  9 35DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9 41MSGCON(008 DIV3049 *LIBL/SYMSGF)
     A            WSL065         2Y 0B  9 50DSPATR(UL)
     A  76                                  DSPATR(PC)
     A  76                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK065         3Y 0B  9 53DSPATR(UL)
     A  76                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  9 61MSGCON(008 DIV3050 *LIBL/SYMSGF)
     A            WSL066         2Y 0B  9 70DSPATR(UL)
     A  75                                  DSPATR(PC)
     A  75                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK066         3Y 0B  9 73DSPATR(UL)
     A  75                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 11  1MSGCON(022 DIV3051 *LIBL/SYMSGF)
     A            WSL270         2Y 0B 11 24DSPATR(UL)
     A  74                                  DSPATR(PC)
     A  74                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12  1MSGCON(009 DIV3052 *LIBL/SYMSGF)
     A            WSK270         3Y 0B 12 11DSPATR(UL)
     A  73                                  DSPATR(PC)
     A  73                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12 16MSGCON(009 DIV3053 *LIBL/SYMSGF)
     A            WSK271         3Y 0B 12 26DSPATR(UL)
     A  72                                  DSPATR(PC)
     A  72                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12 31MSGCON(007 DIV3054 *LIBL/SYMSGF)
     A            WSK272         3Y 0B 12 39DSPATR(UL)
     A  71                                  DSPATR(PC)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12 44MSGCON(009 DIV3055 *LIBL/SYMSGF)
     A            WSK273         3Y 0B 12 54DSPATR(UL)
     A  70                                  DSPATR(PC)
     A  70                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12 59MSGCON(005 DIV3056 *LIBL/SYMSGF)
     A            WSK274         3Y 0B 12 65DSPATR(UL)
     A  69                                  DSPATR(PC)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12 69MSGCON(007 DIV3057 *LIBL/SYMSGF)
     A            WSK275         3Y 0B 12 77DSPATR(UL)
     A  68                                  DSPATR(PC)
     A  68                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13  1MSGCON(017 DIV3058 *LIBL/SYMSGF)
     A            WSANTL         2Y 0B 13 20DSPATR(UL)
     A  67                                  DSPATR(PC)
     A  67                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 27MSGCON(011 DIV3059 *LIBL/SYMSGF)
     A                                 13 39MSGCON(006 YBC0387 *LIBL/SYMSGF)
     A            WSL380         2Y 0B 13 46DSPATR(UL)
     A  66                                  DSPATR(PC)
     A  66                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK380         3Y 0B 13 49DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 54MSGCON(008 YBC0388 *LIBL/SYMSGF)
     A            WSL379         2Y 0B 13 63DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK379         3Y 0B 13 66DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 15  1MSGCON(008 DIV3222 *LIBL/SYMSGF)
     A            WSL043         2Y 0B 15 11DSPATR(UL)
     A  54                                  DSPATR(PC)
     A  54                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK043         3Y 0B 15 14DSPATR(UL)
     A  54                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 18MSGCON(006 DIV3015 *LIBL/SYMSGF)
     A            WSL044         2Y 0B 15 25DSPATR(UL)
     A  53                                  DSPATR(PC)
     A  53                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK044         3Y 0B 15 28EDTCDE(4)
     A  53                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                 15 32MSGCON(005 DIV3016 *LIBL/SYMSGF)
     A            WSL045         2Y 0B 15 38DSPATR(UL)
     A  52                                  DSPATR(PC)
     A  52                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK045         3Y 0B 15 41DSPATR(UL)
     A  52                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 45MSGCON(005 DIV3017 *LIBL/SYMSGF)
     A            WSL046         2Y 0B 15 51DSPATR(UL)
     A  51                                  DSPATR(PC)
     A  51                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK046         3Y 0B 15 54DSPATR(UL)
     A  51                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 58MSGCON(005 DIV3018 *LIBL/SYMSGF)
     A            WSL047         2Y 0B 15 64DSPATR(UL)
     A  50                                  DSPATR(PC)
     A  50                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK047         3Y 0B 15 67DSPATR(UL)
     A  50                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 16  5MSGCON(005 YBC0706 *LIBL/SYMSGF)
     A            WSL071         2Y 0B 16 11DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK071         3Y 0B 16 14EDTCDE(4)
     A                                      DSPATR(UL)
     A                                 16 18MSGCON(005 YBC0705 *LIBL/SYMSGF)
     A            WSL072         2Y 0B 16 25DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK072         3Y 0B 16 28DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 16 32'Adr0:'
     A            WSL075         2Y 0B 16 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK075         3Y 0B 16 41DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 16 45'Adr4:'
     A            WSL076         2Y 0B 16 51DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK076         3Y 0B 16 54DSPATR(UL)
     A                                      EDTCDE(4)
     A                                 17  1MSGCON(005 DIV3060 *LIBL/SYMSGF)
     A            WSL481         2Y 0B 17  7DSPATR(UL)
     A  65                                  DSPATR(PC)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK481         3Y 0B 17 10DSPATR(UL)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSFT1         30A  B 17 14DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 17 46MSGCON(005 DIV3061 *LIBL/SYMSGF)
     A            WSL482         2Y 0B 17 52DSPATR(UL)
     A  64                                  DSPATR(PC)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK482         3Y 0B 17 55DSPATR(UL)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSFT2         20A  B 17 59DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 18  1MSGCON(005 DIV3062 *LIBL/SYMSGF)
     A            WSL483         2Y 0B 18  7DSPATR(UL)
     A  63                                  DSPATR(PC)
     A  63                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK483         3Y 0B 18 10DSPATR(UL)
     A  63                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSFT3         20A  B 18 14DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 18 36MSGCON(005 DIV3063 *LIBL/SYMSGF)
     A            WSL484         2Y 0B 18 42DSPATR(UL)
     A  62                                  DSPATR(PC)
     A  62                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK484         3Y 0B 18 45DSPATR(UL)
     A  62                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSFT4         10A  B 18 49DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 18 61MSGCON(005 DIV3064 *LIBL/SYMSGF)
     A            WSL485         2Y 0B 18 67DSPATR(UL)
     A  61                                  DSPATR(PC)
     A  61                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK485         3Y 0B 18 70DSPATR(UL)
     A  61                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSFT5          5A  B 18 74DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 19  1MSGCON(005 DIV3065 *LIBL/SYMSGF)
     A            WSL486         2Y 0B 19  7DSPATR(UL)
     A  60                                  DSPATR(PC)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK486         3Y 0B 19 10DSPATR(UL)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSFT6         30A  B 19 14DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 19 46MSGCON(005 DIV3066 *LIBL/SYMSGF)
     A            WSL487         2Y 0B 19 52DSPATR(UL)
     A  59                                  DSPATR(PC)
     A  59                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK487         3Y 0B 19 55DSPATR(UL)
     A  59                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSFT7         20A  B 19 59DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 20  1MSGCON(005 YBC0490 *LIBL/SYMSGF)
     A            WSL488         2Y 0B 20  7DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK488         3Y 0B 20 10DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSFT8         20A  B 20 14DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 20 36MSGCON(005 YBC0548 *LIBL/SYMSGF)
     A            WSL489         2Y 0B 20 42DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSK489         3Y 0B 20 45DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSFT9         30A  B 20 49DSPATR(UL)
N06  A                                      CHECK(LC)
     A                                 21  1MSGCON(010 DIV3031 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 21 12MSGCON(004 DIV3067 *LIBL/SYMSGF)
     A            WSL591         2Y 0B 21 17DSPATR(UL)
     A  58                                  DSPATR(PC)
     A  58                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK591         3Y 0B 21 20DSPATR(UL)
     A  58                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 21 25MSGCON(004 DIV3068 *LIBL/SYMSGF)
     A            WSL592         2Y 0B 21 30DSPATR(UL)
     A  57                                  DSPATR(PC)
     A  57                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK592         3Y 0B 21 33DSPATR(UL)
     A  57                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 21 38MSGCON(004 DIV3069 *LIBL/SYMSGF)
     A            WSL593         2Y 0B 21 43DSPATR(UL)
     A  56                                  DSPATR(PC)
     A  56                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK593         3Y 0B 21 46DSPATR(UL)
     A  56                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 21 51MSGCON(004 DIV3070 *LIBL/SYMSGF)
     A            WSL594         2Y 0B 21 56DSPATR(UL)
     A  55                                  DSPATR(PC)
     A  55                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK594         3Y 0B 21 59DSPATR(UL)
     A  55                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 21 64'Geby'
     A            WSL595         2Y 0B 21 69DSPATR(UL)
E07  A  49                                  DSPATR(PC)
E07  A  49                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK595         3Y 0B 21 72DSPATR(UL)
E07  A  49                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 22 12'VHdt'
     A            WSL596         2Y 0B 22 17DSPATR(UL)
E07  A  48                                  DSPATR(PC)
E07  A  48                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSK596         3Y 0B 22 20DSPATR(UL)
E07  A  48                                  DSPATR(RI)
     A                                      EDTCDE(4)
N07  A                                 22 25'LosH'
N07  A            WSL597         2Y 0B 22 30DSPATR(UL)
N07  A  47                                  DSPATR(PC)
N07  A  47                                  DSPATR(RI)
N07  A                                      EDTCDE(4)
N07  A            WSK597         3Y 0B 22 33DSPATR(UL)
N07  A  47                                  DSPATR(RI)
N07  A                                      EDTCDE(4)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 41'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  2  2MSGCON(25 DIV3073 SYMSGF)
     A                                      DSPATR(HI)
     A            W2FT          30A  I  2 29DSPATR(UL)
     A                                      DSPATR(PC)
     A                                  3  2MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R DLTBLF
     A                                      CF05(05 'CONFORM DELETE')
     A                                      CF12(12 'CANCEL')
     A                                      SLNO(20)
     A                                      CLRL(05)
     A                                      ALARM
     A                                      OVERLAY
     A                                  1  6'|¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯-
     A                                      ¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯¯-
     A                                      |'
     A                                      COLOR(BLU)
     A                                  2  6'|'
     A                                      COLOR(BLU)
     A                                  2  8MSGCON(12 DIV3009 SYMSGF)
     A            CF2KDP         5A  O  2 21DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      DSPATR(HI)
     A                                  2 28MSGCON(15 DIV3010 SYMSGF)
     A            CF2FT         30A  O  2 44DSPATR(UL)
     A                                      DSPATR(HI)
     A                                  2 75'|'
     A                                      COLOR(BLU)
     A                                  3  6'|'
     A                                      COLOR(BLU)
     A                                  3  8MSGCON(65 DIV3071 SYMSGF)
     A                                      DSPATR(PC)
     A                                      COLOR(RED)
     A                                  3 75'|'
     A                                      COLOR(BLU)
     A                                  4  6'|'
     A                                      COLOR(BLU)
     A                                  4  8MSGCON(65 DIV3072 SYMSGF)
     A                                      COLOR(RED)
     A                                  4 75'|'
     A                                      COLOR(BLU)
     A                                  5  6'|_________________________________-
     A                                      ___________________________________-
     A                                      |'
     A                                      COLOR(BLU)
     A          R NYVARE
     A                                      CSRLOC(LINNBR     POSNBR)
     A N27                                  CF03(03 'AVSLUTT')
     A                                      CF05(05 'Frisk')
     A N27                                  CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A  27                                  CF12(12 'AVSLUTT')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYSJ14'
     A                                      COLOR(BLU)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 69TIME
     A                                  1 19MSGCON(40 DIV3007 SYMSGF)
     A                                      DSPATR(HI)
     A                                  3  2MSGCON(30 DIV0016 SYMSGF)
     A                                      COLOR(BLU)
     A N27                              3 34MSGCON(30 DIV4219 SYMSGF)
     A                                      COLOR(BLU)
     A  27                              3 34MSGCON(15 DIV3895 SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(78 YBC0052 SYMSGF)
     A                                      DSPATR(HI)
     A N27                             23  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23  2MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(18 DIV0021 SYMSGF)
     A                                      COLOR(BLU)
     A N27                             23 42MSGCON(18 DIV0022 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(18 DIV0023 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
