********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SORT PÅ SPEDITØR
********************************************************************
     A          R LHEAD
     A                                  2 51MSGCON(35 DIV3577 SYMSGF)
     A                                      HIGHLIGHT
     A                                      UNDERLINE
     A                                  2101MSGCON(15 DIV3578 SYMSGF)
     A            XIDAG          6  0   2117EDTCDE(Y)
     A    N27                           3  2MSGCON(12 DIV3579 SYMSGF)
     A  51N27     YAVD9          4  0   3 15EDTCDE(3)
     A     27                           3  2MSGCON(18 YBC0207 SYMSGF)
     A  51                              3 31MSGCON(12 DIV3580 SYMSGF)
     A  51        XDTF           6  0   3 44EDTCDE(Y)
     A  51                              3 61MSGCON(12 DIV3581 SYMSGF)
     A  51        XDTT           6  0   3 74EDTCDE(Y)
     A  52N27     YAVD1          4  0   3 15EDTCDE(3)
     A  52                              3 31MSGCON(5 DIV3582 SYMSGF)
     A  52        UAAR           2  0   3 37
     A  52                              3 43MSGCON(12 DIV3583 SYMSGF)
     A  52        UUKEF          2  0   3 56
     A  52                              3 62MSGCON(12 DIV3584 SYMSGF)
     A  52        UUKET          2  0   3 76
     A  52                              3 80MSGCON(5 DIV3022 SYMSGF)
     A  52        XUKE           2  0   3 87
     A  53N27     YAVD5          4  0   3 15EDTCDE(3)
     A  53                              3 25MSGCON(12 DIV3585 SYMSGF)
     A  53        ULB            5      3 38
     A  53        XLBNV         30      3 44
     A  53                              3 77MSGCON(12 DIV3580 SYMSGF)
     A  53        XDTL           6  0   3 90EDTCDE(Y)
     A  54N27     YAVD6          4  0   3 15EDTCDE(3)
     A  54                              3 25MSGCON(12 DIV3587 SYMSGF)
     A  54        ULSH           5      3 38
     A  54        XLSHNV        30      3 44
     A  54                              3 77MSGCON(12 DIV3580 SYMSGF)
     A  54        XDTH           6  0   3 90EDTCDE(Y)
     A  55N27     YAVD3          4  0   3 15EDTCDE(3)
     A  55                              3 31MSGCON(12 YBC0044 SYMSGF)
     A  55        UPRO           8  0   3 44EDTCDE(3)
     A  55                              3 55MSGCON(12 DIV3580 SYMSGF)
     A  55        XDTP           6  0   3 68EDTCDE(Y)
     A  56N27     YAVD14         4  0   3 15EDTCDE(3)
     A  56                              3 25MSGCON(12 YBC0175 SYMSGF)
     A  56        UVH            5      3 38
     A  56        XVHNV         30      3 44
     A  56                              3 77MSGCON(12 DIV3580 SYMSGF)
     A  56        XDTV           6  0   3 90EDTCDE(Y)
     A  57        YAVD12         4  0   3 15EDTCDE(3)
     A  57                              3 25MSGCON(12 YBC0177 SYMSGF)
     A  57        ULOH           5      3 38
     A  57        XLOHNV        30      3 44
     A  57                              3 77MSGCON(12 DIV3580 SYMSGF)
     A  57        XDTS           6  0   3 90EDTCDE(Y)
     A  58N27     YAVD10         4  0   3 15EDTCDE(3)
     A  58                              3 31MSGCON(12 YBC0179 SYMSGF)
     A  58        UREIS         14      3 44
     A  59        YAVD8          4  0   3 15EDTCDE(3)
     A  59                              3 25MSGCON(12 YBC0181 SYMSGF)
     A  59        UOB            5      3 38
     A  59        XOBNV         30      3 44
     A  59                              3 77MSGCON(12 DIV3580 SYMSGF)
     A  59        XDTO           6  0   3 90EDTCDE(Y)
     A  50N27     YAVD4          4  0   3 15EDTCDE(3)
     A  50                              3 23MSGCON(12 YBC0183 SYMSGF)
     A  50        UKNA           8  0   3 36EDTCDE(Z)
     A  50        XKNANV        30      3 45
     A  50                              3 77MSGCON(12 DIV3580 SYMSGF)
     A  50        XDTA           6  0   3 90EDTCDE(Y)
N01  A  49N27     YAVD7          4  0   3 15EDTCDE(3)
N01  A  49                              3 23MSGCON(12 YBC1959 SYMSGF)
N01  A  49        UKNSP          8  0   3 36EDTCDE(Z)
N01  A  49        XKNSNV        30      3 45
N01  A  49                              3 77MSGCON(12 DIV3580 SYMSGF)
N01  A  49        XDTSP          6  0   3 90EDTCDE(Y)
     A                                  3101MSGCON(6 DIV3588 SYMSGF)
     A            XSIDE          3  0   3108EDTCDE(3)
     A                                  4  1MSGCON(132 DIV3361 SYMSGF)
     A                                  5  1MSGCON(132 DIV3589 SYMSGF)
     A                                  6  1MSGCON(132 DIV3590 SYMSGF)
     A                                  7  1MSGCON(132 DIV3361 SYMSGF)
     A                                  8  1 ' '
      *
     A          R DET1                      SPACEB(1)
     A  27        BOAVD          4  0      3EDTCDE(3)
     A                                    10'|'
     A            XDT1           6  0     11EDTCDE(Y)
     A                                    19'|'
     A            XLBN          30        21
     A            XLSHN         20        52
     A            XLSSN         20        73
     A            XDT4           6  0     94EDTCDE(Y)
     A                                   103'|'
     A            XNAA          25       105SPACEA(1)
     A            BOOPD          7  0      2EDTCDE(3)
     A                                    10'|'
     A                                    19'|'
     A            XOBN          30        21
     A            XVHN          20        52
     A            XDT3           6  0     73EDTCDE(Y)
     A            XLOHN         20        82
     A                                   103'|'
     A            XNAS          25       105SPACEA(1)
     A            BOSG           3         3
     A                                    10'|'
     A                                    19'|'
     A            XNT            7  0     21EDTCDE(2)
     A            XMN           20        31
     A            XVS           25        52
     A            XVK            9  0     78EDTCDE(2)
     A            XM3            7  3     91EDTCDE(2)
     A                                   103'|'
     A                                   105MSGCON(6 DIV3591 SYMSGF)
     A            BODP          20       112
      *
     A          R DET2                      SPACEB(1)
     A                                    10'|'
     A                                    19'|'
     A            XNT            7  0     21EDTCDE(2)
     A            XMN           20        31
     A            XVS           25        52
     A            XVK            9  0     78EDTCDE(2)
     A            XM3            7  3     91EDTCDE(2)
     A                                   103'|'
      *
     A          R DET3                      SPACEB(1)
     A                                     1MSGCON(132 DIV3361 SYMSGF)
      *
     A          R DET4                      SPACEB(1)
     A                                    10'|'
     A                                    19'|'
     A            BVMN          17        31
     A            BVFT          51        52
     A                                   103'|'
