     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R BILDE
     A                                      CF03(03 'AVSLUTT')
     A                                      CF04(04 'SØK')
     A                                  1  2'SYSPED/SYSJSS'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(40 DIV3677 SYMSGF)
     A                                      DSPATR(HI)
     A                                  6  2MSGCON(20 DIV3678 SYMSGF)
     A            WSSG           3   B  6 28DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                  8  2MSGCON(20 DIV3691 SYMSGF)
     A            WSSD           5   B  8 28DSPATR(UL)
     A  98
     AON30                                  DSPATR(PC)
     A  98                                  DSPATR(RI)
     A                                 11  2MSGCON(30 DIV3679 SYMSGF)
     A                                      DSPATR(HI)
     A                                 13  2MSGCON(24 DIV3680 SYMSGF)
     A            WSDT           6Y 0B 13 28DSPATR(UL)
     A  97                                  DSPATR(PC)
     A  97                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15  2MSGCON(24 DIV3681 SYMSGF)
     A            WSMN          17   B 15 28DSPATR(UL)
     A                                 15 50MSGCON(12 DIV3682 SYMSGF)
     A            WSDTS          6Y 0B 15 64DSPATR(UL)
     A  96                                  DSPATR(PC)
     A  96                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 18  2MSGCON(24 DIV1509 SYMSGF)
     A            WSJBK          1A  B 18 29DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 19  2MSGCON(24 DIV1510 SYMSGF)
     A            WSPRT         10A  B 19 29DSPATR(UL)
     A                                 23  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(18 DIV0032 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
