     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R BILDE
     A                                      CF01(01 'BYTT AVDELINGER')
     A                                      CF03(03 'Avslutt registrering av BI-
     A                                      LL OF LADING')
     A  27                                  CF05(05 'SE PÅ B/L')
     A                                      CF12(12 'AVBRYT')
     A                                  1  2'SYSPED/SYSJ52J'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(40 DIV3477 SYMSGF)
     A                                      DSPATR(HI)
     A                                  3  2MSGCON(10 DIV3116 SYMSGF)
     A            UAVD           4Y 0O  3 14DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 22MSGCON(12 DIV3117 SYMSGF)
     A            UOPD           7Y 0O  3 36DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 45MSGCON(10 DIV3118 SYMSGF)
     A            BLSG           3A  O  3 57DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7  2MSGCON(30 DIV3267 SYMSGF)
     A            BLBBK          5   O  7 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(30 DIV3268 SYMSGF)
     A            BLBBNA        30   O  9 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11  2MSGCON(30 DIV3269 SYMSGF)
     A            BLBREI        14   O 11 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13  2MSGCON(30 DIV3270 SYMSGF)
     A            BLBBLN        16   O 13 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(30 DIV3271 SYMSGF)
     A            BLBOMH         5   O 15 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17  2MSGCON(30 DIV3272 SYMSGF)
     A            WSDT           6Y 0O 17 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(Y)
     A                                 23  2MSGCON(18 DIV0067 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  27                             23 42MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(18 DIV3672 SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
