     A          R SIDE2
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A                                  3  2'Bill of Lading No.'
     A            TUBLNR        17A     3 21
     A                                  3 71MSGCON(12 DIV3312 SYMSGF)
     A            XATD          15A     3 84
     A                                  4  2'Trip number:'
     A            TUPRO          8  0   4 21EDTCDE(Z)
     A                                  6  2'Vessel:'
     A            TUBNV         30      6 21
     A                                  6 62'Reference:'
     A            BLREFS        20      6 81
     A                                  7  2'Place of Receipt:'
     A            TULAS         30      7 21
     A                                  7 62'Port of loading:'
     A            TULASH        30      7 81
     A                                  8  2'Port of Discharge'
     A            TULOSH        30      8 21
     A                                  8 62'Place of Delivery'
     A            TULOS         30      8 81
     A                                  9  1MSGCON(120 DIV3321 SYMSGF)
     A                                      HIGHLIGHT
     A                                 10  2'Marks & Numbers'
     A                                      HIGHLIGHT
     A                                 10 20'No. of pkgs/Shipping Units'
     A                                      HIGHLIGHT
     A                                 10 47'Description of Goods & Pkgs'
     A                                      HIGHLIGHT
     A                                 10 83'Gross Weight (KG)'
     A                                      HIGHLIGHT
     A                                 10101'Measurement (CBM)'
     A                                      HIGHLIGHT
     A                                 11  1MSGCON(120 DIV3321 SYMSGF)
     A                                      HIGHLIGHT
      *
     A          R TOMS2                     SPACEB(1)
     A                                     1' '
      *
     A          R SIDE2D                    SPACEB(1)
     A            BVMN          17         2
     A  37        BVNT           5  0     30EDTCDE(1)
     A            BVVS          25        47
     A  38        BVVKT          9  0     86EDTCDE(1)
     A  39        BVM3           9  3    105EDTCDE(1)
      *
     A          R SIDE2DOS                  SPACEB(1)
     A            XTXT         100         5
      *
     A          R SIDE2S                    SPACEB(1)
     A                                     1MSGCON(120 DIV3321 SYMSGF)
     A                                      HIGHLIGHT
     A                                      SPACEA(1)
     A                                     2MSGCON(10 DIV3323 SYMSGF)
     A N37                                35'0'
     A  37        XSUMNT         5  0     30EDTCDE(1)
     A N38                                97'0'
     A  38        XSUMVK         9  0     86EDTCDE(1)
     A N39                               102'0.000'
     A  39        XSUMM3         9  3    105EDTCDE(1)
