     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R BILDE
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'AVSLUTT')
     A                                      CF04(04 'Søke')
     A                                      CF12(12 'AVBRYT')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYSJ50B'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(040 DIV3115 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  3  2MSGCON(010 DIV3116 *LIBL/SYMSGF)
     A            WSAVD          4Y 0O  3 14DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 22MSGCON(012 DIV3117 *LIBL/SYMSGF)
     A            WSOPD          7Y 0O  3 36DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 45MSGCON(010 DIV3118 *LIBL/SYMSGF)
     A            BOSG           3A  O  3 57DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  7 13MSGCON(066 YBC0341 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  8  2MSGCON(012 DIV3120 *LIBL/SYMSGF)
     A            WSUTO          1A  B  8 16DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A            WSKNTO         8Y 0B  8 20DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNCO         8Y 0B  8 29DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNFO         8Y 0B  8 38DSPATR(UL)
     A  97                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSTFXO         1A  B  8 52DSPATR(UL)
     A                                      VALUES(' ' 'T' 'F')
     A            WSDTO          6Y 0O  8 62DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A            BOTIDO         6Y 0O  8 71DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('  :  :  ')
     A                                  9  2MSGCON(012 DIV3121 *LIBL/SYMSGF)
     A            WSUTL          1A  B  9 16DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A            WSKNTL         8Y 0B  9 20DSPATR(UL)
     A  96                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNCL         8Y 0B  9 29DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNFL         8Y 0B  9 38DSPATR(UL)
     A  94                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSTFXL         1A  B  9 52DSPATR(UL)
     A                                      VALUES(' ' 'T' 'F')
     A            WSDTL          6Y 0O  9 62DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A            BOTIDL         6Y 0O  9 71DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('  :  :  ')
     A                                 10  2MSGCON(012 DIV3122 *LIBL/SYMSGF)
     A            WSUTT          1A  B 10 16DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A            WSKNTT         8Y 0B 10 20DSPATR(UL)
     A  93                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNCT         8Y 0B 10 29DSPATR(UL)
     A  92                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNFT         8Y 0B 10 38DSPATR(UL)
     A  91                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSTFXT         1A  B 10 52DSPATR(UL)
     A                                      VALUES(' ' 'T' 'F')
     A            WSDTT          6Y 0O 10 62DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A            BOTIDT         6Y 0O 10 71DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('  :  :  ')
     A                                 11  2MSGCON(012 DIV3123 *LIBL/SYMSGF)
     A            WSUTP          1A  B 11 16DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A            WSKNTP         8Y 0B 11 20DSPATR(UL)
     A  90                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNCP         8Y 0B 11 29DSPATR(UL)
     A  89                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNFP         8Y 0B 11 38DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSTFXP         1A  B 11 52DSPATR(UL)
     A                                      VALUES(' ' 'T' 'F')
     A            WSDTP          6Y 0O 11 62DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A            BOTIDP         6Y 0O 11 71DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('  :  :  ')
     A                                 12  2MSGCON(012 DIV3124 *LIBL/SYMSGF)
     A            WSUTE          1A  B 12 16DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A            WSKNTE         8Y 0B 12 20DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNCE         8Y 0B 12 29DSPATR(UL)
     A  86                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSKNFE         8Y 0B 12 38DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSTFXE         1A  B 12 52DSPATR(UL)
     A                                      VALUES(' ' 'T' 'F')
     A            WSDTE          6Y 0O 12 62DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A            BOTIDE         6Y 0O 12 71DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('  :  :  ')
     A                                 13  2MSGCON(012 YBC0467 *LIBL/SYMSGF)
     A            WSUTBB         1A  B 13 16DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A            WSKNBB         8Y 0B 13 20DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            WSTFBB         1A  B 13 52DSPATR(UL)
     A                                      VALUES(' ' 'T' 'F')
     A            WSDTBB         6Y 0O 13 62DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A            BOTIBB         6Y 0O 13 71DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTWRD('  :  :  ')
     A                                 16  2MSGCON(024 DIV3138 *LIBL/SYMSGF)
     A            WSUTA          1A  B 16 31DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 16 41'(J/N)'
     A            WSDTA          6Y 0O 16 69DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(Y)
     A                                 17  2MSGCON(024 YBC0374 *LIBL/SYMSGF)
     A            WSUTF          1A  B 17 31DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 17 41'(J/N)'
     A                                 20  2MSGCON(024 DIV1509 *LIBL/SYMSGF)
     A            WSJBQ          1A  B 20 31DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 20 41'(J/N)'
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
