     A          R LHEAD
     A N59                              2  2MSGCON(40 DIV3708 SYMSGF)
     A                                      HIGHLIGHT
     A  59                              2  2MSGCON(40 DIV3709 SYMSGF)
     A                                      HIGHLIGHT
     A                                  2 76MSGCON(15 DIV3710 SYMSGF)
     A            XIDAG          6  0   2 93EDTCDE(Y)
     A                                  2110MSGCON(6 DIV3711 SYMSGF)
     A            XSIDE          5  0   2118EDTCDE(4)
     A N59                              4  2MSGCON(80 DIV3712 SYMSGF)
     A                                      HIGHLIGHT
     A  59                              4  2MSGCON(80 DIV3713 SYMSGF)
     A                                      HIGHLIGHT
     A                                  4 90MSGCON(43 DIV3714 SYMSGF)
     A                                      HIGHLIGHT
     A N59                              5  2MSGCON(88 DIV3715 SYMSGF)
     A                                      HIGHLIGHT
     A  59                              5  2MSGCON(88 DIV3716 SYMSGF)
     A                                      HIGHLIGHT
     A                                  5 90MSGCON(42 DIV3717 SYMSGF)
     A                                      HIGHLIGHT
     A                                  6  1MSGCON(132 DIV3361 SYMSGF)
     A                                  7  1' '
      *
     A          R LDET1                     SPACEB(1)
     A            BLAAR          2  0      2
     A            BLUKE          2  0      6EDTCDE(3)
     A            XDTA           6  0     11EDTCDE(Y)
     A            BLAVD          4  0     20EDTCDE(3)
     A            BLOPD          7  0     25EDTCDE(3)
     A            BLKNR          8  0     33EDTCDE(3)
     A            BLTR           4        44
     A            A11            2        51
     A            A21            5  0     55EDTCDE(4)
     A            XNA           26        62
     A            BLLSH          5        90
     A            BLVH           5        96
     A            HEGN          15       103
     A            BLLOS          5       119
     A            BLLOS2         4       125
     A            BLCH           1       131
     A                                      SPACEA(1)
     A            BLLB           5        11
     A            BLOB           5        21
     A            BLREIS        14        29
     A            HEOT           2        47
     A            A12            2        55
     A            A22            5  0     61EDTCDE(4)
     A            XNAF          30        67
     A            XDTVH          6  0     97EDTCDE(Y)
     A            HEPOS1         7A      109
     A            BLLOH          5       121
     A            BLMH           1       131
      *
     A          R LDET2                     SPACEB(1)
     A                                     7MSGCON(27 DIV3718 SYMSGF)
     A            A13            2        37
     A            A23            5  0     40EDTCDE(4)
     A            A14            2        49
     A            A24            5  0     52EDTCDE(4)
     A            A15            2        61
     A            A25            5  0     64EDTCDE(4)
     A            A16            2        73
     A            A26            5  0     76EDTCDE(4)
     A            A17            2        85
     A            A27            5  0     88EDTCDE(4)
     A            A18            2        97
     A            A28            5  0    100EDTCDE(4)
     A            A19            2       109
     A            A29            5  0    112EDTCDE(4)
      *
     A          R LDET3                     SPACEB(1)
     A            A110           2        37
     A            A210           5  0     40EDTCDE(4)
     A            A111           2        49
     A            A211           5  0     52EDTCDE(4)
     A            A112           2        61
     A            A212           5  0     64EDTCDE(4)
     A            A113           2        73
     A            A213           5  0     76EDTCDE(4)
     A            A114           2        85
     A            A214           5  0     88EDTCDE(4)
     A            A115           2        97
     A            A215           5  0    100EDTCDE(4)
     A            A116           2       109
     A            A216           5  0    112EDTCDE(4)
      *
     A          R LDET4                     SPACEB(1)
     A            A117           2        37
     A            A217           5  0     40EDTCDE(4)
     A            A118           2        49
     A            A218           5  0     52EDTCDE(4)
     A            A119           2        61
     A            A219           5  0     64EDTCDE(4)
     A            A120           2        73
     A            A220           5  0     76EDTCDE(4)
     A            A121           2        85
     A            A221           5  0     88EDTCDE(4)
     A            A122           2        97
     A            A222           5  0    100EDTCDE(4)
     A            A123           2       109
     A            A223           5  0    112EDTCDE(4)
      *
     A          R LDET5                     SPACEB(1)
     A            A124           2        37
     A            A224           5  0     40EDTCDE(4)
     A            A125           2        49
     A            A225           5  0     52EDTCDE(4)
     A            A126           2        61
     A            A226           5  0     64EDTCDE(4)
     A            A127           2        73
     A            A227           5  0     76EDTCDE(4)
     A            A128           2        85
     A            A228           5  0     88EDTCDE(4)
     A            A129           2        97
     A            A229           5  0    100EDTCDE(4)
     A            A130           2       109
     A            A230           5  0    112EDTCDE(4)
      *
     A          R LDET6                     SPACEB(1)
     A            A131           2        37
     A            A231           5  0     40EDTCDE(4)
     A            A132           2        49
     A            A232           5  0     52EDTCDE(4)
     A            A133           2        61
     A            A233           5  0     64EDTCDE(4)
     A            A134           2        73
     A            A234           5  0     76EDTCDE(4)
     A            A135           2        85
     A            A235           5  0     88EDTCDE(4)
     A            A136           2        97
     A            A236           5  0    100EDTCDE(4)
     A            A137           2       109
     A            A237           5  0    112EDTCDE(4)
      *
     A          R LUKE1                     SPACEB(1)
     A                                     1MSGCON(132 DIV3361 SYMSGF)
     A                                      SPACEA(1)
     A                                     2MSGCON(25 DIV3719 SYMSGF)
     A                                    28MSGCON(8 DIV3720 SYMSGF)
     A            XÅR2           2  0     37EDTCDE(4)
     A                                    40MSGCON(4 DIV3721 SYMSGF)
     A            XUKE2          2  0     45EDTCDE(4)
     A            B11            2        52
     A            B21            5  0     55EDTCDE(4)
     A            B12            2        64
     A            B22            5  0     67EDTCDE(4)
     A            B13            2        76
     A            B23            5  0     79EDTCDE(4)
     A            B14            2        88
     A            B24            5  0     91EDTCDE(4)
     A            B15            2       100
     A            B25            5  0    103EDTCDE(4)
     A            B16            2       112
     A            B26            5  0    115EDTCDE(4)
     A            B17            2       124
     A            B27            5  0    127EDTCDE(4)
      *
     A          R LUKE2                     SPACEB(1)
     A            B18            2        52
     A            B28            5  0     55EDTCDE(4)
     A            B19            2        64
     A            B29            5  0     67EDTCDE(4)
     A            B110           2        76
     A            B210           5  0     79EDTCDE(4)
     A            B111           2        88
     A            B211           5  0     91EDTCDE(4)
     A            B112           2       100
     A            B212           5  0    103EDTCDE(4)
     A            B113           2       112
     A            B213           5  0    115EDTCDE(4)
     A            B114           2       124
     A            B214           5  0    127EDTCDE(4)
      *
     A          R LUKE3                     SPACEB(1)
     A            B115           2        52
     A            B215           5  0     55EDTCDE(4)
     A            B116           2        64
     A            B216           5  0     67EDTCDE(4)
     A            B117           2        76
     A            B217           5  0     79EDTCDE(4)
     A            B118           2        88
     A            B218           5  0     91EDTCDE(4)
     A            B119           2       100
     A            B219           5  0    103EDTCDE(4)
     A            B120           2       112
     A            B220           5  0    115EDTCDE(4)
     A            B121           2       124
     A            B221           5  0    127EDTCDE(4)
      *
     A          R LUKE4                     SPACEB(1)
     A            B122           2        52
     A            B222           5  0     55EDTCDE(4)
     A            B123           2        64
     A            B223           5  0     67EDTCDE(4)
     A            B124           2        76
     A            B224           5  0     79EDTCDE(4)
     A            B125           2        88
     A            B225           5  0     91EDTCDE(4)
     A            B126           2       100
     A            B226           5  0    103EDTCDE(4)
     A            B127           2       112
     A            B227           5  0    115EDTCDE(4)
     A            B128           2       124
     A            B228           5  0    127EDTCDE(4)
      *
     A          R LUKE5                     SPACEB(1)
     A            B129           2        52
     A            B229           5  0     55EDTCDE(4)
     A            B130           2        64
     A            B230           5  0     67EDTCDE(4)
     A            B131           2        76
     A            B231           5  0     79EDTCDE(4)
     A            B132           2        88
     A            B232           5  0     91EDTCDE(4)
     A            B133           2       100
     A            B233           5  0    103EDTCDE(4)
     A            B134           2       112
     A            B234           5  0    115EDTCDE(4)
     A            B135           2       124
     A            B235           5  0    127EDTCDE(4)
      *
     A          R LUKE6                     SPACEB(1)
     A            B136           2        52
     A            B236           5  0     55EDTCDE(4)
     A            B137           2        64
     A            B237           5  0     67EDTCDE(4)
     A            B138           2        76
     A            B238           5  0     79EDTCDE(4)
     A            B139           2        88
     A            B239           5  0     91EDTCDE(4)
     A            B140           2       100
     A            B240           5  0    103EDTCDE(4)
     A            B141           2       112
     A            B241           5  0    115EDTCDE(4)
     A            B142           2       124
     A            B242           5  0    127EDTCDE(4)
      *
     A          R LUKE7                     SPACEB(1)
     A            B143           2        52
     A            B243           5  0     55EDTCDE(4)
     A            B144           2        64
     A            B244           5  0     67EDTCDE(4)
     A            B145           2        76
     A            B245           5  0     79EDTCDE(4)
     A            B146           2        88
     A            B246           5  0     91EDTCDE(4)
     A            B147           2       100
     A            B247           5  0    103EDTCDE(4)
     A            B148           2       112
     A            B248           5  0    115EDTCDE(4)
     A            B149           2       124
     A            B249           5  0    127EDTCDE(4)
      *
     A          R LUKE8                     SPACEB(1)
     A                                     1' '
      *
     A          R LTOT1                     SPACEB(1)
     A                                     1' '
     A                                      SPACEA(1)
     A                                     2MSGCON(42 DIV3722 SYMSGF)
     A                                      SPACEA(1)
     A            T11            2        52
     A            T21            5  0     55EDTCDE(4)
     A            T12            2        64
     A            T22            5  0     67EDTCDE(4)
     A            T13            2        76
     A            T23            5  0     79EDTCDE(4)
     A            T14            2        88
     A            T24            5  0     91EDTCDE(4)
     A            T15            2       100
     A            T25            5  0    103EDTCDE(4)
     A            T16            2       112
     A            T26            5  0    115EDTCDE(4)
     A            T17            2       124
     A            T27            5  0    127EDTCDE(4)
      *
     A          R LTOT2                     SPACEB(1)
     A            T18            2        52
     A            T28            5  0     55EDTCDE(4)
     A            T19            2        64
     A            T29            5  0     67EDTCDE(4)
     A            T110           2        76
     A            T210           5  0     79EDTCDE(4)
     A            T111           2        88
     A            T211           5  0     91EDTCDE(4)
     A            T112           2       100
     A            T212           5  0    103EDTCDE(4)
     A            T113           2       112
     A            T213           5  0    115EDTCDE(4)
     A            T114           2       124
     A            T214           5  0    127EDTCDE(4)
      *
     A          R LTOT3                     SPACEB(1)
     A            T115           2        52
     A            T215           5  0     55EDTCDE(4)
     A            T116           2        64
     A            T216           5  0     67EDTCDE(4)
     A            T117           2        76
     A            T217           5  0     79EDTCDE(4)
     A            T118           2        88
     A            T218           5  0     91EDTCDE(4)
     A            T119           2       100
     A            T219           5  0    103EDTCDE(4)
     A            T120           2       112
     A            T220           5  0    115EDTCDE(4)
     A            T121           2       124
     A            T221           5  0    127EDTCDE(4)
      *
     A          R LTOT4                     SPACEB(1)
     A            T122           2        52
     A            T222           5  0     55EDTCDE(4)
     A            T123           2        64
     A            T223           5  0     67EDTCDE(4)
     A            T124           2        76
     A            T224           5  0     79EDTCDE(4)
     A            T125           2        88
     A            T225           5  0     91EDTCDE(4)
     A            T126           2       100
     A            T226           5  0    103EDTCDE(4)
     A            T127           2       112
     A            T227           5  0    115EDTCDE(4)
     A            T128           2       124
     A            T228           5  0    127EDTCDE(4)
      *
     A          R LTOT5                     SPACEB(1)
     A            T129           2        52
     A            T229           5  0     55EDTCDE(4)
     A            T130           2        64
     A            T230           5  0     67EDTCDE(4)
     A            T131           2        76
     A            T231           5  0     79EDTCDE(4)
     A            T132           2        88
     A            T232           5  0     91EDTCDE(4)
     A            T133           2       100
     A            T233           5  0    103EDTCDE(4)
     A            T134           2       112
     A            T234           5  0    115EDTCDE(4)
     A            T135           2       124
     A            T235           5  0    127EDTCDE(4)
      *
     A          R LTOT6                     SPACEB(1)
     A            T136           2        52
     A            T236           5  0     55EDTCDE(4)
     A            T137           2        64
     A            T237           5  0     67EDTCDE(4)
     A            T138           2        76
     A            T238           5  0     79EDTCDE(4)
     A            T139           2        88
     A            T239           5  0     91EDTCDE(4)
     A            T140           2       100
     A            T240           5  0    103EDTCDE(4)
     A            T141           2       112
     A            T241           5  0    115EDTCDE(4)
     A            T142           2       124
     A            T242           5  0    127EDTCDE(4)
      *
     A          R LTOT7                     SPACEB(1)
     A            T143           2        52
     A            T243           5  0     55EDTCDE(4)
     A            T144           2        64
     A            T244           5  0     67EDTCDE(4)
     A            T145           2        76
     A            T245           5  0     79EDTCDE(4)
     A            T146           2        88
     A            T246           5  0     91EDTCDE(4)
     A            T147           2       100
     A            T247           5  0    103EDTCDE(4)
     A            T148           2       112
     A            T248           5  0    115EDTCDE(4)
     A            T149           2       124
     A            T249           5  0    127EDTCDE(4)
