     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPPNLGRP(HLPSCR SYSJ50FPNL)
     A                                      HLPTITLE('REGISTRERING AV BILL OF L-
     A                                      ADING - EKSPORT')
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01I
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt registrering av BI-
     A                                      LL OF LADING')
     A                                      CF04(04 'Søke')
     A                                      CF09(09 'Ny tur')
     A                                      CF10(10 'B/L VARELINJE TYPE 1')
     A                                      CF11(11 'B/L VARELINJE TYPE 2')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A                                      CF13(13 'TIL SIDE 2')
     A                                      CF14(14 'Vise opplysning til AVSEND-
     A                                      ER/MOTTAKER/NOTIFY')
     A                                      CF15(15 'TIL OPPDRAG')
     A N28                                  CF16(16 'Neste')
     A                                      CF17(17 'FRISØKEVEI')
     A                                      CF18(18 'Freetext')
     A          H                           HLPPNLGRP(SYSJ50I010 SYSJ50IPNL)
     A                                      HLPARA(02 001 02 037)
     A          H                           HLPPNLGRP(SYSJ50I015 SYSJ50IPNL)
     A                                      HLPARA(02 038 02 053)
     A          H                           HLPPNLGRP(SYSJ50I020 SYSJ50IPNL)
     A                                      HLPARA(02 054 02 080)
     A          H                           HLPPNLGRP(SYSJ50I030 SYSJ50IPNL)
     A                                      HLPARA(03 001 03 033)
     A          H                           HLPPNLGRP(SYSJ50I035 SYSJ50IPNL)
     A                                      HLPARA(03 034 03 080)
     A          H                           HLPPNLGRP(SYSJ50I040 SYSJ50IPNL)
     A                                      HLPARA(04 001 05 080)
     A          H                           HLPPNLGRP(SYSJ50I045 SYSJ50IPNL)
     A                                      HLPARA(06 001 09 080)
     A          H                           HLPPNLGRP(SYSJ50I050 SYSJ50IPNL)
     A                                      HLPARA(10 001 10 080)
     A          H                           HLPPNLGRP(SYSJ50I055 SYSJ50IPNL)
     A                                      HLPARA(11 001 11 080)
     A          H                           HLPPNLGRP(SYSJ50I060 SYSJ50IPNL)
     A                                      HLPARA(12 001 12 080)
     A          H                           HLPPNLGRP(SYSJ50I065 SYSJ50IPNL)
     A                                      HLPARA(13 001 13 080)
     A          H                           HLPPNLGRP(SYSJ50I070 SYSJ50IPNL)
     A                                      HLPARA(14 001 14 080)
     A          H                           HLPPNLGRP(SYSJ50I075 SYSJ50IPNL)
     A                                      HLPARA(15 001 21 080)
     A          H                           HLPPNLGRP(SYSJ50I999 SYSJ50IPNL)
     A                                      HLPARA(22 001 24 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYSJ50I'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(040 YBC0195 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(004 DIV3163 *LIBL/SYMSGF)
     A            UAVD           4Y 0O  2  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 12MSGCON(006 DIV3164 *LIBL/SYMSGF)
     A            UOPD           7Y 0O  2 19DSPATR(UL)
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 27MSGCON(005 DIV3165 *LIBL/SYMSGF)
     A            USG            3A  H
     A            WSSG           3A  B  2 33DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 38MSGCON(005 DIV3185 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B  2 44DSPATR(UL)
     A  73                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  2 54MSGCON(004 DIV3186 *LIBL/SYMSGF)
     A            WSOB           5A  B  2 59DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 66MSGCON(003 DIV3166 *LIBL/SYMSGF)
     A            WSUKE          2Y 0B  2 70DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 74MSGCON(004 DIV3167 *LIBL/SYMSGF)
     A            WSAAR          2Y 0B  2 79DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(003 DIV3190 *LIBL/SYMSGF)
     A            WSKNR          8Y 0B  3  6DSPATR(UL)
     A  97                                  DSPATR(RI)
     A N97 51                               COLOR(RED)
     A N51                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAR         18A  O  3 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 34MSGCON(002 DIV3191 *LIBL/SYMSGF)
     A            WSTR           4A  B  3 37DSPATR(UL)
     A  96                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  3 42MSGCON(004 YBC0107 *LIBL/SYMSGF)
     A            WSREIS        14A  B  3 47DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  3 62MSGCON(002 YBC0108 *LIBL/SYMSGF)
     A            WSBLNR        16A  B  3 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(003 DIV3142 *LIBL/SYMSGF)
     A            WSKNA          8Y 0B  4  6DSPATR(UL)
     A  94                                  DSPATR(RI)
     A N94 52                               COLOR(RED)
     A N52                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKA          1A  B  4 16DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A            WSNAA         30A  B  4 19DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1A        30A  B  4 51DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD2A        30A  B  5 19DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD3A        30A  B  5 51DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2MSGCON(003 DIV3143 *LIBL/SYMSGF)
     A            WSKNM          8Y 0B  6  6DSPATR(UL)
     A  93                                  DSPATR(RI)
     A N93 53                               COLOR(RED)
     A N53                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKM          1A  B  6 16DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A            WSNAM         30A  B  6 19DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1M        30A  B  6 51DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD2M        30A  B  7 19DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD3M        30A  B  7 51DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  8  2MSGCON(003 DIV3144 *LIBL/SYMSGF)
     A            WSKNN          8Y 0B  8  6DSPATR(UL)
     A  92                                  DSPATR(RI)
     A N92 54                               COLOR(RED)
     A N54                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKN          1A  B  8 16DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A            WSNAN         30A  B  8 19DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD1N        30A  B  8 51DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD2N        30A  B  9 19DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSAD3N        30A  B  9 51DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10  2MSGCON(008 DIV3194 *LIBL/SYMSGF)
     A            WSKNSA         8Y 0B 10 11DSPATR(UL)
     A  91                                  DSPATR(RI)
     A N91 55                               COLOR(RED)
     A N55                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKSA         1A  B 10 20DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A                                 10 22MSGCON(008 DIV1062 *LIBL/SYMSGF)
     A            WSKNK          8Y 0B 10 31DSPATR(UL)
     A  90                                  DSPATR(RI)
     A N90 56                               COLOR(RED)
     A N56                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKK          1A  B 10 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A                                 10 42MSGCON(008 DIV3196 *LIBL/SYMSGF)
     A            WSKNKA         8Y 0B 10 51DSPATR(UL)
     A  89                                  DSPATR(RI)
     A N89 57                               COLOR(RED)
     A N57                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKKA         1A  B 10 60DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A                                 10 62MSGCON(008 YBC0198 *LIBL/SYMSGF)
     A            WSKNRA         8Y 0B 10 71DSPATR(UL)
     A  88                                  DSPATR(RI)
     A N88 58                               COLOR(RED)
     A N58                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKRA         1A  B 10 80DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A                                 11  2MSGCON(005 DIV3198 *LIBL/SYMSGF)
     A            WSLSS          5A  B 11  8DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLSS2         4A  B 11 14DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 20MSGCON(005 DIV3199 *LIBL/SYMSGF)
     A            WSLSH          5A  B 11 26DSPATR(UL)
     A  86                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 11 32MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            WSLB           5A  B 11 38DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 11 44MSGCON(005 DIV3201 *LIBL/SYMSGF)
     A            WSVH           5A  B 11 50DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSDTVH         6Y 0B 11 56DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 11 63MSGCON(005 YBC0273 *LIBL/SYMSGF)
     A            WSVH2          5A  B 11 69DSPATR(UL)
     A  68                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSDVH2         6Y 0B 11 75DSPATR(UL)
     A  67                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12  2MSGCON(005 DIV3203 *LIBL/SYMSGF)
     A            WSLOH          5A  B 12  8DSPATR(UL)
     A  82                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSDLOH         6Y 0B 12 14DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12 21MSGCON(005 DIV3204 *LIBL/SYMSGF)
     A            WSLOS          5A  B 12 27DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLOS2         4A  B 12 33DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 38MSGCON(010 YBC0197 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A            WSDTA          6Y 0B 12 49DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12 58MSGCON(010 DIV3206 *LIBL/SYMSGF)
     A            WSKDP          5A  B 12 69DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 12 76MSGCON(003 DIV3207 *LIBL/SYMSGF)
     A            WSCH           1A  B 12 80DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13  2MSGCON(008 DIV3220 *LIBL/SYMSGF)
     A            WSCP           1A  B 13 11TEXT('COLL/PPD')
     A                                      DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 13 28MSGCON(010 DIV3146 *LIBL/SYMSGF)
     A            WSMN          17A  B 13 39DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 63MSGCON(005 DIV3209 *LIBL/SYMSGF)
     A            WSLSTY         3A  B 13 69DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 13 76MSGCON(003 DIV3210 *LIBL/SYMSGF)
     A            WSMH           1A  B 13 80DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14  2MSGCON(010 YBC0199 *LIBL/SYMSGF)
     A            WSDTR          6Y 0B 14 13DSPATR(UL)
     A  75                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 16  2MSGCON(078 DIV3173 *LIBL/SYMSGF)
     A            WSMN01        17A  B 17  2DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNT01         5Y 0B 17 20DSPATR(UL)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKD01         2A  B 17 28DSPATR(UL)
     A  72                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSVS01        25A  B 17 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVK01         9Y 0B 17 58DSPATR(UL)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSM301         9Y 3B 17 69DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSMN02        17A  B 18  2DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNT02         5Y 0B 18 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKD02         2A  B 18 28DSPATR(UL)
     A  71                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSVS02        25A  B 18 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVK02         9Y 0B 18 58DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSM302         9Y 3B 18 69DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSMN03        17A  B 19  2DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNT03         5Y 0B 19 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKD03         2A  B 19 28DSPATR(UL)
     A  70                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSVS03        25A  B 19 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVK03         9Y 0B 19 58DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSM303         9Y 3B 19 69DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSMN04        17A  B 20  2DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNT04         5Y 0B 20 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKD04         2A  B 20 28DSPATR(UL)
     A  69                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSVS04        25A  B 20 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVK04         9Y 0B 20 58DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSM304         9Y 3B 20 69DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 21 62MSGCON(018 YBC0567 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22  2MSGCON(036 YBC0210 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 42MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N28N50                          22 62MSGCON(018 DIV3187 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50                             23  2MSGCON(078 YBC0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A  50                             23  2MSGCON(078 JOV1488 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BILDE01E
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt registrering av BI-
     A                                      LL OF LADING')
     A                                      CF04(04 'Søke')
     A                                      CF08(08 'Ekstra adresselinjer')
     A                                      CF09(09 'Ny tur')
     A                                      CF10(10 'B/L VARELINJE TYPE 1')
     A                                      CF11(11 'B/L VARELINJE TYPE 2')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A                                      CF13(13 'TIL SIDE 2')
     A                                      CF14(14 'Vise opplysning til AVSEND-
     A                                      ER/MOTTAKER/NOTIFY')
     A                                      CF15(15 'TIL OPPDRAG')
     A N28                                  CF16(16 'Neste')
     A                                      CF17(17 'TIL OPPDRAG')
     A                                      CF18(18 'Freetext')
     A          H                           HLPPNLGRP(SYSJ50I010 SYSJ50IPNL)
     A                                      HLPARA(02 001 02 037)
     A          H                           HLPPNLGRP(SYSJ50I015 SYSJ50IPNL)
     A                                      HLPARA(02 038 02 053)
     A          H                           HLPPNLGRP(SYSJ50I020 SYSJ50IPNL)
     A                                      HLPARA(02 054 02 080)
     A          H                           HLPPNLGRP(SYSJ50I030 SYSJ50IPNL)
     A                                      HLPARA(03 001 03 033)
     A          H                           HLPPNLGRP(SYSJ50I035 SYSJ50IPNL)
     A                                      HLPARA(03 034 03 080)
     A          H                           HLPPNLGRP(SYSJ50I040 SYSJ50IPNL)
     A                                      HLPARA(04 001 05 080)
     A          H                           HLPPNLGRP(SYSJ50I045 SYSJ50IPNL)
     A                                      HLPARA(06 001 09 080)
     A          H                           HLPPNLGRP(SYSJ50I050 SYSJ50IPNL)
     A                                      HLPARA(10 001 10 080)
     A          H                           HLPPNLGRP(SYSJ50I055 SYSJ50IPNL)
     A                                      HLPARA(11 001 11 080)
     A          H                           HLPPNLGRP(SYSJ50I060 SYSJ50IPNL)
     A                                      HLPARA(12 001 12 080)
     A          H                           HLPPNLGRP(SYSJ50I065 SYSJ50IPNL)
     A                                      HLPARA(13 001 13 080)
     A          H                           HLPPNLGRP(SYSJ50I070 SYSJ50IPNL)
     A                                      HLPARA(14 001 14 080)
     A          H                           HLPPNLGRP(SYSJ50I075 SYSJ50IPNL)
     A                                      HLPARA(15 001 21 080)
     A          H                           HLPPNLGRP(SYSJ50I999 SYSJ50IPNL)
     A                                      HLPARA(22 001 24 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYSJ50I'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(040 YBC0196 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(004 DIV3163 *LIBL/SYMSGF)
     A            UAVD           4Y 0O  2  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 12MSGCON(006 DIV3164 *LIBL/SYMSGF)
     A            UOPD           7Y 0O  2 19DSPATR(UL)
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 27MSGCON(005 DIV3165 *LIBL/SYMSGF)
     A            USG            3A  H
     A            WSSG           3A  B  2 33DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 38MSGCON(005 DIV3185 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B  2 44DSPATR(UL)
     A  73                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                  2 54MSGCON(004 DIV3186 *LIBL/SYMSGF)
     A            WSOB           5A  B  2 59DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  2 66MSGCON(003 DIV3166 *LIBL/SYMSGF)
     A            WSUKE          2Y 0B  2 70DSPATR(UL)
     A  98                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 74MSGCON(004 DIV3167 *LIBL/SYMSGF)
     A            WSAAR          2Y 0B  2 79DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(003 DIV3190 *LIBL/SYMSGF)
     A            WSKNR          8Y 0B  3  6DSPATR(UL)
     A  97                                  DSPATR(RI)
     A N97 51                               COLOR(RED)
     A N51                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAR         18A  O  3 15DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  3 34MSGCON(002 DIV3191 *LIBL/SYMSGF)
     A            WSTR           4A  B  3 37DSPATR(UL)
     A  96                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  3 42MSGCON(004 YBC0107 *LIBL/SYMSGF)
     A            WSREIS        14A  B  3 47DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  3 62MSGCON(002 YBC0108 *LIBL/SYMSGF)
     A            WSBLNR        16A  B  3 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(003 DIV3142 *LIBL/SYMSGF)
     A            WSKNA          8Y 0B  4  6DSPATR(UL)
     A  34                                  DSPATR(PR)
     A  94                                  DSPATR(RI)
     A N94 52                               COLOR(RED)
     A N52                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKA          1A  B  4 16DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A            WSNAA         30A  B  4 19DSPATR(UL)
     A  34                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD1A        30A  B  4 51DSPATR(UL)
     A  34                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD2A        30A  B  5 19DSPATR(UL)
     A  34                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD3A        30A  B  5 51DSPATR(UL)
     A  34                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  6  2MSGCON(003 DIV3143 *LIBL/SYMSGF)
     A            WSKNM          8Y 0B  6  6DSPATR(UL)
     A  31                                  DSPATR(PR)
     A  93                                  DSPATR(RI)
     A N93 53                               COLOR(RED)
     A N53                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKM          1A  B  6 16DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A            WSNAM         30A  B  6 19DSPATR(UL)
     A  31                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD1M        30A  B  6 51DSPATR(UL)
     A  31                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD2M        30A  B  7 19DSPATR(UL)
     A  31                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD3M        30A  B  7 51DSPATR(UL)
     A  31                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                  8  2MSGCON(003 DIV3144 *LIBL/SYMSGF)
     A            WSKNN          8Y 0B  8  6DSPATR(UL)
     A  32                                  DSPATR(PR)
     A  92                                  DSPATR(RI)
     A N92 54                               COLOR(RED)
     A N54                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKN          1A  B  8 16DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A            WSNAN         30A  B  8 19DSPATR(UL)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD1N        30A  B  8 51DSPATR(UL)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD2N        30A  B  9 19DSPATR(UL)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSAD3N        30A  B  9 51DSPATR(UL)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 10  2MSGCON(008 DIV3194 *LIBL/SYMSGF)
     A            WSKNSA         8Y 0B 10 11DSPATR(UL)
     A  91                                  DSPATR(RI)
     A N91 55                               COLOR(RED)
     A N55                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKSA         1A  B 10 20DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A                                 10 22MSGCON(008 DIV1062 *LIBL/SYMSGF)
     A            WSKNK          8Y 0B 10 31DSPATR(UL)
     A  90                                  DSPATR(RI)
     A N90 56                               COLOR(RED)
     A N56                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKK          1A  B 10 40DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A                                 10 42MSGCON(008 DIV3196 *LIBL/SYMSGF)
     A            WSKNKA         8Y 0B 10 51DSPATR(UL)
     A  89                                  DSPATR(RI)
     A N89 57                               COLOR(RED)
     A N57                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKKA         1A  B 10 60DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A                                 10 62MSGCON(008 YBC0198 *LIBL/SYMSGF)
     A            WSKNRA         8Y 0B 10 71DSPATR(UL)
     A  88                                  DSPATR(RI)
     A N88 58                               COLOR(RED)
     A N58                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSDKRA         1A  B 10 80DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'P' 'J')
     A                                 11  2MSGCON(005 DIV3198 *LIBL/SYMSGF)
     A            WSLSS          5A  B 11  8DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLSS2         4A  B 11 14DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 20MSGCON(005 DIV3199 *LIBL/SYMSGF)
     A            WSLSH          5A  B 11 26DSPATR(UL)
     A  86                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 11 32MSGCON(005 DIV3200 *LIBL/SYMSGF)
     A            WSLB           5A  B 11 38DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 11 44MSGCON(005 DIV3201 *LIBL/SYMSGF)
     A            WSVH           5A  B 11 50DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSDTVH         6Y 0B 11 56DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 11 63MSGCON(005 YBC0273 *LIBL/SYMSGF)
     A            WSVH2          5A  B 11 69DSPATR(UL)
     A  68                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSDVH2         6Y 0B 11 75DSPATR(UL)
     A  67                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12  2MSGCON(005 DIV3203 *LIBL/SYMSGF)
     A            WSLOH          5A  B 12  8DSPATR(UL)
     A  82                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSDLOH         6Y 0B 12 14DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12 21MSGCON(005 DIV3204 *LIBL/SYMSGF)
     A            WSLOS          5A  B 12 27DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSLOS2         4A  B 12 33DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 38MSGCON(010 DIV3928 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A            WSDTA          6Y 0B 12 49DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 12 58MSGCON(010 DIV3206 *LIBL/SYMSGF)
     A            WSKDP          5A  B 12 69DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 12 76MSGCON(003 DIV3207 *LIBL/SYMSGF)
     A            WSCH           1A  B 12 80DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13  2MSGCON(008 DIV3208 *LIBL/SYMSGF)
     A            WSMM          15A  B 13 11DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 28MSGCON(010 DIV3146 *LIBL/SYMSGF)
     A            WSMN          17A  B 13 39DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 63MSGCON(005 DIV3209 *LIBL/SYMSGF)
     A            WSLSTY         3A  B 13 69DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 13 76MSGCON(003 DIV3210 *LIBL/SYMSGF)
     A            WSMH           1A  B 13 80DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14  2MSGCON(008 DIV3220 *LIBL/SYMSGF)
     A            WSCP           1A  B 14 11TEXT('COLL/PPD')
     A                                      DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 14 13MSGCON(010 DIV3153 *LIBL/SYMSGF)
     A            WSNTBS        15A  B 14 24DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 14 40MSGCON(005 DIV3154 *LIBL/SYMSGF)
     A            WSSD           5A  B 14 46DSPATR(UL)
     A  76                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 14 52MSGCON(010 YBC0199 *LIBL/SYMSGF)
     A            WSDTR          6Y 0B 14 63DSPATR(UL)
     A  75                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 15 23MSGCON(007 DIV3211 *LIBL/SYMSGF)
     A                                 15 41MSGCON(008 DIV3222 *LIBL/SYMSGF)
     A            WSKNG          8Y 0B 15 50DSPATR(UL)
     A  35                                  DSPATR(PR)
     A  74                                  DSPATR(RI)
     A N74 59                               COLOR(RED)
     A N59                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 16  2MSGCON(020 DIV3212 *LIBL/SYMSGF)
     A            WSOLP          1A  B 16 24TEXT('PRE. ORIG. LANDFR.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSOLC          1A  B 16 28TEXT('COL. ORIG. LANDFR.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSNAG         30A  B 16 41DSPATR(UL)
     A  35                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 17  2MSGCON(020 DIV3213 *LIBL/SYMSGF)
     A            WSOTP          1A  B 17 24TEXT('PRE. ORIG. TOC')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSOTC          1A  B 17 28TEXT('COL. ORIG. TOC')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSAD1G        30A  B 17 41DSPATR(UL)
     A  35                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 18  2MSGCON(020 DIV3214 *LIBL/SYMSGF)
     A            WSSFP          1A  B 18 24TEXT('PRE. SEAFREIGHT')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSSFC          1A  B 18 28TEXT('COL. SEAFREIGHT')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSAD2G        30A  B 18 41DSPATR(UL)
     A  35                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 19  2MSGCON(020 DIV3217 *LIBL/SYMSGF)
     A            WSDTP          1A  B 19 24TEXT('PRE. DESTINATION TOC')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSDTC          1A  B 19 28TEXT('COL. DESTINATION TOC')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSAD3G        30A  B 19 41DSPATR(UL)
     A  35                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                 20  2MSGCON(020 DIV3218 *LIBL/SYMSGF)
     A            WSDLP          1A  B 20 24TEXT('PRE. DEST. LANDFR.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSDLC          1A  B 20 28TEXT('COL. DEST. LANDFR.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A                                 21  2MSGCON(020 DIV3219 *LIBL/SYMSGF)
     A            WSMFP          1A  B 21 24TEXT('PRE. MULTIMODAL FR.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A            WSMFC          1A  B 21 28TEXT('COL. MULTIMODAL FR.')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X')
     A                                 21 42MSGCON(018 YBC0687 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 21 62MSGCON(018 YBC0567 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22  2MSGCON(036 YBC0210 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 42MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N28N50                          22 62MSGCON(018 DIV3187 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50                             23  2MSGCON(078 YBC0209 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A  50                             23  2MSGCON(078 JOV1488 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BILDE02
     A                                      CF12(12 'AVBRYT')
     A                                  1  2'SYSPED/SYSJ50I'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A N27                              1 20MSGCON(040 YBC0195 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A  27                              1 20MSGCON(040 YBC0196 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  3  2MSGCON(010 DIV3116 *LIBL/SYMSGF)
     A            UAVD           4Y 0O  3 14DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 22MSGCON(012 DIV3117 *LIBL/SYMSGF)
     A            UOPD           7Y 0O  3 36DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3 45MSGCON(010 DIV3118 *LIBL/SYMSGF)
     A            BLSG           3A  O  3 57DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  6  8MSGCON(030 DIV3273 *LIBL/SYMSGF)
     A            WSPRT          1A  B  6 41DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A            WSKOPI         2Y 0B  6 44EDTCDE(4)
     A                                  6 49'(J/N, Avvikende ant Kopier)'
     A                                  8  8MSGCON(030 DIV3571 *LIBL/SYMSGF)
     A            WSADV          1A  B  8 41DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                  8 49'(J/N)'
     A                                 10  8MSGCON(030 YBC0343 *LIBL/SYMSGF)
     A            WSFAX          1A  B 10 41DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 10 49'(J/N)'
     A                                 11 14MSGCON(024 YBC0344 *LIBL/SYMSGF)
     A            WSCVP          1A  B 11 41DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 11 49'(J/N)'
     A                                 13  8MSGCON(020 DIV3274 *LIBL/SYMSGF)
     A            WSJBK          1A  B 13 41DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 13 49'(J/N)'
     A N50                             17  8MSGCON(030 DIV3275 *LIBL/SYMSGF)
     A N50        WSTILO         1A  B 17 41DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A N50                             17 49'(J/N)'
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
      *
     A          R ADRLINA
     A                                      WINDOW(*DFT 8 61 *NOMSGLIN)
     A                                      CF12(12 'AVBRYT')
     A                                      OVERLAY
     A                                  1  2'SYSPED/SYSJ50I'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(25 YBC0740 SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(12 YBC0738 SYMSGF)
     A            W2AD0A        45A  B  2 15DSPATR(UL)
     A            W2NAA         45A  B  3 15DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A            W2AD1A        45A  B  4 15DSPATR(UL)
     A            W2AD2A        45A  B  5 15DSPATR(UL)
     A            W2AD3A        45A  B  6 15DSPATR(UL)
     A            W2AD4A        45A  B  7 15DSPATR(UL)
     A N99                              8  2MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A  99                              8  2MSGCON(45 YBC0691 SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R ADRLINM
     A                                      WINDOW(*DFT 8 61 *NOMSGLIN)
     A                                      CF12(12 'AVBRYT')
     A                                      OVERLAY
     A                                  1  2'SYSPED/SYSJ50I'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(25 YBC0688 SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(12 YBC0690 SYMSGF)
     A            W2AD0M        45A  B  2 15DSPATR(UL)
     A            W2NAM         45A  B  3 15DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A            W2AD1M        45A  B  4 15DSPATR(UL)
     A            W2AD2M        45A  B  5 15DSPATR(UL)
     A            W2AD3M        45A  B  6 15DSPATR(UL)
     A            W2AD4M        45A  B  7 15DSPATR(UL)
     A N99                              8  2MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A  99                              8  2MSGCON(45 YBC0691 SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R ADRLINN
     A                                      WINDOW(*DFT 8 61 *NOMSGLIN)
     A                                      CF12(12 'AVBRYT')
     A                                      OVERLAY
     A                                  1  2'SYSPED/SYSJ50I'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(25 YBC0689 SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(12 YBC0692 SYMSGF)
     A            W2AD0N        45A  B  2 15DSPATR(UL)
     A            W2NAN         45A  B  3 15DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A            W2AD1N        45A  B  4 15DSPATR(UL)
     A            W2AD2N        45A  B  5 15DSPATR(UL)
     A            W2AD3N        45A  B  6 15DSPATR(UL)
     A            W2AD4N        45A  B  7 15DSPATR(UL)
     A N99                              8  2MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A  99                              8  2MSGCON(45 YBC0693 SYMSGF)
     A                                      COLOR(WHT)
      *
     A          R ADRLING
     A                                      WINDOW(*DFT 8 61 *NOMSGLIN)
     A                                      CF12(12 'AVBRYT')
     A                                      OVERLAY
     A                                  1  2'SYSPED/SYSJ50I'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(25 YBC0741 SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(12 YBC0739 SYMSGF)
     A            W2AD0G        45A  B  2 15DSPATR(UL)
     A            W2NAG         45A  B  3 15DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A            W2AD1G        45A  B  4 15DSPATR(UL)
     A            W2AD2G        45A  B  5 15DSPATR(UL)
     A            W2AD3G        45A  B  6 15DSPATR(UL)
     A            W2AD4G        45A  B  7 15DSPATR(UL)
     A N99                              8  2MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A  99                              8  2MSGCON(45 YBC0691 SYMSGF)
     A                                      COLOR(WHT)
