      *_________________________________
      * Format for markering av ny side.
      *"""""""""""""""""""""""""""""""""
     A          R LINJE1
     A                                  1  1' '
     A            KFMT1         75      1  1
     A            KFMT2         75      1  1
      *_________________________________
      * Format for hovedopplysninger
      *"""""""""""""""""""""""""""""""""""""""""""""
     A          R UTSKRI                    SPACEB(1)
     A            AA120        120         1
