     A          R PFMANIF
     A                                  4  2'**********************************-
     A                                      **'
     A                                  5  2MSGCON(036 DIV4128 *LIBL/SYMSGF)
     A                                  6  2'*                                 -
     A                                       *'
     A                                  7  2MSGCON(036 DIV4129 *LIBL/SYMSGF)
     A                                  8  2'**********************************-
     A                                      **'
     A                                 10  2MSGCON(031 DIV4130 *LIBL/SYMSGF)
     A            FMNAA         30     10 34HIGHLIGHT
     A                                 12  2MSGCON(008 DIV4131 *LIBL/SYMSGF)
     A            FMAVD          4  0  12 11HIGHLIGHT
     A                                 12 15'/'
     A                                      HIGHLIGHT
     A            FMOPD          7  0  12 16HIGHLIGHT
     A                                 12 23'/'
     A                                      HIGHLIGHT
     A            BLSG           3     12 24HIGHLIGHT
     A                                 12 27'/'
     A                                      HIGHLIGHT
     A            BLPRO          8  0  12 28HIGHLIGHT
     A                                 12 39MSGCON(006 DIV4132 *LIBL/SYMSGF)
     A            FMTR           4     12 46HIGHLIGHT
     A                                 12 65MSGCON(005 DIV4133 *LIBL/SYMSGF)
     A            XDT            6  0  12 71EDTCDE(Y)
     A                                      HIGHLIGHT
     A                                 14  2MSGCON(007 DIV4134 *LIBL/SYMSGF)
     A            CBNAB         30     14 10HIGHLIGHT
     A                                 14 41MSGCON(004 DIV4135 *LIBL/SYMSGF)
     A            FMREIS        14     14 46HIGHLIGHT
     A                                 14 62MSGCON(013 DIV4136 *LIBL/SYMSGF)
     A            FMLSH          5     14 76HIGHLIGHT
     A                                 16  2MSGCON(015 DIV4137 *LIBL/SYMSGF)
     A            FMBLNR        16     16 18HIGHLIGHT
     A                                 16 41MSGCON(004 DIV4101 *LIBL/SYMSGF)
     A            BOREFN        14A    16 46HIGHLIGHT
     A                                 18  2'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                 19  2MSGCON(078 DIV4138 *LIBL/SYMSGF)
     A                                 20  2'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                 21  2MSGCON(078 DIV4139 *LIBL/SYMSGF)
     A                                 22  2MSGCON(033 DIV4140 *LIBL/SYMSGF)
     A            FMNAA3        30     22 36
     A                                 22 79'*'
     A                                 23  2MSGCON(078 DIV4225 *LIBL/SYMSGF)
     A                                 24  2'**********************************-
     A                                      ***********************************-
     A                                      *********'
     A                                 25  2'*----------------------------------
     A                                      ------------------------------------
     A                                      --------*'
     A                                 26  2MSGCON(078 DIV4141 *LIBL/SYMSGF)
     A                                 27  2'|----------------------------------
     A                                      ------------------------------------
     A                                      --------|'
     A                                 28  2'|'
     A            FMFT11        30     28  4
     A                                 28 34'|'
     A            FMKU11         7  4  28 35EDTCDE(4)
     A                                 28 43'|'
     A            FMVA11         3     28 44
     A                                 28 47'|'
     A            FMPR11        13  2  28 48EDTCDE(M)
     A                                 28 63'|'
     A            FMCO11        13  2  28 64EDTCDE(M)
     A                                 28 79'|'
     A                                 29  2'|'
     A            FMFT12        30     29  4
     A                                 29 34'|'
     A            FMKU12         7  4  29 35EDTCDE(4)
     A                                 29 43'|'
     A            FMVA12         3     29 44
     A                                 29 47'|'
     A            FMPR12        13  2  29 48EDTCDE(M)
     A                                 29 63'|'
     A            FMCO12        13  2  29 64EDTCDE(M)
     A                                 29 79'|'
     A                                 30  2'|'
     A            FMFT13        30     30  4
     A                                 30 34'|'
     A            FMKU13         7  4  30 35EDTCDE(4)
     A                                 30 43'|'
     A            FMVA13         3     30 44
     A                                 30 47'|'
     A            FMPR13        13  2  30 48EDTCDE(M)
     A                                 30 63'|'
     A            FMCO13        13  2  30 64EDTCDE(M)
     A                                 30 79'|'
     A                                 31  2'|'
     A            FMFT14        30     31  4
     A                                 31 34'|'
     A            FMKU14         7  4  31 35EDTCDE(4)
     A                                 31 43'|'
     A            FMVA14         3     31 44
     A                                 31 47'|'
     A            FMPR14        13  2  31 48EDTCDE(M)
     A                                 31 63'|'
     A            FMCO14        13  2  31 64EDTCDE(M)
     A                                 31 79'|'
     A                                 32  2'|'
     A            FMFT15        30     32  4
     A                                 32 34'|'
     A            FMKU15         7  4  32 35EDTCDE(4)
     A                                 32 43'|'
     A            FMVA15         3     32 44
     A                                 32 47'|'
     A            FMPR15        13  2  32 48EDTCDE(M)
     A                                 32 63'|'
     A            FMCO15        13  2  32 64EDTCDE(M)
     A                                 32 79'|'
     A                                 33  2'|'
     A            FMFT16        30     33  4
     A                                 33 34'|'
     A            FMKU16         7  4  33 35EDTCDE(4)
     A                                 33 43'|'
     A            FMVA16         3     33 44
     A                                 33 47'|'
     A            FMPR16        13  2  33 48EDTCDE(M)
     A                                 33 63'|'
     A            FMCO16        13  2  33 64EDTCDE(M)
     A                                 33 79'|'
     A                                 34  2'|'
     A            FMFT17        30     34  4
     A                                 34 34'|'
     A            FMKU17         7  4  34 35EDTCDE(4)
     A                                 34 43'|'
     A            FMVA17         3     34 44
     A                                 34 47'|'
     A            FMPR17        13  2  34 48EDTCDE(M)
     A                                 34 63'|'
     A            FMCO17        13  2  34 64EDTCDE(M)
     A                                 34 79'|'
     A                                 35  2'|'
     A            FMFT18        30     35  4
     A                                 35 34'|'
     A            FMKU18         7  4  35 35EDTCDE(4)
     A                                 35 43'|'
     A            FMVA18         3     35 44
     A                                 35 47'|'
     A            FMPR18        13  2  35 48EDTCDE(M)
     A                                 35 63'|'
     A            FMCO18        13  2  35 64EDTCDE(M)
     A                                 35 79'|'
     A                                 36  2'|'
     A            FMFT19        30     36  4
     A                                 36 34'|'
     A            FMKU19         7  4  36 35EDTCDE(4)
     A                                 36 43'|'
     A            FMVA19         3     36 44
     A                                 36 47'|'
     A            FMPR19        13  2  36 48EDTCDE(M)
     A                                 36 63'|'
     A            FMCO19        13  2  36 64EDTCDE(M)
     A                                 36 79'|'
     A                                 37  2'|'
     A            FMFT1A        30     37  4
     A                                 37 34'|'
     A            FMKU1A         7  4  37 35EDTCDE(4)
     A                                 37 43'|'
     A            FMVA1A         3     37 44
     A                                 37 47'|'
     A            FMPR1A        13  2  37 48EDTCDE(M)
     A                                 37 63'|'
     A            FMCO1A        13  2  37 64EDTCDE(M)
     A                                 37 79'|'
     A                                 38  2'|----------------------------------
     A                                      ------------------------------------
     A                                      --------|'
     A                                 39  2MSGCON(078 DIV4142 *LIBL/SYMSGF)
     A                                 40  2'|----------------------------------
     A                                      ------------------------------------
     A                                      --------|'
     A                                 41  2MSGCON(013 DIV4143 *LIBL/SYMSGF)
     A            FMVA21         3     41 15
     A                                 41 18'|'
     A            FMPR21        13  2  41 19EDTCDE(M)
     A                                 41 34'|'
     A            FMKU21         7  4  41 35EDTCDE(4)
     A                                 41 43'|'
     A            FMVA2A         3     41 44
     A                                 41 47'|'
     A            FMP221        13  2  41 48EDTCDE(M)
     A                                 41 63'|'
     A                                 41 79'|'
     A                                 42  2MSGCON(013 DIV4144 *LIBL/SYMSGF)
     A            FMVA22         3     42 15
     A                                 42 18'|'
     A            FMPR22        13  2  42 19EDTCDE(M)
     A                                 42 34'|'
     A            FMKU22         7  4  42 35EDTCDE(4)
     A                                 42 43'|'
     A            FMVA2B         3     42 44
     A                                 42 47'|'
     A            FMP222        13  2  42 48EDTCDE(M)
     A                                 42 63'|'
     A                                 42 79'|'
     A                                 43  2MSGCON(013 DIV4145 *LIBL/SYMSGF)
     A            FMVA23         3     43 15
     A                                 43 18'|'
     A            FMPR23        13  2  43 19EDTCDE(M)
     A                                 43 34'|'
     A            FMKU23         7  4  43 35EDTCDE(4)
     A                                 43 43'|'
     A            FMVA2C         3     43 44
     A                                 43 47'|'
     A            FMP223        13  2  43 48EDTCDE(M)
     A                                 43 63'|'
     A                                 43 79'|'
     A                                 44  2MSGCON(013 DIV4146 *LIBL/SYMSGF)
     A            FMVA24         3     44 15
     A                                 44 18'|'
     A            FMPR24        13  2  44 19EDTCDE(M)
     A                                 44 34'|'
     A            FMKU24         7  4  44 35EDTCDE(4)
     A                                 44 43'|'
     A            FMVA2D         3     44 44
     A                                 44 47'|'
     A            FMP224        13  2  44 48EDTCDE(M)
     A                                 44 63'|'
     A                                 44 79'|'
     A                                 45  2MSGCON(013 DIV4147 *LIBL/SYMSGF)
     A            FMVA25         3     45 15
     A                                 45 18'|'
     A            FMPR25        13  2  45 19EDTCDE(M)
     A                                 45 34'|'
     A            FMKU25         7  4  45 35EDTCDE(4)
     A                                 45 43'|'
     A            FMVA2E         3     45 44
     A                                 45 47'|'
     A            FMP225        13  2  45 48EDTCDE(M)
     A                                 45 63'|'
     A                                 45 79'|'
     A                                 46  2'|_________________________________-
     A                                      ___________________________________-
     A                                      ________|'
     A                                 47  2MSGCON(017 DIV4148 *LIBL/SYMSGF)
     A                                 47 19MSGCON(025 DIV4149 *LIBL/SYMSGF)
     A                                      UNDERLINE
     A            FMVATL         3     47 44UNDERLINE
     A                                 47 47'|'
     A                                      UNDERLINE
     A            FMPRTL        13  2  47 48EDTCDE(M)
     A                                      UNDERLINE
     A                                 47 63'|'
     A                                 47 79'|'
     A                                 48  2'|               |'
     A                                      UNDERLINE
     A                                 48 19MSGCON(016 DIV4150 *LIBL/SYMSGF)
     A                                      UNDERLINE
     A            FMKUTA         7  4  48 35EDTCDE(4)
     A                                      UNDERLINE
     A                                 48 43'|'
     A                                      UNDERLINE
     A            FMVATA         3     48 44UNDERLINE
     A                                 48 47'|'
     A                                      UNDERLINE
     A            FMPRTA        13  2  48 48EDTCDE(M)
     A                                      UNDERLINE
     A                                 48 63'|               |'
     A                                      UNDERLINE
     A                                 50  2'*=================================-
     A                                      ===================================-
     A                                      ========*'
     A                                 51  2MSGCON(062 DIV4151 *LIBL/SYMSGF)
     A            FMVALC         3     51 72
     A                                 51 79'|'
     A                                 52  2'|'
     A            FMNAA2        28     52  5
     A                                 52 34'|'
     A                                 52 38'|'
     A                                 52 54'|'
     A                                 52 63'|'
     A                                 52 79'|'
     A                                 53  2'|----------------------------------
     A                                      ------------------------------------
     A                                      --------|'
     A                                 54  2MSGCON(033 DIV4152 *LIBL/SYMSGF)
     A            FMVA31         3     54 35
     A                                 54 38'|'
     A            FMAM31        13  2  54 39EDTCDE(M)
     A                                 54 54'|'
     A            FMKU31         7  4  54 55EDTCDE(4)
     A                                 54 63'|'
     A            FMLC31        13  2  54 64EDTCDE(M)
     A                                 54 79'|'
     A                                 55  2MSGCON(033 DIV4153 *LIBL/SYMSGF)
     A            FMVA32         3     55 35
     A                                 55 38'|'
     A            FMAM32        13  2  55 39EDTCDE(M)
     A                                 55 54'|'
     A            FMKU32         7  4  55 55EDTCDE(4)
     A                                 55 63'|'
     A            FMLC32        13  2  55 64EDTCDE(M)
     A                                 55 79'|'
     A                                 56  2MSGCON(033 DIV4154 *LIBL/SYMSGF)
     A            FMVA33         3     56 35
     A                                 56 38'|'
     A            FMAM33        13  2  56 39EDTCDE(M)
     A                                 56 54'|'
     A            FMKU33         7  4  56 55EDTCDE(4)
     A                                 56 63'|'
     A            FMLC33        13  2  56 64EDTCDE(M)
     A                                 56 79'|'
     A                                 57  2MSGCON(033 DIV4155 *LIBL/SYMSGF)
     A            FMVA34         3     57 35
     A                                 57 38'|'
     A            FMAM34        13  2  57 39EDTCDE(M)
     A                                 57 54'|'
     A            FMKU34         7  4  57 55EDTCDE(4)
     A                                 57 63'|'
     A            FMLC34        13  2  57 64EDTCDE(M)
     A                                 57 79'|'
     A                                 58  2MSGCON(033 DIV4156 *LIBL/SYMSGF)
     A            FMVA35         3     58 35
     A                                 58 38'|'
     A            FMAM35        13  2  58 39EDTCDE(M)
     A                                 58 54'|'
     A            FMKU35         7  4  58 55EDTCDE(4)
     A                                 58 63'|'
     A            FMLC35        13  2  58 64EDTCDE(M)
     A                                 58 79'|'
     A                                 59  2MSGCON(033 DIV4157 *LIBL/SYMSGF)
     A            FMVA36         3     59 35
     A                                 59 38'|'
     A            FMAM36        13  2  59 39EDTCDE(M)
     A                                 59 54'|'
     A            FMKU36         7  4  59 55EDTCDE(4)
     A                                 59 63'|'
     A            FMLC36        13  2  59 64EDTCDE(M)
     A                                 59 79'|'
     A                                 60  2MSGCON(033 DIV4158 *LIBL/SYMSGF)
     A            FMVA37         3     60 35
     A                                 60 38'|'
     A            FMAM37        13  2  60 39EDTCDE(M)
     A                                 60 54'|'
     A            FMKU37         7  4  60 55EDTCDE(4)
     A                                 60 63'|'
     A            FMLC37        13  2  60 64EDTCDE(M)
     A                                 60 79'|'
     A                                 61  2MSGCON(033 DIV4159 *LIBL/SYMSGF)
     A            FMVA38         3     61 35
     A                                 61 38'|'
     A            FMAM38        13  2  61 39EDTCDE(M)
     A                                 61 54'|'
     A            FMKU38         7  4  61 55EDTCDE(4)
     A                                 61 63'|'
     A            FMLC38        13  2  61 64EDTCDE(M)
     A                                 61 79'|'
     A                                 62  2MSGCON(033 DIV4160 *LIBL/SYMSGF)
     A            FMVA39         3     62 35
     A                                 62 38'|'
     A            FMAM39        13  2  62 39EDTCDE(M)
     A                                 62 54'|'
     A            FMKU39         7  4  62 55EDTCDE(4)
     A                                 62 63'|'
     A            FMLC39        13  2  62 64EDTCDE(M)
     A                                 62 79'|'
     A                                 63  2MSGCON(033 DIV4161 *LIBL/SYMSGF)
     A            FMVA3A         3     63 35
     A                                 63 38'|'
     A            FMAM3A        13  2  63 39EDTCDE(M)
     A                                 63 54'|'
     A            FMKU3A         7  4  63 55EDTCDE(4)
     A                                 63 63'|'
     A            FMLC3A        13  2  63 64EDTCDE(M)
     A                                 63 79'|'
     A                                 64  2MSGCON(033 DIV4162 *LIBL/SYMSGF)
     A            FMVA3B         3     64 35
     A                                 64 38'|'
     A            FMAM3B        13  2  64 39EDTCDE(M)
     A                                 64 54'|'
     A            FMKU3B         7  4  64 55EDTCDE(4)
     A                                 64 63'|'
     A            FMLC3B        13  2  64 64EDTCDE(M)
     A                                 64 79'|'
     A                                 65  2'|----------------------------------
     A                                      ------------------------------------
     A                                      --------|'
     A                                 66  2MSGCON(033 DIV4163 *LIBL/SYMSGF)
     A                                 66 38'|'
     A                                 66 54'|'
     A                                 66 63'|'
     A            FMLCTO        13  2  66 64EDTCDE(M)
     A                                 66 79'|'
     A                                 67  2'*=================================-
     A                                      ===================================-
     A                                      ========*'
