     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  6  2VALUES(' ' '2' '5')
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A            BOOPD          7  0O  6  5EDTCDE(4)
     A  49                                  COLOR(WHT)
     A            XDT1           6  0O  6 13EDTCDE(4)
     A            BOSG           3   O  6 20
     A            BOUKE          2  0O  6 24EDTCDE(1)
     A  41                                  COLOR(WHT)
     A            BOKNR          8  0O  6 28EDTCDE(4)
     A  42                                  COLOR(WHT)
     A            BOTR           4   O  6 37
     A  43                                  COLOR(WHT)
     A            XNAA          18   O  6 42
     A  44                                  COLOR(WHT)
     A            BOLBN         20   O  6 61
     A  45                                  COLOR(WHT)
     A            BOST           1   O  7  3DSPATR(UL)
     A            BOREFN        14   O  7  5DSPATR(UL)
     A  50                                  COLOR(WHT)
     A            BOLSH          5   O  7 20DSPATR(UL)
     A  46                                  COLOR(WHT)
     A            BOLOH          5   O  7 29DSPATR(UL)
     A  51                                  COLOR(WHT)
     A            XNAS          20   O  7 38DSPATR(UL)
     A  47                                  COLOR(WHT)
     A            BOOBN         20   O  7 59DSPATR(UL)
     A  48                                  COLOR(WHT)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0009)
     A                                      SFLPAG(0008)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  1 77SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYSJ52A'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(40 DIV3438 SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(9 DIV0050 SYMSGF)
     A            UAVD           4Y 0O  2 12DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  41                              2 20MSGCON(24 DIV3443 SYMSGF)
     A  41                              2 45MSGCON(4 DIV3444 SYMSGF)
     A  41        UÅR            2Y 0O  2 50DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(1)
     A  41                              2 54MSGCON(4 DIV3445 SYMSGF)
     A  41        UUKE           2Y 0O  2 59DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(1)
     A  41                              2 62MSGCON(10 DIV3446 SYMSGF)
     A  41        UUKET          2Y 0O  2 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(1)
     A  42                              2 20MSGCON(24 DIV3447 SYMSGF)
     A  42
     AO 44
     AO 47        KNAVN         30   O  2 45DSPATR(UL)
     A                                      COLOR(WHT)
     A  43                              2 20MSGCON(24 DIV3448 SYMSGF)
     A  43        UTR            4   O  2 45DSPATR(UL)
     A                                      COLOR(WHT)
     A  44                              2 20MSGCON(24 DIV3449 SYMSGF)
     A  45                              2 20MSGCON(24 DIV3450 SYMSGF)
     A  45
     AO 48        CDNAB         30   O  2 45DSPATR(UL)
     A                                      COLOR(WHT)
     A  46                              2 20MSGCON(24 DIV3451 SYMSGF)
     A  51                              2 20MSGCON(24 YBC0007 SYMSGF)
     A  46
     AO 51        ST2NVN        30   O  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A  47                              2 20MSGCON(24 DIV3452 SYMSGF)
     A  48                              2 20MSGCON(24 DIV3453 SYMSGF)
     A  49                              2 20MSGCON(24 DIV3454 SYMSGF)
     A  49        UOPD           7Y 0O  2 45DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(26 DIV0016 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 32MSGCON(15 DIV1963 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 48MSGCON(17 DIV0048 SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(78 DIV3455 SYMSGF)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(78 YBC0008 SYMSGF)
     A                                      COLOR(WHT)
     A          R BUNN
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF01(01 'BYTT AVDELINGER')
     A                                      CF03(03 'Avslutt')
     A                                      CF05(05 'Frisk')
     A                                      CF12(12 'FORRIGE')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A                                  1  2MSGCON(18 DIV0067 SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 22MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 42MSGCON(18 DIV0021 SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 62MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              2 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R NYVARE
     A                                      CF01(01 'BYTT AVDELNGER')
     A                                      CF05(05 'Frisk')
     A                                      CF12(12 'FORRIGE')
     A                                      OVERLAY
     A                                  1  2'SYSPED/SYSJ52A'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(40 DIV3438 SYMSGF)
     A                                      COLOR(WHT)
     A                                  2  2MSGCON(9 DIV0050 SYMSGF)
     A            UAVD           4Y 0O  2 12DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  41                              2 20MSGCON(24 DIV3443 SYMSGF)
     A  41                              2 45MSGCON(4 DIV3444 SYMSGF)
     A  41        UÅR            2Y 0O  2 50DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(1)
     A  41                              2 54MSGCON(4 DIV3445 SYMSGF)
     A  41        UUKE           2Y 0O  2 59DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(1)
     A  41                              2 62MSGCON(10 DIV3446 SYMSGF)
     A  41        UUKET          2Y 0O  2 73DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(1)
     A  42                              2 20MSGCON(24 DIV3447 SYMSGF)
     A  42
     AO 44
     AO 45        XKNAVN        30   O  2 45DSPATR(UL)
     A                                      COLOR(WHT)
     A  43                              2 20MSGCON(24 DIV3448 SYMSGF)
     A  43        UTR            4   O  2 45DSPATR(UL)
     A                                      COLOR(WHT)
     A  44                              2 20MSGCON(24 DIV3449 SYMSGF)
     A  45                              2 20MSGCON(24 DIV3450 SYMSGF)
     A  45
     AO 48        CDNAB         30   O  2 45DSPATR(UL)
     A                                      COLOR(WHT)
     A  46                              2 20MSGCON(24 DIV3451 SYMSGF)
     A  51                              2 20MSGCON(24 YBC0007 SYMSGF)
     A  46
     AO 51        ST2NVN        30   O  2 45DSPATR(UL)
     A                                      COLOR(BLU)
     A  47                              2 20MSGCON(24 DIV3452 SYMSGF)
     A  48                              2 20MSGCON(24 DIV3453 SYMSGF)
     A  49                              2 20MSGCON(24 DIV3454 SYMSGF)
     A  49        UOPD           7Y 0O  2 45DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  3  2MSGCON(26 DIV0016 SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 32MSGCON(17 DIV0048 SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(78 DIV3455 SYMSGF)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(78 YBC0008 SYMSGF)
     A                                      COLOR(WHT)
