     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R BILDE
     A                                      CF03(03 'AVSLUTT')
     A                                  1  2'SYSPED/SYSJBE'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(40 DIV3421 SYMSGF)
     A                                      DSPATR(HI)
     A                                  5  2MSGCON(24 DIV1497 SYMSGF)
     A            WSAVD          4Y 0B  5 29DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  8  2MSGCON(24 DIV3422 SYMSGF)
     A            WSDT           6Y 0B  8 29DSPATR(UL)
     A  98
     AON30                                  DSPATR(PC)
     A  98                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                  8 41MSGCON(15 DIV3423 SYMSGF)
     A                                 10  2MSGCON(24 DIV3424 SYMSGF)
     A            WSVH           5A  B 10 29DSPATR(UL)
     A  97                                  DSPATR(PC)
     A  97                                  DSPATR(RI)
     A                                 10 41MSGCON(15 DIV3425 SYMSGF)
     A                                 12  2MSGCON(24 DIV3426 SYMSGF)
     A            WSKNR          8Y 0B 12 29DSPATR(UL)
     A  96                                  DSPATR(PC)
     A  96                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 12 41MSGCON(15 DIV3423 SYMSGF)
     A                                 14  2MSGCON(24 DIV3427 SYMSGF)
     A            WSTR           4A  B 14 29DSPATR(UL)
     A  95                                  DSPATR(PC)
     A  95                                  DSPATR(RI)
     A                                 14 41MSGCON(15 DIV3425 SYMSGF)
     A                                 17  2MSGCON(24 DIV1509 SYMSGF)
     A            WSJBK          1A  B 17 29DSPATR(UL)
     A                                      VALUES(' ' 'J' 'N')
     A                                 19  2MSGCON(24 DIV1510 SYMSGF)
     A            WSPRT         10A  B 19 29DSPATR(UL)
     A                                 23  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
