     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R BILDE
     A                                      CF01(01 'BYTT AVDELINGER')
     A                                      CF03(03 'Avslutt registrering av BO-
     A                                      OKING-2')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A                                  1  2'SYSPED/SYSJ52C'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(40 DIV3438 SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(4 DIV3163 SYMSGF)
     A            UAVD           4Y 0O  2  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 12MSGCON(6 DIV3164 SYMSGF)
     A            UOPD           7Y 0O  2 19DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 27MSGCON(4 DIV3229 SYMSGF)
     A            WSDTR          6S 0O  2 32DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  2 40MSGCON(5 DIV3165 SYMSGF)
     A            BOSG           3A  O  2 46DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  2 51MSGCON(3 DIV3166 SYMSGF)
     A            BOUKE          2Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 59MSGCON(4 DIV3167 SYMSGF)
     A            BOAAR          2S 0O  2 64DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(10 DIV3156 SYMSGF)
     A            B2KNS          8Y 0O  4 19DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2NAS         30   O  4 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  5  2MSGCON(18 DIV3157 SYMSGF)
     A            B2ADL         30   O  5 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2MSGCON(015 DIV3904 *LIBL/SYMSGF)
     A            B2KNVH         8Y 0O  6 19DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2NAVH        30A  O  6 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  8  2MSGCON(29 DIV3264 SYMSGF)
     A            B2FRP         48   O  8 32DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(012 DIV3242 *LIBL/SYMSGF)
     A            B2HSNR        11A  B  9 19DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10  2MSGCON(10 DIV3257 SYMSGF)
     A                                      COLOR(RED)
     A                                 10 15MSGCON(10 DIV3258 SYMSGF)
     A            B2IMCO         6A  O 10 26DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 36MSGCON(7 DIV3259 SYMSGF)
     A            B2PGNO         6A  O 10 44DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 54MSGCON(7 DIV3260 SYMSGF)
     A            B2UNNO         8A  O 10 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 15MSGCON(004 DIV3899 *LIBL/SYMSGF)
     A            B2EMS          8   O 11 20DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 30MSGCON(005 DIV3900 *LIBL/SYMSGF)
     A            B2MFAG         8   O 11 36DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 47MSGCON(017 DIV3901 *LIBL/SYMSGF)
     A            B2MP           1   O 11 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 15MSGCON(14 DIV3261 SYMSGF)
     A            B2COC         20A  O 12 30DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 54MSGCON(10 DIV3262 SYMSGF)
     A            B2FP          14A  O 12 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13  2MSGCON(015 YBC0101 *LIBL/SYMSGF)
     A            B2PG          14A  O 13 18DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 38MSGCON(016 DIV3902 *LIBL/SYMSGF)
     A            B2TLF         25   O 13 55DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(8 DIV3254 SYMSGF)
     A            B2KDA         12A  O 15 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 28MSGCON(8 DIV3255 SYMSGF)
     A            B2KDM         12A  O 15 38DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 54MSGCON(8 DIV3256 SYMSGF)
     A            B2KDN         12A  O 15 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17  2MSGCON(78 DIV3263 SYMSGF)
     A                                      COLOR(WHT)
     A            B2NT1          7Y 0O 18  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2VT1         15   O 18 10DSPATR(UL)
     A                                      COLOR(YLW)
     A            B2VS1         25   O 18 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            B2VKB1         9Y 0O 18 52DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2VKN1         9Y 0O 18 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2M31          7Y 3O 18 72DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2NT2          7Y 0O 19  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2VT2         15   O 19 10DSPATR(UL)
     A                                      COLOR(YLW)
     A            B2VS2         25   O 19 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            B2VKB2         9Y 0O 19 52DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2VKN2         9Y 0O 19 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2M32          7Y 3O 19 72DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2NT3          7Y 0O 20  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2VT3         15   O 20 10DSPATR(UL)
     A                                      COLOR(YLW)
     A            B2VS3         25   O 20 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            B2VKB3         9Y 0O 20 52DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2VKN3         9Y 0O 20 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2M33          7Y 3O 20 72DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2NT4          7Y 0O 21  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2VT4         15   O 21 10DSPATR(UL)
     A                                      COLOR(YLW)
     A            B2VS4         25   O 21 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            B2VKB4         9Y 0O 21 52DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2VKN4         9Y 0O 21 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            B2M34          7Y 3O 21 72DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 23  2MSGCON(18 DIV0067 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(18 DIV0024 SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
