     A          R LHEAD
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A  51                              5 18MSGCON(15 DIV3324 SYMSGF)
     A N51                              5 18MSGCON(15 DIV3325 SYMSGF)
     A                                 10 65MSGCON(6 DIV3326 SYMSGF)
     A            XIDAG          6  0  10 72EDTCDE(Y)
     A                                 11  2MSGCON(7 DIV3327 SYMSGF)
     A            XTONA         30     11 11
     A            XTOAD1        30     11 43
     A            XTOAD2        30     12 11
     A            XTOAD3        30     12 43
     A                                 13  2MSGCON(7 DIV3328 SYMSGF)
     A            XCCNA         30     13 11
     A            XCCAD1        30     13 43
     A            XCCAD2        30     14 11
     A            XCCAD3        30     14 43
     A                                 15  2MSGCON(7 DIV3329 SYMSGF)
     A            XFRNA         30     15 11
     A            KOSFNV        16     15 57
     A                                 16  1MSGCON(80 DIV3321 SYMSGF)
      *
      * OVERSJØREDERI
      *
     A          R TELFAX
     A                                 17 16MSGCON(20 DIV3330 SYMSGF)
     A                                 17 40MSGCON(12 DIV4102 SYMSGF)
     A            BOREFN        14     17 53
     A                                 18  1MSGCON(80 DIV3331 SYMSGF)
     A                                 19  2MSGCON(10 DIV3332 SYMSGF)
     A            BOAVD          4  0  19 13
     A                                 19 17'/'
     A            BOOPD          7  0  19 18
     A                                 19 25'/'
     A            BOSG           3     19 26
     A                                 19 65MSGCON(6 DIV3333 SYMSGF)
     A            BOUKE          2  0  19 72
     A                                 20  2MSGCON(19 DIV3334 SYMSGF)
     A            BOMM          15     20 23
     A                                 20 65'CH:'
     A            BOCH           1     20 69
     A                                 20 72'MH:'
     A            BOMH           1     20 76
     A                                 22  2MSGCON(19 DIV3335 SYMSGF)
     A            BONAA         30     22 23
     A                                 22 56MSGCON(8 DIV3336 SYMSGF)
     A            B2KDA         12     22 66
     A                                 23  2MSGCON(19 DIV3337 SYMSGF)
     A            BONARP        30     23 23
     A                                 23 56MSGCON(8 DIV3336 SYMSGF)
     A            B2KDM         12     23 66
     A                                 24  2MSGCON(19 DIV3338 SYMSGF)
     A            BONAS         30     24 23
     A                                 24 56MSGCON(8 DIV3336 SYMSGF)
     A            B2KDN         12     24 66
     A                                 26  2MSGCON(24 DIV3340 SYMSGF)
     A  55                             26 28MSGCON(5 DIV3341 SYMSGF)
     A N55                             26 28MSGCON(5 DIV3342 SYMSGF)
     A                                 27  2MSGCON(26 DIV3339 SYMSGF)
     A            XOBNA2        27     27 29
     A                                 27 56'/'
     A            BOREIS        14     27 57
     A                                 27 71'/'
     A            XDT3           6  0  27 72EDTCDE(Y)
     A                                 28  2MSGCON(24 DIV3343 SYMSGF)
     A            XVHN          30     28 29
     A                                 30  2MSGCON(24 DIV3344 SYMSGF)
     A            XLOHN         30     30 29
     A                                 31  2MSGCON(24 DIV3345 SYMSGF)
     A            XLSHN         30     31 29
     A                                 32  1MSGCON(25 DIV3346 SYMSGF)
     A            XLOSN         30     32 29
     A                                 34  1MSGCON(30 DIV3347 SYMSGF)
     A            XSUMVK         9  0  34 36EDTCDE(1)
     A                                 34 49MSGCON(9 DIV3348 SYMSGF)
     A            XSUMKB         9  3  34 60EDTCDE(1)
     A                                 34 72MSGCON(4 DIV3349 SYMSGF)
     A                                 35  1MSGCON(16 DIV3350 SYMSGF)
     A            XLBNA         30     35 19
     A                                 35 58MSGCON(13 DIV3351 SYMSGF)
     A            XDT1           6  0  35 72EDTCDE(Y)
     A                                 36  1MSGCON(20 DIV3352 SYMSGF)
     A                                 37  4MSGCON(16 DIV3353 SYMSGF)
     A            BORATE        50     37 21
     A                                 38  4MSGCON(16 DIV3354 SYMSGF)
     A            BOVAL          3     38 21
     A            BOBL           7  0  38 26EDTCDE(1)
     A  53                             38 41MSGCON(10 DIV3355 SYMSGF)
     A  54                             38 41MSGCON(10 DIV3356 SYMSGF)
     A                                 40  1MSGCON(16 DIV3357 SYMSGF)
     A            B2HSNR        11     40 18
     A                                 41  2MSGCON(78 YBC1757 SYMSGF)
     A                                 42  2MSGCON(78 YBC1758 SYMSGF)
     A                                      UNDERLINE
     A            BONT1          7  0  43  2EDTCDE(Z)
     A            BOMN1         20     43 10
     A            BOVS1         25     43 31
     A            BOKDC1         2A    43 57
     A            BOVKT1         9  0  43 60EDTCDE(Z)
     A            BOM31          7  3  43 70EDTWRD('    .   ')
     A            BONT2          7  0  44  2EDTCDE(Z)
     A            BOMN2         20     44 10
     A            BOVS2         25     44 31
     A            BOKDC2         2A    44 57
     A            BOVKT2         9  0  44 60EDTCDE(Z)
     A            BOM32          7  3  44 70EDTWRD('    .   ')
     A            BONT3          7  0  45  2EDTCDE(Z)
     A            BOMN3         20     45 10
     A            BOVS3         25     45 31
     A            BOKDC3         2A    45 57
     A            BOVKT3         9  0  45 60EDTCDE(Z)
     A            BOM33          7  3  45 70EDTWRD('    .   ')
     A            BONT4          7  0  46  2EDTCDE(Z)
     A            BOMN4         20     46 10
     A            BOVS4         25     46 31
     A            BOKDC4         2A    46 57
     A            BOVKT4         9  0  46 60EDTCDE(Z)
     A            BOM34          7  3  46 70EDTWRD('    .   ')
     A                                 48  1MSGCON(50 DIV3360 SYMSGF)
     A            B2FRP         48     49  4
     A                                 50  1MSGCON(80 DIV3361 SYMSGF)
     A                                 51  1MSGCON(22 DIV3362 SYMSGF)
     A                                 52  4MSGCON(14 DIV3363 SYMSGF)
     A            B2IMCO         6     52 20
     A                                 52 31MSGCON(8 DIV3364 SYMSGF)
     A            B2PGNO         6     52 41
     A                                 52 52MSGCON(6 DIV3365 SYMSGF)
     A            B2UNNO         8     52 60
     A                                 53 14MSGCON(4 DIV3899 SYMSGF)
     A            B2EMS          8     53 20
     A                                 53 35MSGCON(5 DIV3900 SYMSGF)
     A            B2MFAG         8     53 42
     A                                 53 57MSGCON(17 DIV3901 SYMSGF)
     A            B2MP           1     53 76
     A                                 54  4MSGCON(43 DIV3366 SYMSGF)
     A            B2COC         20     54 49
     A                                 55  4MSGCON(14 DIV3367 SYMSGF)
     A            B2FP          14     55 20
     A                                 56  4MSGCON(18 YBC0102 SYMSGF)
     A            B2PG          14     56 23
     A                                 56 39MSGCON(16 DIV3902 SYMSGF)
     A            B2TLF         25     56 56
     A                                 58  1MSGCON(78 DIV3368 SYMSGF)
     A                                 59  1MSGCON(78 DIV3369 SYMSGF)
     A                                      UNDERLINE
     A            B2NT1          7  0  60  1EDTCDE(Z)
     A            B2VT1         15     60  9
     A            B2VS1         25     60 26
     A            B2VKB1         9  0  60 52EDTCDE(Z)
     A            B2VKN1         9  0  60 62EDTCDE(Z)
     A            B2M31          7  3  60 72EDTWRD('    .   ')
     A            B2NT2          7  0  61  1EDTCDE(Z)
     A            B2VT2         15     61  9
     A            B2VS2         25     61 26
     A            B2VKB2         9  0  61 52EDTCDE(Z)
     A            B2VKN2         9  0  61 62EDTCDE(Z)
     A            B2M32          7  3  61 72EDTWRD('    .   ')
     A            B2NT3          7  0  62  1EDTCDE(Z)
     A            B2VT3         15     62  9
     A            B2VS3         25     62 26
     A            B2VKB3         9  0  62 52EDTCDE(Z)
     A            B2VKN3         9  0  62 62EDTCDE(Z)
     A            B2M33          7  3  62 72EDTWRD('    .   ')
     A            B2NT4          7  0  63  1EDTCDE(Z)
     A            B2VT4         15     63  9
     A            B2VS4         25     63 26
     A            B2VKB4         9  0  63 52EDTCDE(Z)
     A            B2VKN4         9  0  63 62EDTCDE(Z)
     A            B2M34          7  3  63 72EDTWRD('    .   ')
     A                                 68  4MSGCON(30 DIV3370 SYMSGF)
      *
      * LOKALLINJE
      *
     A          R TELFA2
     A                                 17 31MSGCON(20 DIV3371 SYMSGF)
     A                                 18  1MSGCON(80 DIV3331 SYMSGF)
     A                                 19  2MSGCON(10 DIV3332 SYMSGF)
     A            BOAVD          4  0  19 13
     A                                 19 17'/'
     A            BOOPD          7  0  19 18
     A                                 19 25'/'
     A            BOSG           3     19 26
     A                                 20  2MSGCON(33 DIV3372 SYMSGF)
     A            BOMM          15     20 37
     A                                 22  2MSGCON(20 DIV3373 SYMSGF)
     A            XLBNA         30     22 24
     A                                 22 58MSGCON(13 DIV3351 SYMSGF)
     A            XDT1           6  0  22 72EDTCDE(Y)
     A                                 24  2MSGCON(20 DIV3374 SYMSGF)
     A            XLSHN         30     24 24
     A                                 25  2MSGCON(20 DIV3375 SYMSGF)
     A            XVHN          30     25 24
     A                                 27  2MSGCON(78 YBC1757 SYMSGF)
     A                                 28  2MSGCON(78 DIV3361 SYMSGF)
     A            BONT1          7  0  29  2EDTCDE(Z)
     A            BOMN1         20     29 10
     A            BOVS1         25     29 31
     A            BOKDC1         2A    29 57
     A            BOVKT1         9  0  29 60EDTCDE(Z)
     A            BOM31          7  3  29 70EDTWRD('    .   ')
     A            BONT2          7  0  30  2EDTCDE(Z)
     A            BOMN2         20     30 10
     A            BOVS2         25     30 31
     A            BOKDC2         2A    30 57
     A            BOVKT2         9  0  30 60EDTCDE(Z)
     A            BOM32          7  3  30 70EDTWRD('    .   ')
     A            BONT3          7  0  31  2EDTCDE(Z)
     A            BOMN3         20     31 10
     A            BOVS3         25     31 31
     A            BOKDC3         2A    31 57
     A            BOVKT3         9  0  31 60EDTCDE(Z)
     A            BOM33          7  3  31 70EDTWRD('    .   ')
     A            BONT4          7  0  32  2EDTCDE(Z)
     A            BOMN4         20     32 10
     A            BOVS4         25     32 31
     A            BOKDC4         2A    32 57
     A            BOVKT4         9  0  32 60EDTCDE(Z)
     A            BOM34          7  3  32 70EDTWRD('    .   ')
     A                                 33  1MSGCON(80 DIV3361 SYMSGF)
     A                                 35  2MSGCON(21 DIV3376 SYMSGF)
     A                                 36  4MSGCON(14 DIV3363 SYMSGF)
     A            B2IMCO         6     36 20
     A                                 36 31MSGCON(8 DIV3364 SYMSGF)
     A            B2PGNO         6     36 41
     A                                 36 52MSGCON(6 DIV3365 SYMSGF)
     A            B2UNNO         8     36 60
     A                                 37 14MSGCON(4 DIV3899 SYMSGF)
     A            B2EMS          8     37 20
     A                                 37 35MSGCON(5 DIV3900 SYMSGF)
     A            B2MFAG         8     37 42
     A                                 37 57MSGCON(17 DIV3901 SYMSGF)
     A            B2MP           1     37 76
     A                                 38  4MSGCON(43 DIV3366 SYMSGF)
     A            B2COC         20     38 49
     A                                 39  4MSGCON(14 DIV3367 SYMSGF)
     A            B2FP          14     39 20
     A                                 40  4MSGCON(18 YBC0102 SYMSGF)
     A            B2PG          14     40 23
     A                                 40 39MSGCON(16 DIV3902 SYMSGF)
     A            B2TLF         25     40 56
     A                                 42  1MSGCON(78 DIV3368 SYMSGF)
     A                                 43  1MSGCON(78 DIV3369 SYMSGF)
     A                                      UNDERLINE
     A            B2NT1          7  0  44  1EDTCDE(Z)
     A            B2VT1         15     44  9
     A            B2VS1         25     44 26
     A            B2VKB1         9  0  44 52EDTCDE(Z)
     A            B2VKN1         9  0  44 62EDTCDE(Z)
     A            B2M31          7  3  44 72EDTWRD('    .   ')
     A            B2NT2          7  0  45  1EDTCDE(Z)
     A            B2VT2         15     45  9
     A            B2VS2         25     45 26
     A            B2VKB2         9  0  45 52EDTCDE(Z)
     A            B2VKN2         9  0  45 62EDTCDE(Z)
     A            B2M32          7  3  45 72EDTWRD('    .   ')
     A            B2NT3          7  0  46  1EDTCDE(Z)
     A            B2VT3         15     46  9
     A            B2VS3         25     46 26
     A            B2VKB3         9  0  46 52EDTCDE(Z)
     A            B2VKN3         9  0  46 62EDTCDE(Z)
     A            B2M33          7  3  46 72EDTWRD('    .   ')
     A            B2NT4          7  0  47  1EDTCDE(Z)
     A            B2VT4         15     47  9
     A            B2VS4         25     47 26
     A            B2VKB4         9  0  47 52EDTCDE(Z)
     A            B2VKN4         9  0  47 62EDTCDE(Z)
     A            B2M34          7  3  47 72EDTWRD('    .   ')
     A                                 48  1MSGCON(80 DIV3361 SYMSGF)
     A                                 50  2MSGCON(18 DIV3377 SYMSGF)
     A            XNAR          30     50 22
     A                                 52  2MSGCON(31 DIV3378 SYMSGF)
     A            B2NAVH        30     52 35
     A                                 54  2MSGCON(15 DIV3379 SYMSGF)
     A            XOBNA         30     54 19
     A                                 54 53MSGCON(8 DIV3380 SYMSGF)
     A            BOREIS        14     54 62
     A                                 55  2MSGCON(9 DIV3381 SYMSGF)
     A            XDT3           6  0  55 12EDTCDE(Y)
     A                                 55 26MSGCON(20 DIV3382 SYMSGF)
     A            XLOHN         30     55 48
     A                                 68  4MSGCON(30 DIV3370 SYMSGF)
      *
      * TRANSPORTØR
      *
     A          R TELFA3
     A                                 17 31MSGCON(21 DIV3383 SYMSGF)
     A                                 18  1MSGCON(80 DIV3331 SYMSGF)
     A                                 19  2MSGCON(10 DIV3409 SYMSGF)
     A            BOAVD          4  0  19 13
     A                                 19 17'/'
     A            BOOPD          7  0  19 18
     A                                 19 25'/'
     A            BOSG           3     19 26
     A                                 21  2MSGCON(14 DIV3384 SYMSGF)
     A                                      UNDERLINE
     A                                 22  2MSGCON(15 DIV3385 SYMSGF)
     A            XLSSN         30     22 19
     A            BOINS2        55     23 17
     A                                 24  2MSGCON(15 DIV3386 SYMSGF)
     A            BONAA         30     24 19
     A            XAD1A         30     24 50
     A            XAD2A         30     25 19
     A            XAD3A         30     25 50
     A                                 26  2MSGCON(30 DIV3387 SYMSGF)
     A            XDT4           6  0  26 33EDTCDE(Y)
     A            BOINS4        55     27 26
     A                                 29  2MSGCON(79 YBC1759 SYMSGF)
     A                                 30  2MSGCON(79 DIV3361 SYMSGF)
     A            BONT1          7  0  31  2EDTCDE(Z)
     A            BOMN1         20     31 10
     A            BOVS1         25     31 31
     A            BOKDC1         2     31 57
     A            BOVKT1         9  0  31 60EDTCDE(Z)
     A            BOM31          7  3  31 70EDTWRD('    .   ')
     A            BONT2          7  0  32  2EDTCDE(Z)
     A            BOMN2         20     32 10
     A            BOVS2         25     32 31
     A            BOKDC2         2     32 57
     A            BOVKT2         9  0  32 60EDTCDE(Z)
     A            BOM32          7  3  32 70EDTWRD('    .   ')
     A            BONT3          7  0  33  2EDTCDE(Z)
     A            BOMN3         20     33 10
     A            BOVS3         25     33 31
     A            BOKDC3         2     33 57
     A            BOVKT3         9  0  33 60EDTCDE(Z)
     A            BOM33          7  3  33 70EDTWRD('    .   ')
     A            BONT4          7  0  34  2EDTCDE(Z)
     A            BOMN4         20     34 10
     A            BOVS4         25     34 31
     A            BOKDC4         2     34 57
     A            BOVKT4         9  0  34 60EDTCDE(Z)
     A            BOM34          7  3  34 70EDTWRD('    .   ')
     A                                 35  1MSGCON(80 DIV3361 SYMSGF)
     A                                 36  2MSGCON(21 DIV2942 SYMSGF)
     A                                 37  4MSGCON(14 DIV3363 SYMSGF)
     A            B2IMCO         6     37 20
     A                                 37 31MSGCON(8 DIV3364 SYMSGF)
     A            B2PGNO         6     37 41
     A                                 37 52MSGCON(6 DIV3365 SYMSGF)
     A            B2UNNO         8     37 60
     A                                 38 14MSGCON(4 DIV3899 SYMSGF)
     A            B2EMS          8     38 20
     A                                 38 35MSGCON(5 DIV3900 SYMSGF)
     A            B2MFAG         8     38 42
     A                                 38 57MSGCON(17 DIV3901 SYMSGF)
     A            B2MP           1     38 76
     A                                 39  4MSGCON(43 DIV3366 SYMSGF)
     A            B2COC         20     39 49
     A                                 40  4MSGCON(14 DIV3367 SYMSGF)
     A            B2FP          14     40 20
     A                                 41  4MSGCON(18 YBC0102 SYMSGF)
     A            B2PG          14     41 23
     A                                 41 39MSGCON(16 DIV3902 SYMSGF)
     A            B2TLF         25     41 56
     A                                 43  1MSGCON(80 DIV3389 SYMSGF)
     A                                 44  1MSGCON(80 DIV3390 SYMSGF)
     A                                      UNDERLINE
     A            B2NT1          7  0  45  1EDTCDE(Z)
     A            B2VT1         15     45  9
     A            B2VS1         25     45 26
     A            B2VKB1         9  0  45 52EDTCDE(Z)
     A            B2VKN1         9  0  45 62EDTCDE(Z)
     A            B2M31          7  3  45 72EDTWRD('    .   ')
     A            B2NT2          7  0  46  1EDTCDE(Z)
     A            B2VT2         15     46  9
     A            B2VS2         25     46 26
     A            B2VKB2         9  0  46 52EDTCDE(Z)
     A            B2VKN2         9  0  46 62EDTCDE(Z)
     A            B2M32          7  3  46 72EDTWRD('    .   ')
     A            B2NT3          7  0  47  1EDTCDE(Z)
     A            B2VT3         15     47  9
     A            B2VS3         25     47 26
     A            B2VKB3         9  0  47 52EDTCDE(Z)
     A            B2VKN3         9  0  47 62EDTCDE(Z)
     A            B2M33          7  3  47 72EDTWRD('    .   ')
     A            B2NT4          7  0  48  1EDTCDE(Z)
     A            B2VT4         15     48  9
     A            B2VS4         25     48 26
     A            B2VKB4         9  0  48 52EDTCDE(Z)
     A            B2VKN4         9  0  48 62EDTCDE(Z)
     A            B2M34          7  3  48 72EDTWRD('    .   ')
     A                                 49  1MSGCON(80 DIV3361 SYMSGF)
     A                                 50  2MSGCON(9 DIV3391 SYMSGF)
     A            BODP          20     50 13
     A                                 50 36MSGCON(10 DIV3392 SYMSGF)
     A            XNAR          30     50 48
     A                                 51  2MSGCON(15 DIV3393 SYMSGF)
     A                                      UNDERLINE
     A                                 52  2MSGCON(20 DIV3394 SYMSGF)
     A            B2ADL         30     52 24
     A                                 53  2MSGCON(14 DIV3395 SYMSGF)
     A            XLBNA         30     53 18
     A                                 53 51MSGCON(12 DIV3396 SYMSGF)
     A            BOREF1        10     53 65
     A                                 54  2MSGCON(14 DIV3397 SYMSGF)
     A            XLSHN         30     54 18
     A                                 54 51MSGCON(6 DIV3326 SYMSGF)
     A            XDT1           6  0  54 65EDTCDE(Y)
     A                                 55  2MSGCON(14 DIV3398 SYMSGF)
     A            XVHN          30     55 18
     A                                 56  1MSGCON(24 DIV3399 SYMSGF)
     A            XLOHN         30     56 28
     A                                 57  4MSGCON(50 SHU0588 SYMSGF)
     A            FREE01        70     58  4
     A            FREE02        70     59  4
     A            FREE03        70     60  4
     A            FREE04        70     61  4
     A            FREE05        70     62  4
     A            FREE06        70     63  4
     A            FREE07        70     64  4
     A            FREE08        70     65  4
     A            FREE09        70     66  4
     A            FREE10        70     67  4
     A                                 69  4MSGCON(30 DIV3400 SYMSGF)
      *
      * CONTAINER DEPOT
      *
     A          R TELFA4
     A                                 17 31MSGCON(24 DIV3401 SYMSGF)
     A                                 18  1MSGCON(80 DIV3331 SYMSGF)
     A                                 19  2MSGCON(10 DIV3409 SYMSGF)
     A            BOAVD          4  0  19 13
     A                                 19 17'/'
     A            BOOPD          7  0  19 18
     A                                 19 25'/'
     A            BOSG           3     19 26
     A                                 21  2MSGCON(12 DIV3402 SYMSGF)
     A            BODP          20     21 16
     A                                 22  2MSGCON(12 DIV3403 SYMSGF)
     A            XNAR          30     22 16
     A                                 24  2MSGCON(30 DIV3404 SYMSGF)
     A            XDT5           6  0  24 33EDTCDE(Y)
     A            BOINS3        55     25  4
     A                                 27  2MSGCON(79 DIV3405 SYMSGF)
     A                                 28  2MSGCON(79 DIV3361 SYMSGF)
     A            BONT1          7  0  29  4EDTCDE(Z)
     A            BOMN1         20     29 12
     A            BONT2          7  0  30  4EDTCDE(Z)
     A            BOMN2         20     30 12
     A            BONT3          7  0  31  4EDTCDE(Z)
     A            BOMN3         20     31 12
     A            BONT4          7  0  32  4EDTCDE(Z)
     A            BOMN4         20     32 12
     A                                 33  1MSGCON(80 DIV3361 SYMSGF)
     A                                 35  2MSGCON(15 DIV3406 SYMSGF)
     A            XNAT          30     35 19
     A            XAD1T         30     35 50
     A            XAD2T         30     36 19
     A            XAD3T         30     36 50
     A                                 39  2MSGCON(15 DIV3407 SYMSGF)
     A            BONAA         30     39 19
      *
      * TERMINAL
      *
     A          R TELFA5
     A                                 17 21MSGCON(40 DIV3408 SYMSGF)
     A                                 18  1MSGCON(80 DIV3331 SYMSGF)
     A                                 19  2MSGCON(10 DIV3409 SYMSGF)
     A            BOAVD          4  0  19 13
     A                                 19 17'/'
     A            BOOPD          7  0  19 18
     A                                 19 25'/'
     A            BOSG           3     19 26
     A                                 21  2MSGCON(14 DIV3410 SYMSGF)
     A            XLSSN         30     21 18
     A                                 22  2MSGCON(14 DIV3411 SYMSGF)
     A            XNAR          30     22 18
     A                                 24  2MSGCON(35 DIV3412 SYMSGF)
     A            XDT5           6  0  24 38EDTCDE(Y)
     A            BOINS3        55     25  4
     A                                 27  2MSGCON(14 DIV3413 SYMSGF)
     A            BONAA         30     27 18
     A                                 28  2MSGCON(14 DIV2944 SYMSGF)
     A            BONAS         30     28 18
     A                                 30  2MSGCON(79 YBC1759 SYMSGF)
     A                                 31  2MSGCON(79 DIV3361 SYMSGF)
     A            BONT1          7  0  32  2EDTCDE(Z)
     A            BOMN1         20     32 10
     A            BOVS1         25     32 31
     A            BOKDC1         2     32 57
     A            BOVKT1         9  0  32 60EDTCDE(Z)
     A            BOM31          7  3  32 70EDTWRD('    .   ')
     A            BONT2          7  0  33  2EDTCDE(Z)
     A            BOMN2         20     33 10
     A            BOVS2         25     33 31
     A            BOKDC2         2     33 57
     A            BOVKT2         9  0  33 60EDTCDE(Z)
     A            BOM32          7  3  33 70EDTWRD('    .   ')
     A            BONT3          7  0  34  2EDTCDE(Z)
     A            BOMN3         20     34 10
     A            BOVS3         25     34 31
     A            BOKDC3         2     34 57
     A            BOVKT3         9  0  34 60EDTCDE(Z)
     A            BOM33          7  3  34 70EDTWRD('    .   ')
     A            BONT4          7  0  35  2EDTCDE(Z)
     A            BOMN4         20     35 10
     A            BOVS4         25     35 31
     A            BOKDC4         2     35 57
     A            BOVKT4         9  0  35 60EDTCDE(Z)
     A            BOM34          7  3  35 70EDTWRD('    .   ')
     A                                 36  1MSGCON(80 DIV3361 SYMSGF)
     A                                 38  2MSGCON(21 DIV2943 SYMSGF)
     A                                 39  4MSGCON(14 DIV3363 SYMSGF)
     A            B2IMCO         6     39 20
     A                                 39 31MSGCON(8 DIV3364 SYMSGF)
     A            B2PGNO         6     39 41
     A                                 39 52MSGCON(6 DIV3365 SYMSGF)
     A            B2UNNO         8     39 60
     A                                 40 14MSGCON(4 DIV3899 SYMSGF)
     A            B2EMS          8     40 20
     A                                 40 35MSGCON(5 DIV3900 SYMSGF)
     A            B2MFAG         8     40 42
     A                                 40 57MSGCON(17 DIV3901 SYMSGF)
     A            B2MP           1     40 76
     A                                 41  4MSGCON(43 DIV3366 SYMSGF)
     A            B2COC         20     41 49
     A                                 42  4MSGCON(14 DIV3367 SYMSGF)
     A            B2FP          14     42 20
     A                                 43  4MSGCON(18 YBC0102 SYMSGF)
     A            B2PG          14     43 23
     A                                 43 39MSGCON(16 DIV3902 SYMSGF)
     A            B2TLF         25     43 56
     A                                 45  1MSGCON(80 DIV3389 SYMSGF)
     A                                 46  1MSGCON(80 DIV3390 SYMSGF)
     A                                      UNDERLINE
     A            B2NT1          7  0  47  1EDTCDE(Z)
     A            B2VT1         15     47  9
     A            B2VS1         25     47 26
     A            B2VKB1         9  0  47 52EDTCDE(Z)
     A            B2VKN1         9  0  47 62EDTCDE(Z)
     A            B2M31          7  3  47 72EDTWRD('    .   ')
     A            B2NT2          7  0  48  1EDTCDE(Z)
     A            B2VT2         15     48  9
     A            B2VS2         25     48 26
     A            B2VKB2         9  0  48 52EDTCDE(Z)
     A            B2VKN2         9  0  48 62EDTCDE(Z)
     A            B2M32          7  3  48 72EDTWRD('    .   ')
     A            B2NT3          7  0  49  1EDTCDE(Z)
     A            B2VT3         15     49  9
     A            B2VS3         25     49 26
     A            B2VKB3         9  0  49 52EDTCDE(Z)
     A            B2VKN3         9  0  49 62EDTCDE(Z)
     A            B2M33          7  3  49 72EDTWRD('    .   ')
     A            B2NT4          7  0  50  1EDTCDE(Z)
     A            B2VT4         15     50  9
     A            B2VS4         25     50 26
     A            B2VKB4         9  0  50 52EDTCDE(Z)
     A            B2VKN4         9  0  50 62EDTCDE(Z)
     A            B2M34          7  3  50 72EDTWRD('    .   ')
     A                                 51  1MSGCON(80 DIV3361 SYMSGF)
