     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R BILDE
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt registrering av BO-
     A                                      OKING-2')
     A                                      CF04(04 'Søke')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A                                      CF14(14 'KUNDEOPPLIYSNING')
     A                                      CF18(18 'Freetext')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYSJ50C'
     A                                      COLOR(BLU)
     A                                  1 61DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  1 20MSGCON(040 DIV3134 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  2  2MSGCON(004 DIV3163 *LIBL/SYMSGF)
     A            BOAVD          4Y 0O  2  7DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 13MSGCON(006 DIV3164 *LIBL/SYMSGF)
     A            BOOPD          7Y 0O  2 20DSPATR(UL)
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 28MSGCON(004 DIV3229 *LIBL/SYMSGF)
     A            WSDTR          6S 0O  2 33DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  2 41MSGCON(005 DIV3165 *LIBL/SYMSGF)
     A            BOSG           3A  O  2 47DSPATR(UL)
     A                                      COLOR(WHT)
     A                                  2 51MSGCON(003 DIV3166 *LIBL/SYMSGF)
     A            BOUKE          2Y 0O  2 55DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2 59MSGCON(004 DIV3167 *LIBL/SYMSGF)
     A            BOAAR          2Y 0O  2 64DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  4  2MSGCON(010 DIV3156 *LIBL/SYMSGF)
     A            WSKNS          8Y 0B  4 19DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A N99 54                               COLOR(RED)
     A N99N54                               COLOR(YLW)
     A            WSNAS         30A  B  4 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  5  2MSGCON(018 DIV3157 *LIBL/SYMSGF)
     A            WSADL         30A  B  5 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2MSGCON(015 DIV3904 *LIBL/SYMSGF)
     A            WSKNVH         8Y 0B  6 19DSPATR(UL)
     A  98                                  DSPATR(RI)
     A N98 53                               COLOR(RED)
     A N98N53                               COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAVH        30A  B  6 29DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  8  2MSGCON(029 DIV3264 *LIBL/SYMSGF)
     A            WSFRP         48A  B  8 32DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9  2MSGCON(012 DIV3242 *LIBL/SYMSGF)
     A            WSHSNR        11A  B  9 19DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10  2MSGCON(010 DIV3257 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A                                 10 15MSGCON(010 DIV3258 *LIBL/SYMSGF)
     A            WSIMCO         6A  B 10 26DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 36MSGCON(007 DIV3259 *LIBL/SYMSGF)
     A            WSPGNO         6A  B 10 44DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 54MSGCON(007 DIV3260 *LIBL/SYMSGF)
     A            WSUNNO         8A  B 10 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 15MSGCON(004 DIV3899 *LIBL/SYMSGF)
     A            WSEMS          8   B 11 20DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 30MSGCON(005 DIV3900 *LIBL/SYMSGF)
     A            WSMFAG         8   B 11 36DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 47MSGCON(017 DIV3901 *LIBL/SYMSGF)
     A            WSMP           1A  B 11 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'Y' 'N')
     A                                 11 68'(Y/N)'
     A                                 12 15MSGCON(014 DIV3261 *LIBL/SYMSGF)
     A            WSCOC         20A  B 12 30DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 54MSGCON(010 DIV3262 *LIBL/SYMSGF)
     A            WSFP          14A  B 12 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13  2MSGCON(015 YBC0101 *LIBL/SYMSGF)
     A            WSPG          14A  B 13 18DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13 38MSGCON(016 DIV3902 *LIBL/SYMSGF)
     A            WSTLF         25A  B 13 55DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(008 DIV3254 *LIBL/SYMSGF)
     A            WSKDA         12A  B 15 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 28MSGCON(008 DIV3255 *LIBL/SYMSGF)
     A            WSKDM         12A  B 15 38DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15 54MSGCON(008 DIV3256 *LIBL/SYMSGF)
     A            WSKDN         12A  B 15 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17  2MSGCON(078 DIV3263 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A            WSNT1          7Y 0B 18  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVT1         15A  B 18 10DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVS1         25A  B 18 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVKB1         9Y 0B 18 52DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVKN1         9Y 0B 18 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM31          7Y 3B 18 72DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNT2          7Y 0B 19  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVT2         15A  B 19 10DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVS2         25A  B 19 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVKB2         9Y 0B 19 52DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVKN2         9Y 0B 19 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM32          7Y 3B 19 72DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNT3          7Y 0B 20  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVT3         15A  B 20 10DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVS3         25A  B 20 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVKB3         9Y 0B 20 52DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVKN3         9Y 0B 20 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM33          7Y 3B 20 72DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNT4          7Y 0B 21  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVT4         15A  B 21 10DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVS4         25A  B 21 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVKB4         9Y 0B 21 52DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSVKN4         9Y 0B 21 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSM34          7Y 3B 21 72DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 22 62MSGCON(018 DIV0037 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV3572 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
