     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R BILDE01
     A                                      CF03(03 'Avslutt')
     A                                  1  2'SYSPED/SYSJ41'
     A                                      COLOR(BLU)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  1 20MSGCON(040 DIV2925 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3 54'T'
     A                                      DSPATR(CS)
     A                                      DSPATR(BL)
     A                                  3 57MSGCON(023 DIV2926 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  4  2MSGCON(010 DIV2927 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  4 14EDTCDE(4)
     A  99                                  DSPATR(RI)
     A  99                                  DSPATR(PC)
     A                                      DSPATR(UL)
     A                                  4 57MSGCON(023 DIV2928 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  5 57MSGCON(023 DIV2929 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  6  2MSGCON(040 DIV2931 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A                                  6 57MSGCON(023 DIV2930 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  7 57MSGCON(024 DIV2932 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  8  2'   01   T S    02   T S    03   T -
     A                                      S    04   T S    05   T S    06   T-
     A                                       S'
     A                                      DSPATR(RI)
     A            WSOP01         7Y 0B  9  2DSPATR(UL)
     A N99                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WST01          1Y 0B  9 10DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS01          1A  B  9 12DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP02         7Y 0B  9 14DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST02          1Y 0B  9 22DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS02          1A  B  9 24DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP03         7Y 0B  9 26DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST03          1Y 0B  9 34DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS03          1A  B  9 36DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP04         7Y 0B  9 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST04          1Y 0B  9 46DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS04          1A  B  9 48DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP05         7Y 0B  9 50DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST05          1Y 0B  9 58DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS05          1A  B  9 60DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP06         7Y 0B  9 62DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST06          1Y 0B  9 70DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS06          1A  B  9 72DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A                                 11  2'   07   T S    08   T S    09   T -
     A                                      S    10   T S    11   T S    12   T-
     A                                       S'
     A                                      DSPATR(RI)
     A            WSOP07         7Y 0B 12  2DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST07          1Y 0B 12 10DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS07          1A  B 12 12DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP08         7Y 0B 12 14DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST08          1Y 0B 12 22DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS08          1A  B 12 24DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP09         7Y 0B 12 26DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST09          1Y 0B 12 34DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS09          1A  B 12 36DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP10         7Y 0B 12 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST10          1Y 0B 12 46DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS10          1A  B 12 48DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP11         7Y 0B 12 50DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST11          1Y 0B 12 58DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS11          1A  B 12 60DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP12         7Y 0B 12 62DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST12          1Y 0B 12 70DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS12          1A  B 12 72DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A                                 14  2'   13   T S    14   T S    15   T -
     A                                      S    16   T S    17   T S    18   T-
     A                                       S'
     A                                      DSPATR(RI)
     A            WSOP13         7Y 0B 15  2DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST13          1Y 0B 15 10DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS13          1A  B 15 12DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP14         7Y 0B 15 14DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST14          1Y 0B 15 22DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS14          1A  B 15 24DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP15         7Y 0B 15 26DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST15          1Y 0B 15 34DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS15          1A  B 15 36DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP16         7Y 0B 15 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST16          1Y 0B 15 46DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS16          1A  B 15 48DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP17         7Y 0B 15 50DSPATR(UL)
     A                                      EDTCDE(4)
     A            WSS17          1A  B 15 60DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP18         7Y 0B 15 62DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST18          1Y 0B 15 70DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS18          1A  B 15 72DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A                                 17  2'   18   T S    20   T S    21   T -
     A                                      S    22   T S    23   T S    24   T-
     A                                       S'
     A                                      DSPATR(RI)
     A            WSOP19         7Y 0B 18  2DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST19          1Y 0B 18 10DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS19          1A  B 18 12DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP20         7Y 0B 18 14DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST20          1Y 0B 18 22DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS20          1A  B 18 24DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP21         7Y 0B 18 26DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST21          1Y 0B 18 34DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS21          1A  B 18 36DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP22         7Y 0B 18 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST22          1Y 0B 18 46DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS22          1A  B 18 48DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP23         7Y 0B 18 50DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST23          1Y 0B 18 58DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS23          1A  B 18 60DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP24         7Y 0B 18 62DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST24          1Y 0B 18 70DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS24          1A  B 18 72DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A                                 20  2'   25   T S    26   T S    27   T -
     A                                      S    28   T S    29   T S    30   T-
     A                                       S'
     A                                      DSPATR(RI)
     A            WSOP25         7Y 0B 21  2DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST25          1Y 0B 21 10DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS25          1A  B 21 12DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP26         7Y 0B 21 14DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST26          1Y 0B 21 22DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS26          1A  B 21 24DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP27         7Y 0B 21 26DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST27          1Y 0B 21 34DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS27          1A  B 21 36DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP28         7Y 0B 21 38DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST28          1Y 0B 21 46DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS28          1A  B 21 48DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP29         7Y 0B 21 50DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST29          1Y 0B 21 58DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS29          1A  B 21 60DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A            WSOP30         7Y 0B 21 62DSPATR(UL)
     A                                      EDTCDE(4)
     A            WST30          1Y 0B 21 70DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      VALUES(0 1 2 3 4 5 6 7)
     A            WSS30          1A  B 21 72DSPATR(UL)
     A                                      VALUES(' ' 'N' 'E' 'T')
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  99                             24  2MSGCON(078 SPA0001 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A  98                             24  2MSGCON(078 DIV2933 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N99N98                          24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
