     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A          R BILDE                     CSRLOC(LINNBR POSNBR)
     A                                      CF01(01 'BYTT AVDELINGER')
     A                                      CF03(03 'Avslutt registrering av BO-
     A                                      OKING')
     A                                      CF05(05 'VISERE')
     A                                      CF07(07 'TRANSPORTØR/RATE')
     A                                      CF10(10 'B/L VARELINJE TYPE 1')
     A                                      CF11(11 'B/L VARELINJE TYPE 2')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A                                      CF14(14 'Vise opplysning til kjøper-
     A                                       / SELGER')
     A            LINNBR         3  0H
     A            POSNBR         3  0H
     A                                  1  2MSGCON(6 DIV3164 SYMSGF)
     A            BOOPD          7Y 0O  1  9COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 17MSGCON(4 DIV3229 SYMSGF)
     A            WSDTR          6Y 0O  1 22COLOR(WHT)
     A                                  1 29MSGCON(3 DIV3230 SYMSGF)
     A                                  1 33MSGCON(5 DIV3249 SYMSGF)
     A            BOPRO          8Y 0O  1 39DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOUKE          2Y 0O  1 50DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 53MSGCON(4 DIV3167 SYMSGF)
     A            BOAAR          2Y 0O  1 58DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 61MSGCON(3 DIV3190 SYMSGF)
     A            BOKNR          8Y 0O  1 65DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  1 74MSGCON(2 DIV3191 SYMSGF)
     A            BOTR           4A  O  1 77DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2  2MSGCON(5 DIV3233 SYMSGF)
     A            BOKNA          8Y 0O  2  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BONAA         30A  O  2 17DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  2 48MSGCON(7 DIV3231 SYMSGF)
     A            BOKNAA        25A  O  2 56DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3  2MSGCON(5 DIV3232 SYMSGF)
     A            BOKNS          8Y 0O  3  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BONAS         30A  O  3 17DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3 48MSGCON(7 DIV3231 SYMSGF)
     A            BOKNAS        25A  O  3 56DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(5 DIV3200 SYMSGF)
     A            BOLB           5A  O  4  8DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOLBN         20A  O  4 14DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4 35MSGCON(5 DIV3199 SYMSGF)
     A            BOLSH          5A  O  4 41DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOLSHN        20A  O  4 47DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4 69MSGCON(5 DIV3235 SYMSGF)
     A            WSDT1          6Y 0O  4 75DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5  2MSGCON(9 YBC0742 SYMSGF)
     A            BOBKNL        14   O  5 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  5 27MSGCON(3 DIV3248 SYMSGF)
     A            BOCPL          1A  O  5 31DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  5 33MSGCON(4 DIV3246 SYMSGF)
     A            BOVALL         3A  O  5 38DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOBLL          7Y 0O  5 42DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 50MSGCON(5 YBC0743 SYMSGF)
     A            BOBLCP         7Y 0O  5 56DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 64MSGCON(5 YBC0744 SYMSGF)
     A            BOBLG          7Y 0O  5 70DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  6  2MSGCON(8 DIV3236 SYMSGF)
     A            BOANM         15A  O  6 11DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 28MSGCON(4 DIV3237 SYMSGF)
     A            BOREF1        10A  O  6 33DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 46MSGCON(4 DIV3238 SYMSGF)
     A            BOANMN        15A  O  6 51DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 69MSGCON(5 DIV3202 SYMSGF)
     A            WSDT2          6Y 0O  6 75DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  7  2MSGCON(8 DIV3239 SYMSGF)
     A            BOINS1        55A  O  7 11DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  7 69MSGCON(5 DIV3209 SYMSGF)
     A            BOLSTY         3A  O  7 75DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  8  2MSGCON(16 YBC0695 SYMSGF)
     A            BOVHL          5A  O  8 19DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  8 25MSGCON(5 YBC0694 SYMSGF)
     A            WSDT7          6Y 0O  8 31DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  8 38MSGCON(8 YBC0696 SYMSGF)
     A            BOVH2          5A  O  8 47DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  8 53MSGCON(5 YBC0694 SYMSGF)
     A            WSDT8          6Y 0O  8 59DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  9  2MSGCON(5 DIV3240 SYMSGF)
     A            BOOB           5A  O  9  8DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOOBN         20A  O  9 14DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 35MSGCON(5 DIV3201 SYMSGF)
     A            BOVH           5A  O  9 41DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVHN         20A  O  9 47DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  9 69MSGCON(5 DIV3235 SYMSGF)
     A            WSDT3          6Y 0O  9 75DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 10  2MSGCON(5 DIV3203 SYMSGF)
     A            BOLOH          5A  O 10  8DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOLOHN        20A  O 10 14DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 10 35MSGCON(5 YBC0694 SYMSGF)
     A            WSDT9          6Y 0O 10 41DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 10 48MSGCON(5 DIV3204 SYMSGF)
     A            BOLOS          5A  O 10 54DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOLOSN        20A  O 10 60DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11  2MSGCON(5 DIV3192 SYMSGF)
     A            BOREIS        14A  O 11  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 27MSGCON(3 DIV3207 SYMSGF)
     A            BOCH           1A  O 11 31DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 11 35MSGCON(6 DIV3896 SYMSGF)
     A            BOKNRP         8Y 0O 11 42DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BONARP        30   O 11 51DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(3 DIV3241 SYMSGF)
     A            BOMM          15A  O 12  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 27MSGCON(3 DIV3210 SYMSGF)
     A            BOMH           1A  O 12 31DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12 35MSGCON(6 DIV3897 SYMSGF)
     A            BOKNDA         8Y 0O 12 42DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BONADA        30   O 12 51DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 13  2MSGCON(72 DIV3243 SYMSGF)
     A            BONT1          7Y 0O 14  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOKDC1         2   O 14 11DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOMN1         20A  O 14 14DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVS1         25A  O 14 35DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVKT1         9Y 0O 14 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOM31          7Y 3O 14 73DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BONT2          7Y 0O 15  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOKDC2         2   O 15 11DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOMN2         20A  O 15 14DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVS2         25A  O 15 35DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVKT2         9Y 0O 15 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOM32          7Y 3O 15 73DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BONT3          7Y 0O 16  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOKDC3         2   O 16 11DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOMN3         20A  O 16 14DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVS3         25A  O 16 35DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVKT3         9Y 0O 16 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOM33          7Y 3O 16 73DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BONT4          7Y 0O 17  2DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOKDC4         2   O 17 11DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOMN4         20A  O 17 14DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVS4         25A  O 17 35DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOVKT4         9Y 0O 17 62DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BOM34          7Y 3O 17 73DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18  2MSGCON(5 DIV3198 SYMSGF)
     A            BOLSS          5A  O 18  8DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOLSSN        20A  O 18 14DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18 42MSGCON(5 DIV3202 SYMSGF)
     A            WSDT4          6Y 0O 18 48DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 18 56MSGCON(4 DIV3237 SYMSGF)
     A            BOREF2        20A  O 18 61DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19  2MSGCON(8 DIV3239 SYMSGF)
     A            BOINS2        55A  O 19 11DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 20  2MSGCON(5 DIV3244 SYMSGF)
     A            BODP          20A  O 20  8DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 20 42MSGCON(5 DIV3202 SYMSGF)
     A            WSDT5          6Y 0O 20 48DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                 20 56MSGCON(4 DIV3237 SYMSGF)
     A            BOREF3        20A  O 20 61DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 21  2MSGCON(8 DIV3239 SYMSGF)
     A            BOINS3        55A  O 21 11DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 22  2MSGCON(18 YBC0697 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(78 YBC0185 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R BILDE03
     A                                      WINDOW(8 5 7 68 *NOMSGLIN)
     A                                      CF01(01 'BYTT AVDELINGER')
     A                                      CF03(03 'Avslutt registrering av BO-
     A                                      OKING')
     A                                      CF05(05 'VISERE')
     A                                      CF10(10 'B/L VARELINJE TYPE 1')
     A                                      CF11(11 'B/L VARELINJE TYPE 2')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A                                      OVERLAY
     A                                  1  2'SYSPED/SYSJ52B'
     A                                      COLOR(BLU)
     A                                  2  2MSGCON(5 DIV3245 SYMSGF)
     A            BOKNT          8Y 0O  2 11DSPATR(UL)
     A                                      DSPATR(PC)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            BONAT         20A  O  2 20DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  3  2MSGCON(5 DIV3202 SYMSGF)
     A            WSDT6          6Y 0O  3 11DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  3 19MSGCON(4 DIV3237 SYMSGF)
     A            BOREF4        20A  O  3 24DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  4  2MSGCON(8 DIV3239 SYMSGF)
     A            BOINS4        55A  O  4 11DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  5  2MSGCON(4 DIV3246 SYMSGF)
     A            BORATE        50A  O  5 11DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6  2MSGCON(009 YBC0742 *LIBL/SYMSGF)
     A            BOREFN        14A  O  6 12DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 27MSGCON(003 DIV3248 *LIBL/SYMSGF)
     A            BOCP           1A  O  6 31DSPATR(UL)
     A                                      COLOR(YLW)
     A                                  6 33MSGCON(4 DIV3247 SYMSGF)
     A            BOVAL          3A  O  6 38DSPATR(UL)
     A                                      COLOR(YLW)
     A            BOBL           7Y 0O  6 42DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  7  2MSGCON(60 YBC0701 SYMSGF)
     A                                      COLOR(BLU)
