     A          R SYSTHLPR
     A            SYSTIP        30          COLHDG('IPADRESSE LOKAL')
     A            SYSTBA        30          COLHDG('BANE')
