     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R BILDE01
     A                                      CF03(03 'EXIT')
     A                                      CF04(04 'SØK')
     A                                      CF12(12 'FORIGE')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYST01A'
     A                                      COLOR(BLU)
     A                                  1 22'Statistikk basert på oppdragsutval-
     A                                      g  '
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  2  2'Stat.navn / beskr...'
     A            WSNAVN        10   B  2 24COLOR(YLW)
     A            WSBESK        40   B  2 36COLOR(YLW)
     A                                  3  2'Sortering/sum.-kode.'
     A            WSTYPE         5A  B  3 24DSPATR(UL)
     A                                      COLOR(YLW)
     A  42                                  ERRMSG('Tastet statistikktype er fe-
     A                                      il. Se gyldige ved F4')
     A  42                                  DSPATR(RI)
     A  42                                  DSPATR(PC)
     A            KFTXT         50   O  3 31COLOR(WHT)
     A                                  4  2'Beløp medtas........'
     A            WSBEL          1   B  4 24COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N')
     A                                  4 32'(J/N)'
     A                                  5  2MSGCON(020 DIV2345 *LIBL/SYMSGF)
     A            WSDTF          6Y 0B  5 24EDTCDE(4)
     A                                      CHECK(RB)
     A  40                                  DSPATR(RI)
     A  40                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A  40                                  ERRMSG('Dato er ugyldig eller feil -
     A                                      format (År mnd dag)')
     A                                  5 32'(ÅÅMMDD)'
     A                                  6  2MSGCON(020 DIV2346 *LIBL/SYMSGF)
     A            WSDTT          6Y 0B  6 24CHECK(RB)
     A                                      EDTCDE(4)
     A  41                                  DSPATR(RI)
     A  41                                  DSPATR(PC)
     A                                      COLOR(YLW)
     A  41                                  ERRMSG('Dato ugyldig(År,mnd,dag) el-
     A                                      ler lavere enn FRA-dato')
     A                                  6 32'(ÅÅMMDD)'
     A                                  7  2'Valgfri utfylling av tillegsvilkår-
     A                                       for utvalg......'
     A                                      COLOR(BLU)
     A                                  8  2'(I=Inkluder,O=Overse,F=Fra-Til)'
     A                                  9  2'I/O/F:'
     A            WSURIO         1   B  9  9COLOR(YLW)
     A                                  9 11'Modulkod'
     A            WSUR01         1   B  9 20COLOR(YLW)
     A            WSUR02         1   B  9 23COLOR(YLW)
     A            WSUR03         1   B  9 26COLOR(YLW)
     A            WSUR04         1   B  9 29COLOR(YLW)
     A            WSUR05         1   B  9 32COLOR(YLW)
     A            WSUR06         1   B  9 35COLOR(YLW)
     A            WSUR07         1   B  9 38COLOR(YLW)
     A            WSUR08         1   B  9 41COLOR(YLW)
     A            WSUR09         1   B  9 44COLOR(YLW)
     A            WSUR10         1   B  9 47COLOR(YLW)
     A                                 10  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSAVIO         1A  B 10  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                 10 11'Avdeling'
     A            WSAV01         4Y 0B 10 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV02         4Y 0B 10 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV03         4Y 0B 10 32DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV04         4Y 0B 10 38DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV05         4Y 0B 10 44DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV06         4Y 0B 10 50DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV07         4Y 0B 10 56DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV08         4Y 0B 10 62DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV09         4Y 0B 10 68DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSAV10         4Y 0B 10 74DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 11  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSFKIO         1A  B 11  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                 11 11'Kn.f.mot'
     A            WSFK01         8Y 0B 11 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK02         8Y 0B 11 32DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK03         8Y 0B 11 44DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK04         8Y 0B 11 56DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK05         8Y 0B 11 68DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK06         8Y 0B 12 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK07         8Y 0B 12 32DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK08         8Y 0B 12 44DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK09         8Y 0B 12 56DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFK10         8Y 0B 12 68DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 13  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSKNIO         1A  B 13  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                 13 11'Kundenr.'
     A            WSKN01         8Y 0B 13 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN02         8Y 0B 13 32DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN03         8Y 0B 13 44DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN04         8Y 0B 13 56DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN05         8Y 0B 13 68DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN06         8Y 0B 14 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN07         8Y 0B 14 32DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN08         8Y 0B 14 44DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN09         8Y 0B 14 56DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSKN10         8Y 0B 14 68DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSFLIO         1A  B 15  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                 15 11'Flyselsk'
     A            WSFL01         3Y 0B 15 20DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL02         3Y 0B 15 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL03         3Y 0B 15 32DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL04         3Y 0B 15 38DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL05         3Y 0B 15 44DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL06         3Y 0B 15 50DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL07         3Y 0B 15 56DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL08         3Y 0B 15 62DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL09         3Y 0B 15 68DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSFL10         3Y 0B 15 74DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A                                 16  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSOTIO         1A  B 16  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                 16 11MSGCON(008 DIV1204 *LIBL/SYMSGF)
     A            WSOT01         2A  B 16 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT02         2A  B 16 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT03         2A  B 16 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT04         2A  B 16 38DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT05         2A  B 16 44DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT06         2A  B 16 50DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT07         2A  B 16 56DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT08         2A  B 16 62DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT09         2A  B 16 68DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSOT10         2A  B 16 74DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 17  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSFRIO         1A  B 17  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                 17 11MSGCON(008 DIV1203 *LIBL/SYMSGF)
     A            WSFR01         3A  B 17 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR02         3A  B 17 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR03         3A  B 17 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR04         3A  B 17 38DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR05         3A  B 17 44DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR06         3A  B 17 50DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR07         3A  B 17 56DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR08         3A  B 17 62DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR09         3A  B 17 68DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFR10         3A  B 17 74DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 19  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSLKIO         1A  B 19  9DSPATR(UL)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                      COLOR(YLW)
     A                                 19 11MSGCON(008 DIV1178 *LIBL/SYMSGF)
     A            WSLK01         2A  B 19 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK02         2A  B 19 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK03         2A  B 19 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK04         2A  B 19 38DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK05         2A  B 19 44DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK06         2A  B 19 50DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK07         2A  B 19 56DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK08         2A  B 19 62DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK09         2A  B 19 68DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSLK10         2A  B 19 74DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 20  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSFSIO         1A  B 20  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                 20 11'Fra sted'
     A            WSFS01         5A  B 20 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS02         5A  B 20 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS03         5A  B 20 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS04         5A  B 20 38DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS05         5A  B 20 44DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS06         5A  B 20 50DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS07         5A  B 20 56DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS08         5A  B 20 62DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS09         5A  B 20 68DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSFS10         5A  B 20 74DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 21  2MSGCON(006 JOV0573 *LIBL/SYMSGF)
     A            WSTSIO         1A  B 21  9DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'I' 'O' 'F')
     A                                 21 11'Til sted'
     A            WSTS01         5A  B 21 20DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS02         5A  B 21 26DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS03         5A  B 21 32DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS04         5A  B 21 38DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS05         5A  B 21 44DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS06         5A  B 21 50DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS07         5A  B 21 56DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS08         5A  B 21 62DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS09         5A  B 21 68DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSTS10         5A  B 21 74DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 23'F4=Søk statistikk-type'
     A                                      COLOR(BLU)
     A                                 23 50MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A          R BILDE02
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(12 'FOREGÅENDE')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYST01A'
     A                                      COLOR(BLU)
     A                                  1 22'Statistikk basert på oppdragsutval-
     A                                      g  '
     A                                      COLOR(WHT)
     A                                  1 64DATE
     A                                      EDTCDE(Y)
     A                                  1 73TIME
     A                                  5  2'Layout..................'
     A            WSLAYO         5   B  5 28
     A  50                                  DSPATR(PC)
     A N50                                  DSPATR(PR)
     A                                  5 38'(*STD / A4)'
     A                                  7  2MSGCON(024 DIV1497 *LIBL/SYMSGF)
     A            WSVAVD         4Y 0B  7 28DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A N50                                  DSPATR(PR)
     A                                  9  2MSGCON(024 DIV1498 *LIBL/SYMSGF)
     A            WSSFSI         3A  B  9 28DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A N50                                  DSPATR(PR)
     A                                 11  2'Antall kopier...........'
     A  50                                  DSPATR(ND)
     A            WSANTK         1A  B 11 28VALUES('1' '2' '3' '4' '5' '6' '7')
     A  50                                  DSPATR(PR)
     A N50                                  DSPATR(PC)
     A  50                                  DSPATR(ND)
     A                                 13  2MSGCON(024 DIV4058 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSPRT         10A  B 13 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                 15  2MSGCON(024 DIV4059 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSFORM        10A  B 15 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                 17  2MSGCON(024 DIV4060 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSJOBQ         1A  B 17 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                      VALUES(' ' 'J' 'N')
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
