     A          R HEAD1E
     A            FIFT          45      2  2HIGHLIGHT
     A                                  2 31'OPPDRAGS-STATISTIKK'
     A                                      HIGHLIGHT
     A                                  2 61MSGCON(6 DIV2310 SYMSGF)
     A            UDAY           2  0   2 68EDTCDE(Z)
     A                                  2 70'.'
     A            UMONTH         2  0   2 71
     A                                  2 73'.'
     A            UYEAR          2  0   2 74
     A                                  3 61'Tid :'
     A            TID            6  0   3 68EDTWRD('  .  .  ')
     A                                  7 15'BESTILLINGSPARAMETRE:'
     A                                      HIGHLIGHT
     A                                  8 15'(Grunnlag for oppdragsutvalget.)'
     A                                      HIGHLIGHT
     A                                 11 15'Statistikk-type.....'
     A            WSTYPE         5     11 41
     A                                 11 47'='
     A            TXTYPE        30     11 49
     A                                 13 15'Fra og med dato.....'
     A            WSDTF          6  0  13 41EDTWRD('  .  .  ')
     A                                 14 15'Til og med dato.....'
     A            WSDTT          6  0  14 41EDTWRD('  .  .  ')
     A                                 16 15'Skriv beløp.........'
     A            WSBEL          1     16 41
      *
     A                                 19  5'Tilleggsvalg for å begrense op'
     A                                      HIGHLIGHT
     A                                 19 35'pdragsutvalget'
     A                                      HIGHLIGHT
      *
     A            TXURIO         8     21  5
     A                                 21 15'modulkode      '
     A            WSUR01         1     22 15
     A            WSUR02         1     22 21
     A            WSUR03         1     22 27
     A            WSUR04         1     22 33
     A            WSUR05         1     22 39
     A            WSUR06         1     22 45
     A            WSUR07         1     22 51
     A            WSUR08         1     22 57
     A            WSUR09         1     22 63
     A            WSUR10         1     22 69
      *
      *
     A            TXAVIO         8     24  5
     A                                 24 15'avdeling       '
     A            WSAV01         4  0  25 15EDTCDE(Z)
     A            WSAV02         4  0  25 21EDTCDE(Z)
     A            WSAV03         4  0  25 27EDTCDE(Z)
     A            WSAV04         4  0  25 33EDTCDE(Z)
     A            WSAV05         4  0  25 39EDTCDE(Z)
     A            WSAV06         4  0  25 45EDTCDE(Z)
     A            WSAV07         4  0  25 51EDTCDE(Z)
     A            WSAV08         4  0  25 57EDTCDE(Z)
     A            WSAV09         4  0  25 63EDTCDE(Z)
     A            WSAV10         4  0  25 69EDTCDE(Z)
      *
     A            TXFKIO         8     27  5
     A                                 27 15'kundenr. fakt. '
     A            WSFK01         8  0  28 15EDTCDE(Z)
     A            WSFK02         8  0  28 26EDTCDE(Z)
     A            WSFK03         8  0  28 37EDTCDE(Z)
     A            WSFK04         8  0  28 48EDTCDE(Z)
     A            WSFK05         8  0  28 59EDTCDE(Z)
     A            WSFK06         8  0  29 15EDTCDE(Z)
     A            WSFK07         8  0  29 26EDTCDE(Z)
     A            WSFK08         8  0  29 37EDTCDE(Z)
     A            WSFK09         8  0  29 48EDTCDE(Z)
     A            WSFK10         8  0  29 59EDTCDE(Z)
      *
     A            TXKNIO         8     31  5
     A                                 31 15'kundenr. "part"'
     A            WSKN01         8  0  32 15EDTCDE(Z)
     A            WSKN02         8  0  32 26EDTCDE(Z)
     A            WSKN03         8  0  32 37EDTCDE(Z)
     A            WSKN04         8  0  32 48EDTCDE(Z)
     A            WSKN05         8  0  32 59EDTCDE(Z)
     A            WSKN06         8  0  33 15EDTCDE(Z)
     A            WSKN07         8  0  33 26EDTCDE(Z)
     A            WSKN08         8  0  33 37EDTCDE(Z)
     A            WSKN09         8  0  33 48EDTCDE(Z)
     A            WSKN10         8  0  33 59EDTCDE(Z)
      *
     A            TXOTIO         8     35  5
     A                                 35 15'oppdragstype   '
     A            WSOT01         2     36 15
     A            WSOT02         2     36 21
     A            WSOT03         2     36 27
     A            WSOT04         2     36 33
     A            WSOT05         2     36 39
     A            WSOT06         2     36 45
     A            WSOT07         2     36 51
     A            WSOT08         2     36 57
     A            WSOT09         2     36 63
     A            WSOT10         2     36 69
      *
     A            TXFRIO         8     38  5
     A                                 38 15'frankatur      '
     A            WSFR01         3     39 15
     A            WSFR02         3     39 21
     A            WSFR03         3     39 27
     A            WSFR04         3     39 33
     A            WSFR05         3     39 39
     A            WSFR06         3     39 45
     A            WSFR07         3     39 51
     A            WSFR08         3     39 57
     A            WSFR09         3     39 63
     A            WSFR10         3     39 69
      *
     A            TXLKIO         8     41  5
     A                                 41 15'landkode       '
     A            WSLK01         2     42 15
     A            WSLK02         2     42 21
     A            WSLK03         2     42 27
     A            WSLK04         2     42 33
     A            WSLK05         2     42 39
     A            WSLK06         2     42 45
     A            WSLK07         2     42 51
     A            WSLK08         2     42 57
     A            WSLK09         2     42 63
     A            WSLK10         2     42 69
      *
     A            TXFSIO         8     44  5
     A                                 44 15'fra stedskode  '
     A            WSFS01         5     45 15
     A            WSFS02         5     45 21
     A            WSFS03         5     45 27
     A            WSFS04         5     45 33
     A            WSFS05         5     45 39
     A            WSFS06         5     45 45
     A            WSFS07         5     45 51
     A            WSFS08         5     45 57
     A            WSFS09         5     45 63
     A            WSFS10         5     45 69
      *
     A            TXTSIO         8     47  5
     A                                 47 15'til stedskode  '
     A            WSTS01         5     48 15
     A            WSTS02         5     48 21
     A            WSTS03         5     48 27
     A            WSTS04         5     48 33
     A            WSTS05         5     48 39
     A            WSTS06         5     48 45
     A            WSTS07         5     48 51
     A            WSTS08         5     48 57
     A            WSTS09         5     48 63
     A            WSTS10         5     48 69
      *
     A            TXFLIO         8     50  5
     A                                 50 15'flyselskap     '
     A            WSFL01         3  0  51 15EDTCDE(Z)
     A            WSFL02         3  0  51 21EDTCDE(Z)
     A            WSFL03         3  0  51 27EDTCDE(Z)
     A            WSFL04         3  0  51 33EDTCDE(Z)
     A            WSFL05         3  0  51 39EDTCDE(Z)
     A            WSFL06         3  0  51 45EDTCDE(Z)
     A            WSFL07         3  0  51 51EDTCDE(Z)
     A            WSFL08         3  0  51 57EDTCDE(Z)
     A            WSFL09         3  0  51 63EDTCDE(Z)
     A            WSFL10         3  0  51 69EDTCDE(Z)
      *
     A                                 57  5'Alle vilkår SOM ER ANGITT må v'
     A                                      HIGHLIGHT
     A                                 57 35'ære oppfylt før oppdraget tas med.'
     A                                      HIGHLIGHT
      *
     A          R HEADPE
     A            FIFT          45      2  2HIGHLIGHT
     A                                  2 31'OPPDRAGS-STATISTIKK'
     A                                      HIGHLIGHT
     A                                  2 61MSGCON(6 DIV2310 SYMSGF)
     A            UDAY           2  0   2 68EDTCDE(Z)
     A                                  2 70'.'
     A            UMONTH         2  0   2 71
     A                                  2 73'.'
     A            UYEAR          2  0   2 74
     A                                  3 61'Tid :'
     A            TID            6  0   3 68EDTWRD('  .  .  ')
     A                                  4 15'(Se forside for grunnlag for o'
     A                                  4 45'ppdragsutvalg)'
     A                                  4 61'Side:'
     A            SIDE           4  0   4 72EDTCDE(Z)
     A*
     A                                  6 01'______________________________'
     A                                  6 31'______________________________'
     A                                  6 61'__________________'
     A                                  7 31'     | Antall| Antall| Brutto '
     A                                  7 61'  | Inntekt/     |'
     A            TXTYPE        30A     8  1
     A                                  8 31'     |Oppdrag|  Kolli|   Fr.ve'
     A                                  8 61'kt| Kostn./Res.  |'
     A                                  8  1'______________________________'
     A                                  8 31'______________________________'
     A                                  8 61'__________________'
     A          R DETE                      SPACEB(1)
      * 1. linje
     A* Kolonnedeling
     A            DETINT        11  0     63EDTCDE(J)
     A                                    31'     |       |       |        '
     A                                    61'  |              |'
      * 2. linje
     A            TXBRUD        39A        1SPACEB(1)
     A            ANTOPD         7  0     36EDTCDE(Z)
     A            ANTKOL         7  0     44EDTCDE(Z)
     A            DETVKB         9  0     53EDTCDE(Z)
     A            DETKOS        11  0     63EDTCDE(J)
     A* Kolonnedeling
     A                                    31'     |       |       |        '
     A                                    61'  |              |'
      * 3. linje
     A                                     1' '
     A                                      SPACEB(1)
     A            TX2BRU        35A        1
     A            DETVKF         9  0     53EDTCDE(Z)
     A            DETRES        11  0     63EDTCDE(J)
     A* Kolonnedeling
     A                                    31'     |       |       |        '
     A                                    61'  |              |'
     A* Fly-stat. med beløp
     A  40                                 1' '
     A  40                                  SPACEB(1)
     A  40                                 6'PP Fr:'
     A  40        DETFPP        11  0     12EDTCDE(J)
     A  40                                32'CC Fr:'
     A  40        DETFCC        11  0     37EDTCDE(J)
     A  40                                53'Saml Fr:'
     A  40        DETFSA        11  0     61EDTCDE(J)
     A* Kolonnedeling
     A  40                                61'                 |'
     A  40                                 1' '
     A  40                                  SPACEB(1)
     A  40                                 6'PP Ge:'
     A  40        DETIPP        11  0     12EDTCDE(J)
     A  40                                32'CC Ge:'
     A  40        DETICC        11  0     37EDTCDE(J)
     A  40                                53'Saml Ge:'
     A  40        DETISA        11  0     61EDTCDE(J)
     A* Kolonnedeling
     A  40                                61'                 |'
     A* Understrek
     A                                     1'______________________________'
     A                                    31'______________________________'
     A                                    61'__________________'
