     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
     A          R BILDE01
     A                                      WINDOW(*DFT 10 75 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CF12(12 'Avbryt')
     A                                  1  2'SYSPED/SYTK13'
     A                                      COLOR(BLU)
     A                                  1 19'Generere importfil for AutoRoute  -
     A                                             '
     A                                      COLOR(WHT)
     A                                  2 19'EN bils posisjoner i tidsrom / tur-
     A                                       '
     A                                      COLOR(WHT)
     A                                  3  2'Turnummer:'
     A            WSTUR          8Y 0B  3 13EDTCDE(4)
     A                                  3 23'eller..:'
     A            WSBRID        10A  B  3 33
     A                                  3 44'<-- Sjåfør-ID/Bilnr'
     A                                  4  2'Fra og med dato / klokka....:'
     A            WSDTF          8Y 0B  4 33
     A                                  4 42'/'
     A            WSKLF          4Y 0B  4 44
     A                                  5  2'Til og med dato / klokka....:'
     A            WSDTT          8Y 0B  5 33
     A                                  5 42'/'
     A            WSKLT          4Y 0B  5 44
     A                                  7  2'Filnavn som genereres.......:'
     A            WSFIL         30A  B  7 33
     A                                  8  2'i mappe:'
     A            WSMAPP        65A  O  8 11COLOR(WHT)
     A                                 10  2'ENTER = Generer fil               -
     A                                                                    '
     A                                      COLOR(BLU)
