     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R BILDE1
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF12(03)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYTL03'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 JOV0486 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                  2 67TIME
     A                                  3  2MSGCON(030 JOV0488 *LIBL/SYMSGF)
     A            WSLBKO         5A  B  3 34
     A N50                                  DSPATR(PR)
     A N50                                  COLOR(WHT)
     A                                  8  2MSGCON(065 JOV0487 *LIBL/SYMSGF)
     A            WSLBS1        30A  B  9 34
     A            WSLBS2        30A  B 10 34
     A            WSLBS3        30A  B 11 34
     A            WSLBS4        30A  B 12 34
     A                                  5  2MSGCON(070 JOV0489 *LIBL/SYMSGF)
     A            WSENH          1A  B  6 34
     A N50                                  DSPATR(PR)
     A N50                                  COLOR(WHT)
     A                                 17  2MSGCON(030 JOV0490 *LIBL/SYMSGF)
     A            WSPRT         10A  B 17 34
     A                                 19  2MSGCON(030 JOV0491 *LIBL/SYMSGF)
     A            WSFAX         15A  B 19 34
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                  6  2'Standard 3. siste Gn.siffer..:'
