********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 SVENSK GODSREGISTRERING
********************************************************************
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/TRAN)
     A                                      PRINT
     A          R SUBFIL                    SFL
     A            GOSTED        18A  H
     A            GOMOTM        28A  H
     A            GOMERB        20A  H
     A            GOMERC        20A  H
     A            GOMERD        20A  H
     A            GOMER1         9A  H
     A            WSNR           1A  B  6  2VALUES(' ' '2' '4' '5')
     A            GOPOS          4Y 0O  6  4EDTCDE(4)
     A            GOANTK         5Y 0O  6  9EDTCDE(4)
     A            GOVSLA        18A  O  6 15
     A            GOPOS2         4Y 0O  6 34EDTCDE(4)
     A            GOMERK        20A  O  6 39
     A            GOMKOD         2A  O  6 61
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SYTL05'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 SHU0889 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 19MSGCON(012 SHU0890 *LIBL/SYMSGF)
S01  A*           GOGN1          4A  O  2 34COLOR(WHT)
S01  A*           GOGN2          5A  O  2 39COLOR(WHT)
S01  A*           GOGN3          3A  O  2 45COLOR(WHT)
S01  A*           GOGN4          3A  O  2 49COLOR(WHT)
N01  A N39        GOGN1          4A  O  2 34COLOR(WHT)
N01  A N39        GOGN2          5A  O  2 39COLOR(WHT)
N01  A N39        GOGN3          3A  O  2 45COLOR(WHT)
N01  A N39        GOGN4          3A  O  2 49COLOR(WHT)
N01  A  39        UDSGN         15A  O  2 34COLOR(WHT)
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  3 19MSGCON(012 SHU0946 *LIBL/SYMSGF)
     A            GOTRNR        20A  O  3 34COLOR(WHT)
     A            WSDATO         6Y 0O  3 56EDTWRD('  .  .  ')
     A                                      COLOR(WHT)
     A                                  5  1MSGCON(075 SHU0891 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(040 SHU0971 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF12(03)
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98                              4  2MSGCON(079 DIV0012 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N98 30     MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VARELI
     A                                      CF12(12 'Forrige')
     A                                      CF03(03)
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYTL05'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 SHU0889 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 19MSGCON(007 SHU0890 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
S01  A*           GOGN1          4A  O  2 28
S01  A*           GOGN2          5A  O  2 33
S01  A*           GOGN3          3A  O  2 39
S01  A*           GOGN4          3A  O  2 43
N01  A N39        GOGN1          4A  O  2 28
N01  A N39        GOGN2          5A  O  2 33
N01  A N39        GOGN3          3A  O  2 39
N01  A N39        GOGN4          3A  O  2 43
N01  A  39        UDSGN         15A  O  2 28
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(015 SHU0943 *LIBL/SYMSGF)
     A            WSMKOD         2A  B  4 18
     A  77                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                  5  2MSGCON(015 SHU0892 *LIBL/SYMSGF)
     A            WSPOS     R        B  5 18REFFLD(MERKNFR/GOPOS *LIBL/MERKNF)
     A                                      EDTCDE(4)
     A  31                                  DSPATR(HI)
     A                                  6  2MSGCON(015 SHU0893 *LIBL/SYMSGF)
     A            WSANTK    R        B  6 18REFFLD(MERKNFR/GOANTK *LIBL/MERKNF)
     A                                      EDTCDE(4)
     A  71                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                  7  2MSGCON(015 SHU0894 *LIBL/SYMSGF)
     A            WSVSLA    R        B  7 18REFFLD(MERKNFR/GOVSLA *LIBL/MERKNF)
     A  72                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                  8  2MSGCON(015 SHU0947 *LIBL/SYMSGF)
     A            WSMER1         9A  B  8 18
     A  73                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                  9  2MSGCON(015 SHU0896 *LIBL/SYMSGF)
     A            WSSTED        18A  B  9 18
     A  74                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                 10  2MSGCON(015 SHU0950 *LIBL/SYMSGF)
     A            WSPOS2         4Y 0B 10 18EDTCDE(4)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                 11  2MSGCON(015 SHU0897 *LIBL/SYMSGF)
     A            WSMOTT    R        B 11 18REFFLD(MERKNFR/GOMOTM *LIBL/MERKNF)
     A  75                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                 12  2MSGCON(015 SHU0898 *LIBL/SYMSGF)
     A            WSMERK    R        B 12 18REFFLD(MERKNFR/GOMERK *LIBL/MERKNF)
     A  76                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A            WSMERB    R        B 13 18REFFLD(MERKNFR/GOMERK *LIBL/MERKNF)
     A  76                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A            WSMERC    R        B 14 18REFFLD(MERKNFR/GOMERK *LIBL/MERKNF)
     A  76                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A            WSMERD    R        B 15 18REFFLD(MERKNFR/GOMERK *LIBL/MERKNF)
     A  76                                  DSPATR(RI)
     A  31                                  DSPATR(PR)
     A  31                                  DSPATR(HI)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A                                 23 21MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R VAREL2
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
      *
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      OVERLAY
     A                                  1  2'SYSPED/SYTL05'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 SHU0889 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                  2 67TIME
     A                                  3  2MSGCON(018 DIV5049 *LIBL/SYMSGF)
      *
     A          R NYWRK
     A                                      CF03(03 'EXIT')
     A                                      CF12(03)
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                  1  2'SYSPED/SYTL05'
     A                                      COLOR(BLU)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A                                  3 19MSGCON(012 SHU0946 *LIBL/SYMSGF)
     A            GOTRNR        20A  O  3 34COLOR(WHT)
     A                                  4  2MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 SHU0889 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 19MSGCON(012 SHU0890 *LIBL/SYMSGF)
S01  A*           GOGN1          4A  O  2 34COLOR(WHT)
S01  A*           GOGN2          5A  O  2 39COLOR(WHT)
S01  A*           GOGN3          3A  O  2 45COLOR(WHT)
S01  A*           GOGN4          3A  O  2 49COLOR(WHT)
N01  A N39        GOGN1          4A  O  2 34COLOR(WHT)
N01  A N39        GOGN2          5A  O  2 39COLOR(WHT)
N01  A N39        GOGN3          3A  O  2 45COLOR(WHT)
N01  A N39        GOGN4          3A  O  2 49COLOR(WHT)
N01  A  39        UDSGN         15A  O  2 34COLOR(WHT)
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A                                  5  1MSGCON(075 SHU0891 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            WSDATO         6Y 0O  3 56EDTWRD('  .  .  ')
     A                                      COLOR(WHT)
