     A*%%TS  SD  20130904  102322  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A          R BILDE1
     A*%%TS  SD  20130904  102322  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'EXIT')
     A                                      CF12(03)
     A                                      CF04(04 'søk')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYTL04'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 JOV0492 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                  2 67TIME
     A                                  3  2MSGCON(030 JOV0488 *LIBL/SYMSGF)
     A            WSLBKO         5A  B  3 34DSPATR(PR)
     A                                      COLOR(WHT)
     A                                  5  2MSGCON(065 JOV0487 *LIBL/SYMSGF)
     A            WSLBS1        30A  B  6 34DSPATR(PR)
     A                                      COLOR(WHT)
     A            WSLBS2        30A  B  7 34DSPATR(PR)
     A                                      COLOR(WHT)
     A            WSLBS3        30A  B  8 34DSPATR(PR)
     A                                      COLOR(WHT)
     A            WSLBS4        30A  B  9 34DSPATR(PR)
     A                                      COLOR(WHT)
     A                                 12  2MSGCON(030 JOV0490 *LIBL/SYMSGF)
     A            WSPRT         10A  B 12 34
     A                                 14  2MSGCON(030 SHU1402 *LIBL/SYMSGF)
     A            WSEPJN         1   B 14 34VALUES('J' 'N' 'S')
     A                                 15  2MSGCON(030 SHU0977 *LIBL/SYMSGF)
     A            EPOST         70A  B 15 34CHECK(LC)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
