     A          R SYTL02FR
     A            GFLBKO         5A         COLHDG('Bevillings kode')
     A            GFLBS1        30A         COLHDG('Lagerholdssted 1')
     A            GOGN          15A         COLHDG('Godsnummer')
     A            GOBILN        13A         COLHDG('Bilnummer')
     A            GOAVG         15A         COLHDG('Avg. tollsted')
     A            GOTRNR        20A         COLHDG('Transitt. nr')
     A            XOTRDT         6  0       COLHDG('Transitt. dato')
     A            GOGREN        20          COLHDG('Grensepass-sted')
     A            GOLSEN        20          COLHDG('Første Lossested')
     A            GOTYPE        20          COLHDG('Type gods')
     A            XXMKOD         5          COLHDG('Merkn.kode')
