     A          R SYTR88SR
     A            STTUR          8S 0       TEXT('TURNR')
     A            STKNR          8S 0       TEXT('KUNDENR')
     A            STAVD          4S 0       TEXT('AVD')
     A            STOPD          7S 0       TEXT('OPPDRNR')
     A*
     A* VERDIER ORIGINALT HENTET FRA DET ENKELTE OPPDRAG
     A            STFR           3A         TEXT('FRANKATUR')
     A            STKDPL         1A         TEXT('PROD-KODE')
     A            STLKF          2A         TEXT('FRA LAND')
     A            STSDF          5A         TEXT('FRA STED')
     A            STLKT          2A         TEXT('TIL LAND')
     A            STSDT          5A         TEXT('TIL STED')
     A            STAMNA        30A         TEXT('AVS/MOTT NAVN')
     A            STAMA1        30A         TEXT('AVS/MOTT ADR1')
     A            STAMA2        30A         TEXT('AVS/MOTT ADR2')
     A            STAMA3        30A         TEXT('AVS/MOTT ADR3')
     A            STVKT          9S 0       TEXT('VEKT')
     A            STFBV          9S 0       TEXT('F.B.VEKT')
     A            STLM           4S 2       TEXT('LASTEMETER')
     A            STM3           7S 3       TEXT('KUBIKK')
     A            STNT           7S 0       TEXT('ANT KLL')
     A            STFRKO         1A         TEXT('FRAKT-KODE')
     A            STOPFR        11S 2       TEXT('OPPDRAGS FRAKTPRIS')
     A            STOPKO         1A         TEXT('FAKTURA STATUSKODE')
     A            STTUÅR         4S 0       TEXT('TUR PERIODE ÅR')
     A            STTUMN         2S 0       TEXT('TUR PERIODE MND')
     A*
     A* VERDIER BENYTTET I FORDELINGEN
     A            STANTO         3S 0       TEXT('ANT OPD I SAMTAKS.')
     A            STANTF         3S 0       TEXT('ANT IKKE SAMTAKS.')
     A            STKNRB         8S 0       TEXT('KUNDENR  BENYTTET')
     A            STLKFB         2A         TEXT('FRA LAND BENYTTET')
     A            STSDFB         5A         TEXT('FRA STED BENYTTET')
     A            STLKTB         2A         TEXT('TIL LAND BENYTTET')
     A            STSDTB         5A         TEXT('TIL STED BENYTTET')
     A            STFRB          3A         TEXT('FRANKATUR BENYTTET')
     A            STKDPB         1A         TEXT('PROD-KODE BENYTTET')
     A            STVKTS         9S 0       TEXT('SUM VEKT')
     A            STFBVS         9S 0       TEXT('SUM F.B.VEKT')
     A            STLMS          4S 2       TEXT('SUM LASTEMETER')
     A            STM3S          7S 3       TEXT('SUM KUBIKK')
     A            STNTS          7S 0       TEXT('SUM ANT KLL')
     A            STOPFS        11S 2       TEXT('OPPDRAGS FRAKT SUM')
     A            STSAFS        11S 2       TEXT('SAMTAKS. FRAKT SUM')
     A            STBEFS        11S 2       TEXT('SAMT. FR-SUM BENYTTET')
      * SLUTTRESULTAT...
     A            STNR           2S 0       TEXT('SAMTAKSERINGSNUMMER')
     A            STOAND         9S 6       TEXT('%-ANDEL DETTE OPPDR')
     A            STBEFD        11S 2       TEXT('SAMT.PRIS DETALJ=OPD.')
     A          K STTUR
     A          K STAVD
     A          K STOPD
