     A*%%TS  SD  20130821  144744  SVEIN       REL-V7R1M0  5770-WDS
     A* ENDRING ER MERKET MED KING
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE01
     A*%%TS  SD  20130821  144744  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'SØK BILNUMMER')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYTR43A'
     A                                      COLOR(BLU)
     A                                  1 20MSGCON(030 DIV5011 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  1 73TIME
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(024 SHU1269 *LIBL/SYMSGF)
     A            WSFRA          4Y 0B  5 28EDTCDE(Z)
     A            WSTIL          4Y 0B  5 35EDTCDE(Z)
     A                                  7  2MSGCON(024 DIV5012 *LIBL/SYMSGF)
     A            WSBILN        10A  B  7 28
     A                                  7 41MSGCON(015 DIV5005 *LIBL/SYMSGF)
     A                                  9  2MSGCON(024 DIV5013 *LIBL/SYMSGF)
     A            WSTYPE         1A  B  9 28
     A                                  9 41MSGCON(015 DIV5005 *LIBL/SYMSGF)
     A                                 15  2MSGCON(024 SHU1399 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            EPOST          1A  B 15 28
     A  50                                  DSPATR(ND)
     A                                 17  2MSGCON(024 DIV4058 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSPRT         10A  B 17 28
     A  50                                  DSPATR(PR)
     A N50                                  DSPATR(PC)
     A  50                                  DSPATR(ND)
     A                                 19  2MSGCON(024 DIV4059 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSFORM        10A  B 19 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                 21  2MSGCON(024 DIV4060 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSJOBQ         1A  B 21 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 27MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
