     A          R SYTR88SR                  PFILE(SYTR88S)
     A          K STTUR
     A          K STKNR
     A          K STKDPL
     A          K STLKF
     A          K STSDF
     A          K STLKT
     A          K STSDT
     A          K STAMNA
     A          K STAMA1
     A          K STAMA2
     A          K STAMA3
