     A*%%TS  SD  20131106  101443  JOVO        REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
     A          R BILDE
     A*%%TS  SD  20131106  101443  JOVO        REL-V7R1M0  5770-WDS
     A  *DS3                                WINDOW(*DFT 15 73 *NOMSGLIN)
     A  *DS4                                WINDOW(*DFT 15 73 *NOMSGLIN)
     A                                      CF08(08 'FINN HEN')
     A                                      CF09(09 'FINN LEV')
     A                                      CF10(10 'SEND ANNEN')
     A                                      CF12(12 'Avslutt')
     A*                                     BLINK
     A*                                     WDWBORDER((*DSPATR HI) (*CHAR '...:-
     A*                                     ::.:'))
     A                                  1  2'SYTR33G'
     A                                      COLOR(BLU)
     A                                  1 12'Vedlikehold oppdrags GeoLocat.'
     A                                      COLOR(WHT)
     A                                  1 43'Avd'
     A            UAVD           4Y 0O  1 47COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  1 52'Oppd'
     A            UOPD           7Y 0O  1 57COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  2  2'Avsender:'
     A            HEKNS          8Y 0O  2 12COLOR(WHT)
     A                                      EDTCDE(Z)
     A            AVSNAV        30A  O  2 21COLOR(WHT)
     A                                  3  2'Hent.adr:'
     A            HENAS         30A  O  3 12COLOR(WHT)
     A                                  3 44'Breddegr.   Lengdegr.   Kode'
     A            HEADS1        30A  O  4 12COLOR(WHT)
     A            WSHBRE         8Y 6B  4 44EDTCDE(J)
     A                                      DSPATR(PR)
     A                                      DSPATR(HI)
     A            WSHLEN         9Y 6B  4 56EDTCDE(J)
     A                                      DSPATR(HI)
     A                                      DSPATR(PR)
     A            HEHBLK         1A  O  4 70COLOR(WHT)
     A            HEADS3        30A  O  5 12COLOR(WHT)
     A                                  5 44'F8=Finn GeoLoc.i Google Maps'
     A                                      COLOR(BLU)
     A                                  9  2'Mottaker:'
     A            HEKNK          8Y 0O  9 12COLOR(WHT)
     A                                      EDTCDE(Z)
     A            MOTNAV        30A  O  9 21COLOR(WHT)
     A                                 10  2'Leve.adr:'
     A            HENAK         30A  O 10 12COLOR(WHT)
     A                                 10 44'Breddegr.   Lengdegr.   Kode'
     A            HEADK1        30A  O 11 12COLOR(WHT)
     A            WSLBRE         8Y 6B 11 44EDTCDE(J)
     A                                      DSPATR(HI)
     A                                      DSPATR(PR)
     A            WSLLEN         9Y 6B 11 56EDTCDE(J)
     A                                      DSPATR(HI)
     A                                      DSPATR(PR)
     A            HELBLK         1A  O 11 70COLOR(WHT)
     A            HEADK3        30A  O 12 12COLOR(WHT)
     A                                 12 44'F9=Finn GeoLoc.i Google Maps'
     A                                      COLOR(BLU)
     A                                 15 12'F8=Finn hentested  F9=Finn lev.ste-
     A                                      d'
     A                                      COLOR(BLU)
     A                                 15 62'F12=Forrige'
     A                                      COLOR(BLU)
