     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A          R BILDE1
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF12(03)
     A                                      CF04(04 'SØKING')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYTR15'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 DIV2357 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                  2 67TIME
     A                                  4  2MSGCON(025 DIV2358 *LIBL/SYMSGF)
     A            WSTNR     R        B  4 29REFFLD(TURERR/TUKNT2 *LIBL/TURER)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  70                                  DSPATR(RI)
     A                                  7  2MSGCON(025 DIV2359 *LIBL/SYMSGF)
     A            WSBILN        10A  B  7 29
     A  72                                  DSPATR(RI)
     A                                  8  2MSGCON(025 DIV2360 *LIBL/SYMSGF)
     A            WSBILK         3A  B  8 29
     A  73                                  DSPATR(RI)
     A                                 10  2MSGCON(025 DIV2265 *LIBL/SYMSGF)
     A            WSPERM         2Y 0B 10 29CHECK(FE)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  71                                  DSPATR(RI)
     A            WSPERÅ         2Y 0B 10 32CHECK(FE)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  71                                  DSPATR(RI)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
