     A*%%TS  SD  19990430  140932  JOVO        REL-V4R2M0  5769-PW1
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
P0380A* 01 YBC VER4 SØKING PÅ UTL.BEHOLD OG STATUS KODE
     A*             NYTT FELT FOR LOSSESTED
P0343A* 02 YBC VER4 WSVKT MED 5.0 ER ENDRET TIL WSVKTK
*****A**************************************************************
     A*
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      HLPDOC('SYTR100000' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      ALTHELP
     A                                      HELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                      CF12(12)
     A                                      CF05(05 'Gå direkte til faktura')
     A                                      CF07(07 'SPØRRING OPPDRAG')
     A                                      CF09(09 'Bytt signatur')
     A                                      CF20(20 'FAX')
     A                                  1  3'SYSPED/SYTR10'
     A                                      COLOR(BLU)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 67TIME
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(045 DIV0596 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  2 21MSGCON(045 DIV3753 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  3 21MSGCON(045 DIV3754 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  7  3MSGCON(018 SHU0315 *LIBL/SYMSGF)
     A            WSIE           1A  B  7 24VALUES('T' ' ' 'I' 'E')
     A                                  9  3MSGCON(018 DIV0599 *LIBL/SYMSGF)
     A            WSSG           3A  B  9 24TEXT('Signatur')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                 11  3MSGCON(018 DIV0600 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B 11 24TEXT('Avdeling')
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      DSPATR(PC)
     A  98                                  DSPATR(RI)
     A                                 13  3MSGCON(018 DIV0601 *LIBL/SYMSGF)
     A            WSOPD          5Y 0B 13 24TEXT('Oppdragsnummer')
     A                                      DSPATR(UL)
     A  97                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 13 39MSGCON(020 DIV0604 *LIBL/SYMSGF)
     A                                 15  3MSGCON(018 DIV0602 *LIBL/SYMSGF)
     A            HEAVD          4Y 0B 15 24TEXT('Avdeling')
     A                                      DSPATR(UL)
     A  96                                  DSPATR(PC)
     A  96                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A            HEOPD          5Y 0B 15 31TEXT('Oppdragsnummer')
     A                                      DSPATR(UL)
     A  96                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                 15 39MSGCON(020 DIV0036 *LIBL/SYMSGF)
     A                                 18  3MSGCON(018 DIV0603 *LIBL/SYMSGF)
     A            WSOPDG         5Y 0O 18 24COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 23  3MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0605 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0606 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0033 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A*
     A          R BILDE02
     A*%%TS  SD  19990430  140932  JOVO        REL-V4R2M0  5769-PW1
     A                                      CF02(02 'MODUS')
     A                                      CF03(03 'Avslutt registrering av op-
     A                                      pdrag')
     A                                      CF04(04 'SØKING')
     A N37                                  CF05(05 'Gå til faktura')
     A N37                                  CF16(16 'Neste')
     A N37                                  CF07(07 'SPØRRING PÅ OPPDRAG')
     A N37                                  CF09(09 'PLANLEGG/PLUKK')
     A N37                                  CF10(10 'FULLOAD')
     A                                      CF12(12 'Avbryt registrering av opp-
     A                                      drag')
     A N37                                  CF11(11 'REKVISISJON')
     A                                      CF14(14 'Vise opplysning')
     A                                      CF15(15 'FRIE SØKEVEIER')
     A                                      CF24(24 'FLERE TASTER')
     A                                      CF18(18 'FRITEKSTER')
     A                                      CF20(20 'FAX diekte')
     A                                      CF21(21 'fax manuell')
     A                                      CF22(22 'Hurtigbooking')
     A  27                                  ALARM
     A                                      CSRLOC(LINNBR     POSNBR)
     A          H                           HLPDOC('SYTR100005' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(01 001 01 080)
     A          H                           HLPDOC('SYTR100005' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(02 001 02 030)
     A          H                           HLPDOC('SYTR100007' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(02 031 02 080)
     A          H                           HLPDOC('SYTR100010' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(03 001 03 080)
     A          H                           HLPDOC('SYTR100020' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(04 001 04 080)
     A          H                           HLPDOC('SYTR100030' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(05 001 05 060)
     A          H                           HLPDOC('SYTR100040' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(05 061 05 080)
     A          H                           HLPDOC('SYTR100050' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(06 001 06 009)
     A          H                           HLPDOC('SYTR100060' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(06 010 06 040)
     A          H                           HLPDOC('SYTR100070' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(06 041 06 080)
     A          H                           HLPDOC('SYTR100080' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(07 001 07 025)
     A          H                           HLPDOC('SYTR100090' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(07 026 07 044)
     A          H                           HLPDOC('SYTR100100' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(07 045 07 065)
     A          H                           HLPDOC('SYTR100110' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(07 066 07 080)
     A          H                           HLPDOC('SYTR100120' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(08 001 08 070)
     A          H                           HLPDOC('SYTR100130' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(08 071 08 080)
     A          H                           HLPDOC('SYTR100140' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(09 001 12 080)
     A          H                           HLPDOC('SYTR100150' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(13 001 15 080)
     A          H                           HLPDOC('SYTR100160' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(17 001 17 024)
     A          H                           HLPDOC('SYTR100160' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(18 001 18 024)
     A          H                           HLPDOC('SYTR100170' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(17 025 17 080)
     A          H                           HLPDOC('SYTR100170' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(18 025 18 080)
     A          H                           HLPDOC('SYTR100180' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(19 001 19 080)
     A          H                           HLPDOC('SYTR100190' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(20 001 20 080)
     A          H                           HLPDOC('SYTR100200' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(21 001 21 080)
     A          H                           HLPDOC('SYTR100210' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(22 001 22 029)
     A          H                           HLPDOC('SYTR100220' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(22 020 22 048)
     A          H                           HLPDOC('SYTR100230' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(22 049 22 080)
     A          H                           HLPDOC('SYTR100240' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(23 001 23 080)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGLN1         7A  P
     A            MSGLN2         7A  P
     A            MSGLN3         7A  P
     A            MSGLN4         7A  P
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYTR10'
     A                                      COLOR(BLU)
     A N37                              1 19MSGCON(040 DIV3755 *LIBL/SYMSGF)
     A N37                                  COLOR(WHT)
     A  37                              1 19MSGCON(040 JOV0216 *LIBL/SYMSGF)
     A  37                                  COLOR(RED)
     A N38                              1 60DATE
     A                                      EDTCDE(Y)
     A  38                              1 60MSGCON(017 DIV2400 *LIBL/SYMSGF)
     A                                      COLOR(RED)
     A N38                              1 69TIME
     A                                  2  2MSGCON(004 DIV0616 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  2  8TEXT('Avdeling')
     A N45                                  DSPATR(PR)
     A N45                                  COLOR(WHT)
     A  45                                  COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  2 13'/'
     A N45                                  COLOR(WHT)
     A  45                                  COLOR(YLW)
     A N45        WSOPD          5Y 0O  2 15TEXT('Oppdragsnummer')
     A N29                                  DSPATR(BL)
     A N29                                  COLOR(RED)
     A  29                                  COLOR(WHT)
     A                                      EDTCDE(4)
     A  45                              2 15'*NY*'
     A                                      DSPATR(BL)
     A                                      DSPATR(RI)
     A                                      COLOR(PNK)
     A                                  2 21MSGCON(003 DIV0072 *LIBL/SYMSGF)
     A            WSSG           3A  B  2 25TEXT('Signatur')
     A N45                                  COLOR(WHT)
     A  45                                  COLOR(YLW)
     A                                  2 29MSGCON(004 SHU0319 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B  2 34TEXT('Prosjektnummer')
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A                                  2 43MSGCON(005 SHU0320 *LIBL/SYMSGF)
     A            WSRUND         8Y 0B  2 49TEXT('Prosjektnummer')
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A                                  2 59MSGCON(010 JOV0170 *LIBL/SYMSGF)
     A            WSHAWB        10A  O  2 70COLOR(WHT)
     A                                  3  2MSGCON(005 SHU0316 *LIBL/SYMSGF)
     A            WSKDAK         1A  B  3  8COLOR(YLW)
     A            WSKNA          8Y 0B  3 10TEXT('Kundenr Agent')
     A                                      DSPATR(UL)
     A  70                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAA         30A  B  3 19TEXT('Navn Agent')
     A  98                                  DSPATR(BL)
     A                                      DSPATR(UL)
     A  98                                  COLOR(RED)
     A N98                                  COLOR(WHT)
     A            WSADA         30A  O  3 50DSPATR(UL)
     A                                      COLOR(WHT)
     A  91                                  DSPATR(RI)
     A                                  4  2MSGCON(005 SHU0317 *LIBL/SYMSGF)
     A  32 31                               DSPATR(ND)
     A            WSKDFF         1A  B  4  8COLOR(YLW)
     A  93                                  DSPATR(RI)
     A  32 31                               DSPATR(ND)
     A  32 31                               DSPATR(PR)
     A            WSKNSF         8Y 0B  4 10TEXT('Kundenr Selg.fakm')
     A                                      DSPATR(UL)
     A  65                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A  32 31                               DSPATR(ND)
     A  32 31                               DSPATR(PR)
     A            WSNASF        30A  B  4 19TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A  99                                  DSPATR(BL)
     A  99                                  COLOR(RED)
     A N99                                  COLOR(WHT)
     A  32 31                               DSPATR(ND)
     A  32 31                               DSPATR(PR)
     A            WSADSF        30A  O  4 50TEXT('Navn Selg.fakm')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A  92                                  DSPATR(RI)
     A  32 31                               DSPATR(ND)
     A                                  5  2MSGCON(005 SHU0318 *LIBL/SYMSGF)
     A            WSRFA         15A  B  5  8TEXT('Referanse Agent')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  59                                  DSPATR(RI)
     A                                  5 24'LS'
     A            WSSDL         20A  B  5 27TEXT('Lossested')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      CHECK(LC)
     A                                  5 50MSGCON(003 DIV0091 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSANS          1Y 0B  5 54TEXT('Avtalenr Selger')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  5 56MSGCON(002 DIV0092 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKDFS         1A  B  5 59TEXT('Fakturakode Selger')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'X' 'B' 'E')
     A                                  5 61MSGCON(003 DIV0093 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSVALS         3A  B  5 65TEXT('Valutakode Selger')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  66                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  5 69'T.'
     A  32                                  DSPATR(ND)
     A            WSVALT         3A  B  5 72TEXT('V.kode tillegg')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  76                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSVALP         3Y 1B  5 76DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A N42                              6  2'Fra'
     A  42                              6  2'Fra'
     A N42        WSSDF          5A  B  6  8TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPLANF         2A  B  6  8COLOR(YLW)
     A  42        WPSDF          5A  B  6 11TEXT('Frakt fra')
     A                                      DSPATR(UL)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSDFD         6Y 0B  6 14DSPATR(UL)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A  42        WPSDFD         6Y 0B  6 17DSPATR(UL)
     A  60                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A N42        WSSDFK         4Y 0B  6 21EDTCDE(4)
     A                                      COLOR(YLW)
     A  72                                  DSPATR(RI)
     A  42        WPSDFK         4Y 0B  6 24EDTCDE(4)
     A                                      COLOR(YLW)
     A  72                                  DSPATR(RI)
     A N42        WSLANF         2A  O  6 28COLOR(WHT)
     A  42        WPPNS1        14A  B  6 29
     A N42        WSSONF         3A  O  6 31COLOR(WHT)
     A N42        WSPNRF         5Y 0O  6 35COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  6 44MSGCON(003 SHU0321 *LIBL/SYMSGF)
     A N42        WSSDT          5A  B  6 48TEXT('Frakt til')
     A  94                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A  42        WPLANT         2A  B  6 48COLOR(YLW)
     A  42        WPSDT          5A  B  6 51TEXT('Frakt til')
     A  94                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A N42        WSSDTD         6Y 0B  6 54DSPATR(UL)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A  42        WPSDTD         6Y 0B  6 57DSPATR(UL)
     A  64                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A N42        WSSDTK         4Y 0B  6 61EDTCDE(4)
     A  73                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPSDTK         4Y 0B  6 64EDTCDE(4)
     A  73                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSLANT         2A  O  6 68COLOR(WHT)
     A  42        WPPNS2        12A  B  6 69
     A N42        WSSONT         3A  O  6 71COLOR(WHT)
     A N42        WSPNRT         5Y 0O  6 75COLOR(WHT)
     A                                      EDTCDE(4)
     A N42                              7  2'Via '
     A  32                                  DSPATR(ND)
     A  42                              7  2'Via'
     A  32                                  DSPATR(ND)
     A N42        WSSDFF         5A  B  7  8TEXT('Forfrakt fra')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPLAN1         2A  B  7  8COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  42        WPSDFF         5A  B  7 11TEXT('Via base')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  84                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSFFD         6Y 0B  7 14DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A  42        WPSFFD         6Y 0B  7 17DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  69                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A N42        WSSFFK         4Y 0B  7 21EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  74                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPSFFK         4Y 0B  7 24EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  74                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSTAF         1A  B  7 26
     A  32                                  DSPATR(ND)
     A  48                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  43                                  DSPATR(HI)
     A  32
     AO 43                                  DSPATR(PR)
     A N42        WSLAN1         2A  O  7 28COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPSTAF         1A  B  7 29
     A  32                                  DSPATR(ND)
     A  48                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  43                                  DSPATR(HI)
     A  32
     AO 43                                  DSPATR(PR)
     A N42        WSSON1         3A  O  7 31COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPPNS3        12A  B  7 31
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A N42        WSPNR1         5Y 0O  7 35COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                  7 44MSGCON(003 SHU0322 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A N42        WSSDVT         5A  B  7 48TEXT('Viderefrakt til')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPLAN2         2A  B  7 48COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  42        WPSDVT         5A  B  7 51TEXT('Via base')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  83                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSVTD         6Y 0B  7 54DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A  42        WPSVTD         6Y 0B  7 57DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  71                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A N42        WSSVTK         4Y 0B  7 61EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  75                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  42        WPSVTK         4Y 0B  7 64EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  75                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A N42        WSSTAE         1A  B  7 66
     A  32                                  DSPATR(ND)
     A  47                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  44                                  DSPATR(HI)
     A  32
     AO 44                                  DSPATR(PR)
     A N42        WSLAN2         2A  O  7 68COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPSTAE         1A  B  7 69
     A  32                                  DSPATR(ND)
     A  47                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A  44                                  DSPATR(HI)
     A  32
     AO 44                                  DSPATR(PR)
     A N42        WSSON2         3A  O  7 71COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  42        WPPNS4        10A  B  7 71
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A N42        WSPNR2         5Y 0O  7 75COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      EDTCDE(4)
     A                                  8  2MSGCON(005 DIV2299 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKNFA    R     Y  B  8  8REFFLD(HEADFR/TRKNFA *LIBL/HEADF)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  82                                  DSPATR(RI)
     A                                      DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSNAFA        30A  B  8 19COLOR(WHT)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A            WSADFX        20A  O  8 50COLOR(WHT)
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                  8 71MSGCON(007 SHU0323 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSTSTA         1A  B  8 79COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  90                                  DSPATR(RI)
     A                                  9  2MSGCON(004 DIV0090 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKNS          8Y 0B  9  8TEXT('Kundenr Selger')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  67
     AO 68                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSNAMS        30A  B  9 19TEXT('Navn Selg.fakm')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A            WSADRS        30A  O  9 50TEXT('Navn Selg.fakm')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                 10  2MSGCON(014 SHU0337 *LIBL/SYMSGF)
     A            WSNAS         30A  B 10 19TEXT('Navn Selger')
     A                                      DSPATR(UL)
     A  67                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSADS1        30A  B 10 50TEXT('Adresse-1 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSADS2        30A  B 11 19TEXT('Adresse-3 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSADS3        30A  B 11 50TEXT('Adresse-2 Selger')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 12  2MSGCON(004 DIV0096 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKNK          8Y 0B 12  8TEXT('Kundenr Kjøper')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A  62
     AO 61                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSNAMK        30A  B 12 19TEXT('Navn Kjøp.fakm')
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      DSPATR(UL)
     A N98                                  COLOR(WHT)
     A            WSADRK        30A  O 12 50TEXT('Navn Kjøp.fakm')
     A  32                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A N98                                  COLOR(WHT)
     A                                 13  2MSGCON(014 SHU0338 *LIBL/SYMSGF)
     A            WSNAK         30A  B 13 19TEXT('Navn Kjøper')
     A                                      DSPATR(UL)
     A  62                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSADK1        30A  B 13 50TEXT('Adresse-1 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSADK2        30A  B 14 19TEXT('Adresse-2 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSADK3        30A  B 14 50TEXT('Adresse-3 Kjøper')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 15  2MSGCON(077 DIV0591 *LIBL/SYMSGF)
     A                                      DSPATR(UL)
     A            WSOT           2A  B 16  2TEXT('Oppdragstype')
     A                                      DSPATR(UL)
     A  89                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFR           3A  B 16  5TEXT('Frankatur')
     A                                      DSPATR(UL)
     A  88                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSGM1         15A  B 16  9TEXT('Godsmerking-1')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSNT           7Y 0B 16 25TEXT('Antall')
     A                                      DSPATR(UL)
     A  87                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      CHECK(RB)
     A            WSVS1         25A  B 16 33TEXT('Vareslag-1')
     A                                      DSPATR(UL)
     A  86                                  DSPATR(RI)
     A                                      COLOR(YLW)
S03  A*           WSVKTK         5Y 0B 16 60TEXT('Vekt')
N03  A            WSVKT          9Y 0B 16 60TEXT('Vekt')
     A                                      DSPATR(UL)
     A  85                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A            WSLM           4Y 2B 17 66TEXT('Kubikk')
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                      DSPATR(UL)
     A            WSM3           7Y 3B 16 72EDTCDE(4)
     A                                      COLOR(YLW)
     A            WSGM2         15A  B 17  9TEXT('Godsmerking-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSVS2         25A  B 17 33TEXT('Vareslag-2')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 18  2MSGCON(006 SHU0150 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSKF           2A  B 18  9DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  40                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSKFT1         1A  B 18 12DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  39                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            WSFT1A        30A  B 18 15DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSFT1B        15A  B 18 46DSPATR(UL)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      COLOR(YLW)
     A            WSUSR         10A  O 18 62COLOR(PNK)
     A  42                             18 73MSGCON(006 YBC0489 *LIBL/SYMSGF)
     A            WSKDPL         1A  B 18 80TEXT('Planleggingskode')
     A N42                                  DSPATR(PR)
     A N42                                  DSPATR(ND)
     A  42                                  COLOR(YLW)
     A                                 19  2MSGCON(006 SHU0324 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSVERV         3A  B 19  9COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  49                                  DSPATR(RI)
     A            WSVERB        13Y 2B 19 13EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  56                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      COMP(GE ,00)
     A                                 19 28'E'
     A  32                                  DSPATR(ND)
     A            WSETTV         3A  B 19 30COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  55                                  DSPATR(RI)
     A            WSETTB        13Y 2B 19 34EDTCDE(4)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A  54                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      COMP(GE ,00)
     A                                 19 49MSGCON(005 SHU0333 *LIBL/SYMSGF)
     A            WSFRAK         1A  B 19 55
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A  53                                  DSPATR(RI)
     A            WSFRAV         3A  B 19 57
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A  52                                  DSPATR(RI)
     A            WSFRAB        13Y 2B 19 61
     A  36                                  COLOR(WHT)
     A N36                                  COLOR(YLW)
     A  36                                  DSPATR(PR)
     A  51                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COMP(GE ,00)
     A                                 19 76MSGCON(001 SHU0334 *LIBL/SYMSGF)
     A            WSMVA          1A  B 19 78COLOR(YLW)
     A  50                                  DSPATR(RI)
     A                                 20  2MSGCON(006 SHU0325 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSFA11         7A  B 20  9COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                 20 17'-'
     A  32                                  DSPATR(ND)
     A            WSFA12         4A  B 20 19COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                 20 24MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSFLP1         3Y 0B 20 29COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      EDTCDE(M)
     A                                 20 34MSGCON(006 SHU0332 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSFA21         7A  B 20 41COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A            WSFA22         4A  B 20 49COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                 20 54MSGCON(004 SHU0331 *LIBL/SYMSGF)
     A  32                                  DSPATR(ND)
     A            WSFLP2         3Y 0B 20 59COLOR(YLW)
     A  32                                  DSPATR(ND)
     A  32                                  DSPATR(PR)
     A                                      EDTCDE(M)
     A                                 20 64MSGCON(006 JOV0168 *LIBL/SYMSGF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(RED)
     A            TRAVD0    R        O 20 71REFFLD(HEADFR/TRAVD0 *LIBL/HEADF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A            TROPD0    R        O 20 76REFFLD(HEADFR/TROPD0 *LIBL/HEADF)
     A  41                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                 21  2MSGCON(006 SHU0326 *LIBL/SYMSGF)
     A  32 26                               DSPATR(ND)
     A            WSGNA          4A  B 21  9COLOR(YLW)
     A  32 26                               DSPATR(ND)
     A  32 26                               DSPATR(PR)
     A            WSGNB          5A  B 21 14COLOR(YLW)
     A  32 26                               DSPATR(ND)
     A  32 26                               DSPATR(PR)
     A            WSGNC          6A  B 21 20COLOR(YLW)
     A  32 26                               DSPATR(ND)
     A  32 26                               DSPATR(PR)
     A                                 21 27'P'
     A  32 26                               DSPATR(ND)
     A            WSPOS1         7A  B 21 29COLOR(YLW)
     A  32 26                               DSPATR(ND)
     A  32 26                               DSPATR(PR)
     A            WSPOS2         4Y 0B 21 37COLOR(YLW)
     A  32 26                               DSPATR(ND)
     A  32 26                               DSPATR(PR)
     A                                      EDTCDE(4)
     A                                 21 42MSGCON(015 JOV0167 *LIBL/SYMSGF)
     A            TRAVD1         4Y 0O 21 58COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD1         5Y 0O 21 63COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 21 69'/'
     A            TRAVD2         4Y 0O 21 71COLOR(WHT)
     A                                      EDTCDE(4)
     A            TROPD2         5Y 0O 21 76COLOR(WHT)
     A                                      EDTCDE(4)
     A                                 22  2MSGCON(006 SHU0327 *LIBL/SYMSGF)
     A            WSPK3          1A  B 22  9TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A            WSPK5          1A  B 22 11TEXT('Printerkode-3')
     A                                      DSPATR(UL)
     A  80                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A                                 22 13MSGCON(003 JOV0805 *LIBL/SYMSGF)
     A            WSPK4          1A  B 22 17TEXT('Printerkode-4 Sad imp')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A                                      COLOR(YLW)
     A            WSPK6          1A  B 22 19TEXT('Printerkode-6  Sad-exp')
     A                                      DSPATR(UL)
     A  79                                  DSPATR(RI)
     A                                      VALUES(' ' 'J' 'N' 'P')
     A                                      COLOR(YLW)
     A                                 22 21'CMR/BL'
     A            WSPK7          1A  B 22 28TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  81                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'B' 'C' 'N' 'P')
     A                                 22 30MSGCON(004 SHU0329 *LIBL/SYMSGF)
     A            WSPK1          1A  B 22 35TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  77                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A            W2TOLL         2Y 0B 22 37EDTCDE(4)
     A  58                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 22 40MSGCON(002 SHU0336 *LIBL/SYMSGF)
     A            W2KDME         1A  B 22 43TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 22 45'Ek'
     A            W2KDE          1A  B 22 48TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A                                      COLOR(YLW)
     A                                 22 50MSGCON(004 SHU0335 *LIBL/SYMSGF)
     A            WSPK2          1A  B 22 55TEXT('Printerkode-7')
     A                                      DSPATR(UL)
     A  78                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'B' 'C' 'N' 'P')
     A            WSNTVS         3Y 0B 22 57EDTCDE(4)
     A  57                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 22 66MSGCON(009 DIV0607 *LIBL/SYMSGF)
     A            WSOPDG         5Y 0O 22 76DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            MSGL1         18A  O 23  2MSGID(&MSGLN1 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL2         18A  O 23 22MSGID(&MSGLN2 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL3         18A  O 23 42MSGID(&MSGLN3 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGL4         18A  O 23 62MSGID(&MSGLN4 SYMSGF)
     A                                      COLOR(BLU)
     A            MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
AMR  A*                                     WINDOW(*DFT 17 70 *NOMSGLIN)
     A          R BILDE03
     A                                      WINDOW(*DFT 19 70 *NOMSGLIN)
     A                                      OVERLAY
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'Avslutt registrering av op-
     A                                      pdrag')
     A                                      CF12(12)
     A                                      CF04(04 'SØK')
     A                                      CF05(05 'Gå til faktura')
     A                                      CF16(16 'Neste')
     A  27                                  ALARM
     A          H                           HLPDOC('SYTR100500' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(01 001 15 070)
     A          H                           HLPDOC('SYTR100510' 'SYTR10' 'SY400-
     A                                      LO/TRANS')
     A                                      HLPARA(16 001 16 070)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR2         7A  P
     A                                  1  2'SYSPED/SYTR10'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(040 JOV0703 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  2 11MSGCON(055 JOV0699 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  4  2MSGCON(014 SHU0339 *LIBL/SYMSGF)
     A                                      DSPATR(RI)
     A            WSSDF          5A  B  4 19TEXT('Frakt fra')
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSSDFD         6Y 0B  4 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A            WSSDFK         4Y 0B  4 34EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                  4 40'------>'
     A  34                                  DSPATR(ND)
     A            WSSDFF         5A  B  4 49TEXT('Forfrakt fra')
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSSFFD         6Y 0B  4 56EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSSFFK         4Y 0B  4 64EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  34                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  42        XXPNS1        14A  O  5 19
     A  34                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A  42        XXPNS3        12A  O  5 49COLOR(WHT)
     A  34                                  DSPATR(ND)
     A                                  6  2MSGCON(045 JOV0700 *LIBL/SYMSGF)
     A  34                                  DSPATR(ND)
     A            WSAVD1         4Y 0B  6 49EDTCDE(4)
     A  91                                  DSPATR(PR)
     A  34                                  DSPATR(ND)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A            WSOTFF         2A  B  6 54
     A  91                                  DSPATR(PR)
     A  34                                  DSPATR(ND)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                  6 57'Ft:'
     A  34                                  DSPATR(ND)
     A            WSFRD1         1A  B  6 61
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                      VALUES('J' 'N' ' ')
     A            WSSTAF         1A  O  6 63DSPATR(BL)
     A  34                                  DSPATR(ND)
     A            WSOPD1         5Y 0O  6 65DSPATR(HI)
     A  34                                  DSPATR(ND)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A                                  7  2'Avvik lev.adr:'
     A  34                                  DSPATR(ND)
     A            WSLNAV        30A  B  7 17
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                  7 49'Pr.k:'
     A  34                                  DSPATR(ND)
     A            WSPKFF         1A  B  7 55
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                  7 57'Frank:'
     A  34                                  DSPATR(ND)
     A            WSFRFF         3A  B  7 64
     A  34                                  DSPATR(ND)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A                                  8  2MSGCON(045 JOV0701 *LIBL/SYMSGF)
     A  34                                  DSPATR(ND)
     A            WSFFBN        10A  B  8 49
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A            WSFFTN         8Y 0B  8 60EDTCDE(4)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A                                  9  3MSGCON(006 JOV0702 *LIBL/SYMSGF)
     A  34                                  DSPATR(ND)
     A            WSFFBL         9Y 2B  9 10EDTCDE(J)
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A                                  9 24'A/E:'
     A  34                                  DSPATR(ND)
     A            WSFFAE         1A  B  9 29
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A            WSFFTX        35A  B  9 33
     A  91                                  DSPATR(PR)
     A  91                                  COLOR(WHT)
     A N91                                  COLOR(YLW)
     A  34                                  DSPATR(ND)
     A                                 11  2MSGCON(014 SHU0340 *LIBL/SYMSGF)
     A                                      DSPATR(RI)
     A            WSSDVT         5A  B 11 19TEXT('Viderefrakt til')
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A            WSSVTD         6Y 0B 11 26DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A            WSSVTK         4Y 0B 11 34EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A                                 11 40'------>'
     A  35                                  DSPATR(ND)
     A            WSSDT          5A  B 11 49TEXT('Frakt til')
     A                                      DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A            WSSDTD         6Y 0B 11 56DSPATR(UL)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A            WSSDTK         4Y 0B 11 64EDTCDE(4)
     A                                      COLOR(WHT)
     A                                      DSPATR(PR)
     A  35                                  DSPATR(ND)
     A                                      DSPATR(UL)
     A  42        XXPNS4        10A  O 12 19COLOR(WHT)
     A  35                                  DSPATR(ND)
     A  42        XXPNS2        12A  O 12 49COLOR(WHT)
     A  35                                  DSPATR(ND)
     A                                 13  2MSGCON(045 JOV0700 *LIBL/SYMSGF)
     A  35                                  DSPATR(ND)
     A            WSAVD2         4Y 0B 13 49EDTCDE(4)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A            WSOTVT         2A  B 13 54
     A  92                                  DSPATR(PR)
     A  35                                  DSPATR(ND)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                 13 57'Ft:'
     A  35                                  DSPATR(ND)
     A            WSFRD2         1A  B 13 61
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                      VALUES('J' 'N' ' ')
     A            WSSTAE         1A  O 13 63DSPATR(BL)
     A  35                                  DSPATR(ND)
     A            WSOPD2         5Y 0O 13 65DSPATR(HI)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A  35                                  DSPATR(ND)
     A                                 14  2'Avvik hen.adr:'
     A  35                                  DSPATR(ND)
     A            WSHNAV        30A  B 14 17
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                 14 49'Pr.k:'
     A  35                                  DSPATR(ND)
     A            WSPKVT         1A  B 14 55
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                 14 57'Frank:'
     A  35                                  DSPATR(ND)
     A            WSFRVT         3A  B 14 64
     A  35                                  DSPATR(ND)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A                                 15  2MSGCON(045 JOV0701 *LIBL/SYMSGF)
     A  35                                  DSPATR(ND)
     A            WSVFBN        10A  B 15 49
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A            WSVFTN         8Y 0B 15 60EDTCDE(4)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A                                 16  3MSGCON(006 JOV0702 *LIBL/SYMSGF)
     A  35                                  DSPATR(ND)
     A            WSVFBL         9Y 2B 16 10EDTCDE(J)
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A                                 16 24'A/E:'
     A  35                                  DSPATR(ND)
     A            WSVFAE         1A  B 16 29
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A            WSVFTX        35A  B 16 33
     A  92                                  DSPATR(PR)
     A  92                                  COLOR(WHT)
     A N92                                  COLOR(YLW)
     A  35                                  DSPATR(ND)
     A                                 18  2MSGCON(015 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 18 18MSGCON(015 DIV0030 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 18 34MSGCON(015 DIV0031 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 18 53MSGCON(015 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTX2        65A  O 19  2MSGID(&MSGNR2 SYMSGF)
     A                                      COLOR(WHT)
