     A*****************************************************************
     A* UTSKRIFT AV DAGLISTE
     A*****************************************************************
     A          R PHEAD
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
SXX  A* 82                              5  1'<FONT FACE="ARIAL" S'
SXX  A* 82                              5 21'IZE="3"> <PRE>'
     A                                 07 11MSGCON(15 SHU0743 SYMSGF)
     A            FIFT          45     07 26
SXX  A* 82                             08  1'<FONT FACE="ARIAL" S'
SXX  A* 82                             08 21'IZE="2"> <PRE>'
     A            CCOMPN         8  0  09 18EDTCDE(Z)
     A                                 09 11MSGCON(7 DIV0248 SYMSGF)
     A            KNAVN         30     11 11
     A                                 11 60'Dato:'
     A            ULDD           2  0  11 70
     A                                 11 72'.'
     A            ULMM           2  0  11 73
     A                                 11 75'.'
     A            UL≈≈           4  0  11 76
     A            ADR1          30     12 11
     A            ADR2          30     13 11
     A            POSTNR         4  0  14 11
     A            ADR3          24     14 17
     A                                 18 11MSGCON(30 SHU0744 SYMSGF)
     A                                 19  2' -----------------------'
     A                                 19 26'------------------------'
     A                                 19 50'------------------------'
     A                                 19 74'------------------------'
     A                                 19 96'------------------------'
     A                                 20  2MSGCON(117 SHU0745 SYMSGF)
     A                                 21  2MSGCON(117 SHU0746 SYMSGF)
     A                                 22  2' -----------------------'
     A                                 22 26'------------------------'
     A                                 22 50'------------------------'
     A                                 22 74'------------------------'
     A                                 22 96'------------------------'
     A          R PHEADE
     A                                  1  1'.'
     A          R PDET                      SPACEB(1)
     A            HERF20        20         2
     A*           HERFA         15        23
     A            HERFA15       15        23
     A            HENAK         30        38
     A            BRUTTO         7  0     90EDTCDE(M)
     A            NETTO          7  0    100EDTCDE(M)
     A            HESG           3         2
     A                                      SPACEB(1)
     A            HEDTOP         8  0      6
     A            HENT           7  0     25EDTCDE(Z)
     A            HEVKT          9  0     35EDTCDE(Z)
     A            HEM3           7  3     45EDTCDE(4)
     A            HEFBV          9  0     55EDTCDE(Z)
     A  50                                65'*'
     A            HEADK3        30        70
     A          R PDETCS                    SPACEB(2)
     A                                    30MSGCON(80 JOV1383 SYMSGF)
     A                                      HIGHLIGHT
     A          R PTOTMI                    SPACEB(1)
     A                                     2MSGCON(30 SHU0747 SYMSGF)
     A            SUMMIX         7  0    100EDTCDE(M)
