     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R NOERAS
     A                                      ASSUME
     A                                      OVERLAY
     A                                  1  2' '
     A          R WIND01
     A                                      OVERLAY
     A                                      WINDOW(*DFT 18 72)
     A          R SUBFIL                    SFL
     A            WSTKEY        39A  H
     A            SFNR           1A  B  5  2VALUES(' ' '1' '6' '7')
     A            SFKUNR         8Y 0O  5  5EDTCDE(4)
     A            SFKNAVN       20A  O  5 14
     A            SFDATO         8Y 0O  5 35EDTWRD('  .  .    ')
     A            SFEDSN        20A  O  5 46
     A            SFANT          3Y 0O  5 67EDTCDE(4)
     A  55                                  COLOR(RED)
     A  55                                  DSPATR(RI)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0012)
     A                                      SFLPAG(0011)
     A                                      WINDOW(WIND01)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                      CF12(12 'tilbake')
     A                                      CF03(12 'tilbake')
     A                                      KEEP
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND(*MORE)
     A            ZRECNO         4S 0H      SFLRCDNBR
     A                                  1  1'SYTR33E'
     A                                      COLOR(BLU)
     A                                  1 22'E-sendinger sortert på kunde/dato'
     A                                      COLOR(WHT)
     A                                  2  2'(Basert på fri søkevei EDS/E_S til-
     A                                      delt til alle oppdrag i motatt EDI)'
     A                                  3  1'Velg og trykk Enter.'
     A                                      COLOR(BLU)
     A                                  3 24'1=Plukk'
     A                                      COLOR(BLU)
     A                                  3 32'6=Print foreløpige fraktbrev'
     A                                      COLOR(BLU)
     A                                  4  1'Alt Kunde/oppdragsgiver           -
     A                                      Dato       EDInr/Bilnr/Turref   Ant'
     A                                      COLOR(WHT)
     A                                  3 61'7=Losseliste'
     A                                      COLOR(BLU)
     A          R BUNN
     A                                      WINDOW(WIND01)
     A                                      SLNO(17)
     A                                      CLRL(01)
     A                                      OVERLAY
     A                                  1  2'F12=Avbryt'
     A                                      COLOR(BLU)
