     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP(CA01)
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 18 40 *NOMSGLIN)
     A                                      OVERLAY
     A          R SUBFIL                    SFL
     A            BOSTAT         1A  O  3  2COLOR(RED)
     A            BOTUR          8Y 0O  3  4
     A                                      COLOR(WHT)
     A            BOUSER        10A  O  3 13
     A            BODATE         8Y 0O  3 24EDTCDE(4)
     A            BOTIME         6Y 0O  3 33EDTCDE(4)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      SFLSIZ(0016)
     A                                      SFLPAG(0015)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A                                      CA03(03 'Forrige')
     A                                      CA02(02 'MODE')
     A                                      CA05(05 'Frisk')
     A                                      CA12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            ZRECNO         4S 0O  1 25SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYTR88U'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(15 SHU0674 SYMSGF)
     A                                      DSPATR(HI)
n01  A                                  1 26'Mo:'
n01  A            MODETXT       10      1 30DSPATR(HI)
     A                                  2  2MSGCON(37 SHU0676 SYMSGF)
     A                                      COLOR(WHT)
     A          R BUNN
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(18)
     A                                      CLRL(01)
     A                                      OVERLAY
     A N30                              1  2MSGCON(37 SHU0675 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        38A  O  1  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R NYVARE
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      CA03(03 'Forrige')
     A                                      CA02(02 'MODE')
     A                                      CA05(05 'Frisk')
     A                                      CA12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYTR88U'
     A                                      COLOR(BLU)
     A                                  1 10MSGCON(15 SHU0674 SYMSGF)
     A                                      DSPATR(HI)
n01  A                                  1 26'Mo:'
n01  A            MODETXT       10      1 30DSPATR(HI)
     A                                  2  2MSGCON(30 SHU0676 SYMSGF)
     A                                      COLOR(WHT)
     A N30                             18  2MSGCON(37 SHU0675 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        38A  O 18  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
