     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R SUBFIL                    SFL
     A            WSNR           1A  B  6  3VALUES(' ' '2' '4')
     A            AGAVD          4  0O  6  5TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            AGTRNR         8  0O  6 10TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            VMNAV1        15   O  6 19TEXT('NAVN')
     A                                      COLOR(WHT)
     A            AGTRKU         8  0O  6 35TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            AGTRLE         8Y 0O  6 44TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            AGPNRT         5   O  6 53
     A            AGDFTR         8Y 0O  6 60EDTCDE(4)
     A            VMNAV2        12   O  6 69COLOR(WHT)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SYTR04D'
     A                                      COLOR(BLU)
     A                                  1 19'Vedlikeh. AVD/Agent, samt std hove-
     A                                      dtransportør.  '
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 19'Avd 9999=Omex, 9998=tilfeldig avvi-
     A                                      kende <agent>  '
     A                                  2 70TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  3 75SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  4  2MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2'Op  Avd Agent(Tr.nr) Navn        K-
     A                                      undenr  Lever.nr Term.  Std Hoved-t-
     A                                      ransp.    '
     A                                      COLOR(WHT)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98                              4  2MSGCON(078 DIV0012 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N98                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VARELI
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'SØK')
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'    Avd Agent(Tr.nr) Navn        K-
     A                                      undenr  Lever.nr Term.  Std Hoved-t-
     A                                      ransp. rm.'
     A                                      COLOR(WHT)
     A            WSAVD          4Y 0B  2  5TEXT('KUNDE')
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A  89                                  DSPATR(RI)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSTRNR         8Y 0B  2 10TEXT('KUNDE')
     A  90                                  DSPATR(RI)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A            VMNAV1        15A  O  2 19TEXT('NAVN')
     A                                      COLOR(WHT)
     A            WSTRKU         8Y 0B  2 35TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A            WSTRLE         8Y 0B  2 44TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      DSPATR(PR)
     A                                      COLOR(WHT)
     A            WSPNRT         5A  B  2 53
     A            WSDFTR         8Y 0B  2 60TEXT('KUNDE')
     A                                      EDTCDE(4)
     A  87                                  DSPATR(RI)
     A            VMNAV2        12A  O  2 69COLOR(WHT)
     A                                  3  4'F4=Søk'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  1  2'    Avd Agent(Tr.nr) Navn        K-
     A                                      undenr  Lever.nr Term.  Std Hoved-t-
     A                                      ransp. rm.'
     A                                      COLOR(WHT)
     A            AGAVD          4Y 0O  2  5TEXT('KUNDE')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            AGTRNR         8Y 0O  2 10TEXT('KUNDE')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            VMNAV1        15A  O  2 19TEXT('NAVN')
     A                                      COLOR(WHT)
     A            AGTRKU         8Y 0O  2 35TEXT('KUNDE')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            AGTRLE         8Y 0O  2 44TEXT('KUNDE')
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            AGPNRT         5A  O  2 53COLOR(WHT)
     A                                  3 21'Tast Enter for å slette eller F12 -
     A                                      for å avbryte'
     A                                      COLOR(WHT)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R NYWRK
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                  1  2'SYSPED/SYTR04D'
     A                                      COLOR(BLU)
     A                                  1 19'Vedlikeh. AVD/Agent, samt std hove-
     A                                      dtransportør.  '
     A                                      COLOR(WHT)
     A                                  1 70DATE
     A                                      EDTCDE(Y)
     A                                  2 19'Avd 9999=Omex, 9998=tilfeldig avvi-
     A                                      kende <agent>'
     A                                  2 70TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2'Op  Avd Agent(Tr.nr) Navn        K-
     A                                      undenr  Lever.nr Term.  Std Hoved-t-
     A                                      ransp.    '
     A                                      COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 24 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
