     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R SUBFIL                    SFL
     A            WSNR           1A  B  6  2VALUES(' ' '2' '4')
     A            WSFIRM    R        H      REFFLD(TRAAR/TRFIRM *LIBL/TRAA)
     A            TRFERR    R        O  6  4REFFLD(TRAAR/TRFERR *LIBL/TRAA)
     A                                      EDTCDE(4)
     A            WSNAM2        30A  B  6 15
     A            TRFROM    R        O  6 50REFFLD(TRAAR/TRFROM *LIBL/TRAA)
     A            TRTO      R        O  6 56REFFLD(TRAAR/TRTO *LIBL/TRAA)
     A            TRPRO     R        O  6 73REFFLD(TRAAR/TRPRO *LIBL/TRAA)
     A                                      EDTCDE(J)
     A            TRDATE    R        H      REFFLD(TRAAR/TRDATE *LIBL/TRAA)
     A            WRDATE         6Y 0O  6 63EDTCDE(Y)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0015)
     A                                      SFLPAG(0014)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A            ZRECNO         4S 0O  2 76SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  1  2'SYSPED/SYTR03'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 DIV3301 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A            WSFIRM    R        O  2  2REFFLD(TRAAR/TRFIRM *LIBL/TRAA)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSNAVN        30A  O  2 11COLOR(WHT)
     A                                  2 67TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(078 DIV3302 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF12(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 62MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98                              4  2MSGCON(078 DIV0012 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A          R VARELI
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      CF04(04 'Søk')
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2MSGCON(078 DIV3302 *LIBL/SYMSGF)
     A            WSFERR    R        B  2  2REFFLD(TRAAR/TRFERR *LIBL/TRAA)
     A                                      EDTCDE(4)
     A  40                                  DSPATR(HI)
     A  72                                  DSPATR(RI)
     A  40                                  DSPATR(PR)
     A            WSNAM2        30A  O  2 13
     A  40                                  DSPATR(HI)
     A            WSFROM    R        B  2 50REFFLD(TRAAR/TRFROM *LIBL/TRAA)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A  70                                  DSPATR(RI)
     A            WSTO      R        B  2 56REFFLD(TRAAR/TRTO *LIBL/TRAA)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A  71                                  DSPATR(RI)
     A            WSDATE         6Y 0B  2 63
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A            WSPRO     R        B  2 73REFFLD(TRAAR/TRPRO *LIBL/TRAA)
     A                                      EDTCDE(J)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A          R VAREL2
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            W2FERR    R        B  2  2REFFLD(TRAAR/TRFERR *LIBL/TRAA)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            W2FROM    R        B  2 50REFFLD(TRAAR/TRFROM *LIBL/TRAA)
     A                                      COLOR(WHT)
     A            W2TO      R        B  2 56REFFLD(TRAAR/TRTO *LIBL/TRAA)
     A                                      COLOR(WHT)
     A            W2DATE         6Y 0B  2 63COLOR(WHT)
     A                                      EDTCDE(4)
     A            W2PRO     R        B  2 73REFFLD(TRAAR/TRPRO *LIBL/TRAA)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R VAREL3
     A                                      CF12(12 'Forrige')
     A                                      CF03(12)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  1  2MSGCON(078 DIV3302 *LIBL/SYMSGF)
     A            TRFERR    R        O  2  2REFFLD(TRAAR/TRFERR *LIBL/TRAA)
     A                                      COLOR(WHT)
     A            WSNAM2        30A  O  2 13COLOR(WHT)
     A            TRFROM    R        O  2 50REFFLD(TRAAR/TRFROM *LIBL/TRAA)
     A                                      COLOR(WHT)
     A            TRTO      R        O  2 56REFFLD(TRAAR/TRTO *LIBL/TRAA)
     A                                      COLOR(WHT)
     A            TRDATE    R        H      REFFLD(TRAAR/TRDATE *LIBL/TRAA)
     A            WRDATE         6Y 0O  2 63EDTCDE(Y)
     A                                      COLOR(WHT)
     A            TRPRO     R        O  2 73REFFLD(TRAAR/TRPRO *LIBL/TRAA)
     A                                      EDTCDE(J)
     A                                      COLOR(WHT)
     A                                  3  2MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R NYWRK
     A                                      CF03(03 'EXIT')
     A                                      CF12(03)
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      CF08(08 'SØK')
     A                                  1  2'SYSPED/SYTR03'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 DIV3301 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A            WSFIRM    R        O  2  2REFFLD(TRAAR/TRFIRM *LIBL/TRAA)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSNAVN        30A  O  2 11COLOR(WHT)
     A                                  2 67TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  5  2MSGCON(078 DIV3302 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 62MSGCON(018 DIV0023 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A          R BILDE1
     A                                      CF03(03 'EXIT')
     A                                      CF12(03)
     A                                      CF04(04 'SEARCH')
     A                                  1  2'SYSPED/SYTR03'
     A                                      COLOR(BLU)
     A                                  1 19MSGCON(045 DIV3301 *LIBL/SYMSGF)
     A                                      DSPATR(HI)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                  2 67TIME
     A                                  4  1MSGCON(018 DIV3303 *LIBL/SYMSGF)
     A            WSFIRM    R        B  4 20REFFLD(TRAAR/TRFIRM *LIBL/TRAA)
     A                                      COLOR(WHT)
     A                                      EDTCDE(4)
     A            WSNAVN        30A  O  4 32COLOR(WHT)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  44        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
