     A*%%TS  SD  20151105  102501  JOVO        REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      PRINT
     A                                      HELP
     A                                      ALTHELP
     A          R SUBFIL                    SFL
     A*%%TS  SD  20151105  100110  JOVO        REL-V7R1M0  5770-WDS
     A            WSNR           1A  B  6  4VALUES(' ' '2' '4')
     A            CTKUNR         8Y 0O  6  6TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            KNA14         14A  O  6 15TEXT('NAVN')
     A            CTKOMS    R        O  6 30REFFLD(CUTRANR/CTKOMS *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKVA    R        O  6 37REFFLD(CUTRANR/CTIKVA *LIBL/CUTRAN)
     A            CTAVVA    R        O  6 39REFFLD(CUTRANR/CTAVVA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKFA    R        O  6 45REFFLD(CUTRANR/CTIKFA *LIBL/CUTRAN)
     A            CTAVFA    R        O  6 47REFFLD(CUTRANR/CTAVFA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKLG    R        O  6 53REFFLD(CUTRANR/CTIKLG *LIBL/CUTRAN)
     A            CTAVLP    R        O  6 55REFFLD(CUTRANR/CTAVLP *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKAD    R        O  6 61REFFLD(CUTRANR/CTIKAD *LIBL/CUTRAN)
     A            CTAVAD    R        O  6 63REFFLD(CUTRANR/CTAVAD *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKSK    R        O  6 68REFFLD(CUTRANR/CTIKSK *LIBL/CUTRAN)
     A            CTAVSK    R        O  6 70REFFLD(CUTRANR/CTAVSK *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKFM    R        O  6 78REFFLD(CUTRANR/CTIKFM *LIBL/CUTRAN)
     A            CTAVFM    R        O  6 80REFFLD(CUTRANR/CTAVFM *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIFMF    R        O  6 87REFFLD(CUTRANR/CTIFMF *LIBL/CUTRAN)
     A            CTAFMF    R        O  6 89REFFLD(CUTRANR/CTAFMF *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKFG    R        O  6 96REFFLD(CUTRANR/CTIKFG *LIBL/CUTRAN)
     A            CTAVFG    R        O  6 98REFFLD(CUTRANR/CTAVFG *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKHU    R        O  6107REFFLD(CUTRANR/CTIKHU *LIBL/CUTRAN)
     A            CTAVHU    R        O  6109REFFLD(CUTRANR/CTAVHU *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTIKHI    R        O  6116REFFLD(CUTRANR/CTIKHI *LIBL/CUTRAN)
     A            CTAVHI    R        O  6118REFFLD(CUTRANR/CTAVHI *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            CTFSRA    R        O  6126REFFLD(CUTRANR/CTFSRA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A*%%TS  SD  20151105  100110  JOVO        REL-V7R1M0  5770-WDS
     A                                      SFLSIZ(0018)
     A                                      SFLPAG(0017)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A                                  1  2'SYSPED/SYTR04F'
     A                                      COLOR(BLU)
     A                                  1 16DATE
     A                                      EDTCDE(Y)
     A                                  1 30'Vedl. Kunders avvik diverse param.-
     A                                       innland       '
     A                                      COLOR(WHT)
     A                                  2116TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  3 75SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  4  2MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 43'X = SKAL IKKE BELASTES...'
     A                                      COLOR(WHT)
     A                                  5  2' Op Kunde.nr Navn       Komm.sats -
     A                                       Varme   Farlig  Lengde  Advis  Lab-
     A                                      el    MiFrakt  MFrFjern  F.geb     -
     A                                      HenG.Ut In/RetGeb FlStrRab'
     A                                      COLOR(WHT)
     A          R BUNN
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      SLNO(21)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  3  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  3 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  98                              4  2MSGCON(078 DIV0012 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A N98                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VARELI
     A*%%TS  SD  20151105  100110  JOVO        REL-V7R1M0  5770-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      CF04(04 'SØK')
     A                                      CF12(12 'Forrige')
     A                                      SLNO(24)
     A                                      CLRL(04)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'    Kunde.nr Navn       Komm.sats -
     A                                       Varme   Farlig  Lengde  Advis  Lab-
     A                                      el    MiFrakt  MFrFjern  F.geb     -
     A                                      HenG.Ut In/RetGeb FlStrRab'
     A                                      COLOR(WHT)
     A            WSKUNR         8Y 0B  2  6TEXT('KUNDENR')
     A  90N40                               DSPATR(RI)
     A  40                                  DSPATR(HI)
     A  40                                  DSPATR(PR)
     A                                      EDTCDE(4)
     A            KNA14         14A  O  2 15TEXT('NAVN')
     A            WSKOMS    R        B  2 30REFFLD(CUTRANR/CTKOMS *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKVA    R        B  2 37REFFLD(CUTRANR/CTIKVA *LIBL/CUTRAN)
     A            WSAVVA    R        B  2 39REFFLD(CUTRANR/CTAVVA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKFA    R        B  2 45REFFLD(CUTRANR/CTIKFA *LIBL/CUTRAN)
     A            WSAVFA    R        B  2 47REFFLD(CUTRANR/CTAVFA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKLG    R        B  2 53REFFLD(CUTRANR/CTIKLG *LIBL/CUTRAN)
     A            WSAVLP    R        B  2 55REFFLD(CUTRANR/CTAVLP *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKAD    R        B  2 61REFFLD(CUTRANR/CTIKAD *LIBL/CUTRAN)
     A            WSAVAD    R        B  2 63REFFLD(CUTRANR/CTAVAD *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKSK    R        B  2 68REFFLD(CUTRANR/CTIKSK *LIBL/CUTRAN)
     A            WSAVSK    R        B  2 70REFFLD(CUTRANR/CTAVSK *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKFM    R        B  2 78REFFLD(CUTRANR/CTIKFM *LIBL/CUTRAN)
     A            WSAVFM    R        B  2 80REFFLD(CUTRANR/CTAVFM *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIFMF    R        B  2 87REFFLD(CUTRANR/CTIFMF *LIBL/CUTRAN)
     A            WSAFMF    R        B  2 89REFFLD(CUTRANR/CTAFMF *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKFG    R        B  2 96REFFLD(CUTRANR/CTIKFG *LIBL/CUTRAN)
     A  87                                  DSPATR(HI)
     A            WSAVFG    R        B  2 98REFFLD(CUTRANR/CTAVFG *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKHU    R        B  2107REFFLD(CUTRANR/CTIKHU *LIBL/CUTRAN)
     A            WSAVHU    R        B  2109REFFLD(CUTRANR/CTAVHU *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSIKHI    R        B  2116REFFLD(CUTRANR/CTIKHI *LIBL/CUTRAN)
     A            WSAVHI    R        B  2118REFFLD(CUTRANR/CTAVHI *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A            WSFSRA    R        B  2126REFFLD(CUTRANR/CTFSRA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A N40                              3  4'F4=Søk'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  4  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                              4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R VAREL3
     A*%%TS  SD  20151105  102501  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF12(12 'Forrige')
     A                                      SLNO(24)
     A                                      CLRL(04)
     A                                      OVERLAY
     A                                  1  2'    Kunde.nr Navn       Komm.sats -
     A                                       Varme   Farlig  Lengde  Advis  Lab-
     A                                      el    MiFrakt  MFrFjern  F.geb     -
     A                                      HenG.Ut In/RetGeb FlStrRab'
     A                                      COLOR(WHT)
     A            CTKUNR         8Y 0O  2  6TEXT('KUNDE')
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            KNA14         14A  O  2 15TEXT('NAVN')
     A                                      COLOR(WHT)
     A            WSKOMS    R        O  2 30REFFLD(CUTRANR/CTKOMS *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKVA    R        O  2 37REFFLD(CUTRANR/CTIKVA *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVVA    R        O  2 39REFFLD(CUTRANR/CTAVVA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKFA    R        O  2 45REFFLD(CUTRANR/CTIKFA *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVFA    R        O  2 47REFFLD(CUTRANR/CTAVFA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKLG    R        O  2 53REFFLD(CUTRANR/CTIKLG *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVLP    R        O  2 55REFFLD(CUTRANR/CTAVLP *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKAD    R        O  2 61REFFLD(CUTRANR/CTIKAD *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVAD    R        O  2 63REFFLD(CUTRANR/CTAVAD *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKSK    R        O  2 68REFFLD(CUTRANR/CTIKSK *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVSK    R        O  2 70REFFLD(CUTRANR/CTAVSK *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKFM    R        O  2 78REFFLD(CUTRANR/CTIKFM *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVFM    R        O  2 80REFFLD(CUTRANR/CTAVFM *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIFMF    R        O  2 87REFFLD(CUTRANR/CTIFMF *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAFMF    R        O  2 89REFFLD(CUTRANR/CTAFMF *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKFG    R        O  2 96REFFLD(CUTRANR/CTIKFG *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVFG    R        O  2 98REFFLD(CUTRANR/CTAVFG *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKHU    R        O  2107REFFLD(CUTRANR/CTIKHU *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVHU    R        O  2109REFFLD(CUTRANR/CTAVHU *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSIKHI    R        O  2116REFFLD(CUTRANR/CTIKHI *LIBL/CUTRAN)
     A                                      COLOR(WHT)
     A            WSAVHI    R        O  2118REFFLD(CUTRANR/CTAVHI *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A            WSFSRA    R        O  2126REFFLD(CUTRANR/CTFSRA *LIBL/CUTRAN)
     A                                      EDTCDE(4)
     A                                      COLOR(WHT)
     A                                  3 21'Tast Enter for å slette eller F12 -
     A                                      for å avbryte'
     A                                      COLOR(WHT)
     A                                  4 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
     A          R NYWRK
     A*%%TS  SD  20151105  102501  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF03(03 'EXIT')
     A                                      CF05(05 'Frisk')
     A                                      CF06(06 'LAGE NY')
     A                                  1  2'SYSPED/SYTR04F'
     A                                      COLOR(BLU)
     A                                  1 30'Vedl. Kunders avvik diverse param.-
     A                                       innland       '
     A                                      COLOR(WHT)
     A                                  1106DATE
     A                                      EDTCDE(Y)
     A                                  2116TIME
     A                                  3  2MSGCON(030 DIV0016 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4  2MSGCON(030 DIV0017 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  4 43'X = SKAL IKKE BELASTES...'
     A                                      COLOR(WHT)
     A                                  5  2' Op Kunde.nr Navn       Komm.sats -
     A                                       Varme   Farlig  Lengde  Advis  Lab-
     A                                      el    MiFrakt  MFrFjern  F.geb     -
     A                                      HenG.Ut In/RetGeb FlStrRab'
     A                                      COLOR(WHT)
     A                                 26  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 22MSGCON(018 DIV0021 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 26 42MSGCON(018 DIV0022 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 27 40'(C) COPYRIGHT  SYSTEMA A/S  1990  '
     A                                      COLOR(WHT)
