*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10261 * 03 YBC PTF10 VEKT/KUBIKK/KOLLI I TURER ER ENDRET TIL 9.0, 7.3 OG 7.0
*****A**************************************************************
     A*****************************************************************
     A*   ANDRES BENYTTELSE AV EGNE SEMITRAILERE                      *
     A* ANTALL LINJE=48,  ANTALL TEGN PR. LINJE=132, OVERFLOW=48      *
     A*****************************************************************
     A          R HEADP                     SKIPB(1)
     A            HOHT1         80A        1
     A                                      SPACEB(1)
     A            HOHT2         80A        1
     A                                      SPACEB(1)
     A            HOHT3         80A        1
     A                                      SPACEB(1)
     A            HOHT4         80A        1
     A                                      SPACEB(1)
     A            HOHT5         80A        1
     A                                      SPACEB(1)
     A            HOHT6         80A        1
     A                                      SPACEB(1)
     A            HOHT7         80A        1
     A                                      SPACEB(1)
     A                                     1MSGCON(80  PTR0032 SYMSGF)
     A                                      SPACEB(2)
     A                                    89MSGCON(5  DIV0062 SYMSGF)
     A            UDATO          6S 0     95EDTCDE(Y)
     A                                    90'PERIODE'
     A                                      SPACEB(1)
     A                                   100'FRA:'
     A            UFRA           4S 0    105
     A                                   110'TIL:'
     A            UTIL           4S 0    115
     A                                     1MSGCON(24 DIV5010 SYMSGF)
     A                                      SPACEB(1)
     A            VMTRAN         8S 0     26EDTCDE(Z)
     A            VMNAVN        30A       35
S04  A*                                   71MSGCON(24 DIV5012 SYMSGF)
N04  A                                    67MSGCON(13 SHU1398 SYMSGF)
S04  A*           TUBILN        10A       96
N04  A            TUBILN        10A       81
N04  A                                    91'/'
N04  A            TUHENG        10A       92
     A                                   112'BILK:'
     A                                     1MSGCON(132 PTR0033 SYMSGF)
     A                                      SPACEB(2)
     A                                     1MSGCON(132 PRI9999 SYMSGF)
     A          R HEAD0                     SKIPB(2)
     A                                     1MSGCON(80  PTR0032 SYMSGF)
     A                                      SPACEB(1)
     A                                    69MSGCON(5  DIV0062 SYMSGF)
     A            UDATO          6S 0     75EDTCDE(Y)
     A                                    90'PERIODE->'
     A                                   100'FRA:'
     A            UFRA           4S 0    105
     A                                   110'TIL:'
     A            UTIL           4S 0    115
     A                                     1MSGCON(24 DIV5010 SYMSGF)
     A                                      SPACEB(2)
     A            VMTRAN         8S 0     26EDTCDE(Z)
     A            VMNAVN        30A       35
S04  A*                                   71MSGCON(24 DIV5012 SYMSGF)
N04  A                                    67MSGCON(13 SHU1398 SYMSGF)
S04  A*           TUBILN        10A       96
N04  A            TUBILN        10A       81
N04  A                                    91'/'
N04  A            TUHENG        10A       92
     A                                     1MSGCON(132 PTR0033 SYMSGF)
     A                                      SPACEB(2)
     A                                     1MSGCON(132 PRI9999 SYMSGF)
     A          R DET                       SPACEB(2)
     A            TULKFR         2         1
     A                                     3'-'
     A            TUSTF6         6A        4
     A            FRADAT         6S 0     11EDTCDE(Z)
     A            TULKTI         2        18
     A                                    20'-'
     A            TUSTT6         6A       21
     A            TILDAT         6S 0     28EDTCDE(Z)
     A            TUAVD          4S 0     38EDTCDE(Z)
     A            TUPRO          8S 0     43EDTCDE(Z)
     A            TURUND         8S 0     52EDTCDE(Z)
S03  A*           TUTVKT         5S 0     63EDTCDE(Z)
S03  A*           TOTFVK         7S 0     69EDTCDE(Z)
S03  A*           XXANT          3S 0     77EDTCDE(Z)
S03  A*           BRUTTO         7S 0     81EDTCDE(Z)
S03  A*           PROVIS         7S 0     89EDTCDE(Z)
S03  A*           INNUT          7S 0     98EDTCDE(L)
S03  A*           REKV           7S 0    106EDTCDE(L)
S03  A*           AVR            7S 0    114EDTCDE(Z)
S03  A* 55                               122'A'
S03  A*           BILAG          6S 0    124EDTCDE(Z)
N03  A            TUTVKT         9S 0     61EDTCDE(Z)
N03  A            TOTFVK         7S 0     71EDTCDE(Z)
N03  A            XXANT          3S 0     79EDTCDE(Z)
N03  A            BRUTTO         7S 0     83EDTCDE(Z)
N03  A            PROVIS         7S 0     91EDTCDE(Z)
N03  A            INNUT          7S 0     99EDTCDE(L)
N03  A            REKV           7S 0    107EDTCDE(L)
N03  A            AVR            7S 0    115EDTCDE(Z)
N03  A  55                               123'A'
N03  A            BILAG          6S 0    125EDTCDE(Z)
N01  A          R REKVHEAD                  SPACEB(2)
N01  A                                     3'* KJØRT PÅ REKVISISJON *'
     A          R DETHE                     SPACEB(1)
     A            HELKA          2A        1
     A                                     3'-'
     A            HESDF          5A        4
     A            WFRA           7A       10
     A            HETRI          2A       18
     A                                    20'-'
     A            HESDT          5A       21
     A            WTIL           7A       27
     A            HEAVD          4S 0     35EDTCDE(Z)
     A                                    39'/'
     A            HEOPD          7S 0     40EDTCDE(Z)
     A            HHEKNS         5S 0     46EDTCDE(Z)
     A            HHENAS        17A       52
     A            HHEFBV         7S 0     69EDTCDE(Z)
     A            HHENT          3S 0     77EDTCDE(Z)
     A            HEA            7S 0     81EDTCDE(Z)
     A            HEB            7S 0     89EDTCDE(Z)
     A            HEC            7S 0     98EDTCDE(L)
     A            HED            7S 0    106EDTCDE(L)
     A            HEE            7S 0    114EDTCDE(Z)
N01  A          R DETREKV                   SPACEB(1)
N01  A            BUTXT         35A        1
N01  A            BUTUNR         8S 0     43EDTCDE(Z)
N01  A                                    55'Rekv.nr:'
N01  A            BUBNR          7S 0     65EDTCDE(Z)
N01  A            HEE            7S 0    114EDTCDE(Z)
N02  A          R BRUREKP                   SPACEB(1)
N02  A                                   100'Sum rekv:'
N02  A            BRUREK         9S 0    112EDTCDE(Z)
N02  A                                   125'*'
     A          R BILTOT                    SPACEB(2)
     A                                     1MSGCON(30 JOV0245 SYMSGF)
     A            FBILN         10A       34
     A            ANTTUR         3S 0     48EDTCDE(Z)
     A            BILVKB         7S 0     61EDTCDE(Z)
     A            BILVKF         7S 0     69EDTCDE(Z)
     A            BILANT         3S 0     77EDTCDE(Z)
     A            BILBRT         7S 0     81EDTCDE(Z)
     A            BILPRO         7S 0     89EDTCDE(Z)
     A            BILIU          7S 0     98EDTCDE(L)
     A            BILREK         7S 0    106EDTCDE(L)
     A            BILAVR         7S 0    114EDTCDE(Z)
