     A*%%TS  SD  20141010  124147  SVEIN       REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE01
     A*%%TS  SD  20141010  124147  SVEIN       REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt program')
     A                                      CF04(04 'SØKING')
     A                                      CF12(12 'FOREGÅENDE')
     A                                      CF23(23 'SKRIV ALLE')
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/SYTR52A'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(045 DIV2365 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 67DATE
     A                                      EDTCDE(Y)
     A                                  2 67TIME
     A                                  5  2MSGCON(024 DIV1497 *LIBL/SYMSGF)
     A            WSVAVD         4Y 0B  5 28DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(RI)
     A N50                                  DSPATR(PR)
     A  50                                  DSPATR(PC)
     A                                  7  2MSGCON(024 DIV1498 *LIBL/SYMSGF)
     A            WSSFSI         3A  B  7 28DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A N50                                  DSPATR(PR)
     A                                 10  2MSGCON(024 DIV2358 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSTNR     R        B 10 28REFFLD(TURERR/TUKNT *LIBL/TURER)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A N50N30
     AON50 30 70                            DSPATR(PC)
     A  70                                  DSPATR(RI)
     A                                      CHECK(FE)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A                                 10 39MSGCON(020 DIV2352 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A                                 11  2MSGCON(024 DIV2265 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSPERM         2Y 0B 11 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A N50 30 71                            DSPATR(PC)
     A  71                                  DSPATR(RI)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A            WSPERÅ         2Y 0B 11 31
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                      CHECK(RB)
     A                                      EDTCDE(4)
     A  71                                  DSPATR(RI)
     A                                 15  2MSGCON(024 DIV2800 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSTYPE         1A  B 15 28VALUES(' ' 'T' 'K' 'C')
     A  50                                  DSPATR(ND)
     A  50                                  DSPATR(PR)
     A                                 15 39MSGCON(020 DIV2801 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A                                 16  2MSGCON(024 DIV4058 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSPRT         10A  B 16 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                 17  2MSGCON(024 DIV4059 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSFORM        10A  B 17 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                 18  2MSGCON(024 DIV4060 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSJOBQ         1A  B 18 28
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50                             23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A N50                             23 43MSGCON(018 DIV0024 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
     A                                 10 60MSGCON(020 SHU1030 *LIBL/SYMSGF)
     A                                 12  2MSGCON(024 SHU1474 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
     A            WSVAL          3   B 12 28
     A N50 30 72                            DSPATR(PC)
     A  72                                  DSPATR(RI)
     A  50                                  DSPATR(PR)
     A  50                                  DSPATR(ND)
     A                                 12 33MSGCON(040 SHU1475 *LIBL/SYMSGF)
     A  50                                  DSPATR(ND)
