     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt')
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYTRTU'
     A                                      COLOR(BLU)
     A                                  1 17MSGCON(040 SHU0582 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 69DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 69TIME
     A                                      COLOR(BLU)
     A                                  7  2MSGCON(024 DIV1497 *LIBL/SYMSGF)
     A            WSAVD          4Y 0B  7 28DSPATR(UL)
     A                                      EDTCDE(4)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                  9  2MSGCON(024 DIV1498 *LIBL/SYMSGF)
     A            WSSG           3A  B  9 28DSPATR(UL)
     A  98                                  DSPATR(RI)
     A  98                                  DSPATR(PC)
     A                                 11  2MSGCON(024 DIV4057 *LIBL/SYMSGF)
     A            WSPRO          8Y 0B 11 28EDTCDE(4)
     A                                      DSPATR(PC)
     A  97                                  DSPATR(RI)
     A                                 13  2MSGCON(024 DIV4093 *LIBL/SYMSGF)
     A            WSTY           1A  B 13 28
     A  96                                  DSPATR(RI)
     A  96                                  DSPATR(PC)
     A                                      VALUES(' ' 'I' 'E' 'B')
     A                                 13 32MSGCON(045 JOV0664 *LIBL/SYMSGF)
     A                                 15  2MSGCON(024 SHU0583 *LIBL/SYMSGF)
     A            WSKON          1A  B 15 28VALUES(' ' 'J' 'N')
     A                                 15 32'(J/N)'
     A                                 17  2MSGCON(024 SHU0584 *LIBL/SYMSGF)
     A            WSGOD          1A  B 17 28VALUES('J' 'N' ' ')
     A                                 17 32'(J/N)'
     A                                 19  2MSGCON(024 SHU0585 *LIBL/SYMSGF)
     A            WSLAS          1A  B 19 28VALUES('J' 'N' ' ')
     A                                 19 32'(J/N)'
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
