     A          R SYTT03WR
     A            S3AVD          4S 0       TEXT('AVDELING')
     A            S3OPD          7S 0       TEXT('OPPDRAG')
     A            S3LKF          2A         TEXT('FRA LAND')
     A            S3SDF          5A         TEXT('FRA STED')
     A            S3LKT          2A         TEXT('TIL LAND')
     A            S3SDT          5A         TEXT('TIL STED')
     A            S3ATAD         8S 0       TEXT('AKT. ANKOMST DATO')
     A            S3ATAK         4S 0       TEXT('AKT. ANKOMST TID')
     A            S3ATDD         8S 0       TEXT('AKT. AVREISE DATO')
     A            S3ATDK         4S 0       TEXT('AKT. AVREISE TID')
     A            S3ETAD         8S 0       TEXT('EST. ANKOMST DATO')
     A            S3ETAK         4S 0       TEXT('EST. ANKOMST TID')
     A            S3ETDD         8S 0       TEXT('EST. AVREISE DATO')
     A            S3ETDK         4S 0       TEXT('EST. AVREISE TID')
     A            S3EX1D         8S 0       TEXT('EXTRA DATO 1')
     A            S3EX1K         4S 0       TEXT('EXTRA TID 1')
     A            S3EX2D         8S 0       TEXT('EXTRA DATO 2')
     A            S3EX2K         4S 0       TEXT('EXTRA TID 2')
     A          K S3LKF
     A          K S3SDF
     A          K S3LKT
     A          K S3SDT
     A          K S3AVD
     A          K S3OPD
