      *****************************************************************
      *             F R A K T A V T A L E R   (S J Ø)                 *
      * ANTALL LINJE=72,  ANTALL TEGN PR. LINJE=80,  OVERFLOW=72      *
      *****************************************************************
      *
      *** KOMPRIMERT LISTE (FRA MANGE STEDER TIL ETT STED)
     A          R IMHEAD
     A  27                              2  2MSGCON(30 DIV0749 SYMSGF)
     A
     A N27                              2  2MSGCON(30 DIV2431 SYMSGF)
     A                                  2 41MSGCON(15 DIV0754 SYMSGF)
     A                                  2 58DATE EDTCDE(Y)
     A                                  2 70MSGCON(6 DIV3588 SYMSGF)
     A            XSIDE          3  0   2 77
     A                                  4  2MSGCON(10 DIV2432 SYMSGF)
     A            FIFT40        40A     4 15
     A                                  4 58MSGCON(18 DIV2433 SYMSGF)
     A                                  5  2MSGCON(02 DIV2434 SYMSGF)
     A  27                              5 15MSGCON(40 DIV2436 SYMSGF)
     A  27                              5 58MSGCON(18 DIV2435 SYMSGF)
     A N27        KUNDNR         8  0   5  6EDTCDE(3)
     A N27        KNAVN         30A     5 15
     A N27        ADR1          30A     6 15
     A N27        XADR3         30A     7 15
     A N27                              7 58MSGCON(18 DIV2435 SYMSGF)
     A                                  9  2MSGCON(70 DIV5032 SYMSGF)
      *
     A N35N39                          11  2MSGCON(10 DIV2442 SYMSGF)
     A N35 39                          11  2MSGCON(10 DIV2437 SYMSGF)
     A  35N39                          11  2MSGCON(10 DIV2443 SYMSGF)
     A  35 39                          11  2MSGCON(10 DIV2441 SYMSGF)
     A                                 11 15MSGCON(5 DIV0778 SYMSGF)
     A            XSTTIL        30A    11 22
     A                                 12  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 13  2MSGCON(77 YBC0123 SYMSGF)
     A                                 14  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
      *
     A          R IMDET1                    SPACEB(1)
     A            XSTF20        20A        2
     A            FTOPDT         2A       23
     A            FTFRAN         3A       26
     A            CC4FT         30A       32
     A            FTPRIS         9  2     63EDTCDE(3)
     A            FTVAL          3A       74
      *
      *** KOMPRIMERT LISTE (FRA ETT STEDER TIL MANGE STEDER)
     A          R EXHEAD
     A  27                              2  2MSGCON(30 DIV0749 SYMSGF)
     A
     A N27                              2  2MSGCON(30 DIV2431 SYMSGF)
     A                                  2 41MSGCON(15 DIV0754 SYMSGF)
     A                                  2 58DATE EDTCDE(Y)
     A                                  2 70MSGCON(6 DIV3588 SYMSGF)
     A            XSIDE          3  0   2 77
     A                                  4  2MSGCON(10 DIV2432 SYMSGF)
     A            FIFT40        40A     4 15
     A                                  4 58MSGCON(18 DIV2433 SYMSGF)
     A                                  5  2MSGCON(02 DIV2434 SYMSGF)
     A  27                              5 15MSGCON(40 DIV2436 SYMSGF)
     A  27                              5 58MSGCON(18 DIV2435 SYMSGF)
     A N27        KUNDNR         8  0   5  6EDTCDE(3)
     A N27        KNAVN         30A     5 15
     A N27        ADR1          30A     6 15
     A N27        XADR3         30A     7 15
     A N27                              7 58MSGCON(18 DIV2435 SYMSGF)
     A                                  9  2MSGCON(70 DIV5032 SYMSGF)
      *
     A N35N39                          11  2MSGCON(10 DIV2437 SYMSGF)
     A N35 39                          11  2MSGCON(10 DIV2442 SYMSGF)
     A  35N39                          11  2MSGCON(10 DIV2441 SYMSGF)
     A  35 39                          11  2MSGCON(10 DIV2443 SYMSGF)
     A                                 11 15MSGCON(5 DIV0777 SYMSGF)
     A            XSTFRA        30A    11 22
     A                                 12  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 13  2MSGCON(77 YBC0124 SYMSGF)
     A                                 14  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
      *
     A          R EXDET1                    SPACEB(1)
     A            XSTT20        20A        2
     A            FTOPDT         2A       23
     A            FTFRAN         3A       26
     A            CC4FT         30A       32
     A            FTPRIS         9  2     63EDTCDE(3)
     A            FTVAL          3A       74
      *
     A          R OTDESC                    SPACEB(1)
     A N28                                 2' '
     A                                      SPACEB(1)
     A N28                                 2MSGCON(10 YBC0125 SYMSGF)
     A            OTKD1          2A       13
     A            OTFT1         30A       15
     A            OTKD2          2A       47
     A            OTFT2         30A       49
