     A          R SYYA03P1
     A                                  2  2'¤1B(s1p20v4s3b4148T'
     A                                  2  2MSGCON(30 YBC0510 SYMSGF)
     A                                  2 44'¤1B(s1p10v1s3b16602T'
     A                                  2 44MSGCON(12 YBC0511 SYMSGF)
     A            WSDTF          6  0   2 57EDTCDE(Y)
     A                                  2 72MSGCON(12 YBC0512 SYMSGF)
     A            WSDTT          6  0   2 85EDTCDE(Y)
     A                                  2 98MSGCON(06 YBC0422 SYMSGF)
     A            SIDE           6  0   2105EDTCDE(Z)
     A                                  2  2'__________________________________+
     A                                       __________________________________+
     A                                       ________'
     A                                  4  2MSGCON(10 YBC0513 SYMSGF)
     A            FIFT30        30      4 24
     A                                  4 56MSGCON(20 YBC0515 SYMSGF)
     A                                  6  2MSGCON(10 YBC0514 SYMSGF)
     A            FTKNR          8  0   6 14EDTCDE(Z)
     A            KNAVN         30      6 24
     A            ADR1          30      7 24
     A            ADR2          30      8 24
     A            POSTNR         4  0   9 24
     A            ADR3          24      9 30
     A                                  9 56MSGCON(20 YBC0516 SYMSGF)
     A                                 11  2MSGCON(70 YBC0517 SYMSGF)
     A          R SYYA03P2                  SPACEB(1)
     A                                     2'¤1B(s1p10v1s3b16602T'
     A                                     2'__________________________________+
     A                                       __________________________________+
     A                                       __________________________________+
     A                                       ________'
     A                                    90'¤1B(s0p15h1s3b4099T'
     A                                      SPACEA(1)
     A                                     2MSGCON(5 YBC0518 SYMSGF)
     A            XLKF           2A        9
     A                                    11'/'
     A            XSTDF         30A       12
     A            FTOPDT         2A       45
     A                                    47'='
     A            KO1NTX        29A       48
     A                                    85'1 M3 = '
     A            FTM3OM         5  0     92EDTCDE(Z)
     A                                    97'KG'
     A                                   102'1 LM = '
     A            FTLMOM         5  0    109EDTCDE(Z)
     A                                   114'KG'
     A                                      SPACEA(1)
     A  51                                 1MSGCON(54 DIV5029 SYMSGF)
     A  52                                 1MSGCON(54 DIV5030 SYMSGF)
     A  53                                 1MSGCON(54 DIV5031 SYMSGF)
     A  54                                 1MSGCON(54 DIV5032 SYMSGF)
     A                                   102MSGCON(10 YBC0520 SYMSGF)
     A            FTFRAN         3A      113
     A                                      SPACEA(1)
     A  61                                 2MSGCON(8  YBC0521 SYMSGF)
     A            XINTF         83A       22
     A  67                               108MSGCON(9 YBC0526 SYMSGF)
     A                                      SPACEA(1)
     A N67                               108MSGCON(1 DIV0000 SYMSGF)
     A                                      SPACEA(1)
     A  61                                 2MSGCON(08 YBC0546 SYMSGF)
     A  62                                 2MSGCON(12 YBC0522 SYMSGF)
     A  63                                 2MSGCON(12 YBC0523 SYMSGF)
     A  64                                 2MSGCON(12 YBC0524 SYMSGF)
     A  65                                 2MSGCON(12 YBC0532 SYMSGF)
     A  66                                 2MSGCON(12 YBC0533 SYMSGF)
     A            XINTT         83A       22SPACEA(1)
     A                                     1'¤1B*c2300A¤1B*c110B¤1B*c3G¤1B*c2P'
     A                                     2MSGCON(5 YBC0519 SYMSGF)
     A            XLKT           2A        9
     A                                    11'/'
     A            XSTDT         30A       12
     A  61
     AO 65                                 2'PR.'
     A  61
     AO 65        FTPRPR         5  0      6EDTCDE(Z)
     A  61
     AO 65                                11'KG'
     A  62                                 2MSGCON(12 YBC0527 SYMSGF)
     A  63                                 2MSGCON(12 YBC0528 SYMSGF)
     A  64                                 2MSGCON(12 YBC0529 SYMSGF)
     A  66                                 2MSGCON(12 YBC0534 SYMSGF)
     A N66        FTVAL          3A       15
     A N66        FB01           5  0     22EDTCDE(Z)
     A N66        FB02           5  0     29EDTCDE(Z)
     A N66        FB03           5  0     36EDTCDE(Z)
     A N66        FB04           5  0     43EDTCDE(Z)
     A N66        FB05           5  0     50EDTCDE(Z)
     A N66        FB06           5  0     57EDTCDE(Z)
     A N66        FB07           5  0     64EDTCDE(Z)
     A N66        FB08           5  0     71EDTCDE(Z)
     A N66        FB09           5  0     78EDTCDE(Z)
     A N66        FB10           5  0     85EDTCDE(Z)
     A N66        FB11           5  0     92EDTCDE(Z)
     A N66        FB12           5  0     99EDTCDE(Z)
     A N66        FTMAX3         5  0    108EDTCDE(Z)
     A  66        XFB01          4  2     22EDTCDE(4)
     A  66        XFB02          4  2     29EDTCDE(4)
     A  66        XFB03          4  2     36EDTCDE(4)
     A  66        XFB04          4  2     43EDTCDE(4)
     A  66        XFB05          4  2     50EDTCDE(4)
     A  66        XFB06          4  2     57EDTCDE(4)
     A  66        XFB07          4  2     64EDTCDE(4)
     A  66        XFB08          4  2     71EDTCDE(4)
     A  66        XFB09          4  2     78EDTCDE(4)
     A  66        XFB10          4  2     85EDTCDE(4)
     A  66        XFB11          4  2     92EDTCDE(4)
     A  66        XFB12          4  2     99EDTCDE(4)
     A  66        XMAX3          4  2    108EDTCDE(4)
     A                                   119' '
     A                                      SPACEA(1)
     A  53                                 2MSGCON(10 DIV5039 SYMSGF)
     A  52                                 2MSGCON(10 DIV5040 SYMSGF)
     A  52
     AO 53        XFTVAL         3A       15
     A  52
     AO 53        FM01           5  0     22EDTCDE(Z)
     A  52
     AO 53        FM02           5  0     29EDTCDE(Z)
     A  52
     AO 53        FM03           5  0     36EDTCDE(Z)
     A  52
     AO 53        FM04           5  0     43EDTCDE(Z)
     A  52
     AO 53        FM05           5  0     50EDTCDE(Z)
     A  52
     AO 53        FM06           5  0     57EDTCDE(Z)
     A  52
     AO 53        FM07           5  0     64EDTCDE(Z)
     A  52
     AO 53        FM08           5  0     71EDTCDE(Z)
     A  52
     AO 53        FM09           5  0     78EDTCDE(Z)
     A  52
     AO 53        FM10           5  0     85EDTCDE(Z)
     A  52
     AO 53        FM11           5  0     92EDTCDE(Z)
     A  52
     AO 53        FM12           5  0     99EDTCDE(Z)
     A* 52
     A* 53        FTMAX3         5  0    108EDTCDE(Z)
     A          R SYYA03P4                  SPACEB(1)
     A                                     2MSGCON(5 YBC0519 SYMSGF)
     A            XLKT           2A        9
     A                                    11'/'
     A            XSTDT         30A       12
     A                                      SPACEA(1)
     A                                     1'¤1B*c2300A¤1B*c110B¤1B*c3G¤1B*c2P'
     A  61
     AO 65                                 2'PR.'
     A  61
     AO 65        FTPRPR         5  0      6EDTCDE(Z)
     A  61
     AO 65                                11'KG'
     A  62                                 2MSGCON(12 YBC0527 SYMSGF)
     A  63                                 2MSGCON(12 YBC0528 SYMSGF)
     A  64                                 2MSGCON(12 YBC0529 SYMSGF)
     A  66                                 2MSGCON(12 YBC0534 SYMSGF)
     A N66        FTVAL          3A       15
     A N66        FB01           5  0     22EDTCDE(Z)
     A N66        FB02           5  0     29EDTCDE(Z)
     A N66        FB03           5  0     36EDTCDE(Z)
     A N66        FB04           5  0     43EDTCDE(Z)
     A N66        FB05           5  0     50EDTCDE(Z)
     A N66        FB06           5  0     57EDTCDE(Z)
     A N66        FB07           5  0     64EDTCDE(Z)
     A N66        FB08           5  0     71EDTCDE(Z)
     A N66        FB09           5  0     78EDTCDE(Z)
     A N66        FB10           5  0     85EDTCDE(Z)
     A N66        FB11           5  0     92EDTCDE(Z)
     A N66        FB12           5  0     99EDTCDE(Z)
     A N66        FTMAX3         5  0    108EDTCDE(Z)
     A  66        XFB01          4  2     22EDTCDE(4)
     A  66        XFB02          4  2     29EDTCDE(4)
     A  66        XFB03          4  2     36EDTCDE(4)
     A  66        XFB04          4  2     43EDTCDE(4)
     A  66        XFB05          4  2     50EDTCDE(4)
     A  66        XFB06          4  2     57EDTCDE(4)
     A  66        XFB07          4  2     64EDTCDE(4)
     A  66        XFB08          4  2     71EDTCDE(4)
     A  66        XFB09          4  2     78EDTCDE(4)
     A  66        XFB10          4  2     85EDTCDE(4)
     A  66        XFB11          4  2     92EDTCDE(4)
     A  66        XFB12          4  2     99EDTCDE(4)
     A  66        XMAX3          4  2    108EDTCDE(4)
     A                                   119' '
     A                                      SPACEA(1)
     A  53                                 2MSGCON(10 DIV5039 SYMSGF)
     A  52                                 2MSGCON(10 DIV5040 SYMSGF)
     A  52
     AO 53        XFTVAL         3A       15
     A  52
     AO 53        FM01           5  0     22EDTCDE(Z)
     A  52
     AO 53        FM02           5  0     29EDTCDE(Z)
     A  52
     AO 53        FM03           5  0     36EDTCDE(Z)
     A  52
     AO 53        FM04           5  0     43EDTCDE(Z)
     A  52
     AO 53        FM05           5  0     50EDTCDE(Z)
     A  52
     AO 53        FM06           5  0     57EDTCDE(Z)
     A  52
     AO 53        FM07           5  0     64EDTCDE(Z)
     A  52
     AO 53        FM08           5  0     71EDTCDE(Z)
     A  52
     AO 53        FM09           5  0     78EDTCDE(Z)
     A  52
     AO 53        FM10           5  0     85EDTCDE(Z)
     A  52
     AO 53        FM11           5  0     92EDTCDE(Z)
     A  52
     AO 53        FM12           5  0     99EDTCDE(Z)
     A          R SYYA03P3                  SPACEB(1)
     A                                     2'¤1B(s1p10v1s3b16602T'
     A                                     2'__________________________________+
     A                                       __________________________________+
     A                                       __________________________________+
     A                                       __________'
     A                                    90'¤1B(s0p15h1s3b4099T'
