     A*****************************************************************
     A*             F R A K T A V T A L E R   L I S T E               *
     A* ANTALL LINJE=72,  ANTALL TEGN PR. LINJE=80,  OVERFLOW=72      *
     A*****************************************************************
     A          R HEADER
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A  88                              3  1'¤&l'
     A  88        COPY           2  0   3  4
     A  88                              3  6'X'
     A  88                              3  7'¤&a-3R'
     A  88                              3 13'¤(12U¤(s0p12h0s3b4099T'
     A            HOHT1         80      4  1
     A            HOHT2         80      5  1
     A            HOHT3         80      6  1
     A            HOHT4         80      7  1
     A            HOHT5         80      8  1
     A            HOHT6         80      9  1
     A            HOHT7         80     10  1
     A  27                             13  2MSGCON(30 DIV0749 SYMSGF)
     A N27                             13  2MSGCON(30 DIV0750 SYMSGF)
     A                                 13 41MSGCON(15 DIV0754 SYMSGF)
     A                                 13 58DATE EDTCDE(Y)
     A N27                             15  2MSGCON(12 DIV0751 SYMSGF)
     A N27        KUNDNR         8  0  15 16EDTCDE(3)
     A N27        KNAVN         30A    15 26
     A N27        ADR1          30A    16 26
     A N27        XADR3         30A    17 26
     A                                 19  2MSGCON(12 DIV0753 SYMSGF)
     A            FTOPDT         2A    19 17
     A            KO1NTX        29A    19 21
     A  28                             19 61MSGCON(10 DIV0769 SYMSGF)
     A N28                             19 61MSGCON(10 DIV0770 SYMSGF)
     A                                 21  2MSGCON(13 DIV0752 SYMSGF)
     A            FTFRAN         3A    21 17
     A  40                             21 25MSGCON(54 DIV5029 SYMSGF)
     A  41                             21 25MSGCON(54 DIV5030 SYMSGF)
     A  42                             21 25MSGCON(54 DIV5031 SYMSGF)
     A                                 23  2MSGCON(70 DIV5032 SYMSGF)
     A                                 25  2MSGCON(5 DIV0777 SYMSGF)
     A            XLKF           2A    25  8
     A                                 25 10'/'
     A            XSTF          20A    25 11
     A                                 25 31'/'
     A            XSONEF         3A    25 32
     A                                 25 42MSGCON(5 DIV0778 SYMSGF)
     A            XLKT           2A    25 48
     A                                 25 50'/'
     A            XSTT          20A    25 51
     A                                 25 71'/'
     A            XSONET         3A    25 72
     A  88                             26  1'¤*c3000A¤*c220B¤*c11G¤*c2P'
     A                                 27  2MSGCON(35 DIV0771 SYMSGF)
     A  41                             27 54MSGCON(10 DIV5040 SYMSGF)
     A  42                             27 54MSGCON(10 DIV5039 SYMSGF)
     A                                 28  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A*
     A          R DETALJ                    SPACEB(1)
     A N50N49 51  XINTF          5  0      3EDTCDE(3)
     A N50N49N51  XINTF2         5  2      2EDTCDE(3)
     A N50N49                              9'-'
     A  50N49                              3MSGCON(6 DIV5037 SYMSGF)
     A    N49 51  XINTT          5  0     12EDTCDE(3)
     A    N49N51  XINTT2         5  2     11EDTCDE(3)
     A     49                              8MSGCON(6 DIV5045 SYMSGF)
     A            FTVAL          3        20
     A            XFB            5  0     29EDTCDE(3)
     A    N55                             35MSGCON(5 DIV0772 SYMSGF)
     A     55                             35MSGCON(3 DIV5044 SYMSGF)
     A  51 55     FTPRPR         5  0     39EDTCDE(3)
     A  52 55
     AO 53 55     XPRPR          4  2     39EDTCDE(4)
     A  51 55                             45MSGCON(5 DIV5033 SYMSGF)
     A  52 55                             45MSGCON(5 DIV5034 SYMSGF)
     A  53 55                             45MSGCON(5 DIV5035 SYMSGF)
     A  54 55                             39MSGCON(5 DIV5036 SYMSGF)
     A  41
     AO 42        XFM            5  0     57EDTCDE(4)
     A*
     A          R TOMLIN                    SPACEB(1)
     A                                     2' '
     A*
     A          R MINIMUM                   SPACEB(1)
     A                                     2MSGCON(12 DIV5038 SYMSGF)
     A            FTMIN          5  0     20EDTCDE(3)
     A*
     A          R FORVOGN                   SPACEB(1)
     A                                     2MSGCON(12 DIV0774 SYMSGF)
     A            FTMAX1         5  0     20EDTCDE(3)
     A*
     A          R HENGER                    SPACEB(1)
     A                                     2MSGCON(12 DIV0775 SYMSGF)
     A            FTMAX2         5  0     20EDTCDE(3)
     A*
     A          R KOMPLETT                  SPACEB(1)
     A                                     2MSGCON(12 DIV0776 SYMSGF)
     A            FTMAX3         5  0     20EDTCDE(3)
      *
      *** KOMPRIMERT LISTE (FRA MANGE STEDER TIL ETT STED)
     A          R IMHEAD
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A  88                              2  1'¤&l'
     A  88        COPY           2  0   2  4
     A  88                              2  6'X'
     A  88                              2  7'¤&a-3R'
     A  88                              2 13'¤(12U¤(s0p12h0s3b4099T'
     A  27                              3  2MSGCON(30 DIV0749 SYMSGF)
     A
     A N27                              3  2MSGCON(30 DIV2431 SYMSGF)
     A                                  3 41MSGCON(15 DIV0754 SYMSGF)
     A                                  3 58DATE EDTCDE(Y)
     A                                  3 70MSGCON(6 DIV3588 SYMSGF)
     A            XSIDE          3  0   3 77
     A* START BOKS 1
     A  88                              4  1'¤&a8C¤*c900A¤*c5B¤*c11G¤*c0P'
     A  88                              4  1'¤&a8C¤*c5A¤*c253B¤*c11G¤*c0P'
     A  88                              4  1'¤&a44C¤*c5A¤*c253B¤*c11G¤*c0P'
     A                                  5  2MSGCON(10 DIV2432 SYMSGF)
     A            FIFT40        40A     5 15
     A                                  5 58MSGCON(18 DIV2433 SYMSGF)
     A                                  6  2MSGCON(02 DIV2434 SYMSGF)
     A  27                              6 15MSGCON(40 DIV2436 SYMSGF)
     A  27                              6 58MSGCON(18 DIV2435 SYMSGF)
     A N27        KUNDNR         8  0   6  6EDTCDE(3)
     A N27        KNAVN         30A     6 15
     A N27        ADR1          30A     7 15
     A N27        XADR3         30A     8 15
     A N27                              8 58MSGCON(18 DIV2435 SYMSGF)
     A  88                              9  1'¤&a8C¤*c900A¤*c5B¤*c11G¤*c0P'
     A                                 10  2MSGCON(70 DIV5032 SYMSGF)
      *
     A N35N39                          12  2MSGCON(10 DIV2442 SYMSGF)
     A N35 39                          12  2MSGCON(10 DIV2437 SYMSGF)
     A  35N39                          12  2MSGCON(10 DIV2443 SYMSGF)
     A  35 39                          12  2MSGCON(10 DIV2441 SYMSGF)
     A                                 12 15MSGCON(5 DIV0778 SYMSGF)
     A            XLKT           2A    12 22
     A                                 12 24'/'
     A            XSTT          20A    12 25
     A                                 12 45'/'
     A            XSONET         3A    12 46
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 14  2MSGCON(35 DIV0771 SYMSGF)
     A                                 15  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
      *
     A          R IMDET1                    SPACEB(1)
     A  88                                 1'¤*c3000A¤*c150B¤*c11G¤*c2P'
     A                                     2MSGCON(5 DIV0777 SYMSGF)
     A                                      SPACEB(1)
     A            XLKF           2A        8
     A                                    10'/'
     A            XSTF          20A       11
     A                                    31'/'
     A            XSONEF         3A       32
     A                                    36MSGCON(10 DIV0753 SYMSGF)
     A            FTOPDT         2A       47
     A                                    50MSGCON(5 DIV2438 SYMSGF)
     A            FTM3OM         5S 0     56EDTCDE(3)
     A                                    62MSGCON(3 DIV2439 SYMSGF)
     A                                    66MSGCON(5 DIV2440 SYMSGF)
     A            FTLMOM         5S 0     72EDTCDE(3)
     A                                    78MSGCON(3 DIV2439 SYMSGF)
     A                                      SPACEA(1)
     A                                     2MSGCON(13 DIV0752 SYMSGF)
     A            FTFRAN         3A       17
     A  40                                25MSGCON(54 DIV5029 SYMSGF)
     A  41                                25MSGCON(54 DIV5030 SYMSGF)
     A  42                                25MSGCON(54 DIV5031 SYMSGF)
     A N88                                 1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      SPACEB(1)
     A  88                                 1' '
     A                                      SPACEB(1)
     A*
     A          R IMDET2                    SPACEB(1)
     A N50N49 51  XINTF          5  0      3EDTCDE(3)
     A N50N49N51  XINTF2         5  2      2EDTCDE(3)
     A N50N49                              9'-'
     A  50N49                              3MSGCON(6 DIV5037 SYMSGF)
     A    N49 51  XINTT          5  0     12EDTCDE(3)
     A    N49N51  XINTT2         5  2     11EDTCDE(3)
     A     49                              8MSGCON(6 DIV5045 SYMSGF)
     A            FTVAL          3        20
     A            XFB            5  0     29EDTCDE(3)
     A    N55                             35MSGCON(5 DIV0772 SYMSGF)
     A     55                             35MSGCON(3 DIV5044 SYMSGF)
     A  51 55     FTPRPR         5  0     39EDTCDE(3)
     A  52 55
     AO 53 55     XPRPR          4  2     39EDTCDE(3)
     A  51 55                             45MSGCON(5 DIV5033 SYMSGF)
     A  52 55                             45MSGCON(5 DIV5034 SYMSGF)
     A  53 55                             45MSGCON(5 DIV5035 SYMSGF)
     A  54 55                             39MSGCON(5 DIV5036 SYMSGF)
     A  41                                60MSGCON(10 DIV5040 SYMSGF)
     A  42                                60MSGCON(10 DIV5039 SYMSGF)
     A  41
     AO 42        XFM            5  0     71EDTCDE(4)
     A*
     A          R IMTOML                    SPACEB(1)
     A                                     2' '
     A*
     A          R IMMM                      SPACEB(1)
     A                                     2MSGCON(12 DIV5038 SYMSGF)
     A            FTMIN          5  0     20EDTCDE(3)
     A*
     A          R IMFORV                    SPACEB(1)
     A                                     2MSGCON(12 DIV0774 SYMSGF)
     A            FTMAX1         5  0     20EDTCDE(3)
     A*
     A          R IMHENG                    SPACEB(1)
     A                                     2MSGCON(12 DIV0775 SYMSGF)
     A            FTMAX2         5  0     20EDTCDE(3)
     A*
     A          R IMKOMP                    SPACEB(1)
     A                                     2MSGCON(12 DIV0776 SYMSGF)
     A            FTMAX3         5  0     20EDTCDE(3)
      *
      *** KOMPRIMERT LISTE (FRA ETT STEDER TIL MANGE STEDER)
     A          R EXHEAD
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A  88                              2  1'¤&l'
     A  88        COPY           2  0   2  4
     A  88                              2  6'X'
     A  88                              2  7'¤&a-3R'
     A  88                              2 13'¤(12U¤(s0p12h0s3b4099T'
     A  27                              3  2MSGCON(30 DIV0749 SYMSGF)
     A*
     A N27                              3  2MSGCON(30 DIV2431 SYMSGF)
     A                                  3 41MSGCON(15 DIV0754 SYMSGF)
     A                                  3 58DATE EDTCDE(Y)
     A                                  3 70MSGCON(6 DIV3588 SYMSGF)
     A            XSIDE          3  0   3 77
     A* START BOKS 1
     A  88                              4  1'¤&a8C¤*c900A¤*c5B¤*c11G¤*c0P'
     A  88                              4  1'¤&a8C¤*c5A¤*c253B¤*c11G¤*c0P'
     A  88                              4  1'¤&a44C¤*c5A¤*c253B¤*c11G¤*c0P'
     A                                  5  2MSGCON(10 DIV2432 SYMSGF)
     A            FIFT40        40A     5 15
     A                                  5 58MSGCON(18 DIV2433 SYMSGF)
     A                                  6  2MSGCON(02 DIV2434 SYMSGF)
     A  27                              6 15MSGCON(40 DIV2436 SYMSGF)
     A  27                              6 58MSGCON(18 DIV2435 SYMSGF)
     A N27        KUNDNR         8  0   6  6EDTCDE(3)
     A N27        KNAVN         30A     6 15
     A N27        ADR1          30A     7 15
     A N27        XADR3         30A     8 15
     A N27                              8 58MSGCON(18 DIV2435 SYMSGF)
     A  88                              9  1'¤&a8C¤*c900A¤*c5B¤*c11G¤*c0P'
     A                                 10  2MSGCON(70 DIV5032 SYMSGF)
      *
     A N35N39                          12  2MSGCON(10 DIV2437 SYMSGF)
     A N35 39                          12  2MSGCON(10 DIV2442 SYMSGF)
     A  35N39                          12  2MSGCON(10 DIV2441 SYMSGF)
     A  35 39                          12  2MSGCON(10 DIV2443 SYMSGF)
     A                                 12 15MSGCON(5 DIV0777 SYMSGF)
     A            XLKF           2A    12 22
     A                                 12 24'/'
     A            XSTF          20A    12 25
     A                                 12 45'/'
     A            XSONEF         3A    12 46
     A                                 13  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                 14  2MSGCON(35 DIV0771 SYMSGF)
     A                                 15  1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
      *
     A          R EXDET1                    SPACEB(1)
     A  88                                 1'¤*c3000A¤*c150B¤*c11G¤*c2P'
     A                                     2MSGCON(5 DIV0778 SYMSGF)
     A                                      SPACEB(1)
     A            XLKT           2A        8
     A                                    10'/'
     A            XSTT          20A       11
     A                                    31'/'
     A            XSONET         3A       32
     A                                    36MSGCON(10 DIV0753 SYMSGF)
     A            FTOPDT         2A       47
     A                                    50MSGCON(5 DIV2438 SYMSGF)
     A            FTM3OM         5S 0     56EDTCDE(3)
     A                                    62MSGCON(3 DIV2439 SYMSGF)
     A                                    66MSGCON(5 DIV2440 SYMSGF)
     A            FTLMOM         5S 0     72EDTCDE(3)
     A                                    78MSGCON(3 DIV2439 SYMSGF)
     A                                      SPACEA(1)
     A                                     2MSGCON(13 DIV0752 SYMSGF)
     A            FTFRAN         3A       17
     A  40                                25MSGCON(54 DIV5029 SYMSGF)
     A  41                                25MSGCON(54 DIV5030 SYMSGF)
     A  42                                25MSGCON(54 DIV5031 SYMSGF)
     A N88                                 1'-----------------------------------
     A                                      ------------------------------------
     A                                      -----------'
     A                                      SPACEB(1)
     A  88                                 1' '
     A                                      SPACEB(1)
     A*
     A          R EXDET2                    SPACEB(1)
     A N50N49 51  XINTF          5  0      3EDTCDE(3)
     A N50N49N51  XINTF2         5  2      2EDTCDE(3)
     A N50N49                              9'-'
     A  50N49                              3MSGCON(6 DIV5037 SYMSGF)
     A    N49 51  XINTT          5  0     12EDTCDE(3)
     A    N49N51  XINTT2         5  2     11EDTCDE(3)
     A     49                              8MSGCON(6 DIV5045 SYMSGF)
     A            FTVAL          3        20
     A            XFB            5  0     29EDTCDE(3)
     A    N55                             35MSGCON(5 DIV0772 SYMSGF)
     A     55                             35MSGCON(3 DIV5044 SYMSGF)
     A  51 55     FTPRPR         5  0     39EDTCDE(3)
     A  52 55
     AO 53 55     XPRPR          4  2     39EDTCDE(3)
     A  51 55                             45MSGCON(5 DIV5033 SYMSGF)
     A  52 55                             45MSGCON(5 DIV5034 SYMSGF)
     A  53 55                             45MSGCON(5 DIV5035 SYMSGF)
     A  54 55                             39MSGCON(5 DIV5036 SYMSGF)
     A  41                                60MSGCON(10 DIV5040 SYMSGF)
     A  42                                60MSGCON(10 DIV5039 SYMSGF)
     A  41
     AO 42        XFM            5  0     71EDTCDE(4)
     A*
     A          R EXTOML                    SPACEB(1)
     A                                     2' '
     A*
     A          R EXMM                      SPACEB(1)
     A                                     2MSGCON(12 DIV5038 SYMSGF)
     A            FTMIN          5  0     20EDTCDE(3)
     A*
     A          R EXFORV                    SPACEB(1)
     A                                     2MSGCON(12 DIV0774 SYMSGF)
     A            FTMAX1         5  0     20EDTCDE(3)
     A*
     A          R EXHENG                    SPACEB(1)
     A                                     2MSGCON(12 DIV0775 SYMSGF)
     A            FTMAX2         5  0     20EDTCDE(3)
     A*
     A          R EXKOMP                    SPACEB(1)
     A                                     2MSGCON(12 DIV0776 SYMSGF)
     A            FTMAX3         5  0     20EDTCDE(3)
