********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10005 * 01 YBC PTF10 TOLLSTEDSKODE ER ENDRE FRA 2.0 TIL 4.0
********************************************************************
     A*****************************************************************
     A*           UTSKRIFT AV HELE KODE / TEKSTREGISTER               *
     A* ANTALL LINJE=72,  ANTALL TEGN PR. LINJE=132, OVERFLOW=72      *
     A*****************************************************************
     A          R HEAD51
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0507 SYMSGF)
     A          R HEAD52
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0508 SYMSGF)
     A          R HEAD53
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0509 SYMSGF)
     A          R HEAD54
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0510 SYMSGF)
     A          R HEAD55
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 YBC0009 SYMSGF)
     A          R HEAD56
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0512 SYMSGF)
     A          R HEAD57
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0513 SYMSGF)
     A          R HEAD58
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0514 SYMSGF)
     A          R HEAD59
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0515 SYMSGF)
     A          R HEAD60
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 YBC1802 SYMSGF)
     A          R HEAD61
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0517 SYMSGF)
     A          R HEAD62
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0518 SYMSGF)
     A          R HEAD63
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0519 SYMSGF)
     A          R HEAD64
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0520 SYMSGF)
     A          R HEAD65
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0521 SYMSGF)
     A          R HEAD66
     A                                  1110MSGCON(6 DIV0523 SYMSGF)
     A                                  1119PAGNBR
     A                                  3  1MSGCON(132 DIV0522 SYMSGF)
N02  A          R HEAD67
N02  A                                  1110MSGCON(6 DIV0523 SYMSGF)
N02  A                                  1119PAGNBR
N02  A                                  3  1MSGCON(132 JOV1613 SYMSGF)
     A          R DET51                     SPACEB(1)
     A            KGEKOD         3A  O     1
     A            XGENOT        17A  O     5
     A            XGEENT        17A  O    23
     A            KGEKON         5  0O    41
     A N91        KG2KON         5  0O    47
     A            KGEUTL         1A  O    53
     A            KGEUTK         8  0O    55EDTCDE(4)
     A N91        KG2AVD         4  0O    64EDTCDE(4)
     A N91        KG2BÆR         4  0O    69EDTCDE(4)
     A N91        XG2TYT        17A  O    74
     A N91        KG2SRT         3  0O    93EDTCDE(4)
     A N91        KG2KRT         7A  O    97
     A N91        KG2UTG         5  0O   105EDTCDE(4)
     A N91                               110'/'
     A N91        KG2MOT         5  0O   111EDTCDE(4)
     A N91        KG2XXX         1A  O   117
     A N91        KG2PRO         4  2O   119EDTCDE(4)
     A            KGESAD         1A  O   126
     A            KGEKK          1A  O   128
     A            KGEFRA         1A  O   130
     A            KGEPR          1A  O   132
     A          R DET52                     SPACEB(1)
     A            KFTLN          1  0O    23
     A            KFTTYP         2A  O    35
     A            KFTSK          1A  O    45
     A            KFTFTX        51A  O    47
     A          R DET53                     SPACEB(1)
     A            KLBKOD         3A  O    19
     A            KLBKT          3A  O    36
     A            KLBNAV        15A  O    40
     A            KLBFOK         1A  O    68
     A            KLBPRM         3  1O    86EDTCDE(1)
     A            KLBFRK         1A  O   100
     A          R DET54                     SPACEB(1)
     A            KLIKOD         1A  O    28
     A            KLINAV        30A  O    46
     A            KLISTO         1A  O    90
     A          R DET55                     SPACEB(1)
     A            KLKLK          2A  O    23
     A            KLKLK2         2A  O    37
     A            KLKNVN        30A  O    50
     A          R DET56                     SPACEB(1)
     A            KO1KOD         2A  O    21
     A            KO1NTX        29A  O    38
     A            KO1ETX        29A  O    77
     A          R DET57                     SPACEB(1)
     A            KOSFSI         3A  O    28
     A            KOSFNV        16A  O    61
     A          R DET58                     SPACEB(1)
     A            KSISIG         3A  O    28
     A            KSINAV        16A  O    54
     A          R DET59                     SPACEB(1)
S01  A*           KTSKOD         2  0O    27
N01  A            KTSPNR         4  0O    27
     A            KTSNAV        15A  O    59
     A          R DET60                     SPACEB(1)
     A            KVAKOD         3A  O    25
     A            KVAKRS        11  3O    41EDTCDE(3)
     A            KVAOMR         3  0O    68EDTCDE(3)
     A            XVADT          6  0O    84EDTCDE(Y)
     A          R DET61                     SPACEB(1)
     A            KOVAVD         4  0O     7EDTCDE(4)
     A            KOVLKG         5  0O    18EDTCDE(4)
     A            KOVKKG         5  0O    30EDTCDE(4)
     A            KOVK1          5  0O    39EDTCDE(4)
     A            KOVK2          5  0O    46EDTCDE(4)
     A            KOVK3          5  0O    53EDTCDE(4)
     A            KOVK4          5  0O    60EDTCDE(4)
     A            KOVK5          5  0O    67EDTCDE(4)
     A            KOVK6          5  0O    74EDTCDE(4)
     A            KOVK7          5  0O    81EDTCDE(4)
     A            KOVK8          5  0O    88EDTCDE(4)
     A            KOVK9          5  0O    95EDTCDE(4)
     A            KOVK10         5  0O   103EDTCDE(4)
     A            KOVK11         5  0O   111EDTCDE(4)
     A            KOVOMR         3  0O   121EDTCDE(4)
     A          R DET62                     SPACEB(1)
     A* BIBLIOTEK FOR REGNSKAP PR. ER IKKE REGISTRERT (8 LANG, POS. 18)
     A* DET ER INGEN PREFIX FOR REGNSKAPSREGISTER I AS/400
     A            FIFIRM         2A  O    69
     A            FIDUL          1A  O    90
     A            FIUPS          4  2O   109EDTCDE(4)
     A            FIUPM          2  0O   127EDTCDE(4)
     A          R DET63                     SPACEB(1)
     A            KO2KOD         2A  O    19
     A            KO2FB          1A  O    46
     A            KO2FPS         1A  O    56
     A            KO2KK          1A  O    66
     A            KO2TI          1A  O    76
     A            KO2FI          1A  O    89
     A            KO2KON         1A  O   100
     A            KO2UTL         1A  O   112
     A            KO2MVK         1A  O   123
     A            KO2MVS         1A  O   127
     A            KO2PST         1A  O   131
     A          R DET64                     SPACEB(1)
     A            KFRKOD         3A  O    18
     A            KFRNTX        28A  O    33
     A            KFRETX        28A  O    68
     A            KFRCP          2A  O   104
     A          R DET65                     SPACEB(1)
     A            KOAAVD         4  0O    15EDTCDE(4)
     A            KOANVN        33A  O    23
     A            KOAFIR         2A  O    57
     A            KOAKNR         8  0O    66EDTCDE(4)
     A            KOAKON         4  0O    97EDTCDE(4)
     A            KOABÆR         4  0O   105EDTCDE(4)
     A            KOAIAT         7  0O   119EDTWRD('  & &    ')
     A          R DET66                     SPACEB(1)
     A            KFSFNR         3  0O    17
     A            KFSNAV        30A  O    36
     A            KFSKD2         2A  O    86
N02  A          R DET67                     SPACEB(1)
N02  A            KOTMKO         1   O    17
N02  A            KOTMNV        20A  O    36
