     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                      CF04(04 'SØK KUNDE')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'SYSPED/SYYA03'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(033 DIV0756 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(GRN)
     A                                  1 71TIME
     A                                      COLOR(GRN)
     A                                  2 58MSGCON(022 DIV0047 *LIBL/SYMSGF)
     A                                      COLOR(TRQ)
     A                                  4  2MSGCON(015 YBC0530 *LIBL/SYMSGF)
     A            WSKN           8Y 0B  4 18DSPATR(UL)
     A  99                                  DSPATR(PC)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      EDTCDE(4)
     A                                  4 28MSGCON(030 YBC0531 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  7  2MSGCON(015 DIV2536 *LIBL/SYMSGF)
     A            WSOPDT         2A  B  7 18COLOR(YLW)
     A                                      DSPATR(UL)
     A                                  7 28MSGCON(018 DIV0761 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                  8  2MSGCON(015 YBC0507 *LIBL/SYMSGF)
     A            WSFR           3A  B  8 18COLOR(YLW)
     A                                      DSPATR(UL)
     A                                  8 28MSGCON(018 DIV0761 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 13  2MSGCON(015 DIV0760 *LIBL/SYMSGF)
     A            WSLK           2A  B 13 18DSPATR(UL)
     A                                      COLOR(YLW)
     A            WSSDF          5A  B 13 21DSPATR(UL)
     A  97                                  DSPATR(PC)
     A  97                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 13 28MSGCON(018 DIV0761 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 14  2MSGCON(015 DIV0762 *LIBL/SYMSGF)
     A            WSLK2          2   B 14 18COLOR(YLW)
     A            WSSDT          5A  B 14 21DSPATR(UL)
     A  96                                  DSPATR(PC)
     A  96                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 14 28MSGCON(018 DIV0761 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 18  2MSGCON(015 YBC0508 *LIBL/SYMSGF)
     A            WSDTF          6S 0B 18 18DSPATR(UL)
     A  95                                  DSPATR(PC)
     A  95                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 19  2MSGCON(015 YBC0509 *LIBL/SYMSGF)
     A            WSDTT          6S 0B 19 18DSPATR(UL)
     A  94                                  DSPATR(PC)
     A  94                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 23 22MSGCON(018 DIV0032 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A            MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A  30                                  COLOR(WHT)
