     A*%%TS  SD  20130911  211120  JOVO        REL-V7R1M0  5770-WDS
     A*%%EC
     A                                      DSPSIZ(24 80 *DS3                  -
     A                                             27 132 *DS4)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE
     A*%%TS  SD  20130911  211120  JOVO        REL-V7R1M0  5770-WDS
     A                                      CF03(03 'Avslutt')
     A                                  1  4'SYSPED/SYYA01'
     A                                      COLOR(BLU)
     A                                  1 21MSGCON(040 DIV0489 *LIBL/SYMSGF)
     A                                      COLOR(WHT)
     A                                  1 69DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2 69TIME
     A                                      COLOR(BLU)
     A                                  4 11MSGCON(066 DIV0490 *LIBL/SYMSGF)
     A                                  6 11MSGCON(033 DIV0491 *LIBL/SYMSGF)
     A            WSGEB          1A  B  6 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(51)
     A                                      VALUES(' ' 'X')
     A                                  7 11MSGCON(033 DIV0492 *LIBL/SYMSGF)
     A            WSFT           1A  B  7 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(52)
     A                                      VALUES(' ' 'X')
     A                                  8 11MSGCON(033 DIV0493 *LIBL/SYMSGF)
     A            WSLB           1A  B  8 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(53)
     A                                      VALUES(' ' 'X')
     A                                  9 11MSGCON(033 DIV0494 *LIBL/SYMSGF)
     A            WSLIK          1A  B  9 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(54)
     A                                      VALUES(' ' 'X')
     A                                 10 11MSGCON(033 DIV0495 *LIBL/SYMSGF)
     A            WSLK           1A  B 10 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(55)
     A                                      VALUES(' ' 'X')
     A                                 11 11MSGCON(033 DIV0496 *LIBL/SYMSGF)
     A            WSOTY          1A  B 11 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(56)
     A                                      VALUES(' ' 'X')
     A                                 12 11MSGCON(033 DIV0497 *LIBL/SYMSGF)
     A            WSSF           1A  B 12 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(57)
     A                                      VALUES(' ' 'X')
     A                                 13 11MSGCON(033 DIV0498 *LIBL/SYMSGF)
     A            WSSI           1A  B 13 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(58)
     A                                      VALUES(' ' 'X')
     A                                 14 11MSGCON(033 DIV0499 *LIBL/SYMSGF)
     A            WSSD           1A  B 14 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(59)
     A                                      VALUES(' ' 'X')
     A                                 15 11MSGCON(033 DIV0500 *LIBL/SYMSGF)
     A            WSVAL          1A  B 15 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(60)
     A                                      VALUES(' ' 'X')
     A                                 16 11MSGCON(033 DIV0501 *LIBL/SYMSGF)
     A            WSV            1A  B 16 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(61)
     A                                      VALUES(' ' 'X')
     A                                 17 11MSGCON(033 DIV0502 *LIBL/SYMSGF)
     A            WSFIRM         1A  B 17 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(62)
     A                                      VALUES(' ' 'X')
     A                                 18 11MSGCON(033 DIV0503 *LIBL/SYMSGF)
     A            WSOT2          1A  B 18 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(63)
     A                                      VALUES(' ' 'X')
     A                                 19 11MSGCON(033 DIV0504 *LIBL/SYMSGF)
     A            WSFR           1A  B 19 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(64)
     A                                      VALUES(' ' 'X')
     A                                 20 11MSGCON(033 DIV0505 *LIBL/SYMSGF)
     A            WSA            1A  B 20 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(65)
     A                                      VALUES(' ' 'X')
     A                                 21 11MSGCON(033 DIV0506 *LIBL/SYMSGF)
     A            WSFS           1A  B 21 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(66)
     A                                      VALUES(' ' 'X')
     A                                 23 11MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A                                 22 11MSGCON(033 JOV1612 *LIBL/SYMSGF)
     A            WSLLS          1A  B 22 50DSPATR(UL)
     A                                      DFTVAL('X')
     A                                      COLOR(YLW)
     A                                      BLANKS(67)
     A                                      VALUES(' ' 'X')
