     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A          R BILDE
     A                                      CF03(03 'Avslutt')
     A                                 10  2MSGCON(65 DIV5042 SYMSGF)
     A                                      COLOR(RED)
     A            WSSVAR         1   B 10 68DSPATR(UL)
     A  99                                  DSPATR(RI)
     A                                      COLOR(YLW)
     A                                      VALUES(' ' 'N' 'J')
     A                                 11  2MSGCON(65 DIV5043 SYMSGF)
     A                                      COLOR(BLU)
     A                                 23  2MSGCON(18 DIV0020 SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
