     A*___________________________
     A* SYSPED / Fakturavarelinjer
     A*"""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TACTDESR
     A*
     A            SASVER         1          COLHDG('VERDENSDEL')
     A            SASLK          2          COLHDG('LANDKODE')
     A            SASFLP         3          COLHDG('FLYPLASS')
     A            SASSTE        20          COLHDG('NAVN FLP')
     A            SASSON         2S 0       COLHDG('SONE')
     A            SASPRI         1          COLHDG('PRIORITY J/N')
     A            SASGEN         1          COLHDG('GEN CARG J/N')
     A            SASDDB         5S 0       COLHDG('D/D TILLEGG BASE')
     A            SASDDK         5S 2       COLHDG('D/D TILLEGG KGPR')
     A            SGMINI         5S 0       COLHDG('GEN.MIN')
     A            SGNRAT         5S 2       COLHDG('GEN.NRATE')
     A            SGQ045         5S 2       COLHDG('GEN.Q045')
     A            SGQ100         5S 2       COLHDG('GEN.Q100')
     A            SGQ250         5S 2       COLHDG('GEN.Q100')
     A            SGQ300         5S 2       COLHDG('GEN.Q100')
     A            SGQ500         5S 2       COLHDG('GEN.Q500')
     A            SGQMIL         5S 2       COLHDG('GEN.Q1000')
     A            SPMINI         5S 0       COLHDG('PTY.NRATE')
     A            SPNRAT         5S 2       COLHDG('PTY.QNRATE')
     A            SPQ045         5S 2       COLHDG('PTY.Q045')
     A            SPQ100         5S 2       COLHDG('PTY.Q100')
     A          K SASVER
     A          K SASSTE
