      *____________________________
      * SYSPED / TOLLTARIFFEN, BEREGNINGSMÅTE
      *""""""""""""""""""""""""""""
     A          R TARIPVAR
     A            TATANR         8S 0       TEXT('TARIFFNR.')
     A            TADATO         8S 0       TEXT('F.O.M. DATO')
     A            TADTR          8S 0       TEXT('REG.DATO')
     A            TAEØSK         1A         TEXT('EØS-LAND KODE')
     A            TATSJK         1A         TEXT('KROATIA KODE')
     A            TATYRK         1A         TEXT('TYRKIA KODE')
     A            TAISRK         1A         TEXT('ISRAEL KODE')
     A            TAELLK         1A         TEXT('SINGAPORE KODE')
     A            TABULK         1A         TEXT('BULGARIA KODE')
     A            TAPOLK         1A         TEXT('MAKEDONIA KODE')
     A            TAROMK         1A         TEXT('ROMANIA KODE')
     A            TAUNGK         1A         TEXT('JORDAN KODE')
     A            TASLOK         1A         TEXT('SLOVENIA KODE')
     A            TAMULK         1A         TEXT('DE MINST UTVIKLEDE LAND')
     A            TAOULK         1A         TEXT('ORDINÆRE UTVIKLINGSLAND')
     A            TAGRLK         1A         TEXT('GRØNLAND')
     A            TAFÆRK         1A         TEXT('FÆRØYENE')
     A            TAISTK         1A         TEXT('INDIA, SRI LANKA, THAILAND')
     A            TAMARK         1A         TEXT('MAROKKO')
     A            TAMEXK         1A         TEXT('MEXICO')
     A            TAVGAK         1A         TEXT('VESTBREDDE OG GAZASTRIPEN')
     A            TAN01K         1A         TEXT('RESERVER 01')
     A            TAN02K         1A         TEXT('RESERVER 02')
     A            TAN03K         1A         TEXT('RESERVER 03')
     A            TAN04K         1A         TEXT('RESERVER 04')
     A            TAN05K         1A         TEXT('RESERVER 05')
     A            TAN06K         1A         TEXT('RESERVER 06')
     A            TAN07K         1A         TEXT('RESERVER 07')
     A            TAN08K         1A         TEXT('RESERVER 08')
     A            TAN09K         1A         TEXT('RESERVER 09')
     A            TAN10K         1A         TEXT('RESERVER 10')
     A          K TATANR
     A          K TADATO
