     A*%%TS  SD  20140408  143122  CB          REL-V7R1M0  5770-WDS
*****A**************************************************************
     A* RETTINGER I DETTE PROGRAM:
PTFnrA*Sek Sig Vers Beskrivelse...........................
"""""A*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
PXXXXA* 01 TH PTF8 NY HELP - FUNKSJON
P11XXA* 02 CB PTF11 VARETEKST
*****A**************************************************************
     A*%%EC
     A                                      DSPSIZ(27 132 *DS4)
     A                                      HELP(01)
     A                                      CF01(01)
     A                                      PRINT
     A          R NOERAS
     A                                      ASSUME
     A                                      OVERLAY
     A                                  1  2' '
     A          R WIND01
     A                                      OVERLAY
     A                                      WINDOW(*DFT 8  70)
     A          R SUBCTL
     A*%%TS  SD  20140408  143122  CB          REL-V7R1M0  5770-WDS
     A  *DS3                                WINDOW(WIND01)
     A  *DS4                                WINDOW(WIND01)
     A                                      CF12(12 'TILBAKE')
     A                                      KEEP
     A                                      OVERLAY
     A                                  2  2'TARIFFNUMMER NORGE..:'
     A            WARICN         8Y 0O  2 26EDTCDE(4)
     A                                  3  4'IMPORT TIL EU.....:'
     A            WARICI        10A  B  3 26
     A                                  4  4'EKSPORT FRA EU....:'
     A            WARICE         8A  B  4 26
     A*                                 5  4'SE Varubeskrivning:'
     A*           WARICV        30A  B  5 26
     A          R BUNN
     A                                      SLNO(7)
     A                                      CLRL(01)
     A                                      OVERLAY
     A                                      WINDOW(WIND01)
     A                                  1  2MSGCON(010 EDI0812 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
