     A*__________________________
     A* NUMMERTELLER / LØPENR DIVERSE FORMÅL
     A*""""""""""""""""""""""""""
      * ANBEFALING FOR Å FÅ ENHETLIG BRUK I ULIKE PROGRAM:
      * GENO = "NESTE NR FOR TILDELING" (SOM I "TELL", SE F.EKS SYFA10)
      * M.A.O: 1.CHAIN 2.FLYTT GENO TIL PROG.VARIABEL 3.ADD 1  4.UPDATE
     A          R TELLGER
     A            GECO           8A         COLHDG('UNIK KODE')
     A            GENO           7S 0       COLHDG('NUMMERTELLER')
     A          K GECO
