     A*____________________________
     A* SYSPED / OPPDRAGSNR/TURNR TELLER
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R TELLRUR
     A            TESTAT         1          TEXT('STATUS')
     A            TEAVD          4S 0       TEXT('AVDELINGSNR')
     A            TERUND         8S 0       TEXT('RUNDTURNR')
     A            TERUNM         8S 0       TEXT('MIN.TURNR')
     A          K TEAVD
