     A*___________________________
     A* SYSPED / Firmaopplysninger
     A*"""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TELLFAR
     A            FIFIRM    R               REFFLD(FI)
     A            FIFNR     R               REFFLD(FN)
     A          K FIFIRM
