     A*____________________________
     A* SYSPED / AWB-NR. FOR FLY-IMPORT/EKSPORT
     A*""""""""""""""""""""""""""""
     A*                                     REF(SR)
     A          R TELLAR
     A            TEASTA         1          TEXT('STATUS')
     A            TEAUNI         2          TEXT('UNIK KODE  AI/AE')
     A            TEAFNR         3S 0       TEXT('FLYSELSKAPSNR.')
     A            TEAFR1         9P 0       TEXT('AWBNR. FRA')
     A            TEATI1         9P 0       TEXT('AWBNR. TIL')
     A            TEAFR2         9P 0       TEXT('NESTE AWBNR. FRA')
     A            TEATI2         9P 0       TEXT('NESTE AWBNR. TIL')
     A            TEAXXX         6          TEXT('LEDIGE PLASSER')
     A            TEATAB         1          TEXT('ALT. TABNR')
     A            TEAACC        10          TEXT('ACCOUNTNR')
     A          K TEAUNI
     A          K TEAFNR
     A          K TEATAB
