     A*____________________________
     A* SYSPED / DESTINASJON
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TELLDER
     A            TEDST     R               REFFLD(ST)
     A            TEDSD     R               REFFLD(SD3)
     A            TEDNR     R               REFFLD(NR)
     A            TEDXXX         9          TEXT('LEDIGE PLASSER')
     A          K TEDSD
