     A*____________________________
     A* SYSPED / TRANSPORTØRS FERGEAVREGNING  VARELINJER
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TFAVVR
     A            FVTAVD    R               REFFLD(AVD)
     A                                      COLHDG('AVDELING TUR')
     A            FVTUNR    R               REFFLD(PRO)
     A                                      COLHDG('TUR (DELTUR)')
     A            FVTYP          1          COLHDG('TYPE AVR.LINJE')
     A            FVLNR          3P 0       COLHDG('LINJENR DENNE TYP')
     A            FVBNRB         7S 0       COLHDG('BILAGSNUMMER BUDSJ')
     A            FVVK      R               REFFLD(VK)
     A                                      COLHDG('VAREKODE')
     A            FVTXT         35          COLHDG('Freetext')
     A            FVPRO     R               REFFLD(TPR)
     A                                      COLHDG('percent')
     A            FVAVES         1          COLHDG('AVT./ESTIMAT')
     A            FVVAL     R               REFFLD(VAL)
     A                                      COLHDG('Valutakode')
     A            FVBL      R               REFFLD(BEL11)
     A                                      COLHDG('BELØP I VAL')
     A            FVBLL     R               REFFLD(BEL11)
     A                                      COLHDG('BELØP I LOK. VAL')
     A*
     A          K FVTAVD
     A          K FVTUNR
     A          K FVTYP
     A          K FVLNR
