     A*____________________________
     A* TOLLPOST WEBSERVICES
     A*""""""""""""""""""""""""""""
     A          R TGUSERR
     A            TGTRAN         8S 0       TEXT('TRANSPORTØR')
     A            TGKUNR         7          TEXT('KUNDENR')
     A            TGUSR         20          TEXT('BRUKER')
     A            TGPWD         20          TEXT('PASSORD')
     A            TGFRI         30          TEXT('FRITEKST')
     A            TGBUD          1          TEXT('BUDSJETTERE J/N')
     A            TGLIM          5S 2       TEXT('LIMIT %')
     A          K TGTRAN
     A          K TGKUNR
