     A*__________________________
     A* Tillatelse på turer
     A*""""""""""""""""""""""""""
     A          R TILLR                     PFILE(TILL)
     A          K TIPRO
