     A*__________________________________
     A* SYSPED / KJØRETILLATELSER
     A*""""""""""""""""""""""""""""""""""
     A          R TILLR                     PFILE(TILL)
     A          K TITYPE
     A          S TIAVD                     CMP(EQ 0)
