     A          R TKAREAR
     A            OMKODE        10          COLHDG('OMRÅDE KODE')
     A            OMBESK        20          COLHDG('BESKRIVELSE')
     A            OMLENV         9S 6       COLHDG('VESTRE (Len.gr) ')
     A            OMBREN         8S 6       COLHDG('NORDRE (Bre.gr) ')
     A            OMLENØ         9S 6       COLHDG('ØSTRE  (Len.gr) ')
     A            OMBRES         8S 6       COLHDG('SØNDRE (Bre.gr) ')
      *
     A          K OMKODE
