     A          R TKSGMR
     A            TGPRO          8S 0       COLHDG('TURNUMMER')
     A            TGDEL          1          COLHDG('X=SKAL DELETES')
     A            TGAVD          4S 0       COLHDG('AVDELING ')
     A            TGOPD          7S 0       COLHDG('OPPDRAGSNR')
     A            TGSN17        17          COLHDG('SENDNR PÅ PDA  ')
     A            TGAVNA        30          COLHDG('AVSENDER NAVN  ')
     A            TGAVA1        30          COLHDG('AVSENDER ADR 1 ')
     A            TGAVA2        30          COLHDG('AVSENDER ADR 2 ')
     A            TGAVA3        30          COLHDG('AVSENDER ADR 3 ')
     A            TGMONA        30          COLHDG('MOTTAKER NAVN  ')
     A            TGMOA1        30          COLHDG('MOTTAKER ADR 1 ')
     A            TGMOA2        30          COLHDG('MOTTAKER ADR 2 ')
     A            TGMOA3        30          COLHDG('MOTTAKER ADR 3 ')
     A            TGPLL          3S 0       COLHDG('ANTALL PALLER')
     A            TGNT           7S 0       COLHDG('ANTALL KOLLI')
     A            TGVKT          9S 0       COLHDG('BRUTTOVEKT')
     A            TGLM           4S 2       COLHDG('LASTEMETER ')
     A            TGM3           7S 3       COLHDG('KUBIKKMETER')
     A            TGHEKO         1          COLHDG('HENTES-KODE 3=HENTES')
     A            TGHETE        20          COLHDG('HEN-TERM BL=HOS AVS')
     A            TGLETE        20          COLHDG('LEV-TERM BL=HOS MOT')
     A            TGIN01        70          COLHDG('FRITEKST INFO01')
     A            TGIN02        70          COLHDG('FRITEKST INFO02')
     A            TGIN03        70          COLHDG('FRITEKST INFO03')
     A            TGIN04        70          COLHDG('FRITEKST INFO04')
     A            TGIN05        70          COLHDG('FRITEKST INFO05')
     A            TGIN06        70          COLHDG('FRITEKST INFO06')
     A            TGIN07        70          COLHDG('FRITEKST INFO07')
     A            TGIN08        70          COLHDG('FRITEKST INFO08')
     A            TGIN09        70          COLHDG('FRITEKST INFO09')
     A            TGIN10        70          COLHDG('FRITEKST INFO10')
     A            TGNNR         18          COLHDG('MRN.NR IMP')
     A            TGNLK          2          COLHDG('MRN LK')
     A            TGNGN         15          COLHDG('MRN GN')
     A            TGVLIN       750          COLHDG('VARELINJEINFO')
      *
     A            TGTUST         1          COLHDG('Turstatus')
     A            TGKOH          1          COLHDG('Org,Upd,Add,Bek')
     A            TGDTH          8S 0       COLHDG('DT HENTET siste')
     A            TGTIH          6S 0       COLHDG('TID HENT. siste')
     A            TGDTR          8S 0       COLHDG('DT REFR. siste')
     A            TGTIR          6S 0       COLHDG('TID REF. siste')
      *
     A          K TGPRO
     A          K TGDEL
     A          K TGAVD
     A          K TGOPD
