     A          R TKUSERR
     A            MAUSER        10          COLHDG('USER')
     A            MAMAPP        65          COLHDG('MAPPE')
      *
     A          K MAUSER
