     A*__________________________
     A* STEDSREGISTER TOLLPOST
     A*""""""""""""""""""""""""""
     A          R TPSOR
     A            TPSONE         3          COLHDG('SONENUMMER')
     A            TPREC          1          COLHDG('RECORDTYPE')
     A            TPBE01         4S 0       COLHDG('BELØP 1')
     A            TPBE02         4S 0       COLHDG('BELØP 1')
     A            TPBE03         4S 0       COLHDG('BELØP 1')
     A            TPBE04         4S 0       COLHDG('BELØP 1')
     A            TPBE05         4S 0       COLHDG('BELØP 1')
     A            TPBE06         4S 0       COLHDG('BELØP 1')
     A            TPBE07         4S 0       COLHDG('BELØP 1')
     A            TPBE08         4S 0       COLHDG('BELØP 1')
     A            TPBE09         4S 0       COLHDG('BELØP 1')
     A            TPBE10         4S 0       COLHDG('BELØP 1')
     A            TPBE11         4S 0       COLHDG('BELØP 1')
     A            TPBE12         4S 0       COLHDG('BELØP 1')
     A            TPBE13         4S 0       COLHDG('BELØP 1')
     A            TPBE14         4S 0       COLHDG('BELØP 1')
     A            TPBE15         4S 0       COLHDG('BELØP 1')
     A            TPBE16         4S 0       COLHDG('BELØP 1')
     A            TPBE17         4S 0       COLHDG('BELØP 1')
     A            TPBE18         4S 0       COLHDG('BELØP 1')
     A            TPBE19         4S 0       COLHDG('BELØP 1')
     A            TPBE20         4S 0       COLHDG('BELØP 1')
     A            TPBE21         4S 0       COLHDG('BELØP 1')
     A            TPBE22         4S 0       COLHDG('BELØP 1')
     A            TPBE23         4S 0       COLHDG('BELØP 1')
     A            TPBE24         4S 0       COLHDG('BELØP 1')
     A            TPBE25         4S 0       COLHDG('BELØP 1')
     A            TPBE26         4S 0       COLHDG('BELØP 1')
     A            TPBE27         4S 0       COLHDG('BELØP 1')
     A            TPBE28         4S 0       COLHDG('BELØP 1')
     A            TPBE29         4S 0       COLHDG('BELØP 1')
     A            TPBE30         4S 0       COLHDG('BELØP 1')
     A            TPBE31         4S 0       COLHDG('BELØP 1')
