     A*__________________________
     A* STEDSREGISTER TOLLPOST
     A*""""""""""""""""""""""""""
     A          R TPPNR
     A            TPFL01         8          COLHDG('FELT 01')
     A            TPPN           4          COLHDG('POSTNUMMER')
     A            TPNA          25          COLHDG('STEDSNAVN')
     A            TPFL02         6          COLHDG('FELT 02')
     A            TPBA           4          COLHDG('BASESTED')
     A            TPFL03         6          COLHDG('FELT 03')
     A            TPTO           4          COLHDG('TOLLSTED')
     A            TPES          10          COLHDG('E-STED')
     A            TPRS          10          COLHDG('R-STED')
     A            TPFSON         9          COLHDG('FRA FRAKTSONE')
     A            TPHF           3          COLHDG('HOVEDFRAKTSONE')
     A            TPFF           3          COLHDG('FORFRAKTSONE')
     A            TPVF           3          COLHDG('VIDEREFRAKTSONE')
     A            TPDU          15          COLHDG('DUMMY')
     A          K TPPN
