      *
     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 11 65 *NOMSGLIN)
     A                                      OVERLAY
     A          R SUBFIL                    SFL
     A            WSNR           1A  I  4  2VALUES(' ' '2' '4')
     A            TFTANR         6  0O  4  5
     A            TFTXT         35A  O  4 12
     A            TFMNGD        11  3O  4 48EDTCDE(4)
     A            TFKODE         2A  O  4 61
      *
     A          R SUBCTL                    SFLCTL(SUBFIL)
     A                                      SFLSIZ(0007)
     A                                      SFLPAG(0006)
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A  91N93N94                            ROLLUP(25)
     A                                      CA03(03 'Forrige')
     A                                      CA05(05 'Frisk')
     A                                      CA06(06 'LAG NY')
     A                                      CA12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/TR004D'
     A                                      COLOR(BLU)
     A                                  1 19'Vedlikehold av koder for følsom va-
     A                                      re'
     A                                      COLOR(WHT)
     A            ZRECNO         4S 0B  1 55SFLRCDNBR
     A                                      DSPATR(ND)
     A                                  2  2'Velg opsjon:   2=Endre  4=Slett'
     A                                      COLOR(BLU)
     A                                  3  2'Op Tariff Beskrivelse             -
     A                                                  Minst mengde Kode'
     A                                      COLOR(WHT)
      *
     A          R BUNN
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(10)
     A                                      CLRL(02)
     A  91N93N94                            ROLLUP(25)
     A                                      CA03(03 'Forrige')
     A                                      CA05(05 'Frisk')
     A                                      CA06(06 'LAG NY')
     A                                      CA12(12 'Forrige')
     A                                      OVERLAY
     A                                  1  2'F3/12=Avslutt   F5=Frisk   F6=Lag -
     A                                      ny'
     A                                      COLOR(BLU)
     A  30        MSGTXT        60A  O  2  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R NYWRK
     A                                      WINDOW(WINDOWSZ)
     A                                      OVERLAY
     A                                      CA03(03 'Forrige')
     A                                      CA05(05 'Frisk')
     A                                      CA06(06 'LAGE NY')
     A                                      CA12(12 'Forrige')
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'SYSPED/TR004D'
     A                                      COLOR(BLU)
     A                                  1 19'Vedlikehold av koder for følsom va-
     A                                      re'
     A                                      COLOR(WHT)
     A                                  2  2'Velg opsjon:   2=Endre  4=Slett'
     A                                      COLOR(BLU)
     A                                  3  2'Op Tariff Beskrivelse             -
     A                                                  Minst mengde Kode'
     A                                      COLOR(WHT)
     A                                 10  2'F3/12=Avslutt   F5=Frisk   F6=Lag -
     A                                      ny'
     A                                      COLOR(BLU)
     A  30        MSGTXT        60A  O 11  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VARELI
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(09)
     A                                      CLRL(03)
     A                                      CA12(12 'Forrige')
     A                                      OVERLAY
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'   Tariff Beskrivelse             -
     A                                                  Minst mengde Kode'
     A                                      COLOR(WHT)
     A            WSTANR         6  0B  2  5DSPATR(UL)
     A  90                                  DSPATR(RI)
     A  90
     AO 40N30                               DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSTXT         35A  B  2 12DSPATR(UL)
     A  89                                  DSPATR(RI)
     A  89
     AON40N30                               DSPATR(PC)
     A            WSMNGD        11  3B  2 48DSPATR(UL)
     A  88                                  DSPATR(RI)
     A  88                                  DSPATR(PC)
     A                                      EDTCDE(4)
     A            WSKODE         2A  B  2 61DSPATR(UL)
     A N30                              3  2'F12=Avbryt'
     A                                      COLOR(BLU)
     A  30        MSGTXT        60A  O  3  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
      *
     A          R VAREL3
     A                                      WINDOW(WINDOWSZ)
     A                                      SLNO(09)
     A                                      CLRL(03)
     A                                      CA12(12 'Forrige')
     A                                      OVERLAY
     A                                      CSRLOC(LINNBR     POSNBR)
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  2'   Tariff Beskrivelse             -
     A                                                  Minst mengde Kode'
     A                                      COLOR(WHT)
     A            TFTANR         6  0O  2  5DSPATR(UL)
     A                                      COLOR(WHT)
     A                                      DSPATR(PC)
     A            TFTXT         35A  O  2 12DSPATR(UL)
     A                                      COLOR(WHT)
     A            TFMNGD        11  3O  2 48DSPATR(UL)
     A                                      EDTCDE(4)
     A            TFKODE         2A  O  2 61DSPATR(UL)
     A                                  3  2'F12=Avbryt'
     A                                      COLOR(BLU)
