********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 JUSTERING PÅ POSISJONER
10XXX * 02 YBC PTF10 FONT
XXXXXX*XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
11XXX * 03 YBC PTF11 *IN38 SKAL IKKE BRUKES
11128 * 04 YBC PTF11 VEKT ER ENDRET FRA 9.0 TIL 11.3
********************************************************************
      *_________________________________
      * FØLGESEDDEL
      *"""""""""""""""""""""""""""""""""
     A          R TR014F1
     A N96N50     PFFM1         75      1  2
     A  96N50     PFFM12        75      1  2
      *
     A          R TR014F2
     A N96N50     PFFM2         75      1  2
     A  96N50     PFFM22        75      1  2
     A                                  2  9'REF.'
     A            THAVD          4  0   2 14EDTCDE(Z)
     A                                  2 18'/'
     A            THTDN          7  0   2 19EDTCDE(Z)
     A                                  2 26'/'
     A            THSG           3      2 27
     A            FSSO25        25      2 31
     A            THTINS        17      3 31
S03  A*N38        THTRDT         8  0   3 58EDTWRD('    .  .  ')
     A  50        XHTRNR        18      3 58BARCODE(CODE128 2 *HRI *HRZ +
     A                                      (*WIDTH 0.008) (*RATIO 3) X'02')
     A            THNAS         30      4 10
S01  A*           THDK           5      4 51
N01  A            THDK           5      4 52
     A            THADS1        30      5 10
     A            THPNS          9      6 10
S01  A*N29        XSIDEN         3  0   6 44EDTCDE(Z)
S01  A* 29                              6 45'---'
S01  A*N29        XSIDET         3  0   6 47EDTCDE(Z)
S01  A* 29                              6 48'---'
S01  A*N29                              6 51'---'
S01  A* 29        THLSTL         4  0   6 51EDTCDE(Z)
N01  A N29        XSIDEN         3  0   6 45EDTCDE(Z)
N01  A  29                              6 46'--'
N01  A N29        XSIDET         3  0   6 48EDTCDE(Z)
N01  A  29                              6 49'--'
N01  A N29                              6 52'---'
N01  A  29        THLSTL         4  0   6 52EDTCDE(Z)
     A            THPSS         24      7 10
     A            THLKS          2      7 36
     A            THVPOS         5  0   8 45EDTCDE(Z)
     A            THNTK          7  0   8 51EDTCDE(Z)
     A            THTINK        17      9 10
     A            THNAK         30     10 10
     A            THTSSD         8     10 46
     A            THTSLK         2     10 76
     A            THADK1        30     11 10
     A            THTSN1        35     11 46
     A            THPNK          9     12 10
     A            THTSN2        35     12 46
     A            THPSK         24     13 10
     A            THLKK          2     13 36
     A            THTSPN         9     13 46
     A            THTSPS        24     13 56
     A N41        XXALKT        17     16 46
     A  41                             16 49'-----'
     A N42        XXBLKT        17     18 64
     A  42                             18 64'-----'
     A N43        THTAID        27     20 10
     A  43                             20 10'-----'
     A N44        THTALK         2     20 38
     A  44                             20 38'--'
      *
     A          R TR014F3
     A    N29                          28 50'1'
     A     29                          28 49'--'
     A N27N29     TVVNT1         6  0  28 55EDTWRD('0    .  ')
     A  27N29                          28 55'----.--'
     A N27N29     TVVNT2         2  0  28 64
     A  27N29                          28 64'--'
     A    N29     TVMN          17     29 10
     A    N29     TVCNR         17     29 28
     A    N29     TVNT           5  0  30 10EDTCDE(Z)
     A    N29     TVEH           2     30 16
     A    N29                          30 18'/'
     A    N29     XVEHT         35     30 19
S04  A*   N29     TVVKTB         9  0  30 65EDTCDE(Z)
S04  A*    29     THVKB          9  0  30 65EDTCDE(Z)
N04  A    N29     TVVKTB        11  3  30 63EDTCDE(4)
N04  A     29     THVKB         11  3  30 63EDTCDE(4)
     A            TVVT          48     31 10
S04  A*   N29     TVVKTN         9  0  32 65EDTCDE(Z)
N04  A    N29     TVVKTN        11  3  32 63EDTCDE(4)
     A N45                             33 10'FØLSOM VARE(SGI):'
     A N45        TVFV           2     33 28
     A N45                             33 31'MENGDE:'
     A N45        TVFVNT        11  3  33 39EDTCDE(4)
     A            TVTDT          6     34 53
     A            TVTDR         20     34 60
     A            TVDO          26     36 10
     A            X2DTY         28     37 10
     A            TVDREF        20     37 39
     A            X2TLO         35     38 10
     A            X2EXKD         2     38 46
     A            TVEXLK         2     38 49
     A            TVMTXT        48     39 10
      *
     A          R TR014F4
     A                                 30 15'SE VARELISTE'
S04  A*           THVKB          9  0  30 65EDTCDE(Z)
N04  A            THVKB         11  3  30 63EDTCDE(4)
      *
     A          R TR014F5
N01   * ALLL SKAL HA EN POS. TIL HØYRE. INGEN MERKING
     A            THTINA        17     51 27
      * ALLE POSISJONER HAR FLYTTET EN PLASS TIL VENSTRE. INGEN MERKING
     A            THNAA         30     52 10
     A                                 52 58'NO'
     A            XKTXTC        16     52 61
     A            THADA1        30     53 10
     A            THPNA          9     54 10
     A                                 54 49'------'
     A            THTRDT         8  0  54 68EDTWRD('    .  .  ')
     A            THPSA         24     55 10
     A                                 55 34'FRITATT FOR UNDERSKRIFT'
     A            XHCNA1        12     55 58
     A            XHCNR1         6     55 73
     A            THLKA          2     56 10
     A            THDST         15     56 19
     A            XIDAG          8  0  56 36EDTWRD('    .  .  ')
     A            XHCNA2        10     56 59
     A            XHCNR2         6     56 73
      *
S02  A*         R TR014F6
S02  A*N50                             57  2'¤(12U¤(s0p25h0s0b4102T'
S02  A*           XKTXT1        25     58 20
S02  A*           XHTSD1         2     58 47
S02  A*           XKTXT2        25     58 50
S02  A*           XHTSD2         2     58 77
S02  A*           XKTXT3        25     58 80
S02  A*           XHTSD3         2     58108
S02  A*           XKTXT4        25     58111
S02  A*           XHTSD4         2     58139
S02  A*           XKTXT5        25     58142
S02  A*           XHTSD5         2     58169
S02  A*           XKTXT6        25     58172
S02  A*           XHTSD6         2     58198
S02  A*N50                             58203'¤(3@'
S02   *
N01   * ALLL SKAL HA TO POS. TIL HØYRE. INGEN MERKING
S02  A*         R TR014F6P                  FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XKTXT1        25     57 10
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XKTXT2        25     57 23
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XKTXT3        25     57 35
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XKTXT4        25     57 48
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XKTXT5        25     57 60
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XKTXT6        25     57 72
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XHTSD1         2     58 10
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XHTSD2         2     58 23
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XHTSD3         2     58 35
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XHTSD4         2     58 48
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XHTSD5         2     58 60
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
S02  A*           XHTSD6         2     58 72
S02  A*                                     FNTCHRSET(C0H20060 +
S02  A*                                     T1V10277)
N02  A          R TR014F6                   FONT(755 (*POINTSIZE 4.8))
N02  A            XKTXT1        25     57 10
N02  A            XKTXT2        25     57 22
N02  A            XKTXT3        25     57 34
N02  A            XKTXT4        25     57 46
N02  A            XKTXT5        25     57 58
N02  A            XKTXT6        25     57 70
N02  A            XHTSD1         2     58 10
N02  A            XHTSD2         2     58 22
N02  A            XHTSD3         2     58 34
N02  A            XHTSD4         2     58 46
N02  A            XHTSD5         2     58 58
N02  A            XHTSD6         2     58 70
N02   *
     A          R TR014F7
N01   * ALLL SKAL HA EN POS. TIL HØYRE. INGEN MERKING
     A N49        THGFT1        24     59 10
     A  49        THGFT2        35     59 10
     A            XHGBGI         2     59 51
     A            THGBGU         2     60 11
     A            XHGBGU        30     60 14
     A            THGKD          1  0  60 56
     A            XKTXTB        18     60 58
     A            XXTSB          2     60 77
     A N46                             60 70'*'
     A            XHDKR         35     62 15
     A N47        THDANT         4  0  63 15EDTCDE(Z)
     A  47                             63 15'--'
     A N47        THDFKD        20     64 15
     A  47                             64 15'--'
     A            THDDT          8  0  65 15EDTWRD('    .  .  ')
     A N46                             65 27'OMDIRIGERING FORBUDT'
     A N48                             66 27'BINDENDE REISERUTE'
     A N96        PFFM3         75     69  2
     A  96        PFFM32        75     69  2
