     A                                      DSPSIZ(24 80 *DS3)
     A          R PROMPT
     A                                      OVERLAY
     A                                      CF03(93 'Exit')
     A                                      CF04(94 'Prompt')
     A                                      CF09(99 'Retrieve')
     A                                      CF12(92 'Cancel')
     A                                  1  2'TR200D'
     A                                      COLOR(BLU)
     A                                  1 25'Reorganisering av NCTS'
     A                                      DSPATR(HI)
     A                                  3  2'Velg et alternativ:'
     A                                      COLOR(BLU)
     A                                  4 46'NCTS-import'
     A                                      COLOR(BLU)
     A                                  4 58'NCTS-eksport'
     A                                      COLOR(BLU)
     A                                  5  2'Flytt fra drift til fullstendig hi-
     A                                      storikk'
     A                                  5 46'01'
     A                                  5 58'11'
     A                                  6  2'Komprimer fra drift til historikk'
     A                                  6 46'02'
     A                                  6 58'12'
     A                                  7  2'Slett direkt fra drift'
     A                                  7 46'03'
     A                                  7 58'13'
     A                                  8  2'Frigjør plass etter pkt. 01-03,11--
     A                                      13'
     A                                  8 46'04'
     A                                  8 58'14'
     A                                 10  2'Komprimer fullstendig historikk'
     A                                 10 46'05'
     A                                 10 58'15'
     A                                 11  2'Slett fra fullstendig historikk'
     A                                 11 46'06'
     A                                 11 58'16'
     A                                 12  2'Frigjør plass etter pkt. 05,06,15,-
     A                                      16'
     A                                 12 46'07'
     A                                 12 58'17'
     A                                 14  2'Slett komprimerte historikk'
     A                                 14 46'08'
     A                                 14 58'18'
     A                                 15  2'Frigjør plass etter pkt. 08,18'
     A                                 15 46'09'
     A                                 15 58'19'
     A*                                17 46'TAST HELP OM DU ER I TVIL'
     A*                                     COLOR(RED)
     A                                 18  2'90. Avslutte'
     A                                 19  2'Valg eller kommando '
     A                                 20  2'===>'
     A            CMD          153A  B 20  7CHECK(LC)
     A  90                                  DSPATR(PC)
     A                                 22  2'F3=Gå ut   F4=Forespørsel   F9=Hen-
     A                                      t   F12=Forrige'
     A                                      COLOR(BLU)
     A          R MSGSFL                    SFL
     A                                      SFLMSGRCD(24)
     A            KEYVAR                    SFLMSGKEY
     A            PGMNAM                    SFLPGMQ
     A          R MSGCTL                    SFLCTL(MSGSFL)
     A                                      SFLSIZ(2)
     A                                      SFLPAG(1)
     A  88                                  SFLDSP
     A  88                                  SFLDSPCTL
     A  88                                  SFLEND
     A N88                                  SFLCLR
