      *__________________________________
      * SYSPED / TRACK TRACING
      *""""""""""""""""""""""""""""""""""
     A          R TRACKKR                   PFILE(TRACKK)
     A          K TKCLID
     A          K TKDATE
     A          K TKTIME
