     A*__________________________________
     A* SYSPED / TRACK TRACING
     A*""""""""""""""""""""""""""""""""""
     A* TTNAME = '*UNDEFINED' = SKAL FØLGES OPP VIA ESPED.
      * i så fall: TTEDEV = ny T&Tkode, TTEDRE=Arkivkode, Skannet dokumentasjon
     A          R TRACKFR                   PFILE(TRACKF)
     A          K TTNAME
     A          K TTACTI
     A          K TTDATE
     A          K TTTIME
