     A*__________________________________
     A* SYSPED / TRACK TRACING
     A*""""""""""""""""""""""""""""""""""
     A          R TRACKFR                   PFILE(TRACKF)
     A          K TTACTI
     A          K TTTEXT
