      *__________________________________
      * SYSPED / TRACK TRACING
      *""""""""""""""""""""""""""""""""""
     A          R TRACKKR                   PFILE(TRACKK)
     A          K TKAVD
     A          K TKOPD
     A          K TKFBNR
