     A*__________________________________
     A* SYSPED / TRACK TRACING
     A*""""""""""""""""""""""""""""""""""
     A* TTMANU BRUKES OGSÅ SOM STATUS,, S=IFTSTA SKAL (KANSKJE) SENDES
     A          R TRACKFR                   PFILE(TRACKF)
     A          K TTMANU
     A          K TTDATE
     A          K TTTIME
