********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10019 * 01 YBC PTF10 NYE FELTER FOR OVERSJØ-ORDRE
********************************************************************
     A*__________________________
     A* SYSPED / TRACK AND TRACE AVGANGS/ANK-TIDSPUNKT
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRACKTR                   TEXT('TRACK/TRACE ETD..')
     A            TXAVD     R               REFFLD(AVD)
     A                                      COLHDG('Dep')
     A            TXOPD     R               REFFLD(OPD)
     A                                      COLHDG('Order')
     A            TXFBNR    R               REFFLD(FRBN)
     A                                      COLHDG('Waybillno')
     A            TXETDD         8S 0       COLHDG('ETD Date')
     A            TXETDK         4S 0       COLHDG('ETD Hour')
     A            TXATDD         8S 0       COLHDG('ATD Date')
     A            TXATDK         4S 0       COLHDG('ATD Hour')
     A            TXETAD         8S 0       COLHDG('ETA Date')
     A            TXETAK         4S 0       COLHDG('ETA Hour')
     A            TXATAD         8S 0       COLHDG('ATA Date')
     A            TXATAK         4S 0       COLHDG('ATA Hour')
     A            TXEX1D         8S 0       COLHDG('EXTRA Date 1')
     A            TXEX1K         4S 0       COLHDG('EXTRA Hour 1')
     A            TXEX2D         8S 0       COLHDG('EXTRA Date 2')
     A            TXEX2K         4S 0       COLHDG('EXTRA Hour 2')
N01  A            TXOS01         8S 0       COLHDG('KLAR HOS LEVERANDØR')
N01  A            TXOS02         8S 0       COLHDG('FRIST FOR SHIPPING')
N01  A            TXOS03         8S 0       COLHDG('FRIST FOR ANKOMST')
N01  A            TXOS04         8S 0       COLHDG('SHIPPINGVINDU FRA')
N01  A            TXOS05         8S 0       COLHDG('SHIPPINGVINDU TIL')
N01  A            TXOS06         8S 0       COLHDG('ANKOMSTVINDU FRA')
N01  A            TXOS07         8S 0       COLHDG('ANKOMSTVINDU TIL')
N01  A            TXOS08         8S 0       COLHDG('LEDIG FOR OVERSJØ')
N01  A            TXOS09         8S 0       COLHDG('LEDIG FOR OVERSJØ')
N01  A            TXOS10         8S 0       COLHDG('LEDIG FOR OVERSJØ')
N02  A            TXETDD2        8S 0       COLHDG('ETD 2 Date')
N02  A            TXETDK2        4S 0       COLHDG('ETD 2 Hour')
N02  A            TXETD2K        1A         COLHDG('ETD 2 KODE')
N02  A            TXETAD2        8S 0       COLHDG('ETA 2 Date')
N02  A            TXETAK2        4S 0       COLHDG('ETA 2 Hour')
N02  A            TXETA2K        1A         COLHDG('ETA 2 KODE')
     A          K TXAVD
     A          K TXOPD
     A          K TXFBNR
