      *__________________________
      * SYSPED / TRACK AND TRACING-FILE
      *""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRACKKR                   TEXT('TRACK/TRACING')
     A            TKCLID        20A         COLHDG('KOLLI-ID')
     A            TKKODE         3A         COLHDG('TYPE')
     A            TKTEXT        70A         COLHDG('Text')
     A            TKUSER        10A         COLHDG('Logged by User')
     A            TKDATE         8S 0       COLHDG('Date Event')
     A            TKTIME         6S 0       COLHDG('Time Event')
     A            TKAVD     R               REFFLD(AVD)
     A                                      COLHDG('Dep')
     A            TKOPD     R               REFFLD(OPD)
     A                                      COLHDG('Order')
     A            TKFBNR    R               REFFLD(FRBN)
     A                                      COLHDG('Waybillno')
     A            TKSTYP         5A         COLHDG('STS TYPE,FELT')
     A            TKSPRO         8S 0       COLHDG('STS TUR/LØPENR')
