     A*__________________________
     A* SYSPED / TRACK AND TRACE AVGANGS/ANK-TIDSPUNKT
     A*""""""""""""""""""""""""""
     A          R TRACKTR                   PFILE(TRACKT)
     A          K TXETDD
     A          K TXAVD
     A          K TXOPD
