     A*__________________________________
     A* SYSPED / TRACK TRACING
     A*""""""""""""""""""""""""""""""""""
     A          R TRACKFR                   PFILE(TRACKF)
     A          K TTTUR
     A          K TTDATE
     A          K TTTIME
