     A*__________________________
     A* SYSPED400 TRANSPORTERS
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRANR
     A            VMFIRM    R               REFFLD(FI)
     A                                      COLHDG('Firmcode')
     A            VMTRAN    R               REFFLD(KN)
     A                                      COLHDG('trans.no')
     A            VMTRKU    R               REFFLD(KN)
     A                                      COLHDG('custno')
     A            VMTRLE    R               REFFLD(KN)
     A                                      COLHDG('suppno')
     A            VMINCR         1S 0
     A                                      COLHDG('Inv/cre')
     A            VMNAVN        30
     A                                      COLHDG('Name')
     A            VM0004        35
     A                                      COLHDG('Nodi Id Avsender')
     A            VM0010        35
     A                                      COLHDG('Nodi Id Mottaker')
     A            VM0035    R               REFFLD(N0035)
     A            VMPREF         3          COLHDG('Prefix Transportør')
     A            VMRECN         9S 0       COLHDG('Nr.tell. Transportør')
     A            VMRECM         9S 0       COLHDG('Nr.tell. Transp.maks')
     A            VMLAYO         2          COLHDG('IFTM Layout')
     A                                      TEXT('LG=L.GODS  TG=T.GLO')
     A            VMLMOM         4S 0       COLHDG('OMREGNINGSFAKTOR')
     A            VMM3OM         4S 0       COLHDG('OMREGNINGSFAKTOR')
     A            VMRAB          3S 1       COLHDG('RABATT')
     A            VMALFA        10          COLHDG('SØKEFELT FRA KUNDF')
     A            VMTKAT         1          COLHDG('Transportkategori')
     A            VMSTOP         1          COLHDG('Stoppkode')
     A            VMSTDA         8S 0       COLHDG('Stopp/frit.dato')
     A            VMTEXT        60          COLHDG('Fritekst')
     A            VMSNLA         2  0       TEXT('Landkode i sendingsnr')
     A            VMSNLE         5  0       TEXT('Leverandørnr i sendingsnr')
     A            VMINTP         7          TEXT('Prefix internett')
     A          K VMFIRM
     A          K VMTRAN
