     A*__________________________________
     A* SYSPED / TRANSPORTØRER KUNDENR
     A*""""""""""""""""""""""""""""""""""
     A          R TRANR                     PFILE(TRAN)
     A          K VMFIRM
     A          K VMTRKU
     A          K VMTRAN
