     A*____________________________
     A* SYSPED / TRANSPORTØRANREGNING ARBEIDSFIL - VARELINJER
     A*""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRAVVR
     A            TVTAVD    R               REFFLD(AVD)
     A                                      COLHDG('AVDELING TUR')
     A            TVTUNR    R               REFFLD(PRO)
     A                                      COLHDG('TUR (DELTUR)')
     A            TVTYP          1          COLHDG('TYPE AVR.LINJE')
     A*           TVLNR          3P 0       COLHDG('LINJENR DENNE TYP')
     A            TVLNR          5P 0       COLHDG('LINJENR DENNE TYP')
     A            TVBNRB         7S 0       COLHDG('BILAGSNUMMER BUDSJ')
     A            TVBNRK         7S 0       COLHDG('BILAGSNUMMER KOSTA')
     A            TVOAVD    R               REFFLD(AVD)
     A                                      COLHDG('AVDELING OPPDRAG')
     A            TVOPD     R               REFFLD(OPD)
     A                                      COLHDG('OPPDRAGSNUMMER')
     A            TVVK      R               REFFLD(VK)
     A                                      COLHDG('VAREKODE')
     A            TVTXT         35          COLHDG('Freetext')
     A            TVPRO     R               REFFLD(TPR)
     A                                      COLHDG('percent')
     A            TVAVES         1          COLHDG('AVT./ESTIMAT/UTFAKT')
     A            TVOPKO         1          COLHDG('OPPDAT.STATUS')
     A            TVVAL     R               REFFLD(VAL)
     A                                      COLHDG('Valutakode')
     A            TVBL      R               REFFLD(BEL11)
     A                                      COLHDG('BELØP I VAL')
     A            TVBLL     R               REFFLD(BEL11)
     A                                      COLHDG('BELØP I LOK. VAL')
     A            TVBLLB    R               REFFLD(BEL11)
     A                                      COLHDG('BRUTTO BELØP LOK')
     A            TVFRA          5          COLHDG('FRASTED ')
     A            TVTIL          5          COLHDG('TILSTED ')
     A            TVST           1          COLHDG('AVREGNET-STATUS')
     A            TVFAKT    R               REFFLD(FN)
     A                                      COLHDG('Fakt(KR.NOTA).nr')
     A*
     A          K TVTAVD
     A          K TVTUNR
     A          K TVTYP
     A          K TVLNR
