     A*_________________________________________
     A* SYSPED / HEADING INFOR TRANSPORTØRKREDITNOTA (AVREGN.)
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R TRAVHR                    PFILE(TRAVH)
     A          K THST
     A          K THFAKT
     A          K THRTNR
     A          K THKDM
     A          K THTAVD
     A          K THTUNR
