     A          R TRAVVR                    PFILE(TRAVV)
     A          K TVTAVD
     A          K TVTUNR
     A          K TVTYP
     A          K TVOAVD
     A          K TVOPD
