     A          R TRAVVR                    PFILE(TRAVV)
     A          K TVTAVD
     A          K TVTUNR
     A          K TVST
     A          K TVOAVD
     A          K TVOPD
     A          K TVTYP
