     A* VED GODSKRIVING - TXT STARTER MED TURNR
     A          R TRAVVR                    PFILE(TRAVV)
     A          K TVTAVD
     A          K TVTUNR
     A          K TVST
     A          K TVFAKT
     A          K TVTXT
