     A*_________________________________________
     A* SYSPED / HEADING INFOR AVREGN SORT PÅ RUNDTUR
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R TRAVHR                    PFILE(TRAVH)
     A          K THRTNR
     A          K THKDM
     A          K THTAVD
     A          K THTUNR
