     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, SIGNATUR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRIHR                     PFILE(TRIH)
     A                                      TEXT('SIGNATUR')
     A          K TIAVD
     A          K TISG
     A          K TIDT
