     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRIHR                     PFILE(TRIH)
     A          K TIAVD
     A          K TIST
