     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, Regdato
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRIHR                     PFILE(TRIH)
     A                                      TEXT('Regdato')
     A          K TIAVD
     A          K TIDT
