      *_______________________________________
      * SYSPED / Tolldekl. TRANSITT FORSEGLING
      *"""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRIHFSR
     A            TIAVD          4S 0       COLHDG('AVDELING')
     A            TITDN     R               REFFLD(TDN)
     A            TIDFKD        20A         COLHDG('FORSEGLING-ID KODE')
     A            TIDFSK         2A         COLHDG('FORSEGLING-ID SPRÅK')
     A            NIDFKD        20A         COLHDG('NY FORS.-ID KODE')
     A            NIDFSK         2A         COLHDG('NY FORS.-ID SPRÅK')
      *
     A          K TIAVD
     A          K TITDN
