     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, NÄRINGSLIV
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRIHR                     PFILE(TRIH)
     A          K TIAVD
     A          K TIKN
     A          K TIDT
