      *__________________________________________________
      * SYSPED / Tolldekl. TRANSIT Varelinjer CONTAINERNR
      *""""""""""""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRIVCNR
     A            TVAVD     R               REFFLD(AVD)
     A            TVTDN     R               REFFLD(TDN)
     A            TVLI      R               REFFLD(LI5)
     A            TVCNR         17A         COLHDG('CONTAINERNR')
     A          K TVAVD
     A          K TVTDN
     A          K TVLI
