     A*____________________________________
     A* SYSPED / KODEREG. FOR TRANSITTERING
     A*""""""""""""""""""""""""""""""""""""
     A          R TRKODFR
     A            TKUNIK         3A         COLHDG('UNIK KODE')
     A            TKKODE        10A         COLHDG('KODE')
     A            TKTXTN        35A         COLHDG('NORSK TEKST')
     A            TKTXTE        35A         COLHDG('ENGELSK TEKST')
     A            TKAVG          1A         COLHDG('AVGANG')
     A            TKANK          1A         COLHDG('ANKOMST')
     A            TKTRS          1A         COLHDG('TRANSITT')
