     A          R TRTRANR
     A            TTTRNR         8S 0       COLHDG('TRANSP.NR')
     A            TTKOMS         4S 2       COLHDG('AGENT-KOMM-SATS')
     A            TTTERM         5S 2       COLHDG('AGENT TERM.BEL./TONN')
     A            TTIKFB         1          COLHDG('X,N = IKKE FB-trekk')
     A          K TTTRNR
