      *__________________________________
      * SYSPED / TET-EKSPORT, GARANTI
      *""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRUGHR
     A            TGST      R               REFFLD(ST)
     A            TGGNR         24A         COLHDG('GARANTINR')
     A            TGGTY          1S 0       COLHDG('GARATITYPE')
     A            TGGVK          3A         COLHDG('VALUTA')
     A            TGGBL         11S 0       COLHDG('GARANTIBELØP')
     A            TGGBLB        11S 0       COLHDG('BRUKT GARANTIBELØP')
     A            TGKNA     R               REFFLD(KN)
     A                                      COLHDG('HOVEDANSVARLIG')
     A            TGTINA        17A         COLHDG('TIN-KODE ANSVARLIG')
     A            TGNAA     R               REFFLD(NA)
     A                                      COLHDG('Navn ANSVARLIG')
     A            TGADA1    R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 ANSVARLIG')
     A            TGPNA          9A         COLHDG('POSTNR ANSVARLIG')
     A            TGPSA         24A         COLHDG('POSTSTED ANSVARLIG')
     A            TGLKA          2A         COLHDG('LANDKODE ANSVARLIG')
     A            TGTSD          8A         COLHDG('GARANTI TOLLSTED')
     A            TGAKNY         4A         COLHDG('ADGANGSKODE NY')
     A            TGAKGM         4A         COLHDG('ADGANGSKODE GAMMEL')
     A            TGUSR         10A         COLHDG('BRUKER')
     A            TGDT      R               REFFLD(DT)
     A                                      COLHDG('SENDINGSDATO')
     A            TGDTR     R               REFFLD(DT)
     A                                      COLHDG('REGISTRERINGSDATO')
     A            TGPRM          3S 0       COLHDG('VARSLING % BRUKT')
     A            TGRN          11S 0       COLHDG('RECORDNR')
     A            TGGFV          1A         COLHDG('GJELD FORSOMME VARE')
      *
     A          K TGGNR
