     A                                      REF(SR)
     A          R TRUGLGR
     A            TLGNR         24A         COLHDG('GARANTINR')
     A            TLRN          11S 0       COLHDG('RECORDNR')
     A            TLUSR         10A         COLHDG('BRUKER')
     A            TLDT      R               REFFLD(DT)
     A            TLTM      R               REFFLD(TM)
      *
     A            TLFST     R               REFFLD(ST)
     A            TLFGTY         1S 0       COLHDG('GARATITYPE')
     A            TLFVK          3A         COLHDG('VALUTA')
     A            TLFBL         11S 0       COLHDG('GARANTIBELØP')
     A            TLFBLB        11S 0       COLHDG('BRUKT GARANTIBELØP')
     A            TLFKNY         4A         COLHDG('ADGANGSKODE NY')
     A            TLFKGM         4A         COLHDG('ADGANGSKODE GAMMEL')
     A            TLFPRM         3S 0       COLHDG('VARSLING % BRUKT')
     A            TLFFV          1A         COLHDG('GJELD FORSOMME VARE')
      *
     A            TLEST     R               REFFLD(ST)
     A            TLEGTY         1S 0       COLHDG('GARATITYPE')
     A            TLEVK          3A         COLHDG('VALUTA')
     A            TLEBL         11S 0       COLHDG('GARANTIBELØP')
     A            TLEBLB        11S 0       COLHDG('BRUKT GARANTIBELØP')
     A            TLEKNY         4A         COLHDG('ADGANGSKODE NY')
     A            TLEKGM         4A         COLHDG('ADGANGSKODE GAMMEL')
     A            TLEPRM         3S 0       COLHDG('VARSLING % BRUKT')
     A            TLEFV          1A         COLHDG('GJELD FORSOMME VARE')
      *
