     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, KJØPER
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRUHR                     PFILE(TRUH)
     A          K THAVD
     A          K THKNK
     A          K THDT
