     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, TUR
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRUHR                     PFILE(TRUH)
     A          K THAVD
     A          K THPRO
