      *___________________________________________
      * SYSPED / Tolldekl. TRANSITT, SELGER
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R TRUHR                     PFILE(TRUH)
     A          K THKNS
     A          K THDT
     A          K THAVD
     A          K THTDN
