     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, STATUS
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRUHR                     PFILE(TRUH)
     A          K THAVD
     A          K THST
