     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSIT, Regdato
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRUHR                     PFILE(TRUH)
     A                                      TEXT('Regdato')
     A          K THAVD
     A          K THDT
