      *______________________________________
      * SYSPED / Tolldekl. TRANSIT LASTELISTE
      *""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRUHLR
     A            TLAVD     R               REFFLD(AVD)
     A            TLTDN     R               REFFLD(TDN)
     A            TLAVD2    R               REFFLD(AVD)
     A                                      COLHDG('AVD. FOR HENTET OPD')
     A            TLTDN2    R               REFFLD(TDN)
     A                                      COLHDG('OPD. FOR HENTET OPD')
     A            TLTXT         50          COLHDG('FRITEKST')
     A            TLTLKU         1          COLHDG('KUN UTFØRSEL')
     A          K TLAVD
     A          K TLTDN
