      *___________________________________________
      * SYSPED / Tolldekl. TRANSIT, KJØPER
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R TRUHR                     PFILE(TRUH)
     A          K THKNK
     A          K THDT
     A          K THAVD
     A          K THTDN
