      *___________________________________________
      * SYSPED / Tolldekl. TRANSITT, SIGNATUR
      *"""""""""""""""""""""""""""""""""""""""""""
     A          R TRUHR                     PFILE(TRUH)
     A          K THSG
     A          K THDT
     A          K THAVD
     A          K THTDN
