     A*___________________________________________
     A* SYSPED / Tolldekl. TRANSITT, ARBEIDSSTASJON
     A*"""""""""""""""""""""""""""""""""""""""""""
     A          R TRUHR                     PFILE(TRUH)
     A                                      TEXT('ARBEIDSSTASJON')
     A          K THWS
     A          K THST
