      *_____________________________________
      * SYSPED / Tolldekl. TRANSIT Varelinjer
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRUVFVR
     A            TVAVD     R               REFFLD(AVD)
     A            TVTDN     R               REFFLD(TDN)
     A            TVLI      R               REFFLD(LI5)
     A            TVTKBM         1A         COLHDG('TR.KOST. BET.MÅTE')
     A            TVKREF        70A         COLHDG('KOMMERSIELT REF.NR')
     A            TVFGKD         5A         COLHDG('FARLIG GODS KODE')
      * AVSENDER SIKKERHET
     A            TVKNSS    R               REFFLD(KN)
     A                                      COLHDG('Kundenr Selger')
     A            TVNASS    R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            TVADSS1   R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Selger')
     A            TVPNSS         9A         COLHDG('POSTNR SELGER')
     A            TVPSSS        24A         COLHDG('POSTSTED SELGER')
     A            TVLKSS         2A         COLHDG('LANDKODE SELGER')
     A            TVSKSS         2A         COLHDG('SPRÅKKODE SELGER')
     A            TVTINSS       17A         COLHDG('TIN-KODE SELGER')
      * MOTTAKER SIKKERHET
     A            TVKNKS    R               REFFLD(KN)
     A                                      COLHDG('Kundenr Kjøper')
     A            TVNAKS    R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            TVADKS1   R               REFFLD(AD)
     A                                      COLHDG('Adresse-1 Kjøper')
     A            TVPNKS         9A         COLHDG('POSTNR KJØPER')
     A            TVPSKS        24A         COLHDG('POSTSTED KJØPER')
     A            TVLKKS         2A         COLHDG('LANDKODE KJØPER')
     A            TVSKKS         2A         COLHDG('SPRÅKKODE KJØPER')
     A            TVTINKS       17A         COLHDG('TIN-KODE KJØPER')
     A          K TVAVD
     A          K TVTDN
     A          K TVLI
