     A*__________________________________________
     A* SYSPED / Tolldekl. TRANSITT VARELINJE
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R TRUVR                     PFILE(TRUV)
     A          K TVAVD
     A          K TVTDN
     A          K TVVNT
     A          K TVDK
