      *__________________________________________________
      * SYSPED / Tolldekl. TRANSIT Varelinjer MERKE & NR
      *""""""""""""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRUVMNR
     A            TVAVD     R               REFFLD(AVD)
     A            TVTDN     R               REFFLD(TDN)
     A            TVLI      R               REFFLD(LI5)
     A            TVMN          17A         COLHDG('31 MERKE & NR')
     A            TVMNSK         2A         COLHDG('31 MERKE & NR SPRÅK')
     A          K TVAVD
     A          K TVTDN
     A          K TVLI
