     A*__________________________________________
     A* SYSPED / Tolldekl. TRANSITT VARELINJE (VARENR.)
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R TRUVR                     PFILE(TRUV)
     A          K TVVNT
