********************************************************************
      * XKSTERN REF TET EKSPORT
     A*___________________
     A* SYSPED / EKSTERN REF
     A*"""""""""""""""""""
     A          R TRXREFR
     A            TRXAVD         4S 0       COLHDG('AVDELING')
     A            TRXOPD         7S 0       COLHDG('OPDNR')
     A            TRXLI          5S 0       COLHDG('LINJENR')
     A            TRXEXT        35          COLHDG('EKSTERN REF')
     A          K TRXAVD
     A          K TRXOPD
     A          K TRXLI
