     A          R SVX014F2
     A            XHTRNR2       18      4 15BARCODE(CODE128 3 *HRI *HRZ +
     A                                      (*WIDTH 0.010) (*RATIO 3.00) X'02')
     A                                 11 12'BENYTTET PRINTER-OVERSTYRING:'
     A            UCMD1        100     12 15
     A            UCMD2        100     13 15
     A            UCMD3        100     14 15
     A            UCMD4        100     15 15
     A            UCMD5        100     16 15
     A            UCMD6        100     17 15
