     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R BILDE01
     A                                      CF03(03 'Avslutt program')
     A                                  1 62DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(GRN)
     A                                  1 73TIME
     A                                      COLOR(GRN)
     A                                  3 10'Test av fraktberegning'
     A                                      COLOR(WHT)
     A                                  5 10'Avdeling'
     A            UAVD           4S 0B  5 26
     A                                  6 10'oppdrag'
     A            UOPD           7S 0B  6 26
     A                                  7 10'Gebyr'
     A            UGEB           3A  B  7 26
     A                                  8 10'Kunde'
     A            UKNR           8S 0B  8 26
     A                                  9 10'kode S/K'
     A            USK            1A  B  9 26
     A                                 10 10'Avtnr'
     A            UAVTN          1S 0B 10 26
     A                                 11 10'Komplett'
     A            UKOM           1S 0B 11 26
     A                                 12 10'Retur A/B'
     A            UKDA           1A  B 12 26
     A                                 13 10'Retur Beløp'
     A            PRBELØ         9Y 2B 13 26EDTWRD('       .  ')
     A                                 14 10'VALKOD'
     A            WSVAL          3   B 14 26
     A                                 15 10'VALBEL'
     A            WSVALB        13  2B 15 26EDTWRD('           .  ')
     A                                 23  2MSGCON(018 DIV0020 *LIBL/SYMSGF)
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A            MSGNR          7A  P
