     A*__________________________
     A* SYSPED400 FERRIES TO TRIPS
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TUFER
     A            FEFIRM    R               REFFLD(KN)
     A                                      COLHDG('Ferryfirm')
     A            FEFROM    R               REFFLD(SD)
     A                                      COLHDG('From place')
     A            FETO      R               REFFLD(SD)
     A                                      COLHDG('To place')
     A            FELENG         3          COLHDG('LENGTH')
     A            FEDATE    R               REFFLD(DT)
     A                                      COLHDG('DATE')
     A            FECURR    R               REFFLD(VAL)
     A                                      COLHDG('Currency')
     A            FEPRI1    R               REFFLD(BEL13)
     A                                      COLHDG('Price buyer')
     A            FEPRI2    R               REFFLD(BEL13)
     A                                      COLHDG('Price sales')
     A            FEPRIN    R               REFFLD(BEL13)
     A                                      COLHDG('Pr. sales-local Cur.')
     A            FEAVD          4S 0       COLHDG('AVD')
     A            FETUR          8S 0       COLHDG('TUR')
     A            FETREF         7P 0       COLHDG('REFNR BUDSJETT')
     A            FERUND         8S 0       COLHDG('RUNDTUR')
     A            FEDAT2    R               REFFLD(DT)
     A                                      COLHDG('DATE AVGANG')
     A            FETIME         4S 0       COLHDG('AVGANG KLOKKA')
     A            FEKUNR    R               REFFLD(KN)
     A                                      COLHDG('Kundnr')
     A            FEFAKT    R               REFFLD(FN)
     A                                      COLHDG('Fakt.nr')
     A            FEOPKO    R               REFFLD(ST)
     A                                      COLHDG('Status')
     A            FEJOUR    R               REFFLD(JNR)
     A                                      COLHDG('journalnr')
     A            FECC      R               REFFLD(DTC)
     A                                      COLHDG('periode.århundre')
     A            FEÅR      R               REFFLD(DTÅ)
     A                                      COLHDG('periode.år')
     A            FEMND     R               REFFLD(DTM)
     A                                      COLHDG('periode.mnd')
     A            FEDATO    R               REFFLD(DT)
     A                                      COLHDG('fakturadato')
     A            FEDAFF    R               REFFLD(DT)
     A                                      COLHDG('forfallsdato')
     A            FEBILN        10          COLHDG('BILNUMMER')
     A          K FEAVD
     A          K FETUR
     A          K FEFROM
     A          K FETO
     A          K FELENG
     A          K FEDATE
