     A*_________________________________________
     A* SYSPED / FERJEOVERFARTER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R TUFER                     PFILE(TUFE)
     A          K FETUR
