     A*_________________________________________
     A* SYSPED / FERJEOVERFARTER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R TUFER                     PFILE(TUFE)
     A          K FEOPKO
     A          K FEAVD
     A          K FETUR
     A          K FEBILN
     A          K FEDAT2
     A          K FEFROM
     A          K FETO
