     A*_________________________________________
     A* SYSPED / FERJEOVERFARTER
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R TUFER                     PFILE(TUFE)
     A          K FEFIRM
     A          K FEDAT2
     A          K FEFROM
     A          K FETO
