     A*__________________________
     A* SYSPED400 FERRIES TO TRIPS - EXTRA COSTS
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TUFETR
     A            FETBN3         7S 0       COLHDG('SLAVE AV BUDSJ.B.NR.')
     A            FETLN3         2S 0       COLHDG('LØPENR SLAVELINJER.')
     A            FETVAL    R               REFFLD(VAL)
     A                                      COLHDG('Currency')
     A            FETPR2    R               REFFLD(BEL13)
     A                                      COLHDG('Price sales')
     A            FETPRN    R               REFFLD(BEL13)
     A                                      COLHDG('Pr.sales-loc.Cur.')
     A            FETBNR         7S 0       COLHDG('BILAGSNR BUDSJ')
     A          K FETBN3
     A          K FETLN3
