     A          R TURERR                    PFILE(TURER)
     A          K TUKNT2
     A          K TURACC
     A          K TURAAR
     A          K TURMND
     A          K TUBILN
