     A          R TURERR                    PFILE(TURER)
     A          K TURACC
     A          K TURAAR
     A          K TURMND
     A          K TUAVD
     A          K TUPRO
