     A          R TURERR                    PFILE(TURER)
     A          K TUAVRE
     A          K TUKNT
     A          K TUDT
     A          K TUBILN
