     A          R TURERR                    PFILE(TURER)
     A          K TUBILK
     A          K TURACC
     A          K TURAAR
     A          K TURMND
