     A          R TURERR                    PFILE(TURER)
     A          K TUETD
     A          K TUSTEF
     A          O TUATD                     COMP(NE 0)
