     A*____________________________________________________________
     A* SYSPED / Logg over endrede statuskoder på TURER-REG.
     A*""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TUSTSR
     A            SSDT      R               REFFLD(DT)
     A            SSTM      R               REFFLD(TM)
     A            SSAVD     R               REFFLD(AVD)
     A            SSTUR     R               REFFLD(PRO)
     A            SSUSR     R               REFFLD(USR)
     A            SSSG      R               REFFLD(SG)
     A            SSSTG     R               REFFLD(ST)
     A                                      COLHDG('Status gammel')
     A            SSSTN     R               REFFLD(ST)
     A                                      COLHDG('Status ny')
     A          K SSDT
     A          K SSTM
     A          K SSAVD
     A          K SSTUR
     A          K SSUSR
