      *
     A          R TVI28FP1
     A                                      HIGHLIGHT
     A            KFMT1         75      1  1
     A            KFMT2         75      2  1
     A                                  5 22'MELDING OM FORHÅNSSENDT'
     A                                      UNDERLINE
     A                                  7 22'   TVINN-DEKLARASJON   '
     A                                      UNDERLINE
     A                                 12  2'Deklarantnummer . . . . . . . . :'
     A            SIRG          11A    12 42
     A                                 14  2'Ekspedisjonstollsted  . . . . . :'
     A            XFTXT         35A    14 42
     A                                 16  2'Dato for sending av deklarasjon.:'
     A            M0068A    R          16 42REFFLD(M0068A EDIM)
     A                                      EDTWRD('    .  .  ')
     A                                 18  2'Sekvensenummer  . . . . . . . . :'
     A            M0068B    R          18 42REFFLD(M0068B EDIM)
     A                                      EDTCDE(Z)
     A                                 20  2'Versjonsnummer  . . . . . . . . :'
     A            M0068C    R          20 42REFFLD(M0068C EDIM)
     A                                      EDTCDE(Z)
     A                                 22  2'Kolliantall . . . . . . . . . . :'
     A            SINTK          7  0  22 42EDTCDE(Z)
     A                                 24  2'Mottaker  . . . . . . . . . . . :'
     A            SINAK         30A    24 42
     A                                 26  2'Vår referanse . . . . . . . . . :'
     A            MAVD      R          26 42REFFLD(MAVD EDIM)
     A                                      EDTCDE(Z)
     A                                 26 46'/'
     A            MTDN      R          26 47REFFLD(MTDN EDIM)
     A                                      EDTCDE(Z)
     A                                 26 54'/'
     A            SISG      R          26 55REFFLD(SISG SADH)
     A                                 28  2'Fakturadato/nummer  . . . . . . :'
     A            SIFID          8  0  28 42EDTWRD('    .  .  ')
     A                                 28 52'/'
     A            SIFIF         17A    28 53
     A                                 33  2'Deklarant . . . . . . . . . . . :'
     A            SINAD         30A    33 42
     A                                 35  2'Dato  . . . . . . . . . . . . . :'
     A            ELKDT          8  0  35 42EDTWRD('    .  .  ')
     A                                 37  2'Signatur  . . . . . . . . . . . :'
     A                                 37 42'__________________________________'
     A                                 42  2'Til bruk for Tollvesenet:'
     A                                      UNDERLINE
     A                                 44  2'Kvittering for at sendingen er'
     A                                 45  2'fortollet ved grense.'
     A                                 45 42'__________________________________'
     A                                 47  2'Dato/Underskrift.'
     A                                 47 42'__________________________________'
