     A                                      REF(*LIBL/EDIM)
     A          R TVI70PA                   SKIPB(3)
     A                                      HIGHLIGHT
     A                                     2'TVINN  Statistikk på meldinger'
     A                                    45DATE EDTCDE(Y)
     A                                    54TIME EDTWRD('0 :  :  ')
     A                                    64'TVI70P Side:'
     A                                    +1PAGNBR EDTCDE(Z)
     A                                     2'Seleksjon på Avd:'
     A                                      SPACEB(2)
     A            ZAVD      R             20REFFLD(MAVD)
     A                                      EDTCDE(Z)
     A                                    26'Fra:'
     A            ZDTF      R             31REFFLD(MDT)
     A            ZTMF      R             40REFFLD(MTM)
     A                                      EDTWRD('0 :  :  ')
     A                                    50'Til:'
     A            ZDTT      R             55REFFLD(MDT)
     A            ZTMT      R             64REFFLD(MTM)
     A                                      EDTWRD('0 :  :  ')
     A                                    30'_______Sent______'
     A                                      SPACEB(2)
     A                                    52'_____Mottatt_____'
     A                                    71'___Svar___'
     A                                     3'Avd'
     A                                      SPACEB(1)
     A                                     8'Tdeknr'
     A                                    15'Dato'
     A                                    21'Sekvens'
     A                                    29'V'
     A                                    32'I/E'
     A                                    36'Fun'
     A                                    40'Dato'
     A                                    47'Tid'
     A                                    52'Fun'
     A                                    57'Dato'
     A                                    65'Tid'
     A                                    71'Dgr'
     A                                    75'Tim'
     A                                    78'Min'
     A                                      SPACEA(1)
     A          R TVI70PB                   SPACEB(1)
     A            MAVD      R              2EDTCDE(Z)
     A            MTDN      R              7EDTCDE(Z)
     A            X0068A         6  0     15
     A            M0068B    R             22EDTCDE(Z)
     A            M0068C    R             29EDTCDE(Z)
     A            WSIMEX         3        32
     A            X1N07          3        36
     A            XDT6           6  0     40
     A            XTM            4  0     47EDTWRD('  :  ')
     A            Y1N07          3        53
     A            YDT6           6  0     57
     A            YTM            4  0     65EDTWRD('  :  ')
     A            ÅDGR           3  0     71EDTWRD(' 0 ')
     A            ÅTIM           3  0     75EDTWRD(' 0 ')
     A            ÅMIN           2  0     79EDTWRD('0 ')
     A          R TVI70PØ                   SPACEB(2)
     A                                     2'--------------------------  S i s +
     A                                       t e  S i d e n  ------------------+
     A                                       ------------'
