     A                                      REF(SR)
     A          R TVINEF
     A            E9705     R               REFFLD(N9705)
     A                                      COLHDG('Kode')
     A            E4440     R               REFFLD(N4440)
     A                                      COLHDG('Tollvesenets tekst')
     A          K E9705
