     A                                      REF(SR)
     A          R TVINDF
     A            D0068A    R               REFFLD(N0068A)
     A            D0068B    R               REFFLD(N0068B)
     A          K D0068A
