********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 MELDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A                                      REF(SR)
     A          R TVINFF
S01  A*           FMN       R               REFFLD(N0036)
S01  A*                                     COLHDG('Meldingsnummer')
N01  A            FMN       R               REFFLD(MN)
     A            FLN       R               REFFLD(LI5)
     A            F0077     R               REFFLD(N0077)
     A            F4815     R               REFFLD(N4815)
     A            F0078A    R               REFFLD(N0078)
     A            F0078B    R               REFFLD(N0078)
     A            F0078C    R               REFFLD(N0078)
     A            F0078D    R               REFFLD(N0078)
     A            F0078E    R               REFFLD(N0078)
     A          K FMN
     A          K FLN
