     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      HLPDOC('STD' 'HELPNU' 'HLP400')
     A                                      HELP
     A          R TVINFOA
     A                                  1  2'TVINN'
     A                                      COLOR(BLU)
     A                                  1 34'Informasjon'
     A                                      COLOR(WHT)
     A                                  1 73'TVINFO'
     A                                      COLOR(BLU)
     A                                  1 80'A'
     A                                      COLOR(BLU)
     A                                  3 32'Skisse over RJE'
     A                                      COLOR(WHT)
     A                                  4  2'Trykk Enter for å fortsette:'
     A                                      COLOR(BLU)
     A                                  6 17'               '
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  6 47'               '
     A                                      COLOR(PNK)
     A                                      DSPATR(RI)
     A                                  7 17' '
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  7 31' '
     A                                      COLOR(YLW)
     A                                      DSPATR(RI)
     A                                  7 47' '
     A                                      COLOR(PNK)
     A                                      DSPATR(RI)
     A                                  7 61' '
     A                                      COLOR(PNK)
     A                                      DSPATR(RI)
     A                                  8 17' '
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  8 20'OS/400'
     A                                      COLOR(YLW)
     A                                  8 27'                         '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  8 53'QRJE'
     A                                      COLOR(PNK)
     A                                  8 61' '
     A                                      COLOR(PNK)
     A                                      DSPATR(RI)
     A                                  9 17' '
     A                                      DSPATR(RI)
     A                                      COLOR(YLW)
     A                                  9 27' '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  9 31' '
     A                                      COLOR(YLW)
     A                                      DSPATR(RI)
     A                                  9 47' '
     A                                      COLOR(PNK)
     A                                      DSPATR(RI)
     A                                  9 51' '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                  9 61' '
     A                                      COLOR(PNK)
     A                                      DSPATR(RI)
     A                                 10 17'               '
     A                                      COLOR(YLW)
     A                                      DSPATR(RI)
     A                                 10 47'               '
     A                                      COLOR(PNK)
     A                                      DSPATR(RI)
     A                                 11 27' '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 11 36'SYSPED'
     A                                      COLOR(WHT)
     A                                 11 51' '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 12 27' '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 12 47'               '
     A                                      COLOR(RED)
     A                                      DSPATR(RI)
     A                                 13 27' '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 13 47' '
     A                                      COLOR(RED)
     A                                      DSPATR(RI)
     A                                 13 51' '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 13 61' '
     A                                      COLOR(RED)
     A                                      DSPATR(RI)
     A                                 14 27'                         '
     A                                      DSPATR(RI)
     A                                      COLOR(WHT)
     A                                 14 53'COMM'
     A                                      COLOR(RED)
     A                                 14 61' '
     A                                      COLOR(RED)
     A                                      DSPATR(RI)
     A                                 15 47' '
     A                                      COLOR(RED)
     A                                      DSPATR(RI)
     A                                 15 61' '
     A                                      COLOR(RED)
     A                                      DSPATR(RI)
     A                                 16 47'               '
     A                                      COLOR(RED)
     A                                      DSPATR(RI)
     A                                 18  2'SYSPED'
     A                                      COLOR(WHT)
     A                                 18 10'Systema A/S  Spedisjonsprogrammer.'
     A                                 19  2'OS/400'
     A                                      COLOR(YLW)
     A                                 19 10'IBM AS/400 Operativsystem.'
     A                                 20  2'QRJE'
     A                                      COLOR(PNK)
     A                                 20 10'IBM AS/400 Remote Job Entry.'
     A                                 21  2'COMM'
     A                                      COLOR(RED)
     A                                 21 10'IBM AS/400 Linje, kontroller og en-
     A                                      hetsbeskrivelser.'
