     A                                      INDARA
     A          R RCVDATA
     A            RCVFLD       256A
     A          R SNDDATA
     A            SNDFLD        80A
