     A*__________________________
     A* SYSPED400 FAX/MOBILNR KNYTTET TIL BIL
     A*""""""""""""""""""""""""""
     A          R UNITFXR                   PFILE(UNITFX)
     A          K UFBILN
