     A*__________________________________
     A* SYSPED / UNIT PÅ BILNUMMER
     A*""""""""""""""""""""""""""""""""""
     A          R UNITR                     PFILE(UNIT)
     A          K UNBILN
