********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10261 * 01 YBC PTF10 VEKT OG KUBIKK ER ØKT TIL 9.0 OG 7.3
XXXXX * 02 SH  PTF11 KILOMETER PRIS
********************************************************************
     A*__________________________
     A* SYSPED400 TRANSPORTERS
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R UNITR
     A            UNTRAN    R               REFFLD(KN)
     A                                      COLHDG('trans.no')
     A            UNBILN        10          COLHDG('Unitname')
     A            UNTILH        10          COLHDG('Henger')
     A            UNAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            UNLAND    R               REFFLD(LKA)
     A                                      COLHDG('Nasjon')
S01  A*           UNVEKT    R               REFFLD(VKT)
N01  A            UNVEKT    R               REFFLD(VKT9)
     A                                      COLHDG('Max vekt')
     A            UNTARA    R               REFFLD(VKT)
     A                                      COLHDG('Tara')
S01  A*           UNM3      R               REFFLD(M3)
S01  A*                                     COLHDG('Max M3')
N01  A            UNM3           7S 3       COLHDG('Max M3')
     A            UNLM      R               REFFLD(LM)
     A                                      COLHDG('Max LM')
     A            UNTRME         3          COLHDG('Bilkode')
     A            UNTRMA         2S 0       COLHDG('Tran.måte')
     A            UNDATE    R               REFFLD(DT)
     A                                      COLHDG('DATE')
     A            UNSAVD         4S 0       COLHDG('AVD/TUR')
     A            UNSPRO         8S 0       COLHDG('TUR/TUR')
     A            UNRUND         8S 0       COLHDG('RUNDTUR')
     A            UNRETU        30          COLHDG('Garanti')
     A            UNUNTY         4          COLHDG('UNITTYPE')
     A            UNHØYD         4S 2       COLHDG('INV. HØYDE')
N02  A            UNVAL          3          COLHDG('VALUTAKODE IMPORT')
N02  A            UNKMP          5S 2       COLHDG('KM PRIS IMPORT')
N02  A            UNVALI         3          COLHDG('VALUTAKODE INNLAND')
N02  A            UNKMPI         5S 2       COLHDG('KM PRIS INNLAND')
N02  A            UNVALE         3          COLHDG('VALUTAKODE EKSPORT')
N02  A            UNKMPE         5S 2       COLHDG('KM PRIS EKSPORT')
     A          K UNTRAN
     A          K UNBILN
