     A*__________________________________
     A* SYSPED / UNIT PÅ GARANTI (PDANR)
     A*""""""""""""""""""""""""""""""""""
     A          R UNITR                     PFILE(UNIT)
     A          K UNRETU
