     A*__________________________
     A* SYSPED400 FAX/MOBILNR KNYTTET TIL BIL
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R UNITFXR
     A            UFBILN        10          COLHDG('Unitname')
     A            UFFAX         15          COLHDG('FAX-NR')
     A            UFMOB         15          COLHDG('MOBIL-NR')
     A            UFTXT         20          COLHDG('TEKST/KOMMENTAR')
     A            UFEPO         70          COLHDG('EPOSTADRESSE')
