     A          R USRDFTR
     A            ZZUSER        10          TEXT('BRUKER-ID')
     A            ZZBESK        25          TEXT('NAVN/BESKRIVELSE')
     A            ZZTERM         4  0       TEXT('TERMINAL. INNL')
     A          K ZZUSER
