     A          R UTLLOGR
     A            ULAVD          4S 0       COLHDG('AVDELING')
     A            ULOPD          7S 0       COLHDG('OPPDRAG')
     A            ULDT           8S 0       COLHDG('DATO')
     A            ULTID          6S 0       COLHDG('TID')
     A            ULUSR         10A         COLHDG('BRUKER')
     A            ULKF           2A         COLHDG('KODE FOR UTL.FORB')
     A            ULKFT1         1A         COLHDG('KODE OM UTL.FORB.')
     A            ULFT1A        30A         COLHDG('TEKST 1A')
     A            ULFT1B        15A         COLHDG('TEKST 1B')
     A          K ULAVD
     A          K ULOPD
     A          K ULDT
     A          K ULTID
