     A          R UTSR                      TEXT('UTSKRIFTSTYRING')
     A            UTPTXT        30          TEXT('BESKRIVELSE AV UTSKRIFT')
     A            UTPTY         10          TEXT('PAPIRTYPE')
     A            UTPNR          3S 0       TEXT('UTSKRIFTSNR')
     A            UTPL           3S 0       TEXT('ANTALL LINJER')
     A            UTPK           3S 0       TEXT('ANTALL KOLONNER')
     A            UTHEAD         1A         TEXT('SKAL HEADING SKRIVES')
     A***         UTXXX         15          TEXT('LEDIGE')
     A            UTPFM          5          COLHDG('FORMULAR STRINGK')
     A            UTPLAS         1          COLHDG('LASER J/N')
     A            UTPCPI         2S 0       COLHDG('CPI')
     A            UTPLPI         2S 0       COLHDG('LPI')
     A            UTPLPP         3S 0       COLHDG('LPP')
     A            UTPCPL         3S 0       COLHDG('CPL')
     A            UTPDRAW        7          COLHDG('DRAWER')
     A            UTPOUTB       11          COLHDG('OUTBIN')
     A            UTPFOR1       10          COLHDG('FORMDF')
     A            UTPFOR2       10          COLHDG('FORMDF, LIB')
     A            UTPDUPL        7          COLHDG('DUPLEX')
     A            UTPFOV1        9          COLHDG('FRONTOVL')
     A            UTPFOV2       10          COLHDG('FRONTOVL, LIB')
     A            UTPFOV3        7          COLHDG('FRONTOVL, FOR, NED')
     A            UTPFOV4        7          COLHDG('FRONTOVL, FOR, HØY')
     A            UTPBOV1        9          COLHDG('BACKOVL')
     A            UTPBOV2       10          COLHDG('BACKOVL, LIB')
     A            UTPBOV3        7          COLHDG('BACKOVL, FOR, NED')
     A            UTPBOV4        7          COLHDG('BACKOVL, FOR, HØY')
     A            UTPBOV5       11          COLHDG('BACKOVL, FAST BAKS')
     A            UTPCOPI        6          COLHDG('COPIES')
     A            UTPHOLD        4          COLHDG('HOLD')
     A            UTPSAVE        4          COLHDG('SAVE')
     A            UTPFRMP       15          COLHDG('FRONTMGN, VED PDF')
     A            UTPBAMP       15          COLHDG('BACKMGN, E:0.15 0.05')
     A            UTPFRMF       15          COLHDG('FRONTMGN, VED AFP')
     A            UTPBAMF       15          COLHDG('BACKMGN, E:0.15 0.05')
     A          K UTPNR
