     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      INVITE
     A          R BILDE01
     A                                  1  2'SYSPED/V7FKR2'
     A                                      COLOR(BLU)
     A                                  1 19'Filkonvertering for versjon 7'
     A                                      DSPATR(HI)
     A                                  1 60DATE
     A                                      EDTCDE(Y)
     A                                  1 70TIME
     A                                  4  2'Filnavn     Konvertert Filbeskrive-
     A                                      lse'
     A                                      DSPATR(HI)
     A            FNF01         10A  O  5  2
     A            FNS01          1A  O  5 14
     A            FNT01         50A  O  5 25
     A            FNF02         10A  O  6  2
     A            FNS02          1A  O  6 14
     A            FNT02         50A  O  6 25
     A            FNF03         10A  O  7  2
     A            FNS03          1A  O  7 14
     A            FNT03         50A  O  7 25
     A            FNF04         10A  O  8  2
     A            FNS04          1A  O  8 14
     A            FNT04         50A  O  8 25
     A            FNF05         10A  O  9  2
     A            FNS05          1A  O  9 14
     A            FNT05         50A  O  9 25
     A            FNF06         10A  O 10  2
     A            FNS06          1A  O 10 14
     A            FNT06         50A  O 10 25
     A            FNF07         10A  O 11  2
     A            FNS07          1A  O 11 14
     A            FNT07         50A  O 11 25
     A            FNF08         10A  O 12  2
     A            FNS08          1A  O 12 14
     A            FNT08         50A  O 12 25
     A            FNF09         10A  O 13  2
     A            FNS09          1A  O 13 14
     A            FNT09         50A  O 13 25
     A            FNF10         10A  O 14  2
     A            FNS10          1A  O 14 14
     A            FNT10         50A  O 14 25
     A            FNF11         10A  O 15  2
     A            FNS11          1A  O 15 14
     A            FNT11         50A  O 15 25
     A            FNF12         10A  O 16  2
     A            FNS12          1A  O 16 14
     A            FNT12         50A  O 16 25
     A            FNF13         10A  O 17  2
     A            FNS13          1A  O 17 14
     A            FNT13         50A  O 17 25
     A            FNF14         10A  O 18  2
     A            FNS14          1A  O 18 14
     A            FNT14         50A  O 18 25
     A            FNF15         10A  O 19  2
     A            FNS15          1A  O 19 14
     A            FNT15         50A  O 19 25
     A            FNF16         10A  O 20  2
     A            FNS16          1A  O 20 14
     A            FNT16         50A  O 20 25
     A N50                             21 75'MER'
     A                                      COLOR(WHT)
     A                                 23 40'(C) COPYRIGHT  SYSTEMA A/S  2002  '
     A                                      COLOR(WHT)
