     A                                      DSPSIZ(24 80 *DS3)
     A                                      PRINT
     A                                      INVITE
      * "NOERASE" MÅ HA FOR Å IKKE TØMME BILDE SOM MAN KOMME FRA
     A          R NOERASE
     A                                      ASSUME
     A                                  1  2' '
      * MAN KUN DEFINNERE VINDU PÅ REKORDNIVÅ
     A          R WINDOWSZ
     A                                      WINDOW(*DFT 6 60 *NOMSGLIN)
     A                                      OVERLAY
     A          R BILDE01
     A                                      WINDOW(WINDOWSZ)
     A                                      CA03(03 'AVSLUTT')
     A                                      OVERLAY
     A                                  1  2'SYSPED/V8FKR52'
     A                                      COLOR(BLU)
     A                                  1 19'Sett printernavn for fak.journal'
     A                                      DSPATR(HI)
     A                                  1 50DATE
     A                                      EDTCDE(Y)
     A                                  2 50TIME
     A                                  4  2'Oppgi printernavn:'
     A            WSPRT         10A  B  4 24DSPATR(UL)
     A                                  5  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A                                  6  2'(C) COPYRIGHT  SYSTEMA A/S  2004  '
     A                                      COLOR(WHT)
