     A          R VADRR                     PFILE(*LIBL/VADR)
     A          K FIRMA
     A          K KUNDNR
     A          K VADRNA
N01  A          K VADRN1
