     A                                      UNIQUE
     A          R VALUR                     PFILE(VALUAMF)
     A                                      TEXT('Valutaregister')
     A          K FIRMA
     A          K VALKOD
