     A*_______________________________
     A* SYSPED FASTE VARESLAG/ENHETER/"BASKETS"/CONTAINERE M.M.
     A*"""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R VARESLR
     A            VAKN           8P 0       COLHDG('KUNDENR EIER')
     A            VAID          17          COLHDG('ENH. IDENTITET')
     A            VATY           5          COLHDG('ENHETS TYPE')
     A            VAPRKO         1          COLHDG('PR.KOD, FRAKTBER')
     A            VALEN          5P 2       COLHDG('Lengde I MTR')
     A            VABRD          5P 2       COLHDG('Bredde I MTR')
     A            VAHOY          5P 2       COLHDG('Høyde I MTR')
     A            VAVOL          7P 3       COLHDG('Volum')
     A            VALM           4P 2       COLHDG('Lastemeter')
     A            VAMGW          7P 0       COLHDG('MAXIM. GROSS WEIGHT')
     A            VATARA         7P 0       COLHDG('TARA VEKT')
     A            VAFBV          7P 0       COLHDG('FRAKTBEREGN. VKT')
     A          K VAKN
     A          K VAID
