     A*_______________________________
     A* SYSPED VARELINJER TIL OPPDR. "BASKETS"/CONTAINERE M.M.
     A*"""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R VARELIR
     A            VLAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            VLOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            VLKN           8P 0       COLHDG('KUNDENR EIER')
     A            VLID          17          COLHDG('ENH. IDENTITET')
     A            VLTY           5          COLHDG('ENHETS TYPE')
     A            VLVS          30          COLHDG('VARESLAG')
     A            VLPRKO         1          COLHDG('PR.KOD, FRAKTBER')
     A            VLLEN          5P 2       COLHDG('Lengde I MTR')
     A            VLBRD          5P 2       COLHDG('Bredde I MTR')
     A            VLHOY          5P 2       COLHDG('Høyde I MTR')
     A            VLVOL          7P 3       COLHDG('Volum')
     A            VLLM           4P 2       COLHDG('Lastemeter')
     A            VLVKT          7P 0       COLHDG('BRUTTO (REELL)VKT')
     A            VLMGW          7P 0       COLHDG('MAXIM. GROSS WEIGHT')
     A            VLTARA         7P 0       COLHDG('TARA VEKT')
     A            VLFBV          7P 0       COLHDG('FRAKTBEREGN. VKT')
     A            VLPRIS        11P 2       COLHDG('PRIS')
     A            VLDTOP         8P 0       COLHDG('OPPDRAGSDATO')
     A          K VLAVD
     A          K VLOPD
     A          K VLID
