     A                                      DSPSIZ(24 80 *DS3 27 132 *DS4)
     A                                      REF(*LIBL/CUNDC)
     A                                      PRINT
     A                                      ALTHELP
     A                                      HELP
     A          R VCUNDCD1
     A                                      CF03(03 'EXIT')
     A                                      CF04(04 'SØK')
     A  89                                  CF11(11 'DELETE')
     A                                      CF12(12 'CANCEL')
     A                                      SLNO(01)
     A                                      CLRL(24)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  2'VCUNDC4R'
     A                                      COLOR(BLU)
     A                                  1 20'Arbeide med Kunders Kontakter'
     A                                      COLOR(WHT)
     A                                  1 67'Dato:'
     A                                      COLOR(BLU)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A                                  2 67'Tid.:'
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A                                  3  2'Kunde:'
     A            CCOMPN         8Y 0B  3  9
     A  70                                  DSPATR(RI)
     A            KNAVN         30A  O  3 19
     A            WMODE          7A  O  5 27COLOR(WHT)
     A                                  7  2'Kontaktperson  . . . :'
     A            CCONTA    R        B  7 27
     A  61                                  DSPATR(RI)
     A  61                                  DSPATR(PC)
     A  88                                  DSPATR(PR)
     A                                  8  4'Funksjon . . . . . :'
     A            CTYPE     R        B  8 27
     A  60
     AO 88                                  DSPATR(PR)
     A                                  9  6'Telefon  . . . . :'
     A            CPHONE    R        B  9 27
     A  88                                  DSPATR(PR)
     A                                 10  6'Mobiltelefon . . :'
     A            CMOBIL    R        B 10 27
     A  88                                  DSPATR(PR)
     A                                 11  6'Fax  . . . . . . :'
     A            CFAX      R        B 11 27
     A  88                                  DSPATR(PR)
     A                                 11 46MSGCON(022 SHU1308 *LIBL/SYMSGF)
     A                                 12  6'E-Mail/Fast emne :'
     A                                 12 27MSGCON(045 SHU1202 *LIBL/SYMSGF)
     A                                      COLOR(YLW)
     A            CEMAIL    R        B 13  6
     A  62                                  DSPATR(RI)
     A  62                                  DSPATR(PC)
     A  88                                  DSPATR(PR)
     A                                      CHECK(LC)
     A            CEMNE         80A  B 14  1CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A                                 15  6MSGCON(018 SHU1022 *LIBL/SYMSGF)
     A  78                                  DSPATR(ND)
     A            CLIVE          1A  B 15 27
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A                                 16  6MSGCON(018 SHU1141 *LIBL/SYMSGF)
     A  78                                  DSPATR(ND)
     A            CPRINT         1A  B 16 27
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A                                 16 31MSGCON(015 SHU1411 *LIBL/SYMSGF)
     A  78                                  DSPATR(ND)
     A            CMERGE         1   B 16 47
     A  78                                  DSPATR(ND)
     A  78                                  DSPATR(PR)
     A                                 17  6MSGCON(050 SHU1270 *LIBL/SYMSGF)
     A  78                                  DSPATR(ND)
     A            W01            2A  B 18  6CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W02            2A  B 18  9CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W03            2A  B 18 12CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W04            2A  B 18 15CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W05            2A  B 18 18CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W06            2A  B 18 21CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W07            2A  B 18 24CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W08            2A  B 18 27CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W09            2A  B 18 30CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W10            2A  B 18 33CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W11            2A  B 18 36CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W12            2A  B 18 39CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W13            2A  B 18 42CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W14            2A  B 18 45CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W15            2A  B 18 48CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W16            2A  B 19  6CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W17            2A  B 19  9CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W18            2A  B 19 12CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W19            2A  B 19 15CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W20            2A  B 19 18CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W21            2A  B 19 21CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W22            2A  B 19 24CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W23            2A  B 19 27CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W24            2A  B 19 30CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W25            2A  B 19 33CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W26            2A  B 19 36CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W27            2A  B 19 39CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W28            2A  B 19 42CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W29            2A  B 19 45CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            W30            2A  B 19 48CHECK(LC)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A                                 20  6MSGCON(013 SHU1390 *LIBL/SYMSGF)
     A  78                                  DSPATR(ND)
     A            CAVDIO         1   B 20 23
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD001         4Y 0B 20 27EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD002         4Y 0B 20 32EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD003         4Y 0B 20 37EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD004         4Y 0B 20 42EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD005         4Y 0B 20 47EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD006         4Y 0B 20 52EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD007         4Y 0B 20 57EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD008         4Y 0B 20 62EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD009         4Y 0B 20 67EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD010         4Y 0B 20 72EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD011         4Y 0B 21 27EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD012         4Y 0B 21 32EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD013         4Y 0B 21 37EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD014         4Y 0B 21 42EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD015         4Y 0B 21 47EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD016         4Y 0B 21 52EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD017         4Y 0B 21 57EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD018         4Y 0B 21 62EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD019         4Y 0B 21 67EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            AVD020         4Y 0B 21 72EDTCDE(Z)
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A                                 22  6MSGCON(015 SHU1391 *LIBL/SYMSGF)
     A  78                                  DSPATR(ND)
     A            COPDIO         1   B 22 23
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            COPD01         2   B 22 27
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            COPD02         2   B 22 32
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            COPD03         2   B 22 37
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            COPD04         2   B 22 42
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A            COPD05         2   B 22 47
     A  78                                  DSPATR(PR)
     A  78                                  DSPATR(ND)
     A                                 23  2'F3=Avslutt'
     A                                      COLOR(BLU)
     A  89                             23 15'F11=Bekreft sletting'
     A                                      COLOR(BLU)
     A                                 23 38'F12=Retur '
     A                                      COLOR(BLU)
     A                                 23 58'F4=SØK'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O 24  2MSGID(&MSGNR SYMSGF)
     A                                      COLOR(WHT)
     A N30                             24 63'Systema A/S'
     A                                      COLOR(WHT)
     A          R VCUNDCD3
     A*%%TS  SD  19990417  191334  CB          REL-V4R2M0  5769-PW1
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'EXIT')
     A                                      CF06(06 'NY')
     A N60                                  CF08(08 'EXIT')
     A N31                                  CF05(05 'REFRESH')
     A  31                                  CF12(12 'CANCEL')
     A                                      SLNO(23)
     A                                      CLRL(02)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A                                  1  3'F3=Exit'
     A                                      COLOR(BLU)
     A N31                              1 13'F5=Frisk opp'
     A                                      COLOR(BLU)
     A                                  1 28'F6=Lage ny'
     A                                      COLOR(BLU)
     A N60                              1 40'F8=Søk fra'
     A                                      COLOR(BLU)
     A  31                              1 55'F12=Retur'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  2  2MSGID(&MSGNR SYMSGF)
     A            MSGNR          7A  P
     A                                  2 63'Systema A/S'
     A                                      COLOR(WHT)
     A          R VCUNDCD4                  SFL
     A*%%TS  SD  20060330  082026  SVEIN       REL-V5R2M0  5722-WDS
     A            CPRINT         1A  H
     A            CMERGE         1A  H
     A            AVD001         4S 0H
     A            AVD002         4S 0H
     A            AVD003         4S 0H
     A            AVD004         4S 0H
     A            AVD005         4S 0H
     A            AVD006         4S 0H
     A            AVD007         4S 0H
     A            AVD008         4S 0H
     A            AVD009         4S 0H
     A            AVD010         4S 0H
     A            AVD011         4S 0H
     A            AVD012         4S 0H
     A            AVD013         4S 0H
     A            AVD014         4S 0H
     A            AVD015         4S 0H
     A            AVD016         4S 0H
     A            AVD017         4S 0H
     A            AVD018         4S 0H
     A            AVD019         4S 0H
     A            AVD020         4S 0H
     A            V01            2   H
     A            V02            2   H
     A            V03            2   H
     A            V04            2   H
     A            V05            2   H
     A            V06            2   H
     A            V07            2   H
     A            V08            2   H
     A            V09            2   H
     A            V10            2   H
     A            V11            2   H
     A            V12            2   H
     A            V13            2   H
     A            V14            2   H
     A            V15            2   H
     A            V16            2   H
     A            V17            2   H
     A            V18            2   H
     A            V19            2   H
     A            V20            2   H
     A            V21            2   H
     A            V22            2   H
     A            V23            2   H
     A            V24            2   H
     A            V25            2   H
     A            V26            2   H
     A            V27            2   H
     A            V28            2   H
     A            V29            2   H
     A            V30            2   H
N04  A            AVTYPE         2   H
     A            SFRRN         10S 0H
     A            SFPRIN         1A  H
     A            CURS1          4S 0H
     A            WSNR           2A  I  9  2VALUES('  ' '2 ' '02' ' 2' '3 ' '03-
     A                                      ' ' 3' '4 ' '04' ' 4' '5 ' '05' ' 5-
     A                                      ' '1 ' ' 1' 'F ' ' F' 'E ' ' E')
     A            SFCONT        22A  O  9  5
     A            SFTYPE        22A  O  9 29
     A            SFLIVE         1A  O  9 52
     A            SFMAIL        27A  O  9 54
     A          R VCUNDCD5                  SFLCTL(VCUNDCD4)
     A*%%TS  SD  20090114  163231  SVEIN       REL-V5R4M0  5722-WDS
     A                                      SFLSIZ(0014)
     A                                      SFLPAG(0013)
     A  91N93N94                            ROLLUP(25)
     A  91N93N94                            ROLLDOWN(26)
     A  91                                  SFLDSP
     A  92                                  SFLDSPCTL
     A  93                                  SFLCLR
     A  94                                  SFLEND
     A                                  1  2'VCUNDC4R'
     A                                      COLOR(BLU)
     A                                  1 20'Arbeide med Kunders Kontakter'
     A                                      COLOR(WHT)
     A                                  1 67'Dato:'
     A                                      COLOR(BLU)
     A                                  1 73DATE
     A                                      EDTCDE(Y)
     A                                      COLOR(BLU)
     A                                  2  2USER
     A                                      COLOR(BLU)
     A            ZRECNO         4S 0O  2 15SFLRCDNBR(CURSOR)
     A                                      DSPATR(ND)
     A                                  2 67'Tid.:'
     A                                      COLOR(BLU)
     A                                  2 73TIME
     A                                      COLOR(BLU)
     A            SFTYPE        22A  O  3 20
     A                                  5  2'Velg og trykk Enter'
     A                                      COLOR(BLU)
     A                                  6  2'2=Endre   3=Kopier   4=Slett   5=V-
     A                                      ise '
     A                                      COLOR(BLU)
     A                                  7  2'1=plukk E=epost F=fax'
     A                                      COLOR(BLU)
     A                                  8  2'Op Firmanavn               Funksjo-
     A                                      n(Dokument)     V Epostadresse '
     A                                      COLOR(WHT)
     A                                  3  2'Epost av dokument'
     A                                      COLOR(WHT)
     A          R VCUNDCD8
     A*%%TS  SD  20090126  083453  SVEIN       REL-V5R4M0  5722-WDS
     A                                      CSRLOC(LINNBR     POSNBR)
     A                                      ROLLUP(25)
     A                                      ROLLDOWN(26)
     A                                      CF03(03 'EXIT')
     A                                      CF12(12 'CANCEL')
     A                                      SLNO(22)
     A                                      CLRL(03)
     A                                      OVERLAY
     A            LINNBR         3S 0H
     A            POSNBR         3S 0H
     A            MSGNR          7A  P
     A                                  1  3'Søk fra-->'
     A                                      COLOR(WHT)
     A            WSALFA        10   I  1 15
     A                                  1 30'<-alfa'
     A                                  2  3'F3=Exit'
     A                                      COLOR(BLU)
     A                                  2 41'F12=Retur'
     A                                      COLOR(BLU)
     A  30        MSGTXT        78A  O  3  2MSGID(&MSGNR SYMSGF)
     A                                  3 63'Systema A/S'
     A                                      COLOR(WHT)
