     A*___________________
     A* SYSPED / UTALATE TILLEGGSGEBYR  FRAKT
     A*"""""""""""""""""""
     A                                      REF(SR)
     A          R VEIAVGFN2
     A            VEIGEB         3          COLHDG('GEBYRKODE')
     A            VEIUR          1          COLHDG('DELSYS')
     A            VEILK          2          COLHDG('LAND')
     A            VEISK          1          COLHDG('S/K/A')
     A            VEIFRA         3          COLHDG('FRANKATUR')
     A          K VEIGEB
     A          K VEIUR
     A          K VEILK
     A          K VEISK
     A          K VEIFRA
