     A*___________________________
     A* SYSPED / VEIAVGIFT
     A*"""""""""""""""""""""""""""
     A          R VEIAVGFR                  PFILE(VEIAVGF)
     A          K VEIDEL
     A          K VEIGEB
