     A                                      REF(IBMFRF)
     A          R ADRER                     TEXT('Adresse Informasjon')
     A            AKTKOD    R
     A            FIRMA     R
     A            OTBKOD    R
     A            OTBAAR    R
     A            OTBNR     R
     A            RECTYP    R               VALUES('D' 'V' ' ')
     A            VADRNA    R
     A            VADRN1    R
     A            VADRN2    R
     A            VADN21    R               REFFLD(VADRN2)
     A                                      COLHDG('Adresse 3')
     A            VPOSTN    R
     A            VADRN3    R
     A            POSTAD    R
     A            LANDAD    R
