     A          R ADRER                     PFILE(ADREF)
     A          K FIRMA
     A          K OTBKOD
     A          K OTBAAR
     A          K OTBNR
     A          K RECTYP
