     A*___________________________________
     A* SYSPED / TURNR. KLARE FOR UTSKRIFT
     A*"""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R WAVREGNR
     A            WXUNIK         6S 0       COLHDG('UNIK JOB.KEY')
     A            WXKL           6S 0       COLHDG('KLOKKE')
     A            WXFAKT    R               REFFLD(FN)
     A                                      COLHDG('FAKTURA' 'NR.')
     A            WXBILN        10          COLHDG('BILNR')
     A            WXPRO          8S 0       COLHDG('TURNR.')
     A          K WXUNIK
     A          K WXKL
     A          K WXFAKT
     A          K WXBILN
     A          K WXPRO
