     A          R WEBORDR
      *
     A            WEFIRM         2          COLHDG('FIRMA')
     A            WEORDN         7S 0       COLHDG('OPDNR')
     A          K WEFIRM
