     A*__________________________________
     A* SYSPED / REGISTER FOR WFILCD
     A*""""""""""""""""""""""""""""""""""
     A          R WFILCDR                   PFILE(WFILCD)
     A          K WFCKDC
