     A*__________________________
     A* SYSPED / Oppdragsregister (DEL OPPLYSNINGER
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R WFHEADR
     A            HEAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            HEOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            HEUR      R               REFFLD(UR)
     A                                      COLHDG('Oppr.kode')
     A            HESG      R               REFFLD(SG)
     A                                      COLHDG('Signatur')
     A            HEPRO     R               REFFLD(PRO)
     A                                      COLHDG('Prosjektnr')
     A            HENAS     R               REFFLD(NA)
     A                                      COLHDG('Navn Selger')
     A            HENAK     R               REFFLD(NA)
     A                                      COLHDG('Navn Kjøper')
     A            HEOT      R               REFFLD(OT)
     A                                      COLHDG('Oppdragstype')
     A            HEFR      R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            HENT      R               REFFLD(NTS)
     A                                      COLHDG('Antall kolli')
     A            HEVKT     R               REFFLD(VKT9)
     A                                      COLHDG('Bruttovekt')
     A            HEM3           7P 3       COLHDG('Kubikkmeter')
     A            HEDTR     R               REFFLD(DT)
     A                                      COLHDG('Registreringsdato')
     A            HEOB           5          COLHDG('OVERSJØBÅT')
     A          K HEOB
     A          K HEOT
     A          K HEAVD
     A          K HEOPD
