********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10262 * 01 YBC PTF10 SATS ER UTVIDERT TIL 7.2
10286 * 02 YBC PTF10 VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
10329 * 03 YBC PTF10 MENGDE I ANNEN ENHET ER ENDRET FRA 7.0 TIL 9.0
XXXXXX*XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
11016 * 05 YBC PTF11 SVPREÆ BRUKES TIL Å IDENTIFISERE NY LINJE
11174 * 06 YBC PTF11 TILLEGGSLINJER MED SAMME POST
********************************************************************
     A*_____________________________________
     A* SYSPED / WORKFILE   SAD-IMPORT
     A*"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R WFILEIR
     A            WFAVD     R               REFFLD(AVD)
     A            WFTDN     R               REFFLD(TDN)
     A            WFIRNR         5S 0       COLHDG('RECORDSNR.')
     A            WFIVNT         8S 0       COLHDG('VARENR')
     A            WFITN          1          COLHDG('TOLLNEDSETTELSE')
     A            WFILK          2          COLHDG('OPPRINNELSESLANDKODE')
     A            WFIVKB         9S 0       COLHDG('BRUTTO VEKT')
     A            WFIVKN         9S 0       COLHDG('NETTO VEKT')
     A            WFIPRE         1          COLHDG('PREFERANSE')
S03  A*           WFINTM         7S 0       COLHDG('ANTALL STYKKE')
N03  A            WFINTM         9S 0       COLHDG('ANTALL STYKKE')
     A            WFPVA     R               REFFLD(PVA)
     A            WFISKV         3          COLHDG('MOMS SEKVENS')
     A            WFIMVS         5S 2       COLHDG('MOMS SATS')
     A            WFIVF          1          COLHDG('V.F. KODE')
     A            WFIJUS        11S 0       COLHDG('JUSTERINGSBELØP')
     A            WFIFTG         1          COLHDG('FORTEGN AV JUS.BELØP')
     A            WFISTB        13S 0       COLHDG('STATISTISKVERDI')
     A            WFIBBL        13S 0       COLHDG('BEARBEIDINGSKOST.')
     A            WFIMVA         9S 0       COLHDG('MOMS')
     A            WFIMVG         9S 0       COLHDG('MOMSGRUNNLAG')
     A            WFITOL         9S 0       COLHDG('TOLL')
     A            WFITLG         9S 0       COLHDG('TOLLGRUNNLAG')
     A            WFITRA         9S 0       COLHDG('TRAFIKKAVGIFT')
S01  A*           WFISAT         5S 2       COLHDG('SATS TIL TRAFIKKAVG.')
N01  A            WFISAT         7S 2       COLHDG('TOLLSATS')
     A            WFISUM        11S 0       COLHDG('AVGIFTSUM AV LINJE')
     A            WFITY1         2          COLHDG('AVGIFTTYPE-1')
     A            WFITY2         2          COLHDG('AVGIFTTYPE-2')
     A            WFITY3         2          COLHDG('AVGIFTTYPE-3')
     A            WFITY4         2          COLHDG('AVGIFTTYPE-4')
     A            WFITY5         2          COLHDG('AVGIFTTYPE-5')
     A            WFITY6         2          COLHDG('AVGIFTTYPE-6')
N06  A            WFITY7         2          COLHDG('AVGIFTTYPE-7')
N06  A            WFITY8         2          COLHDG('AVGIFTTYPE-8')
     A            WFISK1         3          COLHDG('SEKVENS-1')
     A            WFISK2         3          COLHDG('SEKVENS-2')
     A            WFISK3         3          COLHDG('SEKVENS-3')
     A            WFISK4         3          COLHDG('SEKVENS-4')
     A            WFISK5         3          COLHDG('SEKVENS-5')
     A            WFISK6         3          COLHDG('SEKVENS-6')
N06  A            WFISK7         3          COLHDG('SEKVENS-7')
N06  A            WFISK8         3          COLHDG('SEKVENS-8')
     A            WFIGL1        11S 2       COLHDG('GRUNNLAG AV AVGIFT-1')
     A            WFIGL2        11S 2       COLHDG('GRUNNLAG AV AVGIFT-2')
     A            WFIGL3        11S 2       COLHDG('GRUNNLAG AV AVGIFT-3')
     A            WFIGL4        11S 2       COLHDG('GRUNNLAG AV AVGIFT-4')
     A            WFIGL5        11S 2       COLHDG('GRUNNLAG AV AVGIFT-5')
     A            WFIGL6        11S 2       COLHDG('GRUNNLAG AV AVGIFT-6')
N06  A            WFIGL7        11S 2       COLHDG('GRUNNLAG AV AVGIFT-7')
N06  A            WFIGL8        11S 2       COLHDG('GRUNNLAG AV AVGIFT-8')
     A            WFIST1         7S 2       COLHDG('SATS AV AVGIFT-1')
     A            WFIST2         7S 2       COLHDG('SATS AV AVGIFT-2')
     A            WFIST3         7S 2       COLHDG('SATS AV AVGIFT-3')
     A            WFIST4         7S 2       COLHDG('SATS AV AVGIFT-4')
     A            WFIST5         7S 2       COLHDG('SATS AV AVGIFT-5')
     A            WFIST6         7S 2       COLHDG('SATS AV AVGIFT-6')
N06  A            WFIST7         7S 2       COLHDG('SATS AV AVGIFT-7')
N06  A            WFIST8         7S 2       COLHDG('SATS AV AVGIFT-8')
     A            WFIPR1         1          COLHDG('TYPE FOR SATS-1')
     A            WFIPR2         1          COLHDG('TYPE FOR SATS-2')
     A            WFIPR3         1          COLHDG('TYPE FOR SATS-3')
     A            WFIPR4         1          COLHDG('TYPE FOR SATS-4')
     A            WFIPR5         1          COLHDG('TYPE FOR SATS-5')
     A            WFIPR6         1          COLHDG('TYPE FOR SATS-6')
N06  A            WFIPR7         1          COLHDG('TYPE FOR SATS-7')
N06  A            WFIPR8         1          COLHDG('TYPE FOR SATS-8')
     A            WFIBL1        11S 2       COLHDG('BELØP AV AVGIFT-1')
     A            WFIBL2        11S 2       COLHDG('BELØP AV AVGIFT-2')
     A            WFIBL3        11S 2       COLHDG('BELØP AV AVGIFT-3')
     A            WFIBL4        11S 2       COLHDG('BELØP AV AVGIFT-4')
     A            WFIBL5        11S 2       COLHDG('BELØP AV AVGIFT-5')
     A            WFIBL6        11S 2       COLHDG('BELØP AV AVGIFT-6')
N06  A            WFIBL7        11S 2       COLHDG('BELØP AV AVGIFT-7')
N06  A            WFIBL8        11S 2       COLHDG('BELØP AV AVGIFT-8')
     A            WFIPRO         1          COLHDG('PROSENTTEGN')
S02  A*           WFIKN1        17          COLHDG('CONTAINERNR-1')
S02  A*           WFIKN2        17          COLHDG('CONTAINERNR-2')
S02  A*           WFIKN3        17          COLHDG('CONTAINERNR-3')
S02  A*           WFIKN4        17          COLHDG('CONTAINERNR-4')
S02  A*           WFIKN5        17          COLHDG('CONTAINERNR-5')
S02  A*           WFIKN6        17          COLHDG('CONTAINERNR-6')
S02  A*           WFIKN7        17          COLHDG('CONTAINERNR-7')
N02  A            WFIKN1        28          COLHDG('CONTAINERNR-1')
N02  A            WFIKN2        28          COLHDG('CONTAINERNR-2')
N02  A            WFIKN3        28          COLHDG('CONTAINERNR-3')
N02  A            WFIKN4        28          COLHDG('CONTAINERNR-4')
N02  A            WFIKN5        28          COLHDG('CONTAINERNR-5')
N02  A            WFIKN6        28          COLHDG('CONTAINERNR-6')
N02  A            WFIKN7        28          COLHDG('CONTAINERNR-7')
     A            WFIANT         6S 0       COLHDG('ANTALL')
     A            WFIVT          4          COLHDG('TYPE AV ANTALL')
S02  A*           WFIVB1        15          COLHDG('VAREBESKRIVELSE-1')
S02  A*           WFIVB2        15          COLHDG('VAREBESKRIVELSE-2')
S02  A*           WFIVB3        15          COLHDG('VAREBESKRIVELSE-3')
S02  A*           WFIVB4        15          COLHDG('VAREBESKRIVELSE-4')
S02  A*           WFIVB5        15          COLHDG('VAREBESKRIVELSE-5')
S02  A*           WFIVB6        15          COLHDG('VAREBESKRIVELSE-6')
S02  A*           WFIVB7        15          COLHDG('VAREBESKRIVELSE-7')
N02  A            WFIVB1        30          COLHDG('VAREBESKRIVELSE-1')
N02  A            WFIVB2        30          COLHDG('VAREBESKRIVELSE-2')
N02  A            WFIVB3        30          COLHDG('VAREBESKRIVELSE-3')
N02  A            WFIVB4        30          COLHDG('VAREBESKRIVELSE-4')
N02  A            WFIVB5        30          COLHDG('VAREBESKRIVELSE-5')
     A            WFITO1        45          COLHDG('TILLEGGSOPPLYSNING-1')
     A            WFITO2        45          COLHDG('TILLEGGSOPPLYSNING-2')
     A            WFITO3        45          COLHDG('TILLEGGSOPPLYSNING-3')
     A            WFITO4        45          COLHDG('TILLEGGSOPPLYSNING-4')
     A            WFITO5        45          COLHDG('TILLEGGSOPPLYSNING-5')
N02  A            WFITO6        45          COLHDG('TILLEGGSOPPLYSNING-6')
N02  A            WFITO7        45          COLHDG('TILLEGGSOPPLYSNING-7')
N02  A            WFITO8        45          COLHDG('TILLEGGSOPPLYSNING-8')
N02  A            WFITO9        45          COLHDG('TILLEGGSOPPLYSNING-9')
N02  A            WFITO10       45          COLHDG('TILLEGGSOPPLYSNING10')
N02  A            WFITO11       45          COLHDG('TILLEGGSOPPLYSNING11')
N02  A            WFITO12       45          COLHDG('TILLEGGSOPPLYSNING12')
N02  A            WFITO13       45          COLHDG('TILLEGGSOPPLYSNING13')
N02  A            WFITO14       45          COLHDG('TILLEGGSOPPLYSNING14')
N02  A            WFITO15       45          COLHDG('TILLEGGSOPPLYSNING15')
     A            WFITC1         3          COLHDG('CREF-1')
     A            WFITC2         3          COLHDG('CREF-2')
     A            WFITC3         3          COLHDG('CREF-3')
     A            WFITC4         3          COLHDG('CREF-4')
     A            WFITC5         3          COLHDG('CREF-5')
N02  A            WFITC6         3          COLHDG('CREF-6')
N02  A            WFITC7         3          COLHDG('CREF-7')
N02  A            WFITC8         3          COLHDG('CREF-8')
N02  A            WFITC9         3          COLHDG('CREF-9')
N02  A            WFITC10        3          COLHDG('CREF-10')
N02  A            WFITC11        3          COLHDG('CREF-11')
N02  A            WFITC12        3          COLHDG('CREF-12')
N02  A            WFITC13        3          COLHDG('CREF-13')
N02  A            WFITC14        3          COLHDG('CREF-14')
N02  A            WFITC15        3          COLHDG('CREF-15')
     A            WFITRG         9S 0       COLHDG('GRUNNLAG AV TRAFIKK')
S05  A*           WFITRP         1          COLHDG('FORTEGN AV TR.AVG.')
N05  A            WFITRP         1          COLHDG('OMBER. J=NY/S=SLETT')
     A          K WFAVD
     A          K WFTDN
     A          K WFIRNR
