********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10318 * 01 YBC PTF10 VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
XXXXXX*XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX
11016 * 02 YBC PTF11 NY FELT FOR Å IDENTIFISERE NY LINJE I OMBEREGNING
********************************************************************
      *_____________________________________
      * SYSPED / WORKFILE   SAD-EKSPORT
      * OBS!!! LAGE MEMBER AV SADPRT, TVINS
      *"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R WFILEER
     A            WFEAVD    R               REFFLD(AVD)
     A            WFETDN    R               REFFLD(TDN)
     A            WFERNR         5S 0       COLHDG('RECORDSNR.')
     A            WFEVNT         8S 0       COLHDG('VARENR')
     A            WFEFYL         2          COLHDG('OPPRINGELSESFYLKE')
     A            WFEVKB         9P 0       COLHDG('BRUTTO VEKT')
     A            WFEVKN         9P 0       COLHDG('NETTO VEKT')
     A            WFESTB        11P 0       COLHDG('STATISTISKVERDI')
S01  A*           WFENTM         7P 0       COLHDG('ANTALL STYKKE')
N01  A            WFENTM         9P 0       COLHDG('ANTALL STYKKE')
     A            WFEBL          9P 0       COLHDG('BELØP FOR FF')
     A            WFEATS         3          COLHDG('AVG.SEKVENS')
S01  A*           WFEATP         5  3       COLHDG('AVGIFTSATS')
N01  A            WFEATP         7S 3       COLHDG('AVGIFTSATS')
     A            WFESUM         9P 0       COLHDG('AVGIFTSUM AV LINJE')
     A            WFETO1        45          COLHDG('TILLEGGSOPPLYSNING-1')
     A            WFETO2        45          COLHDG('TILLEGGSOPPLYSNING-2')
     A            WFETO3        45          COLHDG('TILLEGGSOPPLYSNING-3')
     A            WFETO4        45          COLHDG('TILLEGGSOPPLYSNING-4')
     A            WFETO5        45          COLHDG('TILLEGGSOPPLYSNING-5')
N01  A            WFETO6        45          COLHDG('TILLEGGSOPPLYSNING-6')
N01  A            WFETO7        45          COLHDG('TILLEGGSOPPLYSNING-7')
N01  A            WFETO8        45          COLHDG('TILLEGGSOPPLYSNING-8')
N01  A            WFETO9        45          COLHDG('TILLEGGSOPPLYSNING-9')
N01  A            WFETO10       45          COLHDG('TILLEGGSOPPLYSNING10')
N01  A            WFETO11       45          COLHDG('TILLEGGSOPPLYSNING11')
N01  A            WFETO12       45          COLHDG('TILLEGGSOPPLYSNING12')
N01  A            WFETO13       45          COLHDG('TILLEGGSOPPLYSNING13')
N01  A            WFETO14       45          COLHDG('TILLEGGSOPPLYSNING14')
N01  A            WFETO15       45          COLHDG('TILLEGGSOPPLYSNING15')
S01  A*           WFEKN1        17          COLHDG('CONTAINERNR-1')
S01  A*           WFEKN2        17          COLHDG('CONTAINERNR-2')
S01  A*           WFEKN3        17          COLHDG('CONTAINERNR-3')
S01  A*           WFEKN4        17          COLHDG('CONTAINERNR-4')
S01  A*           WFEKN5        17          COLHDG('CONTAINERNR-5')
S01  A*           WFEKN6        17          COLHDG('CONTAINERNR-6')
S01  A*           WFEKN7        17          COLHDG('CONTAINERNR-7')
N01  A            WFEKN1        28          COLHDG('CONTAINERNR-1')
N01  A            WFEKN2        28          COLHDG('CONTAINERNR-2')
N01  A            WFEKN3        28          COLHDG('CONTAINERNR-3')
N01  A            WFEKN4        28          COLHDG('CONTAINERNR-4')
N01  A            WFEKN5        28          COLHDG('CONTAINERNR-5')
N01  A            WFEKN6        28          COLHDG('CONTAINERNR-6')
N01  A            WFEKN7        28          COLHDG('CONTAINERNR-7')
     A            WFEANT         6S 0       COLHDG('ANTALL')
     A            WFEVT          4          COLHDG('TYPE AV ANTALL')
S01  A*           WFEVB1        15          COLHDG('VAREBESKRIVELSE-1')
S01  A*           WFEVB2        15          COLHDG('VAREBESKRIVELSE-2')
S01  A*           WFEVB3        15          COLHDG('VAREBESKRIVELSE-3')
S01  A*           WFEVB4        15          COLHDG('VAREBESKRIVELSE-4')
S01  A*           WFEVB5        15          COLHDG('VAREBESKRIVELSE-5')
S01  A*           WFEVB6        15          COLHDG('VAREBESKRIVELSE-6')
S01  A*           WFEVB7        15          COLHDG('VAREBESKRIVELSE-7')
N01  A            WFEVB1        30          COLHDG('VAREBESKRIVELSE-1')
N01  A            WFEVB2        30          COLHDG('VAREBESKRIVELSE-2')
N01  A            WFEVB3        30          COLHDG('VAREBESKRIVELSE-3')
N01  A            WFEVB4        30          COLHDG('VAREBESKRIVELSE-4')
N01  A            WFEVB5        30          COLHDG('VAREBESKRIVELSE-5')
     A            WFEJUS        11P 0       COLHDG('JUSTERINGSBELØP')
     A            WFETC1         3          COLHDG('CREF-1')
     A            WFETC2         3          COLHDG('CREF-2')
     A            WFETC3         3          COLHDG('CREF-3')
     A            WFETC4         3          COLHDG('CREF-4')
     A            WFETC5         3          COLHDG('CREF-5')
N01  A            WFETC6         3          COLHDG('CREF-6')
N01  A            WFETC7         3          COLHDG('CREF-7')
N01  A            WFETC8         3          COLHDG('CREF-8')
N01  A            WFETC9         3          COLHDG('CREF-9')
N01  A            WFETC10        3          COLHDG('CREF-10')
N01  A            WFETC11        3          COLHDG('CREF-11')
N01  A            WFETC12        3          COLHDG('CREF-12')
N01  A            WFETC13        3          COLHDG('CREF-13')
N01  A            WFETC14        3          COLHDG('CREF-14')
N01  A            WFETC15        3          COLHDG('CREF-15')
N02  A            WFENYL         1          COLHDG('NY LINJE FOR OMB.')
     A          K WFEAVD
     A          K WFETDN
     A          K WFERNR
