     A          R WINTFR
     A            WIST           1          COLHDG('Status')
     A            WIAVD          4S 0       COLHDG('Avdeling')
     A            WIOPD          7S 0       COLHDG('Oppdrag')
     A            WILI           5S 0       COLHDG('Linjenr.')
     A            WIKNR          8S 0       COLHDG('Kundenr.')
     A            WIVK           3          COLHDG('Gebyrkode')
     A            WIGRL          5S 0       COLHDG('GRUNNLAG')
     A            WIINT          5S 0       COLHDG('INT I AVT')
     A            WIBELØ        10S 3       COLHDG('ENH-PRIS')
     A            WIPPR          5S 0       COLHDG('PR ENHET')
     A            WITEGN         1A         COLHDG('MIN/MAX/JUS')
     A            WIJUST        10S 3       COLHDG('JUSTERING')
     A            WIBELN        13S 2       COLHDG('Beløp')
     A          K WIAVD
     A          K WIOPD
     A          K WILI
