     A          R WKOMMR                    PFILE(WKOMMF)
     A          K FIRMA     R
     A          K OTBKOD    R
     A          K OTBAAR    R
     A          K OTBNR     R
     A          K OTBLNR    R
     A          K LNRKOM    R
