     A          R OTRAHR                    PFILE(WOTRAHF)
     A          K FIRMA
     A          K ORDWEB
     A          S STATUS                    COMP(EQ 'F')
