     A          R WOTRAR                    PFILE(WOTRAF)
     A                                      TEXT('ORDRETRANSER')
     A          K FIRMA
     A          K ORDNOT
     A          K LIN1OT
