     A*__________________________________________
     A* SYSPED / AGENTER TIL GODSLIST
     A*""""""""""""""""""""""""""""""""""""""""""
     A          R WRKAGR                    PFILE(WRKAG)
     A          K FIRMA
     A          K KUNDNR
