     A*__________________________
     A* SYSPED400 REGISTER FOR AVSETNINGER VED PERIODEAVSLUTNING
     A*""""""""""""""""""""""""""
     A          R WAVSR
     A            AVPERC         2S 0       COLHDG('PERIODE ÅRHUNDRE')
     A            AVPERÅ         2S 0       COLHDG('PERIODE ÅR')
     A            AVPERM         2S 0       COLHDG('PERIODE ÅR')
     A            AVKONT         5S 0       COLHDG('KONTO')
     A            AVKSTE         4S 0       COLHDG('KOSTN.STED')
     A            AVKBÆR         4S 0       COLHDG('KOSTN.BÆRER')
     A            AVKOIN         1          COLHDG('KOSTN./INNT.KODE')
     A            AVTEXT        30          COLHDG('TEKST')
     A            AVSIGN         3          COLHDG('SAKSBEHANDLER')
     A            AVOAVD         4S 0       COLHDG('OPPDRAGS AVD')
     A            AVOPD          7S 0       COLHDG('OPPDRAGSNR')
     A            AVTAVD         4S 0       COLHDG('TURS AVD')
     A            AVTUR          8S 0       COLHDG('TURNUMMER')
     A            AVVAL          3          TEXT('VAL.KODE')
     A            AVBELV        11S 2       TEXT('BELØP I VAL')
     A            AVBELL        11S 2       TEXT('BELØP I LOKAL VAL')
     A          K AVPERC
     A          K AVPERÅ
     A          K AVPERM
     A          K AVKONT
     A          K AVKSTE
     A          K AVKBÆR
     A          K AVKOIN
