      *************************************************************
      * GENERELL WORKFILE TIL BRUK I YMSE CGI-PROGRAM             *
      *************************************************************
      * CGI-PROG SOM "INITIERER" BRUK AV FIL HENTER INTEGER
      *     VIA FUNKSJONEN:  eval    WINTEG   = random(1:999999)
      * WKEY2 bygges etter behov i ulike program
      * DATA  bygges etter behov via datastrukturer
      * Ved avslutning BØR program rydde etter seg med en
      * reade / delete loop (men filen blir tømt i nattrutine)
      * Eksempel: se cgi-prog  "SS151/SS152"
     A          R WRKCGISR
     A            WINTEG         6S 0       TEXT('RANDOM INTEGER')
     A            WKEY2        256A         TEXT('Del2 av Key')
     A            WDATA       1024A         TEXT('DATA')
     A          K WINTEG
     A          K WKEY2
