      * FORDELING BELØP PÅ ORDRE PÅ EN TUR
     A          R WRKFORR
     A            HEPRO          8S 0       COLHDG('TUR')
     A            HEAVD          4S 0       COLHDG('AVD')
     A            HEOPD          7S 0       COLHDG('OPD')
     A            HEANDEL       13S 2       COLHDG('ANDEL')
     A          K HEPRO
