     A*__________________________
     A* SYSPED400 REGISTER FORSLAG PERIODEJUSTERING
     A*""""""""""""""""""""""""""
     A          R WPERR
     A            AVFPEC         2S 0       COLHDG('FØRT-PER ÅRHUNDRE')
     A            AVFPEÅ         2S 0       COLHDG('FØRT-PERIODE ÅR')
     A            AVFPEM         2S 0       COLHDG('FØRT-PERIODE MND')
     A            AVPERC         2S 0       COLHDG('HOVED-PER ÅRHUNDRE')
     A            AVPERÅ         2S 0       COLHDG('HOVED-PERIODE ÅR')
     A            AVPERM         2S 0       COLHDG('HOVED-PERIODE MND')
     A            AVKONT         5S 0       COLHDG('KONTO')
     A            AVKSTE         4S 0       COLHDG('KOSTN.STED')
     A            AVKBÆR         4S 0       COLHDG('KOSTN.BÆRER')
     A            AVKOIN         1          COLHDG('KOSTN./INNT.KODE')
     A            AVTEXT        30          COLHDG('TEKST')
     A            AVOAVD         4S 0       COLHDG('OPPDRAGS AVD')
     A            AVOPD          7S 0       COLHDG('OPPDRAGSNR')
     A            AVTUR          8S 0       COLHDG('TURNUMMER')
     A            AVBINR         7S 0       COLHDG('BILAGSNR')
     A            AVBELL        11S 2       TEXT('BELØP I LOKAL VAL')
     A          K AVFPEC
     A          K AVFPEÅ
     A          K AVFPEM
     A          K AVPERC
     A          K AVPERÅ
     A          K AVPERM
     A          K AVKONT
     A          K AVKSTE
     A          K AVKBÆR
