     A*__________________________
     A* SYSPED400 REGISTER FOR FORSLAG PERIODE-JUSTERING
     A*""""""""""""""""""""""""""
     A          R WPERR                     PFILE(WRKPER)
     A          K AVKSTE
     A          K AVKBÆR
     A          K AVFPEC
     A          K AVFPEÅ
     A          K AVFPEM
     A          K AVPERC
     A          K AVPERÅ
     A          K AVPERM
     A          K AVKONT
