     A*_________________________________
     A* SYSPED / AMETA Fakturanr. - Work
     A*"""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R WRKTAVRR                  TEXT('AMETA fakturanr. work')
     A            WRFAKT    R               REFFLD(FN)
     A                                      COLHDG('Fakt.nr')
     A            UMVA          13S 2       COLHDG('Gr uten mva')
     A            MMVA          13S 2       COLHDG('Gr med mva')
     A            MVA           13S 2       COLHDG('Mva-beløp')
     A            TOT           13S 2       COLHDG('Total-beløp')
     A          K WRFAKT
