     A*__________________________________
     A* SYSPED / SAMLEFAKTURA-POSTER
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R WSAMLR
     A            WAUNIK         6S 0       COLHDG('UNIK JOB.KEY')
     A            WAKN      R               REFFLD(KN)
     A            WAVAL     R               REFFLD(VAL)
     A            WASORT        20          COLHDG('SORT.BEGREP')
     A            WAAVD     R               REFFLD(AVD)
     A            WAOPD     R               REFFLD(OPD)
     A            WAPRO     R               REFFLD(PRO)
     A            WAGRP          1          COLHDG('S.FAKT GRUPPE')
     A            WADATO    R               REFFLD(DT)
     A            WAUR      R               REFFLD(UR)
     A*           EPOSTKU        1          COLHDG('EPOSTKUNDE')
     A*           CPRINT         1          COLHDG('PRINT OGSÅ')
     A          K WAUNIK
     A          K WAKN
     A          K WAVAL
     A          K WASORT
     A          K WAAVD
     A          K WAOPD
