     A*__________________________________
     A* SYSPED / SAMLEFAKTURA SUM PR GEB.KODE
     A*""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R WSAMGER
     A            WGUNIK         6S 0       COLHDG('UNIK JOB.KEY')
     A            WGVK      R               REFFLD(VK)
     A                                      COLHDG('Fee' 'cde')
     A            WGKDM     R               REFFLD(KDM)
     A                                      COLHDG('VAT' 'cde')
     A            WGTEXT        20          COLHDG('TEXT')
     A            WGNETF    R               REFFLD(BEL13)
     A            WGNETT    R               REFFLD(BEL13)
     A            WGMVA     R               REFFLD(BEL13)
     A            WGBRUT    R               REFFLD(BEL13)
     A            WGSORT         3          COLHDG('SORTERING')
     A          K WGUNIK
     A          K WGVK
     A          K WGKDM
