     A*__________________________________
     A* SYSPED / SAMLEFAKTURA SUM PR GEB.KODE SORTERT
     A*""""""""""""""""""""""""""""""""""
     A          R WSAMGER                   PFILE(WSAMGE)
     A          K WGUNIK
     A          K WGSORT
     A          K WGKDM
