********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10004 * 01 YBC PTF10 LEVERANDØRSNR ER ØKT TIL 5.0
10027 * 02 YBC PTF10 NYTT FELT FOR TYPE AV ORDRE
********************************************************************
     A          R WSSORFR
     A            ORONO          7S 0       COLHDG('ORDRENR.')
N02  A            ORTYPE         1A         COLHDG('ORDRETYPE')
     A            ORST           1A         COLHDG('STATUS')
      *             BLANK = PÅ LAGER
      *             1     = MED PACKINGLISTE
      *             2     = MED BEKREFTET PACKINGLISTE
      *             3     = MED PROFORMA
      *             4     = MED BEKREFTET PROFORMA
      *             5     = MED FAKTURAGRUNNLAG
      *             6     = MED BEKREFTET FAKTURAGRUNNLAG
      *             S     = SLETTET
     A            ORTNO         11S 0       COLHDG('TURNR. AVD/OPD')
     A            ORTNO2        11S 0       COLHDG('TURNR. AVD/OPD')
     A            ORTNO3        11S 0       COLHDG('TURNR. AVD/OPD')
     A            ORCNO          8S 0       COLHDG('KUNDENR.')
S01  A*           ORSNO          3S 0       COLHDG('LEVERANDØRSNR.')
N01  A            ORSNO          5S 0       COLHDG('LEVERANDØRSNR.')
     A            ORSNM         30A         COLHDG('LEV.NAVN')
     A            ORBCD          5A         COLHDG('BÅTKODE')
     A            ORCLI          5S 0       COLHDG('ANTALL KOLLI')
     A            ORWT           7S 1       COLHDG('VEKT - KG')
     A            ORVOL          5S 2       COLHDG('VOLUM - M3')
     A            ORDSC         30A         COLHDG('VAREBESKRIVELSE')
     A            ORCURC         3A         COLHDG('VALUTAKODE')
     A            ORAMT         11S 2       COLHDG('BELØP')
     A            ORCLNF         3S 0       COLHDG('KOLLINR. FRA')
     A            ORCLNT         3S 0       COLHDG('KOLLINR. TIL')
     A            ORDTWL         8S 0       COLHDG('ØNSKET LEV.DATO')
     A            ORDTL          8S 0       COLHDG('DATO LEVERT')
     A            ORDTL2         8S 0       COLHDG('DATO LEVERT')
     A            ORDTL3         8S 0       COLHDG('DATO LEVERT')
     A            ORLC           5A         COLHDG('LOKASJON LAND/STD')
     A            ORLC2          5A         COLHDG('LOK. LAND/STD 2')
     A            ORLC3          5A         COLHDG('LOK. LAND/STD 3')
     A            ORPOS1         5A         COLHDG('LAGERPOSISJON 1')
     A            ORPOS2         5A         COLHDG('LAGERPOSISJON 2')
     A            ORPOS3         5A         COLHDG('LAGERPOSISJON 3')
     A            ORFTCD         2A         COLHDG('FRITEKST KODE')
     A            ORFT1         30A         COLHDG('FRITEKST 1')
     A            ORFT2         30A         COLHDG('FRITEKST 2')
     A            ORFT3         30A         COLHDG('FRITEKST 3')
     A            ORFT4         30A         COLHDG('FRITEKST 4')
     A            OROT           2A         COLHDG('OPPDRAGSTYPE')
     A            ORFR           3A         COLHDG('FRANKATUR')
     A            ORDTR          8S 0       COLHDG('REG.DATO')
     A            ORRTNG         1A         COLHDG('RETUR GODS')
     A            ORKDL1         2A         COLHDG('KODE FOR USKRIFT')
     A            ORKDL2         2A         COLHDG('KODE FOR USKRIFT')
     A            ORKDL3         2A         COLHDG('KODE FOR USKRIFT')
     A            POCONO        20A         COLHDG('KUNDERS ORDRENR.')
     A            PAPKD          1A         COLHDG('KODE')
     A            PATXT1        50A         COLHDG('TEKST - 1')
     A            PATXT2        50A         COLHDG('TEKST - 2')
     A            PATXT3        50A         COLHDG('TEKST - 3')
     A            PATXT4        50A         COLHDG('TEKST - 4')
     A            PATXT5        50A         COLHDG('TEKST - 5')
     A            TRDTS          8S 0       COLHDG('DATO DISPATCH')
     A            HEGN          15A         COLHDG('AWB NO')
     A            WRUSER        10A         COLHDG('BRUKER-ID')
     A            WRRN           7S 0       COLHDG('REKORDNR')
     A          K WRUSER
     A          K WRRN
