     A*__________________________
     A* SYSPED / WRKFILE STATISTIKK
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R WST01R
     A            WSTUNI         6S 0       COLHDG('UNIK JOB.KEY')
     A            WSTKEY        39          COLHDG('STATISTIKK KEY')
     A            HEAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            HEOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            HEUR      R               REFFLD(UR)
     A                                      COLHDG('Oppr.kode')
     A            HENT      R               REFFLD(NTS)
     A                                      COLHDG('Antall kolli')
     A            HEVKT     R               REFFLD(VKT9)
     A                                      COLHDG('Bruttovekt')
     A            HEFBV     R               REFFLD(VKT9)
     A                                      COLHDG('Fraktb.vekt')
     A            HEOT      R               REFFLD(OT)
     A                                      COLHDG('Oppdragstype')
     A            HEFR      R               REFFLD(FR)
     A                                      COLHDG('Frankatur')
     A            WSTINT        11S 0       COLHDG('SUM INNTEKT')
     A            WSTKOS        11S 0       COLHDG('SUM KOSTNAD')
     A            WSTFCC        11S 0       COLHDG('SUM CC-FRAKT')
     A            WSTICC        11S 0       COLHDG('SUM CC-GEBYR')
     A            WSTFPP        11S 0       COLHDG('SUM PP-FRAKT')
     A            WSTIPP        11S 0       COLHDG('SUM PP-GEBYR')
     A            WSTFSA        11S 0       COLHDG('SUM SAMLAST-FRAKT')
     A            WSTISA        11S 0       COLHDG('SUM SAMLAST-GEBYR')
     A          K WSTUNI
     A          K WSTKEY
