     A          R XMLINHR
     A            XMST           1          COLHDG('STATUS')
     A            XMAVD          4S 0       COLHDG('AVDELING')
     A            XMOPD          7S 0       COLHDG('OPPDRAGSNR')
     A            XMPRO          8S 0       COLHDG('TURNR')
     A            XMDTO          8S 0       COLHDG('OPPRETTELSES DATO')
     A            XMTMO          6S 0       COLHDG('OPPRETTELSES TID')
     A            XMDTS          8S 0       COLHDG('SENDINGS DATO')
     A            XMTMS          6S 0       COLHDG('SENDINGS TID')
