********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10XXX * 01 YBC PTF10 LENGDE PÅ NIVÅ ER ØKT FRA 3.0 TIL 7.0
10XXX * 02 YBC PTF10 SENDINGSNR ER ENDRET FRA 7.0 TIL 9.0
********************************************************************
     A          R XMLRCVFR
     A            XRST           1          COLHDG('STATUS')
S02  A*           XRSN           7S 0       COLHDG('SENDINGSNR')
N02  A            XRSN           9S 0       COLHDG('SENDINGSNR')
E01  A            XRLEV1         7S 0       COLHDG('NIVÅ 1')
E01  A            XRLEV2         7S 0       COLHDG('NIVÅ 2')
E01  A            XRLEV3         7S 0       COLHDG('NIVÅ 3')
E01  A            XRLEV4         7S 0       COLHDG('NIVÅ 4')
E01  A            XRLEV5         7S 0       COLHDG('NIVÅ 5')
E01  A            XRLEV6         7S 0       COLHDG('NIVÅ 6')
E01  A            XRLEV7         7S 0       COLHDG('NIVÅ 7')
E01  A            XRLEV8         7S 0       COLHDG('NIVÅ 8')
E01  A            XRLEV9         7S 0       COLHDG('NIVÅ 9')
     A            XRNV          35A         COLHDG('TAG NAVN')
     A            XRVERD        70A         COLHDG('VERDI')
     A            XRPATH       256A         COLHDG('PATH')
     A          K XRSN
     A          K XRLEV1
     A          K XRLEV2
     A          K XRLEV3
     A          K XRLEV4
     A          K XRLEV5
     A          K XRLEV6
     A          K XRLEV7
     A          K XRLEV8
     A          K XRLEV9
