     A          R XMLU2FR                   PFILE(XMLU2F)
     A          K XFST
     A          K XFFIRM
     A          K XFTYPE
     A          K XFKN
     A          K XFFK
     A          K XFFN
