********************************************************************
      * RETTINGER I DETTE PROGRAM:
PTFnr:*Sek Sig Vers  Beskrivelse...........................
""""""*"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""
10318 * 01 YBC PTF10 SVVKTB/SVVKTN ER ENDRET FRA 9.0 TIL 12.3
      *              VAREBESKRIVELSE ER ØKT FRA 15A TIL 30A
11013 * 02 CB  PTF11 URSPRUNGSLAND TIL INTERNT BRUK VED FYLKESKODE=91
11176 * 03 YBC PTF11 TILLEGGSLINJER MED SAMME POST
********************************************************************
     A*_____________________________________
     A* SYSPED / Tolldekl. EKSPORT Varelinjer
     A*"""""""""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R SAEVR
     A*** SV01 = B ---> HENTE MERKE & NR. FRA B/L    120691
     A            SV01           1          COLHDG('*blanks')
     A            SVAVD     R               REFFLD(AVD)
     A            SVTDN     R               REFFLD(TDN)
     A            SVLI      R               REFFLD(LI5)
     A            SVBELT    R               REFFLD(BEL11)
     A                                      COLHDG('Beløp Tollverdi')
     A            SVFYL          2          COLHDG('FYLKE')
     A            SVVNT     R               REFFLD(VNT)
     A            SVAVT          1          COLHDG('FERSK FISK')
     A            SVAVTS         3          COLHDG('AVG.SEKVENS')
S01  A*           SVAVTP         5P 3       COLHDG('PROSENTSATS AV SVAVT')
N01  A            SVAVTP         7P 3       COLHDG('PROSENTSATS AV SVAVT')
S01  A*           SVVKTB    R               REFFLD(VKT9)
S01  A*                                     COLHDG('Vekt Brutto')
N01  A            SVVKTB        12S 3       COLHDG('Vekt Brutto')
S01  A*           SVVKTN    R               REFFLD(VKT9)
S01  A*                                     COLHDG('Vekt Netto')
N01  A            SVVKTN        12S 3       COLHDG('Vekt Netto')
S01  A*           SVNTM     R               REFFLD(NT)
S01  A*                                     COLHDG('Mengde')
N01  A            SVNTM          9S 0       COLHDG('MENGDE')
S03  A*           SVCREF         3          COLHDG('KOMMUNIKASJONREF.')
N03  A            SVCRE1         3          COLHDG('KOMMUNIKASJONREF. 1')
N03  A            SVCRE2         3          COLHDG('KOMMUNIKASJONREF. 2')
N03  A            SVCRE3         3          COLHDG('KOMMUNIKASJONREF. 3')
N03  A            SVCRE4         3          COLHDG('KOMMUNIKASJONREF. 4')
N03  A            SVCRE5         3          COLHDG('KOMMUNIKASJONREF. 5')
N03  A            SVCRE6         3          COLHDG('KOMMUNIKASJONREF. 6')
N03  A            SVCRE7         3          COLHDG('KOMMUNIKASJONREF. 7')
N03  A            SVCRE8         3          COLHDG('KOMMUNIKASJONREF. 8')
N03  A            SVCRE9         3          COLHDG('KOMMUNIKASJONREF. 9')
N03  A            SVCRE10        3          COLHDG('KOMMUNIKASJONREF. 10')
     A            SVTOA     R               REFFLD(TO22)
     A            SVTOB     R               REFFLD(TO23)
N03  A            SVTOP1        17A         COLHDG('KOMM.REF. 1')
N03  A            SVTOP2        17A         COLHDG('KOMM.REF. 2')
N03  A            SVTOP3        17A         COLHDG('KOMM.REF. 3')
N03  A            SVTOP4        17A         COLHDG('KOMM.REF. 4')
N03  A            SVTOP5        17A         COLHDG('KOMM.REF. 5')
N03  A            SVTOP6        17A         COLHDG('KOMM.REF. 6')
N03  A            SVTOP7        17A         COLHDG('KOMM.REF. 7')
N03  A            SVTOP8        17A         COLHDG('KOMM.REF. 8')
N03  A            SVTOP9        17A         COLHDG('KOMM.REF. 9')
N03  A            SVTOP10       17A         COLHDG('KOMM.REF. 10')
S01  A*           SVFT      R               REFFLD(FT17)
S03  A*           SVFT          28A         COLHDG('Merke & nr.')
N03  A            SVFT01        28A         COLHDG('Merke & nr 1')
N03  A            SVFT02        28A         COLHDG('Merke & nr 2')
N03  A            SVFT03        28A         COLHDG('Merke & nr 3')
N03  A            SVFT04        28A         COLHDG('Merke & nr 4')
N03  A            SVFT05        28A         COLHDG('Merke & nr 5')
N03  A            SVFT06        28A         COLHDG('Merke & nr 6')
N03  A            SVFT07        28A         COLHDG('Merke & nr 7')
S03  A*           SVNT           6P 0       COLHDG('ANTALL')
N03  A            SVNT01         6S 0       COLHDG('ANTALL 1')
N03  A            SVNT02         6S 0       COLHDG('ANTALL 2')
N03  A            SVNT03         6S 0       COLHDG('ANTALL 3')
N03  A            SVNT04         6S 0       COLHDG('ANTALL 4')
N03  A            SVNT05         6S 0       COLHDG('ANTALL 5')
N03  A            SVNT06         6S 0       COLHDG('ANTALL 6')
N03  A            SVNT07         6S 0       COLHDG('ANTALL 7')
S03  A*           SVEH      R               REFFLD(EH)
N03  A            SVEH01    R               REFFLD(EH)
N03  A            SVEH02    R               REFFLD(EH)
N03  A            SVEH03    R               REFFLD(EH)
N03  A            SVEH04    R               REFFLD(EH)
N03  A            SVEH05    R               REFFLD(EH)
N03  A            SVEH06    R               REFFLD(EH)
N03  A            SVEH07    R               REFFLD(EH)
S01  A*           SVVT      R               REFFLD(VT15)
S03  A*           SVVT          30A         COLHDG('VARETEKST')
N03  A            SVVT01        30A         COLHDG('VARETEKST 1')
N03  A            SVVT02        30A         COLHDG('VARETEKST 2')
N03  A            SVVT03        30A         COLHDG('VARETEKST 3')
N03  A            SVVT04        30A         COLHDG('VARETEKST 4')
N03  A            SVVT05        30A         COLHDG('VARETEKST 5')
     A            SVLN           5P 0       COLHDG('LINJENR')
N01  A            SVEXR01        5A         COLHDG('SYSTEM')
N01  A            SVEXR02       17A         COLHDG('EKSTERN REF.')
N01  A            SVEXR03       35A         COLHDG('ANDRE REF.')
N01  A            SVEXR04        9S 0       COLHDG('LINJENR')
N01  A            SVEXR05        5S 0       COLHDG('UNDERLINJENR')
N01  A            SVEXR06        3A         COLHDG('VALUTA')
N01  A            SVEXR07       11S 2       COLHDG('BELØP')
N03  A            SVEXR08       10A         COLHDG('MEMBER')
N02  A            SVLK           2A         COLHDG('LK Oppr. internt')
     A            SVREFL         5P 0       COLHDG('ANT. TILL.LINJER')
     A            SVUNIK         9  0       COLHDG('RECORDNR')
     A            SVREFF        17          COLHDG('REFERANSE')
     A          K SVREFF
