     A*__________________________________
     A* SYSPED / REGISTER FOR BILL OF LADING
     A*""""""""""""""""""""""""""""""""""
     A          R BILLOFR                   PFILE(ZILLOF)
     A          K BLAD3G
     A          K BLBLNR
