     A*__________________________________
     A* SYSPED / REGISTER FOR BILL OF LADING
     A*""""""""""""""""""""""""""""""""""
     A          R BILLOFR                   PFILE(ZILLOF)
     A          K BLREFF
