     A*__________________________________
     A* SYSPED / REGISTER FOR BILL OF LADING
     A*""""""""""""""""""""""""""""""""""
     A          R BLV1R                     PFILE(ZLV1)
     A          K BVREFF
