     A*__________________________
     A* SYSPED / BOOKINGS VARELINJEREGISTER TYPE-1
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R BLV1R
     A            BVAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            BVOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            BVLI           3S 0       COLHDG('LINJENR')
     A            BVSORT         3S 0       COLHDG('SORT')
     A            BVMN      R               REFFLD(FT17)
     A                                      COLHDG('MERKE & NUMMER')
     A            BVNT           5P 0       COLHDG('ANTALL KOLLI')
     A            BVVS      R               REFFLD(VS)
     A                                      COLHDG('VARESLAG')
     A            BVVKT     R               REFFLD(VKT9)
     A                                      COLHDG('Vekt')
     A            BVM3           9P 3       COLHDG('KUBIKK')
     A            BVENH          1S 0       COLHDG('ENHET')
     A            BVKDC          2          COLHDG('CONTAINER KODE')
      * TILLEGG TIL BLV1
     A            BVUNIK         9  0       COLHDG('RECORDNR')
     A            BVREFF        17          COLHDG('REFERANSE')
     A          K BVUNIK
     A          K BVLI
