     A*__________________________
     A* SYSPED / BILL OF LADING VARELINJEREGISTER TYPE-2
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R BLV2R
     A            BVAVD     R               REFFLD(AVD)
     A                                      COLHDG('Avdeling')
     A            BVOPD     R               REFFLD(OPD)
     A                                      COLHDG('Oppdragsnr')
     A            BVLI           3S 0       COLHDG('LINJENR.')
     A            BVLI2          1S 0       COLHDG('LINJENR.')
     A            BVSORT         3S 0       COLHDG('SORT')
     A            BVMN      R               REFFLD(FT17)
     A                                      COLHDG('MERKE & NUMMER')
     A            BVFT      R               REFFLD(FT)
     A                                      COLHDG('FRI TEKST')
     A            BVKD           1          COLHDG('KODE FOR FRITEKST')
      * TILLEGG TIL BLV2
     A            BVUNIK         9  0       COLHDG('RECORDNR')
     A            BVREFF        17          COLHDG('REFERANSE')
     A          K BVUNIK
     A          K BVLI
