     A          R DOK29R
     A            D29AVD         4S 0       COLHDG('AVDELING')
     A            D29OPD         7S 0       COLHDG('OPPDRAGSNR.')
     A            D29FNR         3S 0       COLHDG('FRAKTBREVNR.')
     A            D29TXT        70          COLHDG('INFORMASJON')
     A            D29UNI         9  0       COLHDG('RECORDNR')
     A            D29REF        17          COLHDG('REFERANSE')
     A          K D29REF
