     A          R DOK36R
     A            D36AVD         4S 0       COLHDG('AVDELING')
     A            D36OPD         7S 0       COLHDG('OPPDRAGSNR.')
     A            D36FNR         3S 0       COLHDG('FRAKTBREVNR.')
     A            D36TXT        70          COLHDG('INFORMASJON')
     A            D36UNI         9  0       COLHDG('RECORDNR')
     A            D36REF        17          COLHDG('REFERANSE')
     A          K D36REF
