     A*_______________________________
     A* SYSPED / Fraktbrev - varelinje
     A*"""""""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R DOKUFVR
     A            FVST      R               REFFLD(ST)
     A            FVRI      R               REFFLD(RI)
     A            FVAVD     R               REFFLD(AVD)
     A            FVOPD     R               REFFLD(OPD)
     A            FVFBNR    R               REFFLD(FRBN)
     A            FVLINR         2S 0       COLHDG('Linjenr.')
     A            FVANT          7P 0       COLHDG('Antall')
     A            FVPAKN         7          COLHDG('Pakning')
     A            FVVT          35          COLHDG('Varebeskrivelse')
     A            FVVKT     R               REFFLD(VKT9)
     A            FVVOL          7P 3       COLHDG('Volum')
     A            FVLM           4P 2       COLHDG('Lastemeter')
TMS  A            FVLM2          4P 2       COLHDG('Lastemtr Lasting')
TMS  A*           FVLEN          5P 1       COLHDG('Lengde')
TMS  A*           FVBRD          5P 1       COLHDG('Bredde')
TMS  A*           FVHOY          5P 1       COLHDG('Høyde')
TMS  A            FVLEN          4P 0       COLHDG('Lengde')
TMS  A            FVBRD          4P 0       COLHDG('Bredde')
TMS  A            FVHOY          4P 0       COLHDG('Høyde')
     A            FVUNIK         9  0       COLHDG('RECORDNR')
     A            FVREFF        17          COLHDG('REFERANSE')
     A          K FVREFF
