     A                                      REF(SR)
     A          R DOKUFER
     A            FE_DFAVD  R               REFFLD(AVD)
     A            FE_DFOPD  R               REFFLD(OPD)
     A            FE_DFFBNR R               REFFLD(FRBN)
     A            FE_N3035       3          COLHDG('Party Q')
     A            FE_C3413      17          COLHDG('Kontakt ID')
     A            FE_C3412      35          COLHDG('Kontakt Navn')
     A            FE_C3148A     60          COLHDG('Telefon')
     A            FE_C3148B     60          COLHDG('Mobiltelefon')
     A            FE_C3148C     60          COLHDG('Fax')
     A            FE_C3148D     60          COLHDG('Sms')
     A            FE_C3148E     60          COLHDG('E-post')
     A            FE_C3139       3          COLHDG('Kontakt kode')
     A            FE_UNIK        9  0       COLHDG('RECORDNR')
     A            FE_REFF       17          COLHDG('REFERANSE')
     A          K FE_REFF
