     A*____________________________
     A* FRI SØKEVEI TIL OPPDRAGSREGISTER
     A*""""""""""""""""""""""""""""
     A          R FRISOKR
     A            FSAVD          4S 0       TEXT('AVDELING')
     A            FSOPD          7S 0       TEXT('OPDNR')
     A            FSKODE         3          TEXT('KODE')
     A            FSSOK         35          TEXT('SØKEVEI')
     A            FSDTOP         8S 0       TEXT('OPPDRAGSDATO')
     A            FSDOKK        10          TEXT('DOKUM.KODE')
     A            FSUNIK         9  0       COLHDG('RECORDNR')
     A            FSREFF        17          COLHDG('REFERANSE')
     A          K FSREFF
