     A*_________________________________________
     A* SYSPED / FRI SØKEVEI - MOTSTYKKE TIL FRISOL01
     A*"""""""""""""""""""""""""""""""""""""""""
     A          R FRISOKR                   PFILE(ZRISOK)
     A          K FSKODE
     A          K FSSOK
     A          K FSDTOP
