     A*____________________________
     A* SYSPED / EDI UNIK TELLER
     A*""""""""""""""""""""""""""""
     A          R ZTELLR
     A            FIRMA          2          TEXT('FIRMAKODE')
      * NESTE NUMMER LIGGER I FILEN
     A            ZUNIK          9S 0       TEXT('UNIK TELLER')
     A          K FIRMA
