     A*__________________________
     A* SYSPED / TRACK AND TRACE AVGANGS/ANK-TIDSPUNKT
     A*""""""""""""""""""""""""""
     A                                      REF(SR)
     A          R TRACKTR                   TEXT('TRACK/TRACE ETD..')
     A            TXAVD     R               REFFLD(AVD)
     A                                      COLHDG('Dep')
     A            TXOPD     R               REFFLD(OPD)
     A                                      COLHDG('Order')
     A            TXFBNR    R               REFFLD(FRBN)
     A                                      COLHDG('Waybillno')
     A            TXETDD         8S 0       COLHDG('ETD Date')
     A            TXETDK         4S 0       COLHDG('ETD Hour')
     A            TXATDD         8S 0       COLHDG('ATD Date')
     A            TXATDK         4S 0       COLHDG('ATD Hour')
     A            TXETAD         8S 0       COLHDG('ETA Date')
     A            TXETAK         4S 0       COLHDG('ETA Hour')
     A            TXATAD         8S 0       COLHDG('ATA Date')
     A            TXATAK         4S 0       COLHDG('ATA Hour')
     A            TXEX1D         8S 0       COLHDG('EXTRA Date 1')
     A            TXEX1K         4S 0       COLHDG('EXTRA Hour 1')
     A            TXEX2D         8S 0       COLHDG('EXTRA Date 2')
     A            TXEX2K         4S 0       COLHDG('EXTRA Hour 2')
     A            TXOS01         8S 0       COLHDG('KLAR HOS LEVERANDØR')
     A            TXOS02         8S 0       COLHDG('FRIST FOR SHIPPING')
     A            TXOS03         8S 0       COLHDG('FRIST FOR ANKOMST')
     A            TXOS04         8S 0       COLHDG('SHIPPINGVINDU FRA')
     A            TXOS05         8S 0       COLHDG('SHIPPINGVINDU TIL')
     A            TXOS06         8S 0       COLHDG('ANKOMSTVINDU FRA')
     A            TXOS07         8S 0       COLHDG('ANKOMSTVINDU TIL')
     A            TXOS08         8S 0       COLHDG('LEDIG FOR OVERSJØ')
     A            TXOS09         8S 0       COLHDG('LEDIG FOR OVERSJØ')
     A            TXOS10         8S 0       COLHDG('LEDIG FOR OVERSJØ')
     A            TXUNIK         9  0       COLHDG('RECORDNR')
     A            TXREFF        17          COLHDG('REFERANSE')
     A          K TXREFF
